{
  "name": "Aaron Linfoot",
  "title": "President / Chief Integration Officer",
  "company": "Cannon Beach Vacation Rentals (CBVR)",
  "location": "Cannon Beach, OR",
  "phone": "541-996-2955",
  "company_phone": "503-436-0940",
  "alt_phones": [],
  "flow": {
    "context": "Aaron Linfoot is President and Chief Integration Officer of Meredith Lodging, the parent company behind Cannon Beach Vacation Rentals (CBVR) — 80+ vacation homes on the Oregon coast, operating since 1999. His CIO title comes from a TravelNet customer feature, signaling he's the systems and integration decision-maker across the portfolio. They run on TravelNet/Track (Atlas website, TrackHS portals for owners and guests), built their own commercial laundry facility for quality control, and claim 70% of summer guests rebook — they clearly obsess over unit condition. No Breezeway or Matterport detected, so the Track integration angle is the sharpest pitch. Strongest Sam hook: Aaron's integration-first mindset maps perfectly to RapidEye's 'plugs into Track with zero workflow change' positioning, and his coastal Oregon world connects naturally to Sam's surfing and fishing lifestyle.",
    "start": "call_start",
    "nodes": {
      "call_start": {
        "label": "DIALING",
        "say": "Calling Aaron Linfoot — President and Chief Integration Officer at Meredith Lodging. Runs 80-plus vacation homes on the Oregon coast through CBVR. Systems and integration guy. Deep in the Track/TravelNet stack.",
        "note": "Read this while the phone rings. Listen for who picks up. If it's a man who sounds senior, it's likely Aaron. If it's a front desk voice, go gatekeeper.",
        "branches": [
          {
            "label": "Aaron answers",
            "to": "opener"
          },
          {
            "label": "Gatekeeper / front desk answers",
            "to": "gatekeeper"
          },
          {
            "label": "Voicemail",
            "to": "voicemail"
          }
        ]
      },
      "opener": {
        "label": "OPENER",
        "say": "Hey Aaron — this might be a little out of left field, but I've been working with a few vacation rental operators on the Oregon coast and your name came up as someone who's pretty deep in the ops and integration side at Meredith. It's Sam Parks with RapidEye — have you heard my name tossed around at all?",
        "note": "Relaxed tone. Smile. Feet up on the desk energy. You're not reading a script — you're calling someone whose name came up. The 'integration side' nod is intentional — it mirrors his actual title.",
        "branches": [
          {
            "label": "\"Yeah I have\" / \"Sounds familiar\"",
            "to": "heard_name_yes"
          },
          {
            "label": "\"No\" / \"Can't say I have\"",
            "to": "heard_name_no"
          },
          {
            "label": "\"I'm in the middle of something\"",
            "to": "bad_timing"
          },
          {
            "label": "Guarded / \"What's this about?\"",
            "to": "whos_this"
          }
        ]
      },
      "heard_name_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone in your shoes. What'd you hear?",
        "note": "Let him talk. Whatever he says, bridge into discovery or the pain trigger depending on how warm he sounds. Don't correct anything — just flow with it.",
        "branches": [
          {
            "label": "Shares something / sounds curious",
            "to": "warm_discovery"
          },
          {
            "label": "Vague / \"not sure\" / waiting for you to continue",
            "to": "pain_trigger"
          }
        ]
      },
      "heard_name_no": {
        "label": "HAVEN'T HEARD OF YOU",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call —",
        "note": "Light self-deprecating laugh. Don't dwell. Transition immediately into the pain trigger.",
        "branches": [
          {
            "label": "Continue →",
            "to": "pain_trigger"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow or later this week? When's less hectic for you?",
        "note": "Respect the timing. Get a specific callback window. Don't try to sneak in a pitch.",
        "branches": [
          {
            "label": "Gives a time",
            "to": "reschedule"
          },
          {
            "label": "\"Just email me\"",
            "to": "send_email"
          },
          {
            "label": "\"Don't call back\"",
            "to": "end_graceful"
          }
        ]
      },
      "reschedule": {
        "label": "CALLBACK SET",
        "say": "Perfect — I'll try you then. Appreciate it, Aaron. Talk soon.",
        "note": "Write down the exact day and time. Calendar it immediately. This is a warm callback now, not a cold dial.",
        "branches": []
      },
      "whos_this": {
        "label": "GUARDED — PERMISSION ASK",
        "say": "Yeah totally fair — it is a cold call, I'll be straight with you. Can I get 30 seconds to tell you why I reached out? You can totally hang up on me if it's not relevant.",
        "note": "The honesty disarms. You're acknowledging the cold call before he has to call it out. Don't sound apologetic — sound confident and direct.",
        "branches": [
          {
            "label": "\"Sure, go ahead\"",
            "to": "pain_trigger"
          },
          {
            "label": "\"Not interested\" / rejects",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and it's just not interesting?",
        "note": "Stay calm. You're giving him a multiple choice exit — most people pick 'bad timing' because it's the polite option, and that reopens the door.",
        "branches": [
          {
            "label": "\"Bad timing\"",
            "to": "bad_timing"
          },
          {
            "label": "\"Not interested\" / \"We're set\"",
            "to": "objection_not_interested"
          },
          {
            "label": "\"What do you do?\" / curious now",
            "to": "pain_trigger"
          },
          {
            "label": "Hangs up",
            "to": "end_graceful"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "So I was talking to another PM company pretty similar to you guys — coastal market, 70-plus homes — and they were telling me about this cycle they kept hitting. Their cleaners take turnover photos, upload them into Track, and technically everything's documented. But nobody has the bandwidth to actually review every photo from every turn. So stuff slips through — a scuff on a wall here, a stain on a couch that wasn't there at last checkout, a missing throw blanket. It sits for two or three guest cycles before anyone catches it. By then you can't charge the right guest, the owner's asking questions, and you're eating the cost. Does any of that sound familiar, or is your world totally different?",
        "note": "PAUSE after 'sound familiar.' Let the silence sit. You named Track on purpose — he'll notice you know their stack. The peer story makes it safe for him to relate without admitting a problem. Wait for his reaction before saying another word.",
        "branches": [
          {
            "label": "Relates to the pain / \"Yeah, that happens\"",
            "to": "pain_positive"
          },
          {
            "label": "\"We actually have a good process\"",
            "to": "objection_have_process"
          },
          {
            "label": "\"Not really\" / dismissive / not interested",
            "to": "objection_not_interested"
          },
          {
            "label": "\"What are you selling?\" / wants the pitch",
            "to": "solution_cta"
          }
        ]
      },
      "pain_positive": {
        "label": "THEY FEEL THE PAIN",
        "say": "Yeah — that's basically what we keep hearing. So we built something that plugs directly into Track and automatically analyzes the turnover photos your team's already uploading. It flags damage, missing items, staging issues — no workflow change on your end. Would you be open to seeing what that looks like when I'm not cold calling you out of the blue?",
        "note": "One sentence on the solution. Reference Track again — it's their stack and it shows this isn't generic. The CTA is low-friction. Don't oversell. Goal is the meeting.",
        "branches": [
          {
            "label": "\"Sure\" / \"Yeah, let's take a look\"",
            "to": "book_meeting"
          },
          {
            "label": "Warm but has questions",
            "to": "warm_discovery"
          },
          {
            "label": "\"Just send me something\"",
            "to": "send_email"
          }
        ]
      },
      "solution_cta": {
        "label": "SOLUTION + CTA",
        "say": "Fair enough — in short, we built an AI layer that plugs into Track and analyzes the turnover photos your cleaners are already taking. It catches damage, missing items, staging issues — automatically. No new workflow, no new app for your team. Just better signal from what you're already collecting. Would you be open to a quick look when I'm not ambushing you on a cold call?",
        "note": "He asked, so give a clear answer. But keep it tight — you're still selling the meeting, not doing a product demo on the phone.",
        "branches": [
          {
            "label": "\"Sure, let's set something up\"",
            "to": "book_meeting"
          },
          {
            "label": "Interested but has questions",
            "to": "warm_discovery"
          },
          {
            "label": "\"We're not looking right now\"",
            "to": "objection_no_budget"
          },
          {
            "label": "\"Send me an email\"",
            "to": "send_email"
          }
        ]
      },
      "warm_discovery": {
        "label": "DISCOVERY — STOP PITCHING",
        "say": "That'd actually be super helpful to understand before I show you anything. What does the turnover inspection process look like for you guys right now? Are your cleaners doing photo documentation through Track, or is it more of a separate workflow?",
        "note": "He's warm — STOP SELLING and start asking. He's an integration/systems guy, so he'll likely talk process details. Listen for gaps. Let him talk. Take notes.",
        "branches": [
          {
            "label": "Describes process (photos in Track, manual review)",
            "to": "discovery_deep"
          },
          {
            "label": "\"We have inspectors\" / robust process",
            "to": "discovery_scale"
          },
          {
            "label": "Asks about RapidEye features instead",
            "to": "discovery_redirect"
          },
          {
            "label": "\"Amy handles that\" / defers to ops team",
            "to": "referral_offer"
          }
        ]
      },
      "discovery_deep": {
        "label": "DIG DEEPER — CONSEQUENCES",
        "say": "Got it. And when something does slip through — damage that doesn't get caught until an owner flags it or a guest complains — what does that look like on your end? Is that more of a reviews problem, or more of an owner relations headache?",
        "note": "You're mapping the pain to consequences a President cares about: owner churn, reviews, cost absorption. Let him connect the dots. Don't lead him — ask and listen.",
        "branches": [
          {
            "label": "Talks about owner frustration / eating costs",
            "to": "bridge_to_meeting"
          },
          {
            "label": "Talks about review impact / guest complaints",
            "to": "bridge_to_meeting"
          },
          {
            "label": "\"Honestly it's not a huge problem\"",
            "to": "test_drive"
          },
          {
            "label": "Running short on time",
            "to": "book_meeting"
          }
        ]
      },
      "discovery_scale": {
        "label": "SCALE DISCOVERY",
        "say": "That's solid. With 80-plus homes and the turnover volume you guys push through peak summer season on the coast — are your inspectors checking every single turn, or is it more spot-check based? Just trying to get a feel for how the workload actually scales.",
        "note": "You're probing for the gap. Even with dedicated inspectors, 80+ homes in July/August means corners get cut. Don't accuse — just ask. He'll tell you where it breaks.",
        "branches": [
          {
            "label": "Admits it's not every turn / gap exists",
            "to": "bridge_to_meeting"
          },
          {
            "label": "\"We inspect every turn\" (doubtful at scale)",
            "to": "bridge_to_meeting"
          },
          {
            "label": "Mentions a pain point unprompted",
            "to": "bridge_to_meeting"
          }
        ]
      },
      "discovery_redirect": {
        "label": "REDIRECT FEATURE QUESTIONS",
        "say": "Yeah I could walk through all of that — honestly it'd be way better to just show you than try to explain it over the phone. What I can tell you is we're already integrated with Track, so there's no new system for your team to adopt. Would it make sense to carve out 20 minutes so I can pull up the actual product?",
        "note": "Don't get pulled into a feature Q&A on a cold call. Sell the meeting. The Track integration mention is your strongest hook for this buyer — use it.",
        "branches": [
          {
            "label": "\"Sure, let's do it\"",
            "to": "book_meeting"
          },
          {
            "label": "\"Send me something first\"",
            "to": "send_email"
          },
          {
            "label": "Timing concerns / \"not right now\"",
            "to": "objection_no_budget"
          }
        ]
      },
      "bridge_to_meeting": {
        "label": "BRIDGE TO MEETING",
        "say": "Yeah — that's exactly the kind of stuff we've been helping other operators clean up. Rather than me taking up more of your time right now, would it make sense to grab 20 minutes next week? I could walk you through what a couple other coastal PM companies are doing with their turnover photos. Worst case you steal some ideas and we part as friends.",
        "note": "The offer of value: competitive intel from other coastal PMs. Even if he never buys, the meeting is worth his time. That's the hook.",
        "branches": [
          {
            "label": "\"Sure, let's do it\"",
            "to": "book_meeting"
          },
          {
            "label": "\"Send me something first\"",
            "to": "send_email"
          },
          {
            "label": "\"Let me loop in my ops team\"",
            "to": "referral_offer"
          },
          {
            "label": "\"Not right now\"",
            "to": "test_drive"
          }
        ]
      },
      "objection_not_interested": {
        "label": "\"NOT INTERESTED\"",
        "say": "Totally get it — I should've assumed you'd be all set. With 80-plus homes you'd have to have your inspection process pretty dialed in by now, otherwise you wouldn't have lasted 25 years on the coast.",
        "note": "Agree and compliment. You're validating his operation. This lowers his guard. Then wait — he'll either soften or stay firm.",
        "branches": [
          {
            "label": "Softens / \"well, it's not perfect...\"",
            "to": "pain_positive"
          },
          {
            "label": "Still firm",
            "to": "interest_split"
          }
        ]
      },
      "interest_split": {
        "label": "SPLIT THE OBJECTION",
        "say": "Just so no one from my team cold calls you again — is it that this genuinely isn't a problem you guys deal with, or is it more that you just hate getting cold called? Either way, totally fair.",
        "note": "Multiple choice. Most people pick 'hate cold calls' because it's the polite deflection — and that reopens the door because the problem hasn't been addressed.",
        "branches": [
          {
            "label": "\"Not a problem for us\"",
            "to": "test_drive"
          },
          {
            "label": "\"I just hate cold calls\" / laughs",
            "to": "test_drive"
          },
          {
            "label": "Hard no / done",
            "to": "end_graceful"
          }
        ]
      },
      "objection_have_process": {
        "label": "\"WE HAVE A PROCESS\"",
        "say": "That makes total sense — with the number of homes you're running you'd have to. Are you handling that through Track's housekeeping module, or do you have a separate inspection layer on top?",
        "note": "Agree AND ask a discovery question. This keeps the conversation going and shows you know their stack. You're looking for the gap between what Track does natively and what actually catches issues.",
        "branches": [
          {
            "label": "Describes their process",
            "to": "process_gap"
          },
          {
            "label": "\"We're happy with what we have\"",
            "to": "process_split"
          },
          {
            "label": "Shares a pain point",
            "to": "pain_positive"
          }
        ]
      },
      "process_gap": {
        "label": "FIND THE GAP",
        "say": "Got it. And is someone manually reviewing those photos after every single turn, or is it more of a spot-check situation — like when there's a guest complaint or an owner flags something?",
        "note": "You're hunting for the manual bottleneck. If anyone's manually reviewing photos at 80+ homes, they're drowning. If nobody reviews until there's a complaint, the damage is already done. Either answer is your opening.",
        "branches": [
          {
            "label": "Manual review / spot-check / admits gap",
            "to": "pain_positive"
          },
          {
            "label": "\"We review everything\" (unlikely at scale)",
            "to": "bridge_to_meeting"
          },
          {
            "label": "\"Why do you ask?\"",
            "to": "solution_cta"
          }
        ]
      },
      "process_split": {
        "label": "SPLIT THE PROCESS OBJECTION",
        "say": "Totally respect that. Just so I'm not wasting your time — is it that you're fully covered and genuinely happy with the results, or is it more that adding anything new right now would just be a headache?",
        "note": "If he's happy with results, respect it and offer the future test drive. If adding something is the headache, that's a timing/change-management objection — much easier to handle.",
        "branches": [
          {
            "label": "\"Happy with what we have\"",
            "to": "test_drive"
          },
          {
            "label": "\"Don't want to add anything right now\"",
            "to": "test_drive"
          },
          {
            "label": "Opens up about a gap",
            "to": "pain_positive"
          }
        ]
      },
      "objection_no_budget": {
        "label": "\"NOT RIGHT NOW\" / BUDGET",
        "say": "Totally get it. Nowadays it's hard enough to keep a tool on the books, let alone bring in something new.",
        "note": "Agree completely. Don't counter. Then either he softens or you split.",
        "branches": [
          {
            "label": "Softens / gives more context",
            "to": "test_drive"
          },
          {
            "label": "Still firm",
            "to": "budget_split"
          }
        ]
      },
      "budget_split": {
        "label": "SPLIT THE BUDGET OBJECTION",
        "say": "Just so I know where you're at — is it that budget for this cycle is completely locked, or is it more that anything new has to go through an approval process across Meredith's portfolio?",
        "note": "You're showing you know there's a parent company layer. If it's corporate approval, you can help him build an internal case. If budget is truly locked, pivot to the test drive.",
        "branches": [
          {
            "label": "\"Budget is locked\"",
            "to": "test_drive"
          },
          {
            "label": "\"Yeah, it's a process\"",
            "to": "test_drive"
          },
          {
            "label": "Opens up / gives context",
            "to": "bridge_to_meeting"
          }
        ]
      },
      "test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally hear you, and I'm not trying to push anything today. But honestly, the people who end up moving on something like this are the ones who already know what's on their list when budget does open up. Would you be open to a quick 20-minute look — not to buy anything, just so it's on your radar? Worst case you see what other coastal PM companies are doing with their turnover photos and you steal some ideas.",
        "note": "You're de-risking the ask completely. The 'steal some ideas' line is the offer of value — the meeting is worth his time even if he never buys. This is your last real shot at the meeting.",
        "branches": [
          {
            "label": "\"Sure, why not\"",
            "to": "book_meeting"
          },
          {
            "label": "\"Send me something first\"",
            "to": "send_email"
          },
          {
            "label": "\"Talk to my ops team instead\"",
            "to": "referral_offer"
          },
          {
            "label": "\"I'll reach out if interested\"",
            "to": "end_graceful"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next Tuesday and Thursday pulled up — what works better on your end? Morning or afternoon?",
        "note": "Give two specific days, two time slots. Lock it NOW. Don't say 'whenever works' — that's how meetings never happen. Pacific time for him.",
        "branches": [
          {
            "label": "Picks a day and time",
            "to": "confirm_meeting"
          },
          {
            "label": "\"Let me check my calendar\"",
            "to": "pin_meeting"
          },
          {
            "label": "\"Should I loop anyone else in?\"",
            "to": "expand_meeting"
          }
        ]
      },
      "pin_meeting": {
        "label": "PIN THE MEETING",
        "say": "Totally — how about I shoot over an invite for Thursday at 10 AM Pacific as a placeholder? You can move it if you need to. That way it doesn't fall through the cracks for either of us.",
        "note": "Never leave without a calendar hold. 'Let me check my calendar' without a placeholder dies 80% of the time. Get the invite sent while you're on the phone.",
        "branches": [
          {
            "label": "Agrees to placeholder",
            "to": "confirm_meeting"
          },
          {
            "label": "\"Just email me\"",
            "to": "send_email"
          }
        ]
      },
      "expand_meeting": {
        "label": "EXPAND THE MEETING",
        "say": "That'd actually be great. Who would make sense to include — Amy on the ops side, or someone else? The more context going in, the better I can tailor it to how you guys actually run things.",
        "note": "You know Amy Taylor is VP Ops Oregon, Ashley Kingman is GM/former Regional Director OR Coast, Rachel Beardslee is Director of Ops. Dropping Amy's name casually shows homework and makes it easy for him to confirm. Multi-threading this deal is huge.",
        "branches": [
          {
            "label": "Names someone / confirms Amy",
            "to": "confirm_meeting"
          },
          {
            "label": "\"I'll figure it out\" / wants to handle it",
            "to": "confirm_meeting"
          }
        ]
      },
      "confirm_meeting": {
        "label": "MEETING BOOKED — CLOSE",
        "say": "Perfect — I'll send that invite right over so it's locked in. Really appreciate you taking my call, Aaron. Talk to you on [day].",
        "note": "Send the calendar invite WHILE ON THE PHONE. Then stop talking. Do not add features, benefits, or anything else. You got the meeting. Hang up warm.",
        "branches": []
      },
      "send_email": {
        "label": "\"SEND ME AN EMAIL\"",
        "say": "Totally fair. One quick question before I do — what would actually be useful to include so it doesn't just sit in your inbox? Like, is it the Track integration piece you'd want to see, or more the ROI side of what other PM companies in your position are getting out of it?",
        "note": "Accept the request. Ask ONE question to tailor. You're also learning what he cares about — integration fit vs. cost justification. Both are gold for your follow-up.",
        "branches": [
          {
            "label": "Gives direction on what to include",
            "to": "email_close"
          },
          {
            "label": "\"Just whatever you have\"",
            "to": "email_close"
          },
          {
            "label": "Gets more engaged / conversation reopens",
            "to": "bridge_to_meeting"
          }
        ]
      },
      "email_close": {
        "label": "CONFIRM EMAIL + CLOSE",
        "say": "Got it — I'll put something together around that and have it over to you today. Best email alinfoot at meredithlodging dot com? I'll drop in a couple time suggestions in case you want to hop on a quick call after you've had a look.",
        "note": "Confirm the email address. You already know it's alinfoot@meredithlodging.com — confirming it sounds like homework, not stalking. Embed meeting time suggestions in the email body.",
        "branches": [
          {
            "label": "Confirms email",
            "to": "end_email_sent"
          },
          {
            "label": "Gives a different email",
            "to": "end_email_sent"
          }
        ]
      },
      "end_email_sent": {
        "label": "EMAIL PATH — CLOSE",
        "say": "Perfect. I'll get that over to you shortly. Appreciate your time, Aaron — talk soon.",
        "note": "Send the email within the hour. Include 2 specific time options for a call. Follow up in 3 business days if no response. Don't send a generic deck — tailor it to whatever he said he wanted.",
        "branches": []
      },
      "referral_offer": {
        "label": "REFERRAL — WHO OWNS INSPECTIONS",
        "say": "That makes total sense — you've got enough on your plate running the whole operation. Who on your team typically owns the inspection and turnover workflow day to day? Is that Amy Taylor, or someone else on the ops side?",
        "note": "You know Amy Taylor is VP Ops Oregon, Ashley Kingman is GM (former Regional Director Oregon Coast), Rachel Beardslee is Director of Ops, Ken Appel is Director of Guest Experience. Drop Amy's name — it shows you've done homework and makes the referral frictionless.",
        "branches": [
          {
            "label": "Confirms Amy / gives a name",
            "to": "referral_get_details"
          },
          {
            "label": "\"I'll have them reach out\"",
            "to": "referral_pin"
          },
          {
            "label": "\"Just send me the info, I'll handle it\"",
            "to": "send_email"
          }
        ]
      },
      "referral_get_details": {
        "label": "GET REFERRAL CONTACT INFO",
        "say": "Awesome. If I could grab their direct email or number, I'll put something tailored together so it actually lands and doesn't feel like another random cold outreach. Would you mind?",
        "note": "Get name, email, and/or phone. Then ask if you can mention Aaron's name — a referral from the President is 10x more effective than a cold contact.",
        "branches": [
          {
            "label": "Gives contact info",
            "to": "referral_close"
          },
          {
            "label": "\"I'll connect you\" / won't share direct info",
            "to": "referral_close"
          }
        ]
      },
      "referral_pin": {
        "label": "PIN THE REFERRAL",
        "say": "Appreciate that. And just so it doesn't fall off either of our radars — would it be cool if I mentioned your name when I reach out to them? That way it's not totally out of nowhere on their end.",
        "note": "Permission to name-drop the President is gold. It turns a cold outreach to Amy/Ashley/Rachel into a warm intro. Get the yes.",
        "branches": [
          {
            "label": "\"Sure\" / agrees",
            "to": "referral_close"
          },
          {
            "label": "\"I'll intro you directly\"",
            "to": "referral_close"
          }
        ]
      },
      "referral_close": {
        "label": "REFERRAL LOCKED — CLOSE",
        "say": "Really appreciate that, Aaron. I'll reach out to them and keep it super relevant. Thanks for taking my call — enjoy the coast.",
        "note": "Send the referral outreach within 24 hours. Mention Aaron by name if he approved it. If he said he'd intro you, follow up in 2 days if you haven't heard. Log the referral name and details immediately.",
        "branches": []
      },
      "gatekeeper": {
        "label": "GATEKEEPER — SLIDE BY",
        "say": "Hey — could you get me through to Aaron? It's Sam.",
        "note": "Minimal info. First name basis. Sound like you know him. Don't explain yourself unless they ask. Keep it breezy.",
        "branches": [
          {
            "label": "Transfers you → Aaron picks up",
            "to": "opener"
          },
          {
            "label": "\"What's this regarding?\"",
            "to": "gatekeeper_context"
          },
          {
            "label": "\"He's not available\"",
            "to": "gatekeeper_vm_offer"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — ADD CONTEXT",
        "say": "Yeah — I work with a few other vacation rental operators on the Oregon coast. Would you mind letting him know it's Sam Parks?",
        "note": "Still no pitch. One layer of context — geographic and industry. You're asking them to pass your name, not your product. Keep it vague enough that they can't screen you.",
        "branches": [
          {
            "label": "Transfers you → Aaron picks up",
            "to": "opener"
          },
          {
            "label": "\"Can I take a message?\"",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "\"He's out\" / unavailable",
            "to": "gatekeeper_vm_offer"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "Sure — we help a couple other property management companies with their inspection workflows. I sent Aaron a note, just wanted to give him a quick heads up. Would you mind passing that along?",
        "note": "Third and final attempt. If they still block, gracefully take the VM or ask for a callback time. Don't fight the gatekeeper — they're doing their job.",
        "branches": [
          {
            "label": "Transfers or passes message",
            "to": "opener"
          },
          {
            "label": "Takes a message / still blocking",
            "to": "gatekeeper_vm_offer"
          }
        ]
      },
      "gatekeeper_vm_offer": {
        "label": "GATEKEEPER — GET VM OR CALLBACK",
        "say": "No worries at all — could you put me through to his voicemail? Or is there a better time to catch him?",
        "note": "Get either a voicemail or a callback window. If they give a time, note it precisely and call back then. Ask for the gatekeeper's name so you can greet them next time.",
        "branches": [
          {
            "label": "Puts you through to VM",
            "to": "voicemail"
          },
          {
            "label": "Gives a callback time",
            "to": "reschedule"
          },
          {
            "label": "Dead end / \"try the main line\"",
            "to": "end_graceful"
          }
        ]
      },
      "voicemail": {
        "label": "VOICEMAIL",
        "say": "Hey Aaron — Sam Parks, RapidEye. I work with a few vacation rental operators on the Oregon coast on their inspection and turnover workflows. Wanted to see if it makes sense to connect. My number is [your number]. Again, that's Sam Parks — talk soon.",
        "note": "Under 20 seconds. Say your name twice, number once. No pitch, no features — just enough to create curiosity. Follow up with a short email within the hour referencing the voicemail.",
        "branches": []
      },
      "end_graceful": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand, Aaron. If anything ever changes, I'm easy to find. Appreciate your time.",
        "note": "Don't burn the bridge. Log the call outcome and objection reason. Set a follow-up reminder for 4 weeks out. He may not be ready today but the market is small — you'll cross paths again.",
        "branches": []
      }
    }
  }
}