{
  "name": "Aaron Fisher",
  "title": "President / Owner",
  "company": "Myrtle Beach Rental Pros L.L.C",
  "location": "Myrtle Beach, SC",
  "phone": "+1-843-855-5154",
  "company_phone": "+1-843-800-2512",
  "alt_phones": [],
  "flow": {
    "context": "Aaron Fisher is President and sole named owner of Myrtle Beach Rental Pros, a vacation rental PM company in the Grand Strand area since 2016. He personally oversees turnover cleaning, maintenance, and inspections — his own hiring page requires staff to 'report and photograph any damage' and 'conduct inspections of cleanings.' He markets hard on quality standards, constant inspections, and an 'owner mentality' because he manages and owns rentals himself. Appears to be a smaller, hands-on operation with no known PMS or ops platform. Strongest hook: Sam's a surfer and fisherman who grew up on the coast — Myrtle Beach is Aaron's world, and his team's photo-heavy inspection workflow is exactly what RapidEye automates.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Aaron — I work with a few vacation rental managers in beach markets up and down the East Coast. Bit of a beach guy myself, grew up surfing out in LA. It's Sam Parks with RapidEye — have you heard my name tossed around at all?",
        "note": "Relaxed, feet-up tone. Don't rush. The surfing mention makes you human and memorable — you're not reading a script. Pause after the question and let him respond.",
        "branches": [
          {
            "label": "Yes / Maybe / Sounds familiar",
            "to": "heard_yes"
          },
          {
            "label": "No / Who? / Doesn't ring a bell",
            "to": "heard_no"
          },
          {
            "label": "Bad timing / I'm busy / In the middle of something",
            "to": "bad_timing"
          },
          {
            "label": "Someone else answers (not Aaron)",
            "to": "not_aaron"
          }
        ]
      },
      "heard_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone like you on the inspection and turnover side. What'd you hear?",
        "note": "Let him talk. Whatever he says, bridge into discovery. Don't correct — just guide the conversation forward.",
        "branches": [
          {
            "label": "Shares what they heard / Describes it",
            "to": "discovery_process"
          },
          {
            "label": "Vague / Not sure / Just the name",
            "to": "pain_trigger"
          }
        ]
      },
      "heard_no": {
        "label": "HAVEN'T HEARD — BRIDGE TO PAIN",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason I'm calling is —",
        "note": "Quick self-deprecating beat then flow right into the pain trigger. If his tone is guarded or hostile, pivot to the permission fallback instead.",
        "branches": [
          {
            "label": "He's listening / Neutral tone — continue",
            "to": "pain_trigger"
          },
          {
            "label": "Guarded / What are you selling? / I'm not interested",
            "to": "permission_fallback"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow or later this week? When's a better window?",
        "note": "Don't pitch into resistance. Lock in a callback time. If he gives you one, take it and get off the phone — you've won.",
        "branches": [
          {
            "label": "Gives a time / Sure try me tomorrow",
            "to": "reschedule_confirmed"
          },
          {
            "label": "Just tell me what it's about real quick",
            "to": "pain_trigger"
          },
          {
            "label": "Don't call me back / Not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "not_aaron": {
        "label": "GATEKEEPER — SOMEONE ELSE ANSWERED",
        "say": "Oh hey — could you get me through to Aaron? It's Sam.",
        "note": "Keep it casual. Don't volunteer more unless asked. First name only. Sound like you know him.",
        "branches": [
          {
            "label": "Who's calling? / What's this about?",
            "to": "gatekeeper_context"
          },
          {
            "label": "Hold on / Transferring you",
            "to": "opener"
          },
          {
            "label": "He's not available",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER WANTS CONTEXT",
        "say": "Yeah — I work with a few other vacation rental managers in the Myrtle Beach area on their inspection workflows. Would you mind letting him know it's Sam Parks?",
        "note": "Don't pitch the gatekeeper. Just enough info to sound relevant. End with the redirect question so they take action.",
        "branches": [
          {
            "label": "Okay, hold on / Let me check",
            "to": "opener"
          },
          {
            "label": "He's not available / Can I take a message?",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_unavailable": {
        "label": "AARON NOT AVAILABLE",
        "say": "No worries at all. Do you know when's a good time to catch him? I'll try back. And who am I speaking with, by the way?",
        "note": "Get a name and a callback window. Write both down. Don't leave a voicemail pitch — just get the info and hang up.",
        "branches": [
          {
            "label": "Gives a time / Suggests calling back",
            "to": "reschedule_confirmed"
          },
          {
            "label": "I can take a message / Send an email",
            "to": "end_graceful"
          }
        ]
      },
      "reschedule_confirmed": {
        "label": "CALLBACK LOCKED IN",
        "say": "Perfect — I'll try him then. Really appreciate it.",
        "note": "Write down the exact time. Set a reminder. When you call back, open with 'Hey Aaron, it's Sam Parks — we were supposed to connect' to make it feel like a scheduled call.",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call. Can I get 30 seconds to tell you why I reached out? And you can totally hang up on me if it's not a fit.",
        "note": "Disarming honesty. Most people respect the transparency and give you the 30 seconds. If they do, make them count — go straight into the pain trigger.",
        "branches": [
          {
            "label": "Sure / Go ahead / You've got 30 seconds",
            "to": "pain_trigger"
          },
          {
            "label": "No / Take me off your list / Not interested",
            "to": "last_chance_split"
          }
        ]
      },
      "last_chance_split": {
        "label": "LAST CHANCE — SPLIT THE REJECTION",
        "say": "Shoot — totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and it's just not interesting?",
        "note": "This is your final play. If it's bad timing, you might get a callback window. If it's genuinely not interesting, exit gracefully. Don't push beyond this.",
        "branches": [
          {
            "label": "Bad timing / Call me another time",
            "to": "reschedule_confirmed"
          },
          {
            "label": "Not interested / Don't call again",
            "to": "end_graceful"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER — THE PHOTO PROBLEM",
        "say": "So I was talking to another vacation rental owner running a pretty similar operation to yours — turnovers, cleaning crews, inspections, the whole thing. And his biggest headache wasn't even the damage. It was that his team was snapping photos every single turnover like they're supposed to, but nobody actually had time to review them all. So stuff was slipping through — a burn on the balcony furniture, a crack in a shower door, a stain nobody reported — and it wouldn't surface until a guest complained or an owner asked why their place was looking rough. At that point you're eating the cost because you can't prove when it happened.",
        "note": "PAUSE after this. Let the silence sit. Aaron's team already photographs damage — his hiring page says so. This should hit close to home. Watch for a sigh, an 'mm-hm,' or a 'yeah.' That's your green light.",
        "branches": [
          {
            "label": "Yeah / That sounds familiar / We deal with that",
            "to": "pain_positive"
          },
          {
            "label": "Silence or lukewarm / Hmm / Okay",
            "to": "pain_neutral"
          },
          {
            "label": "We've got that handled / Not really our issue",
            "to": "objection_have_process"
          },
          {
            "label": "What do you sell? / What is this exactly?",
            "to": "solution_bridge"
          }
        ]
      },
      "pain_positive": {
        "label": "THEY RELATE — GO TO DISCOVERY",
        "say": "Yeah — I hear that a lot from owners who actually care about the product, which clearly you do. Let me ask you — what does your inspection process actually look like right now after a turnover? Are your cleaners taking photos on their phones, or do you have some kind of system for it?",
        "note": "He's warm. STOP PITCHING. Ask questions. The more he talks, the more invested he gets. Listen for specific pain points you can reference when you pitch the meeting.",
        "branches": [
          {
            "label": "Describes process / Cleaners take photos",
            "to": "discovery_photos"
          },
          {
            "label": "I inspect everything myself / I walk the units",
            "to": "discovery_owner_inspects"
          },
          {
            "label": "We don't have a formal system for it",
            "to": "discovery_no_system"
          }
        ]
      },
      "pain_neutral": {
        "label": "LUKEWARM — PUSH GENTLY",
        "say": "Yeah — I know it's a lot to throw at you out of nowhere. Basically we built a tool that looks at the photos your team's already taking during turnovers and flags damage automatically — so you're not relying on somebody remembering to report it. Would you be open to seeing what that looks like? I'm not trying to sell you on the phone.",
        "note": "He's not sold but he's not gone. Give the one-sentence solution and a soft CTA. If he bites, book it. If not, handle the objection.",
        "branches": [
          {
            "label": "Sure / Yeah I'd look at that",
            "to": "book_meeting"
          },
          {
            "label": "I don't have time / Not interested",
            "to": "objection_not_interested"
          },
          {
            "label": "Send me something / Email me",
            "to": "send_email"
          },
          {
            "label": "What does it cost?",
            "to": "deflect_price"
          }
        ]
      },
      "discovery_process": {
        "label": "DISCOVERY — CURRENT PROCESS",
        "say": "That's great. So tell me — what does your inspection process actually look like right now? Like after a guest checks out and your team turns the unit, how are you documenting condition?",
        "note": "Let him talk. Learn the workflow. Listen for gaps — things that take too long, things that get missed, manual steps that frustrate him. That's where RapidEye fits.",
        "branches": [
          {
            "label": "Describes photo workflow / Cleaners take photos",
            "to": "discovery_photos"
          },
          {
            "label": "He inspects personally / Walks the properties",
            "to": "discovery_owner_inspects"
          },
          {
            "label": "No formal system / Pretty informal",
            "to": "discovery_no_system"
          }
        ]
      },
      "discovery_photos": {
        "label": "DISCOVERY — PHOTO WORKFLOW",
        "say": "Got it. And when those photos come in — are you or someone on your team actually reviewing every one? Or is it more of a 'we have them if we need them' kind of thing?",
        "note": "This is the key question. Most operators take photos but don't review them systematically. If he admits nobody reviews them all, that's your leverage point.",
        "branches": [
          {
            "label": "We try but can't review them all / It's hit or miss",
            "to": "solution_bridge"
          },
          {
            "label": "I review them myself / We're pretty thorough",
            "to": "discovery_time"
          },
          {
            "label": "We just have them for records / CYA",
            "to": "solution_bridge"
          }
        ]
      },
      "discovery_owner_inspects": {
        "label": "DISCOVERY — AARON INSPECTS HIMSELF",
        "say": "Respect that — honestly that's the best way to keep quality up. How many turnovers are you doing a week right now? Is that sustainable as you grow, or is that starting to eat into your time?",
        "note": "Owner-operators who inspect personally are the perfect buyer. They care deeply about quality but can't scale themselves. The pain is their time.",
        "branches": [
          {
            "label": "It's a lot / Getting harder to keep up",
            "to": "solution_bridge"
          },
          {
            "label": "It's manageable / We're small enough",
            "to": "solution_bridge_small"
          },
          {
            "label": "We're looking at ways to scale that",
            "to": "solution_bridge"
          }
        ]
      },
      "discovery_no_system": {
        "label": "DISCOVERY — NO FORMAL SYSTEM",
        "say": "That's honestly super common — especially for owner-operated companies where you're wearing ten hats. Most of the guys I talk to are relying on their cleaners' eyes and hoping nothing gets missed. That's actually exactly what we help with. We basically look at whatever photos your team's already taking and flag anything that's off — damage, missing items, staging issues — automatically. No extra work on your end. Would you be open to seeing it? Takes about fifteen minutes.",
        "note": "No formal system means low barrier to entry. He doesn't have to rip out existing tooling. Frame RapidEye as adding a layer, not replacing anything.",
        "branches": [
          {
            "label": "Sure / That could be useful",
            "to": "book_meeting"
          },
          {
            "label": "We're too small for that",
            "to": "objection_too_small"
          },
          {
            "label": "What does it cost?",
            "to": "deflect_price"
          },
          {
            "label": "Send me info first",
            "to": "send_email"
          }
        ]
      },
      "discovery_time": {
        "label": "DISCOVERY — TIME BURDEN",
        "say": "Yeah — and heading into summer in Myrtle Beach, that's only going to ramp up, right? That's actually why a lot of the owners I work with got interested — we basically automate that review step so you're not eyeballing every photo yourself. The AI flags anything that changed or looks off, and you just check the flagged stuff. Would you be open to a quick look? Fifteen minutes, I'll show you exactly how it'd work for your setup.",
        "note": "Summer is peak season for Myrtle Beach vacation rentals. Use the seasonal pressure — he knows turnovers are about to multiply. Don't let him punt to 'after season' without getting something locked in.",
        "branches": [
          {
            "label": "Sure / Yeah let's do it",
            "to": "book_meeting"
          },
          {
            "label": "After season maybe / Not right now",
            "to": "objection_timing"
          },
          {
            "label": "What does it cost?",
            "to": "deflect_price"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          }
        ]
      },
      "solution_bridge": {
        "label": "SOLUTION — ONE SENTENCE PLUS CTA",
        "say": "So what we built basically plugs into the photos your team's already taking and uses AI to flag damage, missing items, staging issues — automatically. No workflow change, your crew keeps doing what they're doing. We're working with a few hundred properties on the East Coast doing the same thing right now. Would you be open to taking a look when I'm not cold calling you out of the blue?",
        "note": "One sentence on what it does. One sentence on traction. One low-friction CTA. Don't oversell. Pause and let him decide.",
        "branches": [
          {
            "label": "Sure / Yeah I'd look at that",
            "to": "book_meeting"
          },
          {
            "label": "Not interested / We're good",
            "to": "objection_not_interested"
          },
          {
            "label": "No budget / Can't buy anything right now",
            "to": "objection_budget"
          },
          {
            "label": "Send me info / Email me",
            "to": "send_email"
          }
        ]
      },
      "solution_bridge_small": {
        "label": "SOLUTION — SMALLER OPERATION ANGLE",
        "say": "Totally get it. Honestly the smaller operators are the ones who get the most out of this — because you actually care about every unit. The big companies with five hundred properties? Half of them are just trying to survive. You're trying to deliver a great product. We basically look at the photos your crew's already snapping and flag anything that changed — damage, missing items, whatever. No extra work. Would it be worth fifteen minutes to see if it's a fit? If it's not, I'll tell you that straight up.",
        "note": "Smaller operators often self-disqualify. Reframe: quality-focused operators get the most value because every unit matters more. Be direct that you'll tell him if it's not a fit.",
        "branches": [
          {
            "label": "Sure / I'd take a look",
            "to": "book_meeting"
          },
          {
            "label": "Not a priority right now",
            "to": "objection_not_interested"
          },
          {
            "label": "What does it cost?",
            "to": "deflect_price"
          },
          {
            "label": "Send me info first",
            "to": "send_email"
          }
        ]
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "Totally get it — I should've assumed you'd have that handled already. Otherwise you probably would've reached out yourself.",
        "note": "Agree first. Surprise him by not pushing back. Pause briefly then move to the split. Don't sound defeated — sound understanding.",
        "branches": [
          {
            "label": "Continue",
            "to": "interest_split"
          }
        ]
      },
      "interest_split": {
        "label": "SPLIT — NOT INTERESTED",
        "say": "Just so nobody from my team bugs you again — is it that this really isn't something you're dealing with, or is it more that you just hate cold calls and I caught you at a bad time?",
        "note": "Most people will admit it's the cold call, not the problem. That reopens the door. If it's genuinely not a problem, respect it and go to referral.",
        "branches": [
          {
            "label": "It's the cold call / Bad timing honestly",
            "to": "sell_test_drive"
          },
          {
            "label": "We genuinely don't need this",
            "to": "referral_check"
          },
          {
            "label": "I'm just busy / Try me later",
            "to": "bad_timing"
          }
        ]
      },
      "objection_budget": {
        "label": "OBJECTION — NO BUDGET",
        "say": "Totally get it — nowadays it's harder to keep a tool let alone buy something new. Especially heading into season when every dollar's going into operations.",
        "note": "Agree and validate. Reference seasonal budget pressure — he's probably investing in cleaning staff and supplies for summer right now. Pause then move to split.",
        "branches": [
          {
            "label": "Continue",
            "to": "budget_split"
          }
        ]
      },
      "budget_split": {
        "label": "SPLIT — BUDGET",
        "say": "Just so I'm not wasting your time — is it that budget this cycle is completely locked up, or is it more that adding anything new right now just sounds like a headache?",
        "note": "If budget is locked, sell the test drive for future planning. If it's the headache, address how easy it is — no integration pain, no workflow change.",
        "branches": [
          {
            "label": "Budget is tight / Locked up right now",
            "to": "sell_test_drive"
          },
          {
            "label": "Just don't want to add anything new",
            "to": "sell_test_drive"
          },
          {
            "label": "What does it actually cost though?",
            "to": "deflect_price"
          }
        ]
      },
      "objection_have_process": {
        "label": "OBJECTION — ALREADY HAVE A PROCESS",
        "say": "That totally makes sense — honestly with how much you guys emphasize quality and inspections, I'd be surprised if you didn't have something dialed in.",
        "note": "Compliment their process. You know from their website they market on 'highest quality standards' and 'constant inspections.' Reference that credibility without sounding like a stalker. Pause then split.",
        "branches": [
          {
            "label": "Continue",
            "to": "process_split"
          }
        ]
      },
      "process_split": {
        "label": "SPLIT — HAVE A PROCESS",
        "say": "Is it that you're fully covered and nothing's slipping through, or is it more that what you've got works well enough and switching anything right now would be a pain?",
        "note": "Nobody's fully covered. If he says things slip through, you're back in. If switching is the concern, emphasize there's nothing to switch — RapidEye layers on top.",
        "branches": [
          {
            "label": "Things still slip through sometimes",
            "to": "sell_test_drive"
          },
          {
            "label": "We're covered / Works fine",
            "to": "referral_check"
          },
          {
            "label": "Switching would be a pain",
            "to": "no_switch_needed"
          }
        ]
      },
      "no_switch_needed": {
        "label": "NO SWITCHING — LAYERS ON TOP",
        "say": "That's the thing though — we actually don't replace anything. Your team keeps doing exactly what they're doing. We just look at the photos they're already taking and flag what a human eye might miss. There's literally nothing to switch out or change. Would it be worth a fifteen-minute look just to see if it catches stuff your current process doesn't?",
        "note": "This is a key differentiator for smaller ops who don't want disruption. Zero workflow change is the whole pitch here. Say it clearly.",
        "branches": [
          {
            "label": "Okay / Sure I'll look",
            "to": "book_meeting"
          },
          {
            "label": "Still not interested",
            "to": "referral_check"
          },
          {
            "label": "Send me info first",
            "to": "send_email"
          }
        ]
      },
      "objection_too_small": {
        "label": "OBJECTION — WE'RE TOO SMALL",
        "say": "I hear you. Honestly though, some of the best results we've seen are with smaller operators — because you actually care about every single unit. The big guys with five hundred properties? Half of them are just trying to keep the lights on. You're trying to deliver a five-star product. That's who this is built for. Would you be open to a quick look? If it doesn't make sense at your scale, I'll tell you that straight up.",
        "note": "Don't let him self-disqualify. Reframe small as an advantage. Quality-focused operators have more at stake per property. Be genuine — if it's truly not a fit, you'd say so.",
        "branches": [
          {
            "label": "Okay / Sure why not",
            "to": "book_meeting"
          },
          {
            "label": "Still not sure it's for us",
            "to": "sell_test_drive"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          }
        ]
      },
      "objection_timing": {
        "label": "OBJECTION — NOT THE RIGHT TIME",
        "say": "Totally fair — right before peak season is probably the worst time to add anything to your plate. What if we did this: I'll shoot you a quick email with the basics, and we set up fifteen minutes for after the summer rush? That way it's on your radar without adding to your workload right now. How does sometime in September look?",
        "note": "Respect the timing but don't let the lead die. Lock in a post-season touchpoint. Summer in Myrtle Beach is roughly June through August. Suggest September. Get it on the calendar now.",
        "branches": [
          {
            "label": "Sure / That works",
            "to": "book_meeting"
          },
          {
            "label": "Just email me / I'll reach out when I'm ready",
            "to": "send_email"
          },
          {
            "label": "Not interested even then",
            "to": "end_graceful"
          }
        ]
      },
      "deflect_price": {
        "label": "DEFLECT PRICE — REDIRECT TO MEETING",
        "say": "It honestly depends on how many units you're running and what the turnover volume looks like — I don't want to throw out a number that doesn't mean anything. That's part of why a quick call makes sense. I can show you exactly what it'd look like for your setup and give you real numbers. How's sometime next week?",
        "note": "Never quote price on a cold call. Redirect to the meeting where you can anchor value first. If he pushes hard, give a ballpark but always tie it back to the meeting.",
        "branches": [
          {
            "label": "Okay / Let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "Just give me a ballpark",
            "to": "ballpark_and_book"
          },
          {
            "label": "Not worth my time without knowing cost",
            "to": "sell_test_drive"
          }
        ]
      },
      "ballpark_and_book": {
        "label": "BALLPARK THEN BOOK",
        "say": "Totally fair. For an operation your size we're typically talking a couple hundred bucks a month — way less than one missed damage claim. But the exact number really depends on volume and setup. How about I show you the full picture next week and if the numbers don't work I'll tell you upfront? How's Tuesday or Wednesday look?",
        "note": "Give a soft range. Anchor to the cost of one missed damage claim — which is way more than a couple hundred. Then immediately redirect to booking. Don't negotiate price on a cold call.",
        "branches": [
          {
            "label": "Okay / Let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Let me think about it / Send me info",
            "to": "send_email"
          },
          {
            "label": "That's too much / Not in the budget",
            "to": "objection_budget"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Look — you're probably not buying anything off a cold call, and I totally respect that. But when you do have bandwidth, the people who make smart moves are the ones who already know what's out there. If nothing else I could show you what a few other vacation rental operators are doing with their turnover photos right now. Worst case you steal some ideas and we part as friends. Would you be open to that?",
        "note": "This is your last best shot before exit. Low pressure. Frame it as value even if he never buys. 'Steal some ideas and part as friends' is disarming. If this doesn't land, go gracefully.",
        "branches": [
          {
            "label": "Alright / Sure why not",
            "to": "book_meeting"
          },
          {
            "label": "Send me something and I'll decide",
            "to": "send_email"
          },
          {
            "label": "No / Not right now",
            "to": "end_graceful"
          }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair — I'll shoot you something today. One quick question so it's not just another generic pitch sitting in your inbox — what would be most relevant for you? Is it more about catching damage between guests, or is it the time your team spends on inspections, or something else?",
        "note": "Accept the email request then ask ONE question. Whatever he says, tailor the email to that specific angle. This also keeps the conversation going a few more seconds and shows you're not just blasting templates.",
        "branches": [
          {
            "label": "Tells you what matters most to him",
            "to": "email_confirm"
          },
          {
            "label": "Just send me the basics / Whatever you've got",
            "to": "email_confirm"
          }
        ]
      },
      "email_confirm": {
        "label": "CONFIRM EMAIL AND SUGGEST TIME",
        "say": "Got it — I'll put something together and send it over today. I'll include a couple times next week in case you want to hop on a quick call after you look it over. Best email — is it the gmail, myrtlebeachrentalpros at gmail?",
        "note": "Confirm the email address — the gmail is publicly listed so it sounds natural. Suggesting times in the email keeps the door open for a meeting. Send the email within the hour while you're fresh in his mind.",
        "branches": [
          {
            "label": "Yes / Confirms email",
            "to": "end_graceful_warm"
          },
          {
            "label": "Gives a different email",
            "to": "end_graceful_warm"
          }
        ]
      },
      "referral_check": {
        "label": "REFERRAL — CHECK FOR OTHER CONTACTS",
        "say": "Totally respect that. Hey — since you're in the vacation rental world down in Myrtle Beach, do you know any other property managers in the area who might be dealing with this? I work with a few companies up and down the Grand Strand and I'm always looking for introductions.",
        "note": "Aaron knows the local market. Even if he's not a buyer, he might connect you to someone who is — Thomas Beach, Dunes Realty, Elliott Beach, whoever. Vacation rental operators in the same market often know each other.",
        "branches": [
          {
            "label": "Mentions someone / Gives a name",
            "to": "referral_capture"
          },
          {
            "label": "Can't think of anyone / No",
            "to": "end_graceful"
          }
        ]
      },
      "referral_capture": {
        "label": "CAPTURE THE REFERRAL",
        "say": "That's awesome — really appreciate that. If you've got their number or email I'll put something tailored together so it actually lands. And I'll mention you pointed me their way if that's cool?",
        "note": "Get the contact info. Ask to use Aaron's name as a warm intro. Write everything down. Follow up same day while the connection is fresh.",
        "branches": [
          {
            "label": "Gives contact info",
            "to": "end_graceful_warm"
          },
          {
            "label": "Just look them up / Can't remember offhand",
            "to": "end_graceful_warm"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING — LOCK IT IN NOW",
        "say": "Awesome. Let me grab my calendar — how does next week look for you? I've got Tuesday afternoon or Wednesday morning open. What works best?",
        "note": "Pick specific days and times. Don't say 'when are you free' — too open-ended. Give two concrete options. Send the calendar invite while on the phone if possible.",
        "branches": [
          {
            "label": "Picks a time / Suggests a day",
            "to": "meeting_booked"
          },
          {
            "label": "I need to check my calendar / Can I get back to you?",
            "to": "meeting_pin_down"
          }
        ]
      },
      "meeting_pin_down": {
        "label": "PIN DOWN THE MEETING",
        "say": "Totally — tell you what, I'll shoot you an invite for Wednesday at ten just to hold the slot. If you need to move it just let me know. That way we've got something on the books and it's off both our plates. Sound good?",
        "note": "Don't let 'I'll check my calendar' turn into a ghost. Send the invite anyway. It's much easier to reschedule a meeting that exists than to restart from zero.",
        "branches": [
          {
            "label": "Sure / That works",
            "to": "meeting_booked"
          },
          {
            "label": "Just email me first",
            "to": "send_email"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING CONFIRMED",
        "say": "Perfect — I'll send that over right now. Really appreciate you taking my call, Aaron. Talk to you then.",
        "note": "STOP SELLING. The meeting is booked. Send the invite immediately after hanging up. Be warm, be brief, get off the phone. Don't give him a reason to reconsider.",
        "branches": []
      },
      "end_graceful_warm": {
        "label": "WARM EXIT",
        "say": "Really appreciate it, Aaron. I'll follow up today. If anything ever comes up on the inspection side, I'm easy to find. Have a good one.",
        "note": "Positive exit. You got an email send or a referral — that's a win. Follow up within the hour while you're fresh in his mind. Log the outcome.",
        "branches": []
      },
      "end_graceful": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes down the road, I'm easy to find — Sam Parks, RapidEye. Appreciate your time, Aaron.",
        "note": "Don't burn the bridge. He might Google you later. Stay professional and warm. Log the outcome and set a reminder to try again in 60 to 90 days.",
        "branches": []
      }
    }
  }
}