{
  "name": "Amanda Vanderpool Flynn",
  "title": "Agent",
  "company": "Coldwell Banker Mason Morse — Aspen Resort Luxury Rentals",
  "location": "Aspen, CO",
  "phone": "+1-310-874-7101",
  "company_phone": "+1-970-920-7393",
  "alt_phones": [],
  "flow": {
    "context": "Amanda Vanderpool Flynn is an agent at Coldwell Banker Mason Morse's Aspen Resort Luxury Rentals division, personally representing 11 luxury rental properties in Aspen/Snowmass. Her cell is a 310 area code — she's almost certainly from the LA area, same as Sam (La Cañada Flintridge). CBMM manages roughly 300 properties across the Roaring Fork Valley and explicitly advertises pre-arrival and post-departure inspections to owners. Amanda is not the top decision-maker — Will Herndon (President) oversees all operations — but she lives the inspection pain daily across her portfolio and can champion or refer internally. Strongest opener: the shared LA roots via her 310 cell number.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER — LA CONNECTION",
        "say": "Hey Amanda — I noticed you've got an LA area code. I actually grew up out in La Cañada, so that caught my eye. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Feet-up-on-the-desk energy. Smile. The LA area code thing is genuine and disarming — let it land naturally. Don't rush past it.",
        "branches": [
          {
            "label": "No, haven't heard of you",
            "to": "no_not_heard"
          },
          {
            "label": "Yes / maybe",
            "to": "yes_heard"
          },
          {
            "label": "Bad timing / busy",
            "to": "bad_timing"
          },
          {
            "label": "Who is this? / Guarded",
            "to": "whos_this"
          }
        ]
      },
      "no_not_heard": {
        "label": "THEY HAVEN'T HEARD OF YOU",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call — I work with a few luxury rental managers, and your name came up since you've got about eleven properties over in Aspen. Figured it was worth a quick call.",
        "note": "Transition naturally into the pain trigger. The 'eleven properties' specificity shows you did homework and aren't blasting a list.",
        "branches": [
          {
            "label": "OK, go on / listening",
            "to": "pain_trigger"
          },
          {
            "label": "Not interested",
            "to": "not_interested_objection"
          },
          {
            "label": "How'd you get my number?",
            "to": "how_got_number"
          }
        ]
      },
      "yes_heard": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — what'd you hear? We've been working with a few property managers on their inspection workflows, so I'm curious what made it to you.",
        "note": "Let her talk. Whatever she says, bridge to pain trigger or discovery. This is rare but golden if it happens.",
        "branches": [
          {
            "label": "Shares what they heard",
            "to": "pain_trigger"
          },
          {
            "label": "Vague / not much",
            "to": "pain_trigger"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow or later this week? When's less hectic?",
        "note": "Don't push. Lock in a specific callback time. If she gives one, confirm it and end cheerfully.",
        "branches": [
          {
            "label": "Gives a specific time",
            "to": "reschedule_confirmed"
          },
          {
            "label": "Just call back whenever / vague",
            "to": "reschedule_confirmed"
          },
          {
            "label": "Not interested at all",
            "to": "not_interested_objection"
          }
        ]
      },
      "whos_this": {
        "label": "GUARDED — WHO IS THIS",
        "say": "Yeah totally fair — it is a cold call, I'll be upfront. I'm Sam with RapidEye. Can I get thirty seconds to tell you why I reached out? And you can totally hang up on me if it's not a fit.",
        "note": "Acknowledge the cold call immediately. Asking for 30 seconds with permission to hang up disarms most people.",
        "branches": [
          {
            "label": "OK, go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "No thanks / not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "how_got_number": {
        "label": "HOW'D YOU GET MY NUMBER",
        "say": "It's actually right on your agent page on the Aspen Resort Rentals site — the 310 number. Honestly that LA area code is what caught my attention. But look, I know I'm calling out of the blue. Can I get thirty seconds? If it's not relevant I'll get out of your hair.",
        "note": "Be transparent. Her cell is published on aspenresortrentals.com. Honesty builds trust fast.",
        "branches": [
          {
            "label": "OK, go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "Not interested",
            "to": "not_interested_objection"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot, totally my bad for the interruption. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is this just not something on your radar?",
        "note": "Last chance to salvage. The multiple choice forces her to clarify. 'Horrible time' reopens a callback. 'Not on radar' might lead to a referral.",
        "branches": [
          {
            "label": "Bad time",
            "to": "bad_timing"
          },
          {
            "label": "Not on my radar / not my area",
            "to": "referral_not_right_person"
          },
          {
            "label": "Hard no / hangs up",
            "to": "graceful_exit"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER — LUXURY TURNOVER INSPECTIONS",
        "say": "So here's why I called you specifically. I was talking to another luxury rental agent — she manages about a dozen high-end homes, pretty similar to your setup. She told me that after every turnover, her team snaps photos of everything, but with properties at Aspen price points, stuff still slips through — a scratch on a hardwood floor, a stain on a ten-thousand-dollar sofa — and by the time anyone catches it, the guest's long gone and the owner's calling asking who's covering it. Does that sound familiar at all, or am I totally off base for how you guys run things?",
        "note": "PAUSE after asking the question. Let the silence work. She manages 11 luxury properties — she's lived this. The pause is where the magic happens. Do not fill it.",
        "branches": [
          {
            "label": "Yes, that happens / relatable",
            "to": "warm_response"
          },
          {
            "label": "We have a process for that",
            "to": "have_a_process"
          },
          {
            "label": "Not really my problem / not interested",
            "to": "not_interested_objection"
          },
          {
            "label": "What do you do about it?",
            "to": "solution_one_liner"
          }
        ]
      },
      "warm_response": {
        "label": "THEY'RE WARM — STOP PITCHING, ASK QUESTIONS",
        "say": "Yeah, I hear that a lot in luxury markets. So when your team does a turnover on one of your eleven properties — what does the inspection piece actually look like right now? Are your cleaners taking photos, or do you have a separate inspection step?",
        "note": "She's warm. DO NOT PITCH. Ask about her process. Listen for: who takes photos, what tool they use, who reviews them, what happens when something's missed.",
        "branches": [
          {
            "label": "Describes their process / shares details",
            "to": "discovery_dig_deeper"
          },
          {
            "label": "Mentions a frustration or pain point",
            "to": "discovery_pain_found"
          },
          {
            "label": "Says she's not the one who handles that",
            "to": "referral_not_right_person"
          }
        ]
      },
      "have_a_process": {
        "label": "OBJECTION — WE HAVE A PROCESS",
        "say": "That totally makes sense — with properties at that level, you'd have to. I'd honestly be surprised if you didn't. Just out of curiosity, is it more of a manual review after photos come in, or are you guys using software to flag things automatically?",
        "note": "Agree genuinely, then distinguish manual vs. automated. Most luxury PMs still rely on humans reviewing photos — that's the gap. No tech stack is publicly known for CBMM, so you need to learn it here.",
        "branches": [
          {
            "label": "Manual / someone reviews photos",
            "to": "manual_process_bridge"
          },
          {
            "label": "We use software (names a tool)",
            "to": "software_bridge"
          },
          {
            "label": "Not sure / not my area",
            "to": "referral_not_right_person"
          }
        ]
      },
      "not_interested_objection": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "Totally get it. I should've assumed you'd be all set — otherwise you probably would've reached out to us. Just so no one from my team cold calls you again — is it that inspections just aren't a headache for you right now, or is it more that you just hate getting cold called?",
        "note": "Agree first, never argue. The split question forces specificity. 'Not a headache' → pivot to referral for who it IS a headache for. 'Hate cold calls' → lower-friction channel.",
        "branches": [
          {
            "label": "Not a headache / we're fine",
            "to": "not_a_priority"
          },
          {
            "label": "Hate cold calls / just busy",
            "to": "hate_cold_calls"
          },
          {
            "label": "Hard no",
            "to": "graceful_exit"
          }
        ]
      },
      "manual_process_bridge": {
        "label": "BRIDGE — MANUAL REVIEW GAP",
        "say": "Yeah, that's exactly what I hear from most luxury managers. The photos are getting taken, but someone still has to sit there and review every single one — and when you're turning properties back to back during ski season, things get missed just because of volume. That's actually the exact problem we built RapidEye to solve — it plugs into whatever you're already using and automatically flags damage, missing items, staging issues from the photos your team's already taking. No workflow change at all. Would you be open to seeing what that looks like? I promise I won't take more than twenty minutes of your time.",
        "note": "This is your one-sentence solution plus CTA. 'No workflow change' is the key phrase — she doesn't want more work added to her plate. Keep it tight.",
        "branches": [
          {
            "label": "Sure, I'd take a look",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "I'm not the right person for this",
            "to": "referral_not_right_person"
          },
          {
            "label": "Not right now",
            "to": "sell_test_drive"
          }
        ]
      },
      "software_bridge": {
        "label": "BRIDGE — THEY USE SOFTWARE",
        "say": "Oh interesting — which platform are you guys on? I ask because we actually integrate with most of the big ones and sit on top as an AI layer. Curious whether what you're using does the damage-detection piece automatically or if that's still a human eyeballing photos.",
        "note": "Learn their tech stack. No public evidence of any PMS or ops platform at CBMM. Whatever she names, note it — it's gold for the follow-up and demo.",
        "branches": [
          {
            "label": "Names a tool / describes it",
            "to": "manual_process_bridge"
          },
          {
            "label": "Not sure / would have to check",
            "to": "referral_not_right_person"
          }
        ]
      },
      "discovery_dig_deeper": {
        "label": "DISCOVERY — DIG DEEPER ON COST",
        "say": "Got it. And when something does get missed — like damage that doesn't get caught until the next guest checks in or the owner notices — what happens? Does that come out of the company's pocket, or can you claw it back from the guest's deposit?",
        "note": "You're looking for the financial pain. In Aspen luxury, a single missed damage incident can be thousands to tens of thousands. If she says the company eats it or deposits don't cover it, you have your hook.",
        "branches": [
          {
            "label": "Shares the financial impact / frustration",
            "to": "discovery_pain_found"
          },
          {
            "label": "Deposits cover it / not a big deal",
            "to": "solution_one_liner"
          },
          {
            "label": "That's more of an ops question",
            "to": "referral_not_right_person"
          }
        ]
      },
      "discovery_pain_found": {
        "label": "PAIN CONFIRMED — BRIDGE TO SOLUTION",
        "say": "Yeah, and at Aspen price points that adds up fast. That's literally why we built this — we take the photos your team's already capturing after every turnover and run them through AI that flags damage, missing items, anything out of place. Automatically. No extra steps for your cleaners or inspectors. We're doing it right now for a PM company in New York managing about two hundred luxury homes — similar high-value stuff. Would it make sense to show you what that actually looks like? I could do twenty minutes, tops.",
        "note": "Name the NYC traction — 200 luxury homes is relevant social proof for her portfolio. The CTA is low-friction: 20 minutes, not a big commitment.",
        "branches": [
          {
            "label": "Yeah, let's set it up",
            "to": "book_meeting"
          },
          {
            "label": "Send me info first",
            "to": "send_email"
          },
          {
            "label": "I'd want to loop in someone else",
            "to": "referral_loop_in"
          },
          {
            "label": "Not right now",
            "to": "sell_test_drive"
          }
        ]
      },
      "solution_one_liner": {
        "label": "ONE-LINER SOLUTION + CTA",
        "say": "Makes sense. Well real quick — we built an AI tool that automatically analyzes the turnover photos your team's already taking and flags damage, missing items, staging issues before the next guest walks in. No extra steps for anyone. We're working with a couple hundred luxury homes in New York doing the same thing. Would you be open to taking a quick look when I'm not cold calling you out of the blue?",
        "note": "Keep this tight. One sentence on what RapidEye does, one sentence of social proof, one low-friction CTA. Don't oversell.",
        "branches": [
          {
            "label": "Sure, I'd look at that",
            "to": "book_meeting"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          },
          {
            "label": "Not the right person",
            "to": "referral_not_right_person"
          },
          {
            "label": "Not interested",
            "to": "sell_test_drive"
          }
        ]
      },
      "referral_not_right_person": {
        "label": "NOT THE RIGHT PERSON — REFERRAL",
        "say": "Totally get it — I appreciate you being straight with me. Who on your team would typically own the inspection side of things? I know Will Herndon runs operations overall — would something like this land on his desk, or is there someone between you and him who handles the turnover workflow?",
        "note": "You know Will Herndon is President and oversees all operations. Name-drop him to show you've done homework. She might confirm him or point to someone else — either way you get a warm path in. Carrie Bryant is another potential name (luxury vacation rental division background).",
        "branches": [
          {
            "label": "Gives a name / confirms Will",
            "to": "referral_given"
          },
          {
            "label": "Not sure / try the main office",
            "to": "referral_push_for_name"
          },
          {
            "label": "Just email the team",
            "to": "send_email"
          }
        ]
      },
      "referral_given": {
        "label": "REFERRAL NAME RECEIVED",
        "say": "Perfect — that's super helpful. Would you mind if I mentioned you pointed me their way? Sometimes that's the difference between getting through and getting ignored. And honestly, if I put something tailored together, would you be open to being on the call too? You're the one managing those properties day to day — your perspective would actually be really useful.",
        "note": "Ask to use her name AND try to get her on the call. She's close to the pain — having her on the demo increases close rate significantly.",
        "branches": [
          {
            "label": "Sure, mention my name / I'll join",
            "to": "book_referral_meeting"
          },
          {
            "label": "Just reach out directly",
            "to": "book_referral_meeting"
          },
          {
            "label": "I'd rather not be involved",
            "to": "book_referral_meeting"
          }
        ]
      },
      "referral_push_for_name": {
        "label": "PUSH GENTLY FOR A NAME",
        "say": "Totally fair. If I just call the main line cold, it'll probably sit in a pile. Is there anyone — even just a first name — who you think would actually care about this? Could be someone on the property management side, or whoever deals with owner calls when damage gets missed.",
        "note": "Frame it as helping you not waste people's time. 'Owner calls when damage gets missed' is a specific pain trigger that might jog a name loose.",
        "branches": [
          {
            "label": "Gives a name",
            "to": "referral_given"
          },
          {
            "label": "Try vacation@masonmorse.com / main line",
            "to": "send_email"
          },
          {
            "label": "Can't help",
            "to": "graceful_exit"
          }
        ]
      },
      "referral_loop_in": {
        "label": "THEY WANT TO LOOP SOMEONE IN",
        "say": "Love that. Who would you want on the call? I can send an invite to both of you — that way it's easy and nobody's playing phone tag.",
        "note": "Get the name and email of who she wants to include. This is ideal — she's sponsoring the meeting internally. If she names Will Herndon, you already have his cell and office number.",
        "branches": [
          {
            "label": "Gives a name or email",
            "to": "book_meeting"
          },
          {
            "label": "Let me check and get back to you",
            "to": "send_email"
          }
        ]
      },
      "not_a_priority": {
        "label": "INSPECTIONS NOT A PRIORITY FOR HER",
        "say": "Makes total sense. Out of curiosity — who on your team does worry about the inspection piece? I don't want to keep bugging the wrong person. Would that be more of a Will Herndon conversation, or somebody else?",
        "note": "If it's not her problem, pivot to referral immediately. Don't push the product on someone who doesn't own the pain. Will Herndon (President) is the known ops leader.",
        "branches": [
          {
            "label": "Gives a name / direction",
            "to": "referral_given"
          },
          {
            "label": "Not sure",
            "to": "graceful_exit"
          }
        ]
      },
      "hate_cold_calls": {
        "label": "THEY HATE COLD CALLS",
        "say": "Ha — honestly, fair. I hate making them too. What if I just shoot you a quick email with what we're doing for a couple other luxury rental managers? Worst case you steal some ideas and we never talk again. Best case it's actually useful. Sound fair?",
        "note": "Pivot to email as a lower-friction channel. Her email is amanda@masonmorse.com. Keep the tone light.",
        "branches": [
          {
            "label": "Sure, send it over",
            "to": "send_email_confirm"
          },
          {
            "label": "No thanks",
            "to": "graceful_exit"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally respect that. You're probably not buying anything right now, and that's fine. But here's what I've seen — when something does break, or an owner calls upset about damage nobody caught, the people who already know what's out there move fast. Would you be open to just seeing what it looks like? Not a commitment — just so it's on your radar. If nothing else, I can walk you through what other luxury PMs in ski markets are doing with their turnover photos. Twenty minutes, tops.",
        "note": "This is the future-value play. Position the meeting as intelligence-gathering, not a buying decision. 'Ski markets' is specific to her world.",
        "branches": [
          {
            "label": "OK, I'll take a look",
            "to": "book_meeting"
          },
          {
            "label": "Just send me something",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "graceful_exit"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next week pulled up — does Tuesday or Wednesday afternoon work for you? I'm flexible, just want to lock something in while we're talking.",
        "note": "Pick specific days. Don't say 'whenever works.' Get a day and time confirmed, then send the calendar invite NOW while still on the phone.",
        "branches": [
          {
            "label": "Confirms a day and time",
            "to": "meeting_confirmed"
          },
          {
            "label": "Need to check calendar / push to later",
            "to": "meeting_pin_down"
          },
          {
            "label": "Send me an invite and I'll confirm",
            "to": "send_invite_confirm"
          }
        ]
      },
      "meeting_confirmed": {
        "label": "MEETING BOOKED — WRAP UP",
        "say": "Perfect, I'll send a calendar invite over to amanda at mason morse dot com right now. Really appreciate you taking my call, Amanda — especially from a random LA kid calling about inspection software. Talk to you then.",
        "note": "STOP SELLING. Confirm the email, send the invite immediately, and get off the phone. The LA callback at the end keeps it warm and human.",
        "branches": []
      },
      "meeting_pin_down": {
        "label": "PIN DOWN THE MEETING",
        "say": "Totally — how about I send you a couple time options and you just pick whichever works? That way it's on your terms. I'll send it to amanda at mason morse — that still the best email?",
        "note": "Confirm the email and send options immediately after hanging up. Follow up within 24 hours if she doesn't respond.",
        "branches": [
          {
            "label": "Confirms email / agrees",
            "to": "meeting_confirmed"
          },
          {
            "label": "Vague / noncommittal",
            "to": "send_email"
          }
        ]
      },
      "send_invite_confirm": {
        "label": "SENDING INVITE",
        "say": "Done — I'll fire that over right now. It'll come from Sam at RapidEye. If the time doesn't work just suggest another one right in the invite. Looking forward to it, Amanda.",
        "note": "Send the invite before you hang up. Follow up if she doesn't accept within 48 hours.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Absolutely. One quick question so I don't send you something generic — would you rather see how the AI actually catches things, or would a before-and-after from another luxury PM be more interesting to you?",
        "note": "Ask what to include so the email is tailored and gives you a reason to follow up. Her email is amanda@masonmorse.com. Include a specific meeting time suggestion in the email.",
        "branches": [
          {
            "label": "Tells you what they want to see",
            "to": "send_email_confirm"
          },
          {
            "label": "Just send whatever / doesn't matter",
            "to": "send_email_confirm"
          }
        ]
      },
      "send_email_confirm": {
        "label": "EMAIL CONFIRMED — WRAP UP",
        "say": "Got it — I'll send that over to amanda at mason morse dot com today. I'll drop in a couple times to chat too, in case you want to dig in after you see it. Appreciate your time, Amanda — enjoy the rest of ski season out there.",
        "note": "Send the email within the hour. Include a specific day/time suggestion for a call. Follow up in 3-4 days if no reply. The ski season line keeps it warm and personal.",
        "branches": []
      },
      "book_referral_meeting": {
        "label": "BOOK MEETING WITH REFERRAL",
        "say": "That's great. Do you have their direct number or email handy? I'll put something together that's specific to what you guys are doing at Mason Morse so it actually lands. And I'll mention you pointed me their way.",
        "note": "Get the contact info now. If she says Will Herndon, you already have his cell (970-319-5530) and office (970-925-7000) — confirm or get his email. If it's someone else, get everything you can.",
        "branches": [
          {
            "label": "Gives contact info",
            "to": "referral_wrap_up"
          },
          {
            "label": "I'll forward your info to them",
            "to": "referral_wrap_up"
          }
        ]
      },
      "referral_wrap_up": {
        "label": "REFERRAL WRAP UP",
        "say": "Seriously — thank you, Amanda. This is way more helpful than you think. I'll keep you in the loop on how it goes. Have a great rest of your day.",
        "note": "End warm. She just gave you a warm intro path — that's a win even if the call didn't convert directly. Follow up with the referral within 24 hours. CC Amanda if she agreed to it.",
        "branches": []
      },
      "reschedule_confirmed": {
        "label": "CALLBACK SCHEDULED",
        "say": "Perfect, I'll try you then. Appreciate it, Amanda — talk soon.",
        "note": "Note the exact callback time and set a reminder. When you call back, open with: 'Hey Amanda, it's Sam — we spoke briefly the other day and you said to try you back around now.'",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything ever comes up around inspections or turnover stuff, I'm easy to find — Sam Parks, RapidEye. Appreciate your time, Amanda.",
        "note": "Don't burn the bridge. She manages 11 luxury properties at a 300-property company. She may circle back, or you'll call others at CBMM and her name could come up. Leave a good impression.",
        "branches": []
      }
    }
  }
}