{
  "name": "Amanda Hoffmann",
  "title": "General Manager, Greater Palm Springs",
  "company": "Vacation Palm Springs by Vacasa",
  "location": "Palm Springs, CA",
  "phone": "800-590-3110",
  "company_phone": "+1-800-544-0300",
  "alt_phones": [],
  "flow": {
    "context": "Amanda Hoffmann is the General Manager for Greater Palm Springs at Vacation Palm Springs by Vacasa — she owns market-level quality, guest-readiness, and turnover operations for what was historically a 450+ property portfolio of upscale vacation homes. Vacasa was acquired by Casago (completed May 2025), so she is navigating post-acquisition changes with pressure to standardize ops and prove efficiency. Tech-wise, the site runs on Rezfusion/Bluetent, owners log in through Vacasa's portal, and Breezeway launched a Vacasa integration in Nov 2025 so they may be using it. Other known managers on-site: Britt Cheek (Manager), Bunnie Williams (Supervisor), Justin Vasquez (Management). Strongest Sam connection: he grew up in La Cañada Flintridge — Palm Springs is the quintessential LA-area resort market, shared SoCal context.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Amanda — I work with a couple vacation rental managers out in the Coachella Valley, and I'm actually from LA originally, grew up in La Cañada. It's Sam Parks with RapidEye — have you heard my name tossed around at all?",
        "note": "Warm, relaxed. Feet-up energy. The SoCal tie is real — if she asks about La Cañada or where in LA, engage for a beat before pivoting. Don't rush past it.",
        "branches": [
          {
            "label": "Yes / Maybe",
            "to": "heard_name_yes"
          },
          {
            "label": "No / Who?",
            "to": "heard_name_no"
          },
          {
            "label": "Bad timing / Busy",
            "to": "bad_timing"
          },
          {
            "label": "Someone else answered",
            "to": "gatekeeper"
          }
        ]
      },
      "heard_name_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone in your shoes. What'd you hear?",
        "note": "Let her talk. Whatever she says, steer toward discovery. If vague or confused, pivot into the pain trigger.",
        "branches": [
          {
            "label": "Positive or curious",
            "to": "discovery"
          },
          {
            "label": "Vague or confused",
            "to": "pain_trigger"
          },
          {
            "label": "Negative or dismissive",
            "to": "objection_not_interested"
          }
        ]
      },
      "heard_name_no": {
        "label": "HAVEN'T HEARD — BRIDGE",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call —",
        "note": "Smile through it. This is just the bridge line. Move straight into the pain trigger without pausing.",
        "branches": [
          {
            "label": "Continue to pain trigger",
            "to": "pain_trigger"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow or later this week?",
        "note": "Don't push. Respect the timing but try to lock a specific day and time.",
        "branches": [
          {
            "label": "Gives a time / Sure",
            "to": "reschedule"
          },
          {
            "label": "Don't call back",
            "to": "permission_rejected"
          }
        ]
      },
      "reschedule": {
        "label": "CALLBACK LOCKED",
        "say": "Perfect — I'll try you then. Really appreciate it, Amanda. Talk soon.",
        "note": "Write down the exact day and time. Set a reminder. Call exactly when you said you would.",
        "branches": []
      },
      "gatekeeper": {
        "label": "GATEKEEPER — SLIDE BY",
        "say": "Hey — could you get me through to Amanda? It's Sam.",
        "note": "Minimal info. Don't explain what you do. Sound like you belong. First name only.",
        "branches": [
          {
            "label": "Transferred / Hold on",
            "to": "opener"
          },
          {
            "label": "Who's calling / What's this about?",
            "to": "gatekeeper_pushback"
          },
          {
            "label": "She's not available",
            "to": "voicemail"
          }
        ]
      },
      "gatekeeper_pushback": {
        "label": "GATEKEEPER — ADD CONTEXT",
        "say": "Yeah — I work with a few other vacation rental managers in the Palm Springs area on their turnover workflows. Would you mind letting her know it's Sam Parks?",
        "note": "Still not pitching. Dose info one layer at a time. Stay casual. If they ask more, add: 'We help a couple PM companies with their inspection process. I sent her a note — just want to give her a heads up.'",
        "branches": [
          {
            "label": "OK transferring",
            "to": "opener"
          },
          {
            "label": "Can I take a message / She's out",
            "to": "voicemail"
          }
        ]
      },
      "voicemail": {
        "label": "VOICEMAIL",
        "say": "Hey Amanda — it's Sam Parks. I work with a few vacation rental operators out in the Coachella Valley on their inspection workflows. Wanted to run something by you — my number is [your number]. Again, Sam Parks. Thanks.",
        "note": "Under 20 seconds. Don't pitch. Create curiosity only. Follow up immediately with an email to amanda.hoffmann@vacationpalmsprings.com referencing the voicemail.",
        "branches": []
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "I've been talking to a few other GMs running large vacation rental portfolios in resort markets, and the thing I keep hearing is the same headache — their cleaners are taking photos after every turnover, sometimes hundreds a week, and nobody actually has time to review them all. So a stained sofa cushion, a cracked pool deck tile, a missing blender — it just doesn't get caught until a guest walks in and leaves a bad review, or worse, an owner finds out. And especially with everything going on post-acquisition, the pressure to tighten that up without adding headcount is real. We built a tool that plugs into the turnover photos your team's already taking and uses AI to flag damage, missing items, and staging issues automatically — zero workflow change. Would you be open to seeing what that looks like at some point when I'm not cold calling you out of the blue?",
        "note": "PAUSE after the 'missing blender' line — let the pain land before continuing. The post-acquisition line should feel empathetic, not salesy. If she reacts mid-sentence, STOP and let her talk.",
        "branches": [
          {
            "label": "Interested / Tell me more",
            "to": "warm_reaction"
          },
          {
            "label": "Lukewarm / Hmm / Silence",
            "to": "permission_fallback"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          },
          {
            "label": "That's a corporate decision",
            "to": "corporate_pushback"
          },
          {
            "label": "We already have something for that",
            "to": "objection_have_process"
          }
        ]
      },
      "permission_fallback": {
        "label": "PERMISSION — 30 SECONDS",
        "say": "Yeah totally — I mean, it is a cold call. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not a fit?",
        "note": "Self-aware and disarming. The admission that it's a cold call builds trust. If she laughs, you're in.",
        "branches": [
          {
            "label": "OK go ahead",
            "to": "pain_trigger_short"
          },
          {
            "label": "No thanks",
            "to": "permission_rejected"
          }
        ]
      },
      "pain_trigger_short": {
        "label": "ABBREVIATED PAIN + SOLUTION",
        "say": "Appreciate it. Short version — your teams are probably taking a bunch of turnover photos already, and nobody has the bandwidth to actually review them all. We built an AI tool that scans those photos and flags damage, missing items, and staging issues before the next guest walks in. A few other PM companies with portfolios your size are already using it. Would you be open to a quick look?",
        "note": "Compressed version. She gave you 30 seconds — honor it. Get to the CTA fast.",
        "branches": [
          {
            "label": "Interested / Sure",
            "to": "warm_reaction"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          },
          {
            "label": "That's corporate",
            "to": "corporate_pushback"
          },
          {
            "label": "We have something already",
            "to": "objection_have_process"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED — SPLIT IT",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and it's just not interesting?",
        "note": "Genuine, not pushy. The split question often reopens the door. Most people admit it's just bad timing.",
        "branches": [
          {
            "label": "Just bad timing",
            "to": "reschedule"
          },
          {
            "label": "Not interested at all",
            "to": "graceful_exit"
          },
          {
            "label": "Actually tell me quick",
            "to": "pain_trigger_short"
          }
        ]
      },
      "warm_reaction": {
        "label": "WARM — STOP PITCHING, START ASKING",
        "say": "Awesome — well before I talk your ear off, I'd love to understand how things work on your end. What does the turnover inspection process look like right now across your portfolio?",
        "note": "She's interested. STOP selling. Ask questions and listen. The more she talks, the better the meeting will be. Take notes on everything.",
        "branches": [
          {
            "label": "Describes their process",
            "to": "discovery"
          },
          {
            "label": "We don't really have one / It's a mess",
            "to": "discovery_pain_deep"
          },
          {
            "label": "I'm not really the person for this",
            "to": "referral_ask"
          },
          {
            "label": "Just send me info",
            "to": "send_email"
          }
        ]
      },
      "discovery": {
        "label": "DISCOVERY — DIG DEEPER",
        "say": "Got it — and are your cleaners documenting with photos after every turn, or is it more spot-check? Is that tied into a system or is it more manual?",
        "note": "Listen for tool names: Breezeway, Track, manual checklists, no system at all. Whatever she says, mirror it back and probe one level deeper.",
        "branches": [
          {
            "label": "They use Breezeway or named tool",
            "to": "discovery_tech"
          },
          {
            "label": "Manual / photos but no system",
            "to": "discovery_pain_deep"
          },
          {
            "label": "Mentions Casago or acquisition changes",
            "to": "casago_probe"
          }
        ]
      },
      "discovery_tech": {
        "label": "DISCOVERY — TECH STACK",
        "say": "OK so you're on [tool they mentioned] — that makes sense at your scale. Are you happy with how it handles the photo review piece? Like, is someone still eyeballing every photo set, or does it flag stuff automatically?",
        "note": "If Breezeway: we integrate with it — position RapidEye as the AI layer on top. If something else: find the gap in their current workflow. The question is always: who's reviewing those photos?",
        "branches": [
          {
            "label": "There's a gap / still manual review",
            "to": "cta_meeting"
          },
          {
            "label": "Happy with current tool",
            "to": "objection_have_process"
          },
          {
            "label": "Mentions acquisition or changes coming",
            "to": "casago_probe"
          }
        ]
      },
      "discovery_pain_deep": {
        "label": "DISCOVERY — PAIN IS REAL",
        "say": "Yeah, that's exactly what I keep hearing. When stuff does slip through — who usually catches it first? Is it a guest complaint, or does it come back through an owner?",
        "note": "This is gold. She's confirming the pain is real. Keep pulling the thread. The more specific the story, the easier the meeting books.",
        "branches": [
          {
            "label": "Guest complaints or reviews",
            "to": "cta_meeting"
          },
          {
            "label": "Owner escalations",
            "to": "cta_meeting"
          },
          {
            "label": "Gives a specific example or story",
            "to": "cta_meeting"
          }
        ]
      },
      "casago_probe": {
        "label": "CASAGO / ACQUISITION ANGLE",
        "say": "Yeah — I know Casago closed the Vacasa deal back in May. Has that changed much on the operations side for your market? Like, are you getting more flexibility on tooling, or is it tighter right now?",
        "note": "High-value intel. If she has local autonomy, push for the meeting. If centralized, get a corporate contact. Either way she'll respect that you did your homework on the acquisition.",
        "branches": [
          {
            "label": "More flexibility / local decisions",
            "to": "cta_meeting"
          },
          {
            "label": "Tighter / corporate decides",
            "to": "corporate_pushback"
          },
          {
            "label": "Doesn't want to discuss it",
            "to": "cta_meeting"
          }
        ]
      },
      "corporate_pushback": {
        "label": "CORPORATE DECISION OBJECTION",
        "say": "Totally makes sense — especially with Casago coming in, I'm sure there's a ton of consolidation happening. Is it that all new tools go through corporate now, or do you still have some say on the local ops side?",
        "note": "Don't accept 'corporate decides' at face value. GMs often have more influence than they let on. But if it truly is centralized, pivot to getting a corporate name.",
        "branches": [
          {
            "label": "I have some say / can evaluate locally",
            "to": "cta_meeting"
          },
          {
            "label": "Fully corporate / I can't approve anything",
            "to": "corporate_workaround"
          }
        ]
      },
      "corporate_workaround": {
        "label": "CORPORATE WORKAROUND — GET THE NAME",
        "say": "Got it — who on the corporate side would typically own a decision like this? If I can get a name, I'll put something tailored together so it's not just another cold pitch landing in their inbox. And honestly, having a local GM say 'this is worth looking at' goes a really long way with those conversations.",
        "note": "Two plays: (1) get the corporate contact name, (2) position Amanda as the internal champion who brings the idea up the chain. She might warm to that role.",
        "branches": [
          {
            "label": "Gives a name or contact",
            "to": "referral_got_name"
          },
          {
            "label": "Not sure who / won't share",
            "to": "cta_meeting_light"
          },
          {
            "label": "Not comfortable referring",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_not_interested": {
        "label": "NOT INTERESTED — SPLIT IT",
        "say": "Totally get it — I should've assumed you'd be all set. Otherwise you probably would've reached out. Just so nobody from my team cold calls you again — is it that turnover quality isn't really a problem you're focused on right now, or is it more that you just hate cold calls?",
        "note": "Agree first — surprise her. Then split the objection. Most people admit they hate cold calls, which reopens the door.",
        "branches": [
          {
            "label": "Hate cold calls / bad timing",
            "to": "pain_trigger_short"
          },
          {
            "label": "Not a priority / we're fine",
            "to": "test_drive"
          },
          {
            "label": "Hard no",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_have_process": {
        "label": "ALREADY HAVE A PROCESS / TOOL",
        "say": "That makes total sense — with a portfolio your size you'd have to have something in place. Are you using Breezeway by any chance, or something internal?",
        "note": "Breezeway launched a Vacasa integration Nov 2025 — high chance they use it. If yes, go to the Breezeway-specific angle. If something else, probe for gaps in photo review.",
        "branches": [
          {
            "label": "Yes Breezeway",
            "to": "split_vendor_breezeway"
          },
          {
            "label": "Something else or internal process",
            "to": "split_vendor"
          },
          {
            "label": "Won't say what they use",
            "to": "split_vendor"
          }
        ]
      },
      "split_vendor_breezeway": {
        "label": "BREEZEWAY — FIND THE GAP",
        "say": "Oh great — we actually integrate with Breezeway. The piece most teams tell me is still missing is that Breezeway is awesome for coordinating the turnover — tasks, scheduling, checklists — but someone still has to manually review every photo set to actually catch issues. That's the gap we fill. The AI scans those Breezeway photos automatically and flags anything off. Is it that you feel fully covered on the photo review side, or is that still kind of a bottleneck?",
        "note": "This is the killer angle. Breezeway coordinates tasks but does NOT analyze photos with AI. RapidEye is the layer on top, not a replacement. Make that crystal clear.",
        "branches": [
          {
            "label": "That is a gap / interesting",
            "to": "cta_meeting"
          },
          {
            "label": "We're fully covered",
            "to": "test_drive"
          },
          {
            "label": "Send me more info",
            "to": "send_email"
          }
        ]
      },
      "split_vendor": {
        "label": "SPLIT THE VENDOR OBJECTION",
        "say": "Got it, totally fair. Is it that you're fully covered and happy with how it's working, or is it more that switching anything right now would be a headache — especially with everything in flux post-acquisition?",
        "note": "The 'in flux' nod to the Casago acquisition usually lands. Most people admit their current setup has gaps when given a safe way to say it.",
        "branches": [
          {
            "label": "Has gaps / not fully happy",
            "to": "test_drive"
          },
          {
            "label": "Switching is the real problem",
            "to": "test_drive"
          },
          {
            "label": "Happy and fully covered",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_no_budget": {
        "label": "NO BUDGET",
        "say": "Totally get it — nowadays it's harder to keep a tool, let alone buy something new. Especially when corporate's involved. Is it that budget this cycle is completely locked, or is it more that anything new has to go through the ringer with Casago?",
        "note": "Split the objection. Either answer leads to the test drive. The goal isn't to sell today — it's to get on her radar for when budget opens.",
        "branches": [
          {
            "label": "Budget fully locked",
            "to": "test_drive"
          },
          {
            "label": "Approval process is the issue",
            "to": "test_drive"
          },
          {
            "label": "Hard no on budget",
            "to": "graceful_exit"
          }
        ]
      },
      "test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally hear you, and I'm not trying to sell you something today. But here's what I've seen — when budget does open up or when corporate asks what tools you want, the GMs who already know what's out there are the ones who get their pick. Would you be open to just seeing it? Not a commitment — just so it's on your radar. Worst case, I walk you through what a couple other PM companies in your market are doing with their turnover photos and you steal some ideas.",
        "note": "The 'steal some ideas' line is disarming. The meeting has value even if she never buys. Position it as intelligence gathering, not a sales pitch.",
        "branches": [
          {
            "label": "OK sure",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "graceful_exit"
          }
        ]
      },
      "cta_meeting": {
        "label": "ASK FOR THE MEETING",
        "say": "Would you be open to a quick 20 minutes to see what this looks like with your actual properties? I could pull in a couple of your Palm Springs listings and show you what the AI flags. No commitment — just a look.",
        "note": "The 'your actual properties' line is key — it makes the demo feel custom, not generic. If she says yes, go straight to booking. Don't keep selling.",
        "branches": [
          {
            "label": "Sure / Yes",
            "to": "book_meeting"
          },
          {
            "label": "Send me an email first",
            "to": "send_email"
          },
          {
            "label": "No budget for new tools",
            "to": "objection_no_budget"
          },
          {
            "label": "Would need corporate approval",
            "to": "corporate_pushback"
          }
        ]
      },
      "cta_meeting_light": {
        "label": "LIGHTER MEETING ASK",
        "say": "Totally understand. Even just for your own awareness — would you be open to a quick 15 minutes so you can see what it does? If it ever makes sense to bring up the chain, you'd already know the story. No pressure at all.",
        "note": "Softer ask when corporate is blocking. Position her as evaluating for herself, not committing the company to anything.",
        "branches": [
          {
            "label": "OK sure",
            "to": "book_meeting"
          },
          {
            "label": "Send info first",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "graceful_exit"
          }
        ]
      },
      "book_meeting": {
        "label": "LOCK IN THE MEETING",
        "say": "Awesome. I've got next week pulled up — would Tuesday or Thursday work better for you? I'm thinking morning your time, like 10 or 11 Pacific?",
        "note": "Give two day options and two time options. Lock it down. Don't leave it open-ended. Send the invite while on the phone if possible.",
        "branches": [
          {
            "label": "Picks a time",
            "to": "meeting_booked"
          },
          {
            "label": "Needs to check calendar / not sure",
            "to": "send_email"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING CONFIRMED — WRAP UP",
        "say": "Perfect — I'll send you a calendar invite right now to your email. Really appreciate you taking my call, Amanda. Looking forward to it.",
        "note": "STOP SELLING. Confirm the time. Send invite to amanda.hoffmann@vacationpalmsprings.com immediately. Don't add anything else — you got the meeting. Send a brief confirmation email within 5 minutes.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One question before I do — what would be most useful to include so it's actually worth opening? Is it more the damage detection piece, the cleaner accountability side, or something else entirely?",
        "note": "This does two things: (1) tailors the email so it's not generic, (2) reveals which pain she actually cares about. Send to amanda.hoffmann@vacationpalmsprings.com within 1 hour.",
        "branches": [
          {
            "label": "Tells you what to focus on",
            "to": "send_email_close"
          },
          {
            "label": "Just send whatever",
            "to": "send_email_close"
          }
        ]
      },
      "send_email_close": {
        "label": "CLOSE THE EMAIL THREAD",
        "say": "Got it — I'll send that over today. I'll drop in a couple times for next week in case you want to see it live after reading. If not, no pressure at all. Appreciate your time, Amanda.",
        "note": "Send within 1 hour. Subject line should reference this call. Include a specific time option or Calendly link. Follow up in 3 business days if no reply.",
        "branches": []
      },
      "referral_ask": {
        "label": "ASK FOR A REFERRAL",
        "say": "Totally get it — you might not be the right person for this one. Who on your team typically owns the inspection or turnover quality piece day to day? Is that more of a supervisor role, or does someone else handle that?",
        "note": "Listen for names. Research shows Britt Cheek (Manager), Bunnie Williams (Supervisor), and Justin Vasquez (Management) — if she mentions any of them, note it. Even a title or department helps.",
        "branches": [
          {
            "label": "Gives a name",
            "to": "referral_got_name"
          },
          {
            "label": "Not sure / won't share",
            "to": "graceful_exit"
          }
        ]
      },
      "referral_got_name": {
        "label": "GOT A REFERRAL NAME",
        "say": "That's super helpful. And would it be cool if I mentioned you pointed me their way? I'll put something specific together so it actually lands for them — not just a generic pitch.",
        "note": "Get permission to use Amanda's name — it warms the next call massively. Ask for the person's email or direct number if she's willing. Write everything down.",
        "branches": [
          {
            "label": "Yes use my name",
            "to": "referral_close"
          },
          {
            "label": "Rather you didn't",
            "to": "referral_close"
          }
        ]
      },
      "referral_close": {
        "label": "REFERRAL WRAP-UP",
        "say": "Really appreciate it, Amanda. I'll reach out to them and keep it low-key. And if you ever want to see what we're doing yourself, you know where to find me. Thanks for your time.",
        "note": "Send Amanda a short thank-you email. Then call the referral within 24 hours while the connection is fresh. Mention Amanda by name if she gave permission.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything ever changes on the inspection side — especially as things settle with Casago — I'm easy to find. Appreciate your time, Amanda.",
        "note": "Don't burn the bridge. The Casago line plants a seed — things WILL change post-acquisition and she may remember you. Send a brief polite follow-up email anyway. Try again in 90 days.",
        "branches": []
      }
    }
  }
}