{
  "name": "Amanda Franta",
  "title": "General Manager / Principal Broker",
  "company": "Coldwell Banker Island Vacations",
  "location": "Scottsdale, AZ is already on the list. Let me provide the next best option:\\n\\nMaui, HI",
  "phone": "+1-808-357-8243",
  "company_phone": "+1-808-891-2900",
  "alt_phones": [],
  "flow": {
    "context": "Amanda Franta is the Founder, General Manager, and Principal Broker of Coldwell Banker Island Vacations — she built this company in 2001 and oversees 300+ vacation rental properties across Maui, Kauai, and Big Island with dedicated ops, housekeeping, and maintenance teams under her. She is the ultimate decision-maker on operations, vendors, and budget. No ops inspection platform like Breezeway was detected publicly — photo review is likely manual or basic. Maui's Bill 9 (passed Dec 2025) threatens to phase out thousands of vacation rentals, increasing pressure to maximize quality on remaining units. Sam's best personal hook: he's an avid surfer with recent trips to Indonesia and El Salvador — natural common ground with a Hawaii-based operator.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Amanda — bit of a random one. I'm a surfer, so naturally I've been talking to a lot of vacation rental folks out in Hawaii. It's Sam Parks with RapidEye. Have you heard my name tossed around?",
        "note": "Smile. Relaxed, feet-up-on-the-desk energy. The surfing line is real and creates instant warmth with someone living in Hawaii. Don't rush the 'have you heard my name' question — let it hang.",
        "branches": [
          {
            "label": "Yes / I think so",
            "to": "heard_yes"
          },
          {
            "label": "No / doesn't ring a bell",
            "to": "heard_no"
          },
          {
            "label": "I'm busy / bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Skeptical / who is this?",
            "to": "permission_fallback"
          }
        ]
      },
      "heard_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well we'd normally be reaching out to someone like you. What'd you hear?",
        "note": "Let her talk. Whatever she says, bridge into discovery or the pain trigger. If she's vague, say 'Yeah that's the gist — we help PM companies with their turnover inspection workflows.'",
        "branches": [
          {
            "label": "Describes what she heard",
            "to": "warm_response"
          },
          {
            "label": "Vague / can't remember",
            "to": "pain_trigger"
          }
        ]
      },
      "heard_no": {
        "label": "HAVEN'T HEARD OF YOU",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call is —",
        "note": "Say this with a smile and keep moving. No pause here — roll right into the pain trigger.",
        "branches": [
          {
            "label": "Continue",
            "to": "pain_trigger"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow, or is later this week better?",
        "note": "Be brief and respectful. Lock down a specific callback day and time. Don't pitch anything.",
        "branches": [
          {
            "label": "Gives a better time",
            "to": "reschedule"
          },
          {
            "label": "What's this about?",
            "to": "pain_trigger"
          },
          {
            "label": "Don't call back",
            "to": "end_graceful"
          }
        ]
      },
      "reschedule": {
        "label": "CALLBACK LOCKED",
        "say": "Perfect — I'll try you then. Really appreciate it, Amanda. Talk soon.",
        "note": "Write down the exact time. Set a calendar reminder. Don't add anything else — hang up clean.",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean, it is a cold call. Can I get 30 seconds to tell you why I reached out? You can totally hang up on me if it's not a fit.",
        "note": "Say it with a grin. The honesty disarms. If she gives you 30 seconds, deliver the pain trigger with energy and conviction.",
        "branches": [
          {
            "label": "Sure, go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "No / not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot — totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and this just isn't interesting?",
        "note": "This split gives her two doors. 'Horrible time' reopens a callback. 'Know what we do' lets you probe further. Either way you learn something.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "reschedule"
          },
          {
            "label": "Not interested / don't call",
            "to": "end_graceful"
          },
          {
            "label": "What do you actually do?",
            "to": "pain_trigger"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER — THE PROBLEM",
        "say": "So I work with another vacation rental company in a pretty similar spot to yours — they manage a few hundred units across multiple locations, and the problem that kept hitting them was damage slipping through turnovers. Their cleaners were taking photos, but at that volume nobody was actually catching everything. So a guest checks in, finds a stain on the couch or a missing coffee maker, leaves a bad review — and then the owner's calling asking how it got missed. It was costing them in deposit disputes, owner trust, and reviews that were killing future bookings.",
        "note": "PAUSE after this. Do NOT jump to the solution. Let the silence sit for 3-4 seconds. She's either seeing herself in this story or she's not. Listen for a sigh, an 'oh yeah,' a 'tell me about it' — that's your green light.",
        "branches": [
          {
            "label": "That resonates / 'yeah we deal with that'",
            "to": "pain_cta"
          },
          {
            "label": "Quiet but listening",
            "to": "pain_cta"
          },
          {
            "label": "We've got that pretty well handled",
            "to": "have_vendor_objection"
          },
          {
            "label": "Not interested / not our problem",
            "to": "not_interested_objection"
          }
        ]
      },
      "pain_cta": {
        "label": "SOLUTION + CTA",
        "say": "We built a tool that plugs into the photos your team's already taking during turnovers and uses AI to automatically flag damage, missing items, staging issues — so nothing slips through. No workflow change for your cleaners at all. Would you be open to taking a look sometime when I'm not cold calling you out of the blue?",
        "note": "One sentence on the solution, then the CTA. Don't over-explain how the AI works. The CTA should feel low-pressure and a little self-aware. If she says yes — STOP pitching immediately and switch to discovery.",
        "branches": [
          {
            "label": "Yeah / sure / tell me more",
            "to": "warm_response"
          },
          {
            "label": "We're not really looking right now",
            "to": "not_interested_objection"
          },
          {
            "label": "We don't have budget for that",
            "to": "no_budget_objection"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          },
          {
            "label": "We already use something for that",
            "to": "have_vendor_objection"
          }
        ]
      },
      "warm_response": {
        "label": "SHE'S WARM — START DISCOVERY",
        "say": "Awesome — so just so I'm not wasting your time, what does your inspection process actually look like right now? Like after a cleaner finishes a unit, what happens with those photos?",
        "note": "STOP PITCHING. She's warm. Your only job is to ask questions and listen. Take notes on everything — tool names, pain points, who reviews photos, what falls through the cracks. This intel is gold for the demo.",
        "branches": [
          {
            "label": "Describes their current process",
            "to": "discovery_multi_island"
          },
          {
            "label": "We don't really have a formal process",
            "to": "discovery_no_process"
          },
          {
            "label": "Our ops team handles that",
            "to": "discovery_ops_team"
          }
        ]
      },
      "discovery_multi_island": {
        "label": "MULTI-ISLAND DISCOVERY",
        "say": "Got it. And you guys are across Maui, Kauai, and Big Island right? How do you keep that consistent — is each island kind of running their own thing, or is it all centralized?",
        "note": "Multi-island means inconsistency, communication gaps, different team cultures. This question reveals her biggest operational pain. Whatever she shares, empathize and bridge toward booking.",
        "branches": [
          {
            "label": "Each island is different / it's a challenge",
            "to": "bill_9_angle"
          },
          {
            "label": "We've standardized it pretty well",
            "to": "book_meeting_transition"
          },
          {
            "label": "Mentions Justin or ops team running it",
            "to": "referral_to_ops"
          }
        ]
      },
      "discovery_no_process": {
        "label": "NO FORMAL PROCESS",
        "say": "That's actually super common — especially at your scale. Three hundred-plus units across three islands, it's almost impossible to have one person reviewing everything. That's exactly the gap we fill. Can I ask — when damage does get missed, how does that usually surface? Is it the guest complaining, the owner noticing, or your team catching it after the fact?",
        "note": "She just admitted there's a gap. Don't celebrate — empathize. The follow-up reveals the cost of the gap: bad reviews, angry owners, lost deposits.",
        "branches": [
          {
            "label": "Guest complaints / bad reviews",
            "to": "bill_9_angle"
          },
          {
            "label": "Owner catches it",
            "to": "bill_9_angle"
          },
          {
            "label": "We just deal with it as it comes",
            "to": "book_meeting_transition"
          }
        ]
      },
      "discovery_ops_team": {
        "label": "OPS TEAM HANDLES IT",
        "say": "Got it — is that Justin Simpson's world, or does someone else own that day to day?",
        "note": "You know Justin is Operations Manager with a direct line at (808) 909-3103. Dropping his name shows you've done homework. If she confirms Justin, you may need to loop him into the meeting. If she says she owns it, keep going with her.",
        "branches": [
          {
            "label": "Yeah, Justin handles it",
            "to": "referral_to_ops"
          },
          {
            "label": "I oversee it myself",
            "to": "book_meeting_transition"
          },
          {
            "label": "Someone else",
            "to": "referral_to_other"
          }
        ]
      },
      "bill_9_angle": {
        "label": "BILL 9 AMPLIFIER",
        "say": "Yeah — and with Bill 9 now, potentially pulling a big chunk of vacation rentals off the market on Maui, the units you do keep are gonna matter more than ever right? Every missed issue, every bad review hits harder when the portfolio could be shrinking. That's been a big driver in a lot of the conversations I'm having in Hawaii right now.",
        "note": "This is a pressure amplifier, not a scare tactic. Say it matter-of-factly like a market observation. If she reacts to Bill 9, let her vent. If she pushes back, don't argue — just bridge to booking.",
        "branches": [
          {
            "label": "Agrees / shares Bill 9 concerns",
            "to": "book_meeting_transition"
          },
          {
            "label": "We're not worried about that",
            "to": "book_meeting_transition"
          },
          {
            "label": "That's exactly why we can't spend right now",
            "to": "no_budget_objection"
          }
        ]
      },
      "book_meeting_transition": {
        "label": "TRANSITION TO BOOKING",
        "say": "I'd love to show you what this actually looks like — it's way easier to see than explain over the phone. I've got next week pulled up — would Tuesday or Thursday work better for a quick twenty minutes?",
        "note": "Binary choice between two specific days. Don't say 'sometime next week.' If she picks one, lock in the time immediately. She's Hawaii time (HST) — be mindful of the time difference.",
        "branches": [
          {
            "label": "Picks a day / gives availability",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "I need to loop in my ops team",
            "to": "referral_to_ops"
          },
          {
            "label": "Not right now",
            "to": "sell_test_drive"
          }
        ]
      },
      "book_meeting": {
        "label": "LOCK IN THE MEETING",
        "say": "Perfect — how's ten AM your time? I'll shoot a calendar invite over right now so it doesn't get lost. It'll come from sam at rapideye dot ai. Should I send it to amanda at cbislandvacations?",
        "note": "You know her email is amanda@cbislandvacations.com. Confirming it naturally shows homework without being creepy. Send the invite WHILE on the phone. Once confirmed, stop selling immediately.",
        "branches": [
          {
            "label": "Confirms time and email",
            "to": "meeting_booked"
          },
          {
            "label": "Adjusts time or gives different email",
            "to": "meeting_booked"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING BOOKED — STOP SELLING",
        "say": "Awesome — just sent it over. Really appreciate you taking my call, Amanda. Looking forward to showing you what we've got. Talk soon.",
        "note": "YOU WON. Stop talking. Be warm, be brief, hang up. Anything you say past this point can only hurt you.",
        "branches": []
      },
      "not_interested_objection": {
        "label": "NOT INTERESTED — AGREE FIRST",
        "say": "Totally get it — I should've assumed you'd be all set. I mean, running three hundred-plus units across three islands since 2001, you'd have to have something dialed in by now.",
        "note": "Agree first. Surprise her by not pushing back. The company-specific detail shows respect and research. Then move to the split.",
        "branches": [
          {
            "label": "Continue to split",
            "to": "not_interested_split"
          }
        ]
      },
      "not_interested_split": {
        "label": "NOT INTERESTED — SPLIT",
        "say": "Just so nobody from my team cold calls you again — is it that your inspection process is totally buttoned up and you're happy with it, or is it more that you just hate cold calls and this is bad timing?",
        "note": "Two doors. 'Happy with process' lets you probe what they use. 'Hate cold calls' lets you apologize and offer value. Either keeps the conversation alive.",
        "branches": [
          {
            "label": "We've got it handled / happy with it",
            "to": "have_vendor_objection"
          },
          {
            "label": "Bad timing / hate cold calls",
            "to": "sell_test_drive"
          },
          {
            "label": "It's really not a priority for us",
            "to": "sell_test_drive"
          },
          {
            "label": "Please just don't call again",
            "to": "end_graceful"
          }
        ]
      },
      "no_budget_objection": {
        "label": "NO BUDGET — AGREE FIRST",
        "say": "Totally get it. Nowadays it's hard enough to keep the tools you've got, let alone bring on something new — especially with everything up in the air on Maui right now.",
        "note": "The Bill 9 nod shows you understand her world without belaboring it. Don't dwell — move to the split.",
        "branches": [
          {
            "label": "Continue to split",
            "to": "no_budget_split"
          }
        ]
      },
      "no_budget_split": {
        "label": "NO BUDGET — SPLIT",
        "say": "Totally fair. Is it that budget for this year is completely locked, or is it more that anything new has to go through a bunch of hoops before it gets approved?",
        "note": "If budget is locked, sell the test drive for future planning. If approvals are the issue, offer to help her build the internal case with ROI data. Either way the meeting still makes sense.",
        "branches": [
          {
            "label": "Budget is locked / fully spent",
            "to": "sell_test_drive"
          },
          {
            "label": "It's an approvals process",
            "to": "sell_test_drive"
          },
          {
            "label": "We're just not spending on anything new",
            "to": "sell_test_drive"
          }
        ]
      },
      "have_vendor_objection": {
        "label": "HAVE A VENDOR — AGREE AND PROBE",
        "say": "Makes total sense — with three hundred-plus properties you'd have to have something in place. Out of curiosity, what are you guys using for turnover inspections right now?",
        "note": "This is intel gold. Whatever she names — Breezeway, Track, manual checklists, nothing formal — write it down. Don't trash it. If she says 'nothing formal' or 'just checklists,' that's a wide-open door.",
        "branches": [
          {
            "label": "Names a specific tool",
            "to": "have_vendor_split"
          },
          {
            "label": "Mostly manual / checklists / photos in a folder",
            "to": "have_vendor_split"
          },
          {
            "label": "We just use our PMS",
            "to": "have_vendor_split"
          },
          {
            "label": "Won't share / deflects",
            "to": "sell_test_drive"
          }
        ]
      },
      "have_vendor_split": {
        "label": "HAVE A VENDOR — SPLIT",
        "say": "Got it. And is it that you're fully covered and love what you've got, or is it more that switching anything right now would just be a pain?",
        "note": "If they love it, respect it and offer the test drive as a benchmark. If switching is the headache, pivot to the layering angle — RapidEye sits on top, no rip-and-replace.",
        "branches": [
          {
            "label": "We're happy with it",
            "to": "sell_test_drive"
          },
          {
            "label": "Switching would be a headache",
            "to": "sell_test_drive_layer"
          },
          {
            "label": "It's OK but not perfect",
            "to": "warm_response"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally respect that — you're probably not buying anything right now, and I'm not expecting you to. But honestly, the people who are ready when budget does open up are the ones who already know what's on their shortlist. Would you be open to just taking a look — not to buy anything, but so you know what's out there? Worst case I walk you through what other vacation rental companies in Hawaii are doing with their turnover photos and you steal some ideas.",
        "note": "The 'steal some ideas' line makes the meeting valuable even if she never buys. You're selling 20 minutes of her time, not a contract.",
        "branches": [
          {
            "label": "Sure / why not",
            "to": "book_meeting_transition"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "referral_ask"
          },
          {
            "label": "Hard no",
            "to": "end_graceful"
          }
        ]
      },
      "sell_test_drive_layer": {
        "label": "TEST DRIVE — LAYERING ANGLE",
        "say": "That's actually the thing — we layer on top of whatever you're already using. We don't ask you to rip out any tools or change your cleaners' workflow at all. We just analyze the photos they're already taking and catch what's getting missed. Would you be open to seeing what that looks like — even just as a gut check on what might be slipping through?",
        "note": "The 'no workflow change' angle is critical for someone who fears disruption. Keep it low-pressure and curiosity-driven.",
        "branches": [
          {
            "label": "Sure / I'd look at that",
            "to": "book_meeting_transition"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "referral_ask"
          },
          {
            "label": "No thanks",
            "to": "end_graceful"
          }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most relevant to include so it's not just another generic pitch in your inbox? Is it more the damage detection side, the owner reporting piece, or just a general overview?",
        "note": "This does two things: makes the email relevant and tells you which pain she cares about most. Whatever she says, lead with that in the email and propose a specific meeting time.",
        "branches": [
          {
            "label": "Tells you what to include",
            "to": "send_email_close"
          },
          {
            "label": "Just send a general overview",
            "to": "send_email_close"
          }
        ]
      },
      "send_email_close": {
        "label": "EMAIL CLOSE",
        "say": "Perfect — I'll put something together and send it to amanda at cbislandvacations. I'll include a couple times to connect in case anything catches your eye. Really appreciate your time, Amanda.",
        "note": "Send within 1 hour. Subject line should reference CB Island Vacations, not RapidEye. Include what she asked for, one relevant case study, and a specific time proposal. Follow up in 3 business days if no reply.",
        "branches": []
      },
      "referral_to_ops": {
        "label": "REFERRAL TO OPS",
        "say": "Totally makes sense — this is probably more of a day-to-day ops conversation anyway. Would Justin Simpson be the right person, or is there someone else who owns the inspection workflow?",
        "note": "You know Justin Simpson is Operations Manager with a direct line at (808) 909-3103. Dropping his name shows homework without being creepy. If she confirms, ask for the best way to reach him. If she offers to intro you, that's the best-case outcome.",
        "branches": [
          {
            "label": "Yes, talk to Justin",
            "to": "referral_get_contact"
          },
          {
            "label": "Talk to someone else (Celina, Dan, etc.)",
            "to": "referral_get_contact"
          },
          {
            "label": "Just send me the info and I'll pass it along",
            "to": "send_email"
          }
        ]
      },
      "referral_to_other": {
        "label": "REFERRAL TO OTHER PERSON",
        "say": "Got it — what's their name and role? If I can put something tailored together for what they actually deal with day to day, it'll land way better than a generic cold call.",
        "note": "Get name, title, and ideally a direct number or email. A name alone is enough to work with. Don't push for too much.",
        "branches": [
          {
            "label": "Gives name and contact info",
            "to": "referral_close"
          },
          {
            "label": "Gives a name but no contact",
            "to": "referral_close"
          },
          {
            "label": "Says to just go through her",
            "to": "send_email"
          }
        ]
      },
      "referral_get_contact": {
        "label": "GET REFERRAL CONTACT",
        "say": "Amazing — what's the best way to reach them? And would it help if I CC'd you on the email so they know it's coming?",
        "note": "If she gives Justin's direct line, great — you already have it but let her provide it naturally. The CC offer keeps Amanda in the loop and gives the referral credibility. Write down everything.",
        "branches": [
          {
            "label": "Gives contact info / agrees to CC",
            "to": "referral_close"
          },
          {
            "label": "Offers to make an intro herself",
            "to": "referral_close"
          },
          {
            "label": "Just call the main office line",
            "to": "referral_close"
          }
        ]
      },
      "referral_close": {
        "label": "REFERRAL LOCKED — CLOSE",
        "say": "Really appreciate that, Amanda. I'll reach out to them this week. And if anything ever comes across your desk on the inspection side, I'm easy to find — Sam Parks, RapidEye. Thanks for your time. Enjoy the waves out there.",
        "note": "You got what you needed. Be gracious. Follow up with the referral within 24 hours and mention Amanda by name. The 'enjoy the waves' callback ends on a warm human note.",
        "branches": []
      },
      "referral_ask": {
        "label": "REFERRAL ASK",
        "say": "Totally hear you. One last thing — if this isn't something you'd look at directly, who on your team owns the inspection and turnover workflow? Is that more of an ops thing or does your housekeeping team run that?",
        "note": "You're backing into a referral. Even if she won't meet, getting pointed to Justin (Ops), Celina (Housekeeping), or Dan (Maintenance) is a win. Ask naturally — don't sound desperate.",
        "branches": [
          {
            "label": "Names someone / points to ops or housekeeping",
            "to": "referral_get_contact"
          },
          {
            "label": "That would be me / no one else",
            "to": "end_graceful"
          },
          {
            "label": "Won't refer / done talking",
            "to": "end_graceful"
          }
        ]
      },
      "end_graceful": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand, Amanda. If anything changes, I'm easy to find — Sam Parks, RapidEye. Appreciate your time. Enjoy the waves.",
        "note": "Don't burn the bridge. The 'enjoy the waves' callbacks the surfing opener and ends on a human note. Log the call outcome and every piece of intel she shared for future outreach.",
        "branches": []
      }
    }
  }
}