{
  "name": "Amy Taylor",
  "title": "VP of Operations (Oregon)",
  "company": "Cannon Beach Vacation Rentals (CBVR)",
  "location": "Cannon Beach, OR",
  "phone": "",
  "company_phone": "503-436-0940",
  "alt_phones": [],
  "flow": {
    "context": "Amy Taylor is VP of Operations (Oregon) at Meredith Lodging — the parent behind Cannon Beach Vacation Rentals (CBVR). She owns turn standards, inspections, housekeeping, and maintenance quality across their coastal Oregon portfolio (80+ homes claimed). They run Track/TravelNet as their PMS with no Breezeway detected — RapidEye plugs directly into Track. Oregon State grad with multi-site ops background. Strongest hook: Sam works with similar coastal VR operators and RapidEye integrates with the exact PMS her team uses daily. Fallback contacts if Amy redirects: Aaron Linfoot (President), Ashley Kingman (GM), Rachel Beardslee (Dir of Ops).",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Amy — I work with a few other vacation rental operators who run coastal portfolios pretty similar to Meredith's. It's Sam Parks with RapidEye — have you heard the name tossed around?",
        "note": "Warm, casual tone. Feet-up energy. Don't rush — let the question hang after you ask it.",
        "branches": [
          {
            "label": "Yes / maybe",
            "to": "heard_yes"
          },
          {
            "label": "No / who?",
            "to": "heard_no"
          },
          {
            "label": "Bad timing / busy",
            "to": "bad_timing"
          },
          {
            "label": "Guarded / what's this about",
            "to": "guarded_response"
          },
          {
            "label": "Gatekeeper answers (not Amy)",
            "to": "gatekeeper"
          }
        ]
      },
      "heard_yes": {
        "label": "THEY'VE HEARD OF US",
        "say": "Oh nice — well normally we'd be working with someone like you on the operations side. What'd you hear?",
        "note": "Let her talk. Whatever she says, bridge into discovery. Don't correct or pitch yet.",
        "branches": [
          {
            "label": "Describes what they heard",
            "to": "warm_response"
          },
          {
            "label": "Vague / not much",
            "to": "pain_trigger"
          },
          {
            "label": "Heard but not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "heard_no": {
        "label": "HAVEN'T HEARD OF US",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call is —",
        "note": "Deliver this lightly, then roll straight into the pain trigger. No pause here.",
        "branches": [
          {
            "label": "Continue to pain trigger",
            "to": "pain_trigger"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again later this week? Maybe Thursday or Friday morning?",
        "note": "Offer specific days. Lock a callback if possible. Don't grovel.",
        "branches": [
          {
            "label": "Gives a better time",
            "to": "reschedule"
          },
          {
            "label": "Says never / not interested",
            "to": "permission_rejected"
          },
          {
            "label": "Gives you 30 seconds now",
            "to": "pain_trigger"
          }
        ]
      },
      "reschedule": {
        "label": "CALLBACK LOCKED",
        "say": "Perfect — I'll try you then. Really appreciate it, Amy. Talk soon.",
        "note": "Log the callback time immediately. Don't push for more. You got a win.",
        "branches": []
      },
      "guarded_response": {
        "label": "GUARDED — PERMISSION ASK",
        "say": "Yeah totally — I mean it is a cold call, I'll be honest. Can I get thirty seconds to tell you why I reached out, and you can totally hang up on me if it's not a fit?",
        "note": "Disarm with honesty. Thirty-second ask lowers the wall. Smile through it.",
        "branches": [
          {
            "label": "Grants 30 seconds",
            "to": "pain_trigger"
          },
          {
            "label": "No / rejects",
            "to": "permission_rejected"
          },
          {
            "label": "Asks more questions first",
            "to": "pain_trigger"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and this just isn't interesting?",
        "note": "This splits the objection. You're looking for whether it's timing or real disinterest. Stay calm and curious.",
        "branches": [
          {
            "label": "It's a bad time",
            "to": "bad_timing"
          },
          {
            "label": "Just not interested",
            "to": "last_chance_split"
          },
          {
            "label": "Opens up a little",
            "to": "pain_trigger"
          }
        ]
      },
      "last_chance_split": {
        "label": "LAST CHANCE — PLANT THE SEED",
        "say": "Totally fair. If it helps — we actually plug into Track, which I know you guys are running, and a few other coastal operators have been using us to catch stuff in turnover photos their teams were missing. If that ever becomes a priority, I'm easy to find. Really appreciate your time, Amy.",
        "note": "Drop the Track name to show you're not generic. Plant the seed and don't push. Leave the door open.",
        "branches": [
          {
            "label": "Curiosity piqued / asks a question",
            "to": "warm_response"
          },
          {
            "label": "Says goodbye",
            "to": "end_graceful"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "I was talking to another VP of Ops who runs a pretty similar setup to yours — coastal portfolio, seventy-plus homes, team doing turns every day. Her housekeepers were snapping photos every single turn, uploading them into Track, but honestly nobody had the time to sit there and actually review every photo from every unit. They were basically just CYA photos sitting in a system. And every couple weeks something would slip through — a stain on a sofa, a chipped countertop, a missing set of towels — and the guest would find it before anyone on her team did. And she's the one getting the call from the homeowner.",
        "note": "PAUSE after 'getting the call from the homeowner.' Let the silence work. Amy lives this reality — let her feel it before you say another word.",
        "branches": [
          {
            "label": "Resonates / 'yeah that happens' / asks more",
            "to": "solution_bridge"
          },
          {
            "label": "We already have a process for that",
            "to": "objection_have_process"
          },
          {
            "label": "Not really a problem for us",
            "to": "objection_not_interested"
          },
          {
            "label": "No budget right now",
            "to": "objection_no_budget"
          },
          {
            "label": "Just send me an email",
            "to": "objection_send_email"
          },
          {
            "label": "I'm not the right person for this",
            "to": "not_right_person"
          }
        ]
      },
      "solution_bridge": {
        "label": "ONE-SENTENCE SOLUTION + CTA",
        "say": "So we built a tool that plugs into the photos your team's already taking — it actually integrates directly with Track — and flags damage, missing items, staging issues automatically. No workflow change for your cleaners at all. Would you be open to taking a look when I'm not cold calling you out of the blue?",
        "note": "One sentence on the product. One sentence CTA. Stop talking. Let her respond.",
        "branches": [
          {
            "label": "Yes / open to it",
            "to": "warm_response"
          },
          {
            "label": "Sounds interesting, but...",
            "to": "objection_no_budget"
          },
          {
            "label": "We already have something for that",
            "to": "objection_have_process"
          },
          {
            "label": "Send me info first",
            "to": "objection_send_email"
          },
          {
            "label": "How does that actually work?",
            "to": "warm_response"
          }
        ]
      },
      "warm_response": {
        "label": "THEY'RE WARM — STOP PITCHING",
        "say": "Awesome — so I don't waste your time with stuff that's not relevant: what does your turnover inspection process actually look like right now? Are your housekeepers the ones taking photos, or do you have inspectors doing a separate pass?",
        "note": "STOP SELLING. You're in discovery mode. Ask questions, listen, take notes. Her answers tell you exactly how to position the demo.",
        "branches": [
          {
            "label": "Describes their process",
            "to": "discovery_photo_gap"
          },
          {
            "label": "Housekeepers take photos in Track",
            "to": "discovery_track_workflow"
          },
          {
            "label": "We have separate inspectors",
            "to": "discovery_inspector_workflow"
          },
          {
            "label": "Wants to skip discovery and book",
            "to": "book_meeting"
          }
        ]
      },
      "discovery_photo_gap": {
        "label": "DIG INTO THE PHOTO GAP",
        "say": "Got it. And when those photos come in — is someone actually reviewing every single one? Or is it more like they're there if you need to go back and look after something goes wrong?",
        "note": "This question exposes the core gap. Most teams collect photos but don't review them proactively. Let her admit it.",
        "branches": [
          {
            "label": "Admits nobody reviews them all",
            "to": "discovery_seasonal"
          },
          {
            "label": "Says they do review them",
            "to": "discovery_volume_pressure"
          },
          {
            "label": "Ready to see the product",
            "to": "book_meeting"
          }
        ]
      },
      "discovery_track_workflow": {
        "label": "TRACK-SPECIFIC DISCOVERY",
        "say": "Nice — so you're using Track's housekeeping module for that. How are you finding it for the photo review side? I've heard from a few Track shops that the task management is solid but actually catching stuff in the photos is still pretty manual.",
        "note": "Show you know their stack. This builds credibility and gets her talking about gaps in Track's inspection capability.",
        "branches": [
          {
            "label": "Agrees Track doesn't catch everything",
            "to": "discovery_seasonal"
          },
          {
            "label": "Says Track works fine for them",
            "to": "objection_have_process"
          },
          {
            "label": "Asks how RapidEye connects to Track",
            "to": "solution_bridge"
          },
          {
            "label": "Ready to see it",
            "to": "book_meeting"
          }
        ]
      },
      "discovery_inspector_workflow": {
        "label": "INSPECTOR WORKFLOW DISCOVERY",
        "say": "Interesting — so you've got dedicated inspectors. How many properties can they actually get through in a day? And are they checking every turn or is it more of a spot-check situation?",
        "note": "Inspectors are expensive and can't scale. If she has them, the pain is cost or coverage gaps during peak season.",
        "branches": [
          {
            "label": "Can't cover every turn / spot-check only",
            "to": "discovery_seasonal"
          },
          {
            "label": "Cover every turn but it's expensive",
            "to": "discovery_seasonal"
          },
          {
            "label": "Happy with current coverage",
            "to": "objection_have_process"
          }
        ]
      },
      "discovery_seasonal": {
        "label": "SEASONAL PRESSURE",
        "say": "That makes sense. What about heading into summer — when you've got back-to-back turns and the volume really ramps up? Does the process hold, or is that when stuff starts slipping through?",
        "note": "Cannon Beach summer is their peak season. Back-to-back turns = highest risk for missed issues. This is where manual processes break down.",
        "branches": [
          {
            "label": "Summer is when things break down",
            "to": "book_meeting"
          },
          {
            "label": "We manage but it's tight",
            "to": "book_meeting"
          },
          {
            "label": "It's fine honestly",
            "to": "test_drive"
          }
        ]
      },
      "discovery_volume_pressure": {
        "label": "VOLUME PRESSURE",
        "say": "That's honestly impressive. How many photos are we talking per turn across eighty-plus homes? That's gotta be a serious volume to actually get through, especially during peak season.",
        "note": "Put a number on the pain. 80+ homes × photos per turn × summer frequency = thousands of photos weekly. Make the scale tangible.",
        "branches": [
          {
            "label": "Acknowledges the volume is a lot",
            "to": "book_meeting"
          },
          {
            "label": "Says they handle it",
            "to": "test_drive"
          },
          {
            "label": "Interested in how AI helps with that",
            "to": "solution_bridge"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Love it — let's do this. I've got next Tuesday and Thursday pulled up. Would morning or afternoon work better for a quick fifteen minutes? I can walk you through exactly what it looks like inside Track.",
        "note": "Pick specific days. Give a choice of two. Say fifteen minutes — low commitment. Send the invite WHILE on the phone.",
        "branches": [
          {
            "label": "Picks a time",
            "to": "meeting_confirmed"
          },
          {
            "label": "Needs to check calendar",
            "to": "meeting_followup"
          },
          {
            "label": "Not ready to commit to a meeting",
            "to": "test_drive"
          },
          {
            "label": "Send me something first",
            "to": "objection_send_email"
          }
        ]
      },
      "meeting_confirmed": {
        "label": "MEETING BOOKED",
        "say": "Perfect — I'm sending the invite right now so it's locked in. Really appreciate you taking my call, Amy. Looking forward to showing you what we've been building. Talk soon.",
        "note": "Send the calendar invite immediately. Stop selling. Don't add anything. You got the meeting — get off the phone.",
        "branches": []
      },
      "meeting_followup": {
        "label": "CALENDAR CHECK",
        "say": "Totally — I'll shoot you an email in the next hour with a couple time options. What's the best email for that? Is it a-taylor at meredithlodging dot com?",
        "note": "Confirm her email. Pattern from Aaron Linfoot's email is first-initial + lastname @meredithlodging.com. Lock a follow-up commitment.",
        "branches": [
          {
            "label": "Confirms or gives email",
            "to": "meeting_confirmed"
          },
          {
            "label": "Says they'll reach out to you",
            "to": "end_graceful"
          }
        ]
      },
      "objection_no_budget": {
        "label": "NO BUDGET",
        "say": "Totally get it. Nowadays it's harder to keep a tool, let alone buy something new — especially when everything runs through a parent company like Meredith.",
        "note": "Agree first. Reference the Meredith parent structure to show you understand their approval chain. Then split.",
        "branches": [
          {
            "label": "Continue to split",
            "to": "budget_split"
          }
        ]
      },
      "budget_split": {
        "label": "BUDGET SPLIT",
        "say": "Just so nobody from my team bugs you again — is it that budget for this cycle is completely locked, or is it more that anything you try to buy puts you through the ringer with corporate?",
        "note": "Diagnosing whether it's a real budget wall or an approval process issue. Different answers get different follow-ups.",
        "branches": [
          {
            "label": "Budget is locked / frozen",
            "to": "test_drive"
          },
          {
            "label": "Approval process is painful",
            "to": "test_drive"
          },
          {
            "label": "Shuts it down completely",
            "to": "end_graceful"
          }
        ]
      },
      "objection_not_interested": {
        "label": "NOT INTERESTED",
        "say": "I totally get it — I should have assumed you'd be all set. Otherwise you probably would have reached out yourself.",
        "note": "Agree first. Lower her guard. Then split to understand the real reason.",
        "branches": [
          {
            "label": "Continue to split",
            "to": "interest_split"
          }
        ]
      },
      "interest_split": {
        "label": "INTEREST SPLIT",
        "say": "Just out of curiosity — is it that this isn't really a problem you're focused on right now, or is it more that you just hate cold calls? Totally fair either way.",
        "note": "If it's 'hate cold calls,' the door is open for a softer touch. If 'not a problem,' plant the seed and exit.",
        "branches": [
          {
            "label": "Hates cold calls but curious",
            "to": "test_drive"
          },
          {
            "label": "Not a priority right now",
            "to": "last_chance_split"
          },
          {
            "label": "Actually opens up about a problem",
            "to": "warm_response"
          }
        ]
      },
      "objection_have_process": {
        "label": "ALREADY HAVE A PROCESS",
        "say": "That makes total sense — with eighty-plus homes you'd have to have something dialed in. Especially with the kind of repeat-guest rate you guys have, you can't afford to let stuff slip.",
        "note": "Validate their process. Referencing the ~70% re-book rate from CBVR's website shows you did homework. Then split.",
        "branches": [
          {
            "label": "Continue to split",
            "to": "process_split"
          }
        ]
      },
      "process_split": {
        "label": "PROCESS SPLIT",
        "say": "Is it that you're fully covered and happy with how things are working, or is it more that switching anything right now with the season coming up would be a headache?",
        "note": "If 'switching is the headache,' the door is open — they're admitting the current process isn't perfect. If truly happy, plant the seed.",
        "branches": [
          {
            "label": "Switching is the issue / bad timing",
            "to": "test_drive"
          },
          {
            "label": "Happy with current process",
            "to": "last_chance_split"
          },
          {
            "label": "Admits there are some gaps",
            "to": "warm_response"
          }
        ]
      },
      "test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally respect that — you're probably not buying anything right now and that's completely fine. But when budget does free up or summer hits and turns get crazy, the people who move fast are the ones who already know what's on their list. Would you be open to just taking a look — not a commitment, just fifteen minutes so you know what's out there? Worst case you steal some ideas about what other coastal operators are doing with their turnover photos and we part as friends.",
        "note": "You're selling the meeting, not the product. The meeting itself has value even if she never buys.",
        "branches": [
          {
            "label": "Agrees to meet",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "objection_send_email"
          },
          {
            "label": "Not right now",
            "to": "end_graceful"
          }
        ]
      },
      "objection_send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair — I'll send something over. One quick question so it's not just another generic pitch sitting in your inbox: what would actually be most relevant to include? Is it more about how it connects to Track, or more about what other operators your size are seeing in terms of results?",
        "note": "Accept the email ask. But asking what to include extends the conversation and gives you intel for a killer follow-up.",
        "branches": [
          {
            "label": "Tells you what they care about",
            "to": "email_tailored"
          },
          {
            "label": "Just send whatever",
            "to": "email_tailored"
          },
          {
            "label": "Actually, let's just do the call",
            "to": "book_meeting"
          }
        ]
      },
      "email_tailored": {
        "label": "SEND TAILORED EMAIL",
        "say": "Perfect — I'll put something together around that and send it over today. What's the best email? Is it a-taylor at meredithlodging dot com? And I'll drop a couple time options in there in case you want to hop on after you've looked it over. Really appreciate your time, Amy.",
        "note": "Confirm her email. Include a specific time suggestion in the email. Follow up in 2-3 days if no response. Email pattern is first-initial + lastname @meredithlodging.com.",
        "branches": [
          {
            "label": "Confirms email / says goodbye",
            "to": "end_graceful"
          }
        ]
      },
      "not_right_person": {
        "label": "NOT THE RIGHT PERSON",
        "say": "Totally fair — who on your team would typically own the inspection side of things? Or is there someone at Meredith corporate who handles tooling decisions for the operations group?",
        "note": "Amy may redirect to Rachel Beardslee (Dir of Ops), Aaron Linfoot (President), or Ashley Kingman (GM). Get a name and an intro if possible.",
        "branches": [
          {
            "label": "Gives a specific name",
            "to": "referral_get_name"
          },
          {
            "label": "Says to try corporate / vague",
            "to": "referral_ask"
          },
          {
            "label": "Doesn't know / won't say",
            "to": "referral_ask"
          }
        ]
      },
      "referral_ask": {
        "label": "REFERRAL DIG",
        "say": "Totally understand. Would it be someone like a Director of Operations, or does this kind of thing roll up to someone like Aaron on the executive side? Just want to make sure I'm reaching the right person.",
        "note": "Name-drop Aaron Linfoot casually to see if she confirms he's the decision-maker. Shows you know the org. Don't be pushy.",
        "branches": [
          {
            "label": "Confirms Aaron or gives another name",
            "to": "referral_get_name"
          },
          {
            "label": "Won't share / says figure it out",
            "to": "end_graceful"
          },
          {
            "label": "Actually I can take the meeting",
            "to": "book_meeting"
          }
        ]
      },
      "referral_get_name": {
        "label": "GOT A REFERRAL NAME",
        "say": "That's super helpful — really appreciate it. Would it be alright if I mention your name when I reach out to them? That way it doesn't land as another random cold call. I'll make sure it's tailored so it's actually worth their time.",
        "note": "Get permission to use Amy's name. A warm intro is 10x more effective. Log the referral name immediately.",
        "branches": [
          {
            "label": "Says yes, use my name",
            "to": "referral_confirmed"
          },
          {
            "label": "Says no / reach out on your own",
            "to": "referral_confirmed"
          },
          {
            "label": "Offers to intro you directly",
            "to": "referral_warm_intro"
          }
        ]
      },
      "referral_confirmed": {
        "label": "REFERRAL LOCKED",
        "say": "Perfect. Really appreciate you pointing me in the right direction, Amy. I'll reach out to them and keep it relevant. Thanks for your time — enjoy the rest of your day.",
        "note": "Log the referral. Send outreach within 24 hours mentioning Amy by name if permitted. Don't burn this bridge — Amy may still be involved in the decision.",
        "branches": []
      },
      "referral_warm_intro": {
        "label": "WARM INTRO OFFERED",
        "say": "That would be amazing — I really appreciate that. Whatever's easiest for you — an email intro, a quick heads up, anything works. I'll follow up with you so you have my info to pass along. Thanks so much, Amy.",
        "note": "Huge win. Send Amy a clean, forwardable email within the hour. Make it easy for her to pass along. Include a brief description and a specific suggested time.",
        "branches": []
      },
      "gatekeeper": {
        "label": "GATEKEEPER",
        "say": "Hey — could you get me through to Amy? It's Sam.",
        "note": "First name only for both of you. No company name. No explanation. Sound like you know her.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Who's calling / what's this about?",
            "to": "gatekeeper_context"
          },
          {
            "label": "She's not available",
            "to": "gatekeeper_voicemail"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — CONTEXT",
        "say": "Yeah — I work with a few other vacation rental operators on the coast. Would you mind letting her know it's Sam Parks?",
        "note": "A bit more context but still no pitch. Don't explain what RapidEye does. Redirect with the question at the end.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Pushes back more",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "She's not available",
            "to": "gatekeeper_voicemail"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "Totally understand — we help a couple other property management companies with their turnover inspection workflows. I sent her a note earlier — would you mind just giving her a heads up that Sam Parks is on the line?",
        "note": "Third attempt. Social proof plus implication you already have a relationship. If this doesn't work, pivot to voicemail or callback time.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Still won't transfer",
            "to": "gatekeeper_voicemail"
          }
        ]
      },
      "gatekeeper_voicemail": {
        "label": "VOICEMAIL / NOT AVAILABLE",
        "say": "No worries at all — when's the best time to catch her? I know things get busy with turns and everything. Or I can leave a quick message if that's easier.",
        "note": "Get a callback time if possible. If leaving voicemail, keep it under 20 seconds: 'Hey Amy, Sam Parks — I work with a few other coastal VR operators on their turnover workflows. Thought it'd be worth connecting. I'll try you again Thursday.' Then call back at the suggested time.",
        "branches": [
          {
            "label": "Gives best time to call back",
            "to": "reschedule"
          },
          {
            "label": "Sends to voicemail",
            "to": "end_graceful"
          }
        ]
      },
      "end_graceful": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand, Amy. If anything changes, I'm easy to find — Sam Parks, RapidEye. Really appreciate your time. Have a good one.",
        "note": "Don't burn the bridge. Log the outcome. Set a follow-up reminder for 3-4 weeks out. She may come around once peak season pressures hit.",
        "branches": []
      }
    }
  }
}