{
  "name": "Angela McChesney",
  "title": "Broker Associate / Property Manager",
  "company": "Preferred Properties Key West (RealKeyWest.com)",
  "location": "Key West, FL",
  "phone": "305-395-2540",
  "company_phone": "305-294-3040",
  "alt_phones": [],
  "flow": {
    "context": "Angela McChesney is a Broker Associate and Property Manager at Preferred Properties Key West (RealKeyWest.com). She has a hospitality management background from FIU, so she thinks about guest experience and operational quality at a deep level. The company manages 150+ vacation rental homes in Key West, uses Escapia as their PMS, and runs a damage waiver vs. security deposit model — meaning catching damage between turns is operationally critical. Laurie McChesney (founder/principal broker) shares her last name and is almost certainly family, so Angela likely has real influence on ops and tech decisions. No strong personal tie to Sam — lead with industry proximity and the fact her name came up while talking with other Key West PMs.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Angela — this is kind of random, but I've been talking with a few vacation rental managers down in the Keys and your name came up as someone who really runs the property management side over at Preferred Properties. It's Sam Parks with RapidEye — have you heard my name tossed around at all?",
        "note": "Feet-up-on-the-desk energy. Warm, casual, like you're following up on a loose referral. Don't rush through this — let the 'have you heard my name' question hang.",
        "branches": [
          {
            "label": "No / Who? / Doesn't ring a bell",
            "to": "heard_name_no"
          },
          {
            "label": "Yeah / Maybe / Sounds familiar",
            "to": "heard_name_yes"
          },
          {
            "label": "I'm busy / bad time / in the middle of something",
            "to": "bad_timing"
          },
          {
            "label": "Goes to voicemail",
            "to": "voicemail"
          }
        ]
      },
      "heard_name_no": {
        "label": "HAVEN'T HEARD — RECOVER AND TRANSITION",
        "say": "Ha — guess I'm not as popular as I thought. Well, the reason for my call is pretty simple — I work with a handful of property managers who are in a really similar spot to you guys, and I just wanted to see if it'd make sense to connect. Mind if I take like thirty seconds to explain why I reached out?",
        "note": "Stay light. The 'not as popular' line should land with a smile. You're asking soft permission to continue — not begging.",
        "branches": [
          {
            "label": "Sure / go ahead / yeah what's up",
            "to": "pain_trigger"
          },
          {
            "label": "I'm really busy / not a good time",
            "to": "bad_timing"
          },
          {
            "label": "What are you selling? / Is this a sales call?",
            "to": "permission_fallback"
          }
        ]
      },
      "heard_name_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone like you. What'd you hear?",
        "note": "Let them talk. Whatever they say next tells you how warm they are and what angle to take. Don't interrupt.",
        "branches": [
          {
            "label": "They describe something accurate or positive",
            "to": "warm_response"
          },
          {
            "label": "They're vague / 'not sure where I heard it'",
            "to": "pain_trigger"
          },
          {
            "label": "They're mixing you up with someone else",
            "to": "pain_trigger"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again later this week? I promise I'll be quick.",
        "note": "Don't push. Respect the moment. Your only goal right now is to lock in a specific callback time — day and hour.",
        "branches": [
          {
            "label": "Sure / call me Thursday / gives a time",
            "to": "reschedule_lock"
          },
          {
            "label": "Just tell me what it's about real quick",
            "to": "pain_trigger"
          },
          {
            "label": "No thanks / don't call back",
            "to": "graceful_exit"
          }
        ]
      },
      "reschedule_lock": {
        "label": "LOCK IN CALLBACK",
        "say": "Perfect — how's Thursday afternoon look, say around two? I'll keep it to five minutes, I promise.",
        "note": "Get a specific day AND time. Don't leave it vague. If she says 'just try whenever,' push gently: 'Are mornings or afternoons generally better for you?'",
        "branches": [
          {
            "label": "Confirms a specific day/time",
            "to": "meeting_booked"
          },
          {
            "label": "Just try me whenever / no commitment",
            "to": "graceful_exit"
          }
        ]
      },
      "voicemail": {
        "label": "VOICEMAIL",
        "say": "Hey Angela — it's Sam Parks. I work with a few vacation rental managers down in the Keys and your name came up. Wanted to run something by you real quick — I'll try you again tomorrow, or feel free to call me back. It's Sam, S-A-M, Parks. Talk soon.",
        "note": "Keep it under 20 seconds. Sound like someone she should already know. Do NOT explain what RapidEye does — mystery creates callbacks.",
        "branches": []
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER — THE PROBLEM",
        "say": "So I was just talking to another property manager down here who's in a really similar spot to you guys — over a hundred homes, cleaners snapping photos every single turn, everything going into Escapia. The problem was nobody actually had time to look at all those photos. A guest checks out, the housekeeper takes thirty or forty shots, uploads them, and they just… sit there. Then two weeks later an owner calls about a stain on their sofa or a cracked tile, and the photos existed the whole time — they just never got reviewed. They were eating thousands a month in damage they technically had proof of but missed. We built a tool that automatically scans the turnover photos your team's already taking and flags damage, missing items, staging issues — before the next guest checks in. Would you be open to seeing what that looks like when I'm not cold calling you out of the blue?",
        "note": "PAUSE after 'but missed.' Let the pain land. Watch for a sigh, an 'mmhmm,' a 'yeah that sounds familiar.' Then deliver the solution and CTA. The Escapia name-drop shows you've done homework.",
        "branches": [
          {
            "label": "Yeah that's interesting / tell me more / we deal with that",
            "to": "warm_response"
          },
          {
            "label": "We're not really looking at anything like that",
            "to": "not_interested"
          },
          {
            "label": "We already have a process for that",
            "to": "have_a_process"
          },
          {
            "label": "We don't have budget for new tools right now",
            "to": "no_budget"
          },
          {
            "label": "Can you send me an email?",
            "to": "send_email"
          }
        ]
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean, it is a cold call, I'll be honest with you. Can I get thirty seconds to tell you why I reached out, and if it's not relevant you can totally hang up on me?",
        "note": "Disarming honesty. Admitting it's a cold call actually builds trust. Most people will give you the 30 seconds.",
        "branches": [
          {
            "label": "Fine / go ahead / you've got 30 seconds",
            "to": "pain_trigger"
          },
          {
            "label": "No / I'm not interested / take me off your list",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot — totally my bad, Angela. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it more that you already know what we do and this just isn't interesting?",
        "note": "You're giving her two outs. 'Bad time' keeps the door open for a callback. 'Not interesting' lets you probe whether she even knows what you do. Either answer gives you one more shot.",
        "branches": [
          {
            "label": "Bad time / just busy right now",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / don't need it",
            "to": "split_objection_initial"
          },
          {
            "label": "Just take me off the list / hard no",
            "to": "graceful_exit"
          }
        ]
      },
      "split_objection_initial": {
        "label": "SPLIT THE REJECTION",
        "say": "Totally fair. Is it that you guys have the inspection and damage-tracking side totally dialed in already, or is it more that you just hate getting cold calls — which I completely respect?",
        "note": "Miyagi method — agree first, then split the objection into multiple choice. If they say 'dialed in,' you probe their process. If they say 'hate cold calls,' you pivot to email. Either gives you a thread.",
        "branches": [
          {
            "label": "We already have it handled / we're good",
            "to": "have_a_process"
          },
          {
            "label": "I just hate cold calls / not the right channel",
            "to": "send_email"
          },
          {
            "label": "Actually, tell me what it is",
            "to": "pain_trigger"
          }
        ]
      },
      "warm_response": {
        "label": "THEY'RE WARM — STOP PITCHING",
        "say": "Nice — yeah, it's been a big deal for the teams we work with. I'm curious though — with a hundred-fifty-plus homes in Key West, what does your turnover inspection process actually look like right now? Are your cleaners the ones documenting everything, or do you have separate inspectors going through after them?",
        "note": "STOP SELLING. You are in discovery mode now. Ask questions, listen, take notes. The more she talks about her world, the more invested she becomes in this conversation. Let her run.",
        "branches": [
          {
            "label": "Describes their process (cleaners take photos, etc.)",
            "to": "discovery_process"
          },
          {
            "label": "We have inspectors / a QA team",
            "to": "discovery_damage"
          },
          {
            "label": "It's kind of a mess honestly",
            "to": "discovery_damage"
          },
          {
            "label": "Asks a question back about RapidEye",
            "to": "discovery_escapia"
          }
        ]
      },
      "discovery_process": {
        "label": "DIG INTO THEIR PROCESS",
        "say": "Got it — so when those photos come in, who's actually reviewing them? Like is someone going through every set after every turn, or is it more of a spot-check thing?",
        "note": "You're hunting for the gap. Almost nobody reviews every photo from every turn — there's just too many. If she admits that, that's your moment. Don't pounce, just acknowledge it.",
        "branches": [
          {
            "label": "Nobody reviews them all / it's spotty / we try but can't keep up",
            "to": "discovery_damage"
          },
          {
            "label": "We review everything / have a dedicated person",
            "to": "discovery_damage"
          },
          {
            "label": "We rely on the damage waiver to cover us",
            "to": "discovery_damage_waiver"
          }
        ]
      },
      "discovery_damage": {
        "label": "PROBE DAMAGE AND COST IMPACT",
        "say": "Makes sense. And I noticed you guys give guests the choice of a hundred-dollar damage waiver or a five-thousand-dollar deposit. When damage does slip through, how are you typically handling that — are you eating it, going after the guest, or does it end up being an owner conversation?",
        "note": "The damage waiver model is the killer angle. Most guests pay the $100 and walk. If damage isn't caught immediately, the chargeback window closes. Let her vent if she starts talking about specific situations — that's gold.",
        "branches": [
          {
            "label": "It's a headache / we eat some of it / owners get upset",
            "to": "book_meeting"
          },
          {
            "label": "We handle it well / not a huge issue for us",
            "to": "offer_of_value"
          },
          {
            "label": "Asks how RapidEye would help with this specifically",
            "to": "discovery_escapia"
          }
        ]
      },
      "discovery_damage_waiver": {
        "label": "DAMAGE WAIVER DEEP DIVE",
        "say": "Yeah, that's what I keep hearing from PMs who run a waiver model. Most guests take the hundred bucks, right? Which means if your team doesn't catch the damage between checkout and the next check-in, you're basically on the hook. How quickly are you guys turning units — same day usually?",
        "note": "Key West turnovers are tight, especially in high season. If she confirms same-day turns, the time pressure to catch damage is enormous and manual review is basically impossible at 150+ homes. That's your leverage.",
        "branches": [
          {
            "label": "Yeah same-day mostly / it's really tight",
            "to": "book_meeting"
          },
          {
            "label": "We usually have a buffer day",
            "to": "discovery_damage"
          },
          {
            "label": "Asks how the tool actually works",
            "to": "discovery_escapia"
          }
        ]
      },
      "discovery_escapia": {
        "label": "ESCAPIA INTEGRATION ANGLE",
        "say": "Yeah so the cool part is we actually plug right into the workflow you already have in Escapia. Your team keeps doing exactly what they're doing — uploading photos the same way they always have. Our system scans everything automatically and kicks out a report flagging anything that's off — damage, missing items, furniture moved, staging issues. There's literally no workflow change on your team's end. That's usually what gets people to at least take a look.",
        "note": "Mentioning Escapia by name shows you know their stack. The 'no workflow change' point is critical — PMs are allergic to adding steps to their team's plate. Keep this tight and then go straight for the meeting.",
        "branches": [
          {
            "label": "That's interesting / how does it actually work?",
            "to": "book_meeting"
          },
          {
            "label": "We don't really use Escapia for photos / photos go somewhere else",
            "to": "book_meeting"
          },
          {
            "label": "I'd need to loop in Dan / Laurie / someone else",
            "to": "referral_ask"
          }
        ]
      },
      "not_interested": {
        "label": "NOT INTERESTED — AGREE FIRST",
        "say": "Totally get it — honestly I should've assumed you'd be all set. With a hundred and fifty homes you'd have to have something in place, otherwise you wouldn't have gotten this far. Just so nobody from my team reaches out again — is it that damage tracking isn't really a pain point for you guys, or is it more that you're just not looking to add anything new right now?",
        "note": "Agree, then split. Don't fight the objection — it's a reaction to the interruption, not a rejection of the product. Either answer gives you something to work with.",
        "branches": [
          {
            "label": "Not a pain point / we have it handled",
            "to": "have_a_process"
          },
          {
            "label": "Just not looking to add new tools right now",
            "to": "sell_test_drive"
          },
          {
            "label": "Both / genuinely not interested",
            "to": "offer_of_value"
          }
        ]
      },
      "have_a_process": {
        "label": "THEY HAVE A PROCESS",
        "say": "That totally makes sense — with that many homes you'd have to have something. I'm curious though — is it more of a manual review situation where someone on the team is going through photos, or are you guys using something automated for that?",
        "note": "Almost everyone who says 'we have a process' means their cleaners take photos and someone sometimes eyeballs them. If it's manual, that's your opening. If they name a specific tool, ask how they feel about it.",
        "branches": [
          {
            "label": "It's manual / our team reviews / someone checks",
            "to": "sell_test_drive"
          },
          {
            "label": "We use Breezeway / a specific tool",
            "to": "sell_test_drive_vendor"
          },
          {
            "label": "It works fine / we're happy / not looking to change",
            "to": "offer_of_value"
          }
        ]
      },
      "sell_test_drive_vendor": {
        "label": "THEY HAVE A VENDOR — SELL THE LOOK",
        "say": "Oh nice — yeah they're solid on the task-management side. The piece we keep hearing is missing though is the actual photo analysis — like your cleaner uploads forty photos into Breezeway or wherever, and someone still has to manually look at them to catch damage. That's the gap we fill. You're probably not switching anything today, but would it be worth fifteen minutes just to see what the AI side looks like? Worst case you tell your current vendor to build it.",
        "note": "Don't trash their current tool. Complement it. Position RapidEye as the layer that's missing, not a replacement. 'Worst case you tell your vendor to build it' is disarming and confident.",
        "branches": [
          {
            "label": "Sure / that makes sense / I'd look at it",
            "to": "book_meeting"
          },
          {
            "label": "We're happy with what we have",
            "to": "offer_of_value"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "That's completely fair — and look, you're probably not buying anything from a cold call today, I totally respect that. But what I've found is the managers who end up getting the most out of this are the ones who took a look early — just so when budget does open up, or when something slips through and becomes a fire drill, they already know what their options are. Would you be open to a quick fifteen-minute look? Not a pitch — I'd just show you what the other PMs in the Keys are doing with their turnover photos and you can decide from there.",
        "note": "You're reframing the meeting as due diligence, not a purchase. 'Other PMs in the Keys' creates social proof and curiosity. Fifteen minutes lowers the commitment bar.",
        "branches": [
          {
            "label": "Sure / I could do that",
            "to": "book_meeting"
          },
          {
            "label": "Can you send me something first?",
            "to": "send_email"
          },
          {
            "label": "I'm really not the right person for this",
            "to": "referral_ask"
          },
          {
            "label": "No thanks / not right now",
            "to": "offer_of_value"
          }
        ]
      },
      "offer_of_value": {
        "label": "OFFER OF VALUE — LAST SHOT",
        "say": "Totally hear you. Hey — would it be useful if I just sent you a quick breakdown of what a couple other PM companies in Key West are doing with their turnover photo workflows? No pitch, just what we're seeing across the market. Worst case you steal some ideas and we part as friends.",
        "note": "Give before you get. Even if she never buys, sending something useful keeps the door open and gives you a reason to follow up. This is your last play before graceful exit.",
        "branches": [
          {
            "label": "Sure, send it over",
            "to": "send_email"
          },
          {
            "label": "No I'm good / not needed",
            "to": "graceful_exit"
          },
          {
            "label": "Actually, tell me more about what you're seeing",
            "to": "warm_response"
          }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Absolutely — I'll send you something today. One quick question so I don't just blast you with a generic pitch deck — what would be most useful to see? Is it more the damage-detection side, how the Escapia integration works, or just what other companies your size are doing?",
        "note": "Accept the email request immediately — never fight it. The follow-up question does two things: gets you intel to tailor the email, and gets her engaging on substance. Whatever she picks tells you what matters most.",
        "branches": [
          {
            "label": "She tells you what to include / picks an angle",
            "to": "send_email_close"
          },
          {
            "label": "Just send whatever / the general overview",
            "to": "send_email_close"
          }
        ]
      },
      "send_email_close": {
        "label": "CLOSE THE EMAIL THREAD",
        "say": "Got it — I'll put something together and shoot it over to you today. I'll drop in a couple times to hop on a quick call in case you want to dig in after you read through it. Really appreciate you hearing me out, Angela.",
        "note": "Send the email within one hour. Include 2-3 specific time slots for a call. Follow up in 2-3 business days if no response. Add her to your sequence marked as 'warm — requested email.'",
        "branches": []
      },
      "no_budget": {
        "label": "NO BUDGET",
        "say": "Totally get it — nowadays it's harder to keep a tool, let alone buy something new. Just so I'm not wasting anyone's time — is it that budget for this cycle is completely spoken for, or is it more that anything new has to go through a whole approval process?",
        "note": "Split the budget objection. If it's timing, plant a seed for next quarter. If it's approval chain, find out who approves — that might be Laurie McChesney as the founder.",
        "branches": [
          {
            "label": "Budget is locked / maybe next quarter or next year",
            "to": "sell_test_drive"
          },
          {
            "label": "Would need approval from Laurie / ownership",
            "to": "referral_ask"
          },
          {
            "label": "It's just not a priority right now",
            "to": "offer_of_value"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome — let me grab my calendar real quick. I've got next Tuesday or Wednesday afternoon open. Which one's better for you? I just need fifteen minutes.",
        "note": "Give two options, not an open-ended 'when works for you.' Lock in a day AND a time. If she picks a day, nail the hour: 'How's two o'clock?' Send the calendar invite while you're still on the phone.",
        "branches": [
          {
            "label": "Picks a time",
            "to": "meeting_booked"
          },
          {
            "label": "Let me check my calendar and get back to you",
            "to": "send_email"
          },
          {
            "label": "Can you include Dan / Laurie / someone else on the call?",
            "to": "referral_get_name"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING CONFIRMED",
        "say": "Perfect — just sent the invite over. Really appreciate you taking my call, Angela. I'll keep it tight and make sure it's actually worth your fifteen minutes. Talk to you then.",
        "note": "STOP SELLING. Do not keep talking about the product. Confirm the time, send the invite, and get off the phone. Every extra second after booking is a chance to unbook.",
        "branches": []
      },
      "referral_ask": {
        "label": "REFERRAL — FIND THE RIGHT PERSON",
        "say": "Totally makes sense — I'd want to make sure I'm talking to the right person anyway. Who on your team typically owns the inspection workflow — like if you were going to change how turnovers get documented, who'd be making that call? Would that be Dan Skahen, or does that sit with Laurie?",
        "note": "Name-drop Dan and Laurie naturally — you know the org. If she defers to Laurie, that confirms the family/ownership dynamic and Laurie is your real target. If she says Dan, he's your next call and he grew the PM division from 3 to 150+ homes. Always get a name.",
        "branches": [
          {
            "label": "That'd be Dan / another property manager",
            "to": "referral_get_name"
          },
          {
            "label": "You'd need to talk to Laurie",
            "to": "referral_get_name"
          },
          {
            "label": "Actually I can handle it / let me take the meeting",
            "to": "book_meeting"
          }
        ]
      },
      "referral_get_name": {
        "label": "GET THE NAME AND WARM INTRO",
        "say": "Perfect — would you mind giving them a quick heads up that I'll be reaching out? That way it's not totally cold when I call. I'll put something together that's specific to what you guys are doing so it actually makes sense for them.",
        "note": "If she agrees to give a heads up, your next call just became a warm call. If she won't, you can still open with 'I was just chatting with Angela and she pointed me your way.' Either way you leave with a name and a path forward.",
        "branches": [
          {
            "label": "Sure I'll mention it to them",
            "to": "graceful_exit_referral"
          },
          {
            "label": "Just reach out to them directly / I'd rather not",
            "to": "graceful_exit_referral"
          }
        ]
      },
      "graceful_exit_referral": {
        "label": "EXIT WITH REFERRAL",
        "say": "Really appreciate that, Angela. I'll reach out to them this week. And hey — if anything ever comes up on your end where this becomes relevant, you've got my number. Thanks for your time.",
        "note": "Immediately call the referral after hanging up. Lead with 'I was just talking to Angela McChesney and she mentioned you'd be the right person to connect with about this.' Strike while it's hot.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand, Angela. If anything changes down the road, I'm easy to find. Really appreciate your time — enjoy the rest of your day down in Key West.",
        "note": "Don't burn the bridge. Be warm and human. Key West is a tiny market — she will remember how you left this conversation. Add her to a long-term nurture sequence with a 30-day follow-up.",
        "branches": []
      }
    }
  }
}