{
  "name": "Angie Schnell",
  "title": "Hospitality & Growth Strategies Department Manager",
  "company": "Island Realty",
  "location": "Charleston, SC",
  "phone": "+1-843-242-1502",
  "company_phone": "800-707-6421",
  "alt_phones": [
    "+1-843-886-8144",
    "+1-844-347-5483"
  ],
  "flow": {
    "context": "Angie Schnell is the Hospitality & Growth Strategies Department Manager at Island Realty — she owns marketing, guest experience strategy, and growth initiatives. She's publicly data-savvy: she gave a testimonial for Key Data Dashboard about taking their analytics to the next level. Island Realty is a family-owned vacation rental company in Charleston (Isle of Palms, Wild Dunes, Sullivan's Island), ~300+ properties, with in-house housekeeping (Isle Clean It) and maintenance (Isle Fix It). They run on Escapia, NAVIS, and Key Data but have no confirmed inspection or ops platform. Angie likely doesn't own the inspection workflow directly — that's probably Collins Atkinson (Director of Property Management) or Alex Lane (Housekeeping Dept Manager) — but her data orientation and cross-department influence make her a strong internal champion or referral path. No direct personal connection to Sam — lead with Charleston beach market proximity and her analytics focus.",
    "start": "gatekeeper",
    "nodes": {
      "gatekeeper": {
        "label": "GATEKEEPER",
        "say": "Hey, could you get me over to Angie? It's Sam.",
        "note": "Don't volunteer anything. Dose information one layer at a time. Pause and wait after asking.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Asks what it's regarding",
            "to": "gatekeeper_context"
          },
          {
            "label": "Angie answers directly",
            "to": "opener"
          },
          {
            "label": "Says she's unavailable",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER WANTS CONTEXT",
        "say": "Yeah — I work with a few other property managers in the Charleston beach market on their inspection workflows. Would you mind letting her know it's Sam Parks?",
        "note": "Stay casual. Don't pitch the gatekeeper. If they push again, add the social proof layer.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Pushes back more",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "Says she's unavailable",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER STILL BLOCKING",
        "say": "Totally understand — we help a couple other property management companies similar to Island Realty with their turnover quality workflows. I sent her a note already — would you mind just giving her a heads up that Sam Parks called?",
        "note": "You've given three doses. If they still block, get a callback window and move on gracefully. Don't burn the gatekeeper.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Takes a message or suggests callback",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_unavailable": {
        "label": "ANGIE UNAVAILABLE",
        "say": "No worries at all. When's a good time to catch her — is she usually better mornings or afternoons? And could I grab her direct line so I don't have to bug you again?",
        "note": "Get a callback window. Confirm her direct number is (843) 242-1502. If they push you to email, take it — angie@islandrealty.com — but try for a phone time first.",
        "branches": [
          {
            "label": "Gives a callback time",
            "to": "end_graceful"
          },
          {
            "label": "Suggests email instead",
            "to": "end_graceful"
          }
        ]
      },
      "opener": {
        "label": "OPENER",
        "say": "Hey Angie — I work with a few property managers out in the Charleston beach market, and your name came up when I was looking into Island Realty. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Sound like you belong. Feet up on the desk. Pause after the question and let her answer — don't rush to fill the silence.",
        "branches": [
          {
            "label": "No, I haven't",
            "to": "not_heard"
          },
          {
            "label": "Yeah / maybe / sounds familiar",
            "to": "has_heard"
          },
          {
            "label": "I'm busy / bad time",
            "to": "bad_timing"
          },
          {
            "label": "What is this about?",
            "to": "permission_fallback"
          }
        ]
      },
      "not_heard": {
        "label": "HASN'T HEARD OF YOU",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call is — I was talking to another property manager who runs about 300 units on the coast, pretty similar setup to you guys, in-house cleaning team, running Escapia, the whole thing. And the problem they kept running into was — their cleaners are taking photos every turnover, hundreds of photos a week, but nobody actually has time to sit there and review them all. So stuff slips through. A stain on a couch, a cracked tile, a missing set of towels — it just sits there until a guest complains or an owner notices on their next visit. And by then it's a whole fire drill.",
        "note": "STOP HERE. Pause after 'fire drill.' Let the pain land. Watch for her to react — if she starts talking, shut up and listen. Only continue to the solution if she's silent or says 'okay' / 'right.'",
        "branches": [
          {
            "label": "Silence or acknowledgment — continue",
            "to": "solution_and_cta"
          },
          {
            "label": "Yeah, that happens / tells a story",
            "to": "warm_discovery"
          },
          {
            "label": "That's not really my area",
            "to": "referral_ask"
          },
          {
            "label": "We already have something for that",
            "to": "objection_have_vendor"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "solution_and_cta": {
        "label": "SOLUTION + CTA",
        "say": "We built something that automatically analyzes those turnover photos and flags damage, missing items, staging issues — no workflow change on their end. Their cleaners keep doing exactly what they're doing. Would you be open to taking a look at some point when I'm not cold calling you out of the blue?",
        "note": "One sentence on the solution. One sentence CTA. That's it. Don't oversell. If she asks how it works, that's discovery — let her pull you in.",
        "branches": [
          {
            "label": "Sure / that's interesting / tell me more",
            "to": "warm_discovery"
          },
          {
            "label": "I'm not the right person for this",
            "to": "referral_ask"
          },
          {
            "label": "We already handle that",
            "to": "objection_have_vendor"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          }
        ]
      },
      "has_heard": {
        "label": "HAS HEARD OF YOU",
        "say": "Oh nice — well usually we'd be working with someone in your kind of role. What'd you hear?",
        "note": "Let her talk. Whatever she says, use it to bridge into discovery. Don't correct her — build on what she shares.",
        "branches": [
          {
            "label": "Mentions something specific",
            "to": "warm_discovery"
          },
          {
            "label": "Vague / not sure exactly",
            "to": "not_heard"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow, maybe in the morning?",
        "note": "Don't pitch. Respect the timing. Lock in a specific callback window if possible.",
        "branches": [
          {
            "label": "Sure, call me back",
            "to": "book_callback"
          },
          {
            "label": "Just tell me real quick",
            "to": "not_heard"
          },
          {
            "label": "Not interested at all",
            "to": "objection_not_interested"
          }
        ]
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call, I'll own that. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not a fit?",
        "note": "Smile through this line. The honesty disarms people. If she says yes, go straight to the pain trigger.",
        "branches": [
          {
            "label": "Fine, go ahead",
            "to": "not_heard"
          },
          {
            "label": "No / still not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and it's just not interesting?",
        "note": "Split the rejection. Either answer gives you a next step — bad timing means a callback, genuine disinterest means try the referral path.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "book_callback"
          },
          {
            "label": "Not interested / don't need it",
            "to": "objection_not_interested"
          },
          {
            "label": "Opens up a bit",
            "to": "not_heard"
          }
        ]
      },
      "warm_discovery": {
        "label": "DISCOVERY — SHE'S WARM",
        "say": "Love it — I know you're on the growth and strategy side, so I'm curious. When it comes to property condition and turnover quality, how does that flow work at Island Realty right now? Are your Isle Clean It folks taking photos every turn and someone's reviewing them, or is it more of an eyeball-it situation?",
        "note": "STOP PITCHING. Ask questions. Mentioning Isle Clean It by name shows you know their operation. Let her describe the workflow and gaps herself. Mirror what she says.",
        "branches": [
          {
            "label": "Describes their current process",
            "to": "discovery_dig_deeper"
          },
          {
            "label": "Not sure / that's not really my area",
            "to": "referral_ask"
          },
          {
            "label": "We have something in place already",
            "to": "discovery_current_tool"
          }
        ]
      },
      "discovery_dig_deeper": {
        "label": "DIG DEEPER",
        "say": "That makes sense. And with 300-plus units and your in-house team handling all the turns — when something does get missed, like damage between guests or a staging issue — how does that usually surface? Is it the guest calling in, or an owner rep catching it on a walk-through, or kind of random?",
        "note": "You're mapping their pain. If she mentions guest complaints, reviews, owner frustration — those are gold. You know they have Owner Representatives — reference them naturally if she does.",
        "branches": [
          {
            "label": "Guest complaints / reviews surface it",
            "to": "pain_reviews"
          },
          {
            "label": "Owner reps catch it but it's inconsistent",
            "to": "pain_inconsistency"
          },
          {
            "label": "We've got it pretty locked down honestly",
            "to": "pivot_data_angle"
          },
          {
            "label": "That's really more of a Collins or Alex question",
            "to": "referral_ask"
          }
        ]
      },
      "discovery_current_tool": {
        "label": "THEY HAVE SOMETHING",
        "say": "Oh nice — is that built into Escapia or is it a separate tool?",
        "note": "You know they use Escapia as their PMS. Referencing it shows homework. If they name a tool, ask how it's working. If it's manual or checklists, that's your opening.",
        "branches": [
          {
            "label": "Names a tool (Breezeway, Track, etc.)",
            "to": "objection_have_vendor"
          },
          {
            "label": "Manual / checklists / spreadsheets",
            "to": "pain_manual_process"
          },
          {
            "label": "Not sure of the details",
            "to": "referral_ask"
          }
        ]
      },
      "pain_reviews": {
        "label": "PAIN — GUEST COMPLAINTS HIT REVIEWS",
        "say": "Yeah — that's exactly what I keep hearing. And the tricky part is, by the time it shows up in a review, the damage is done. Literally and figuratively. Especially heading into summer when every review is make or break. The managers I work with who've started using our tool — they're catching those issues in the photos their cleaners already take, before the guest even walks in the door. Would it make sense to show you what that looks like? Even if it's just to see if it's worth looping in Collins or whoever owns the property management side?",
        "note": "You've connected her pain to business outcomes she cares about — reviews, growth, peak season. Dropping Collins Atkinson's name shows you know their org and makes her more comfortable.",
        "branches": [
          {
            "label": "Sure, let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "Yeah, Collins would need to be on that",
            "to": "referral_ask"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "objection_not_interested"
          }
        ]
      },
      "pain_inconsistency": {
        "label": "PAIN — INCONSISTENT CATCH RATE",
        "say": "That's super common — especially with an in-house team handling that volume. It's not that anyone's doing a bad job, it's just that when you're turning over that many properties in a day, stuff is gonna slip through. What we do is basically run every turnover photo through AI — so it's like having a second set of eyes on every single turn. No extra work for your housekeeping team. Would it be worth taking a quick look?",
        "note": "Validate their team. Never imply their people are bad. Frame RapidEye as a safety net, not a replacement for their in-house crew.",
        "branches": [
          {
            "label": "Yeah, that could be interesting",
            "to": "book_meeting"
          },
          {
            "label": "Who should be on the call from our side?",
            "to": "referral_ask"
          },
          {
            "label": "Send me info first",
            "to": "send_email"
          },
          {
            "label": "We're good for now",
            "to": "objection_not_interested"
          }
        ]
      },
      "pain_manual_process": {
        "label": "PAIN — MANUAL / NO AUTOMATION",
        "say": "Got it — so photos are getting taken but there's no automated layer actually reviewing them. That's exactly what we built for. Your cleaners keep doing exactly what they're already doing — we just run every photo through AI and flag damage, missing items, staging problems. Zero workflow change. The property managers I work with in similar-sized portfolios were genuinely surprised by what was slipping through. Would you be open to seeing it?",
        "note": "This is your strongest position — they have the photos but no automation reviewing them. Keep it simple. Don't list features.",
        "branches": [
          {
            "label": "Sure, that sounds useful",
            "to": "book_meeting"
          },
          {
            "label": "I'd need to pull in the right people",
            "to": "referral_ask"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          },
          {
            "label": "Not a priority right now",
            "to": "sell_test_drive"
          }
        ]
      },
      "pivot_data_angle": {
        "label": "PIVOT — DATA ANGLE",
        "say": "That's great — honestly you guys being data-driven is probably a big reason for that. I know you've been doing some cool stuff with Key Data on the benchmarking side. What we're seeing with some of the more analytically-focused teams is they want that same level of visibility into property condition — like, which properties are consistently flagging issues, where damage keeps recurring, which units are costing more in maintenance than they should. Would that kind of reporting layer be interesting to you?",
        "note": "She gave a Key Data testimonial — this is your hook. Connect inspection data to the analytics she already values. Keep the reference natural, not stalkerish.",
        "branches": [
          {
            "label": "Yeah, that would be useful",
            "to": "book_meeting"
          },
          {
            "label": "That's more of an ops conversation",
            "to": "referral_ask"
          },
          {
            "label": "We're pretty covered on the data side",
            "to": "objection_have_vendor"
          },
          {
            "label": "Interesting but not right now",
            "to": "sell_test_drive"
          }
        ]
      },
      "referral_ask": {
        "label": "REFERRAL",
        "say": "Totally makes sense — this probably sits more on the property management or housekeeping side of the house. Who on your team would typically own that turnover and inspection workflow? Would that be Collins Atkinson, or maybe someone on the housekeeping side like Alex?",
        "note": "Drop Collins Atkinson (Director of Property Management) and Alex Lane (Housekeeping Dept Manager) by name. It shows you've done your homework and makes the referral frictionless. Push for a warm intro if possible.",
        "branches": [
          {
            "label": "Collins is the right person",
            "to": "referral_collins"
          },
          {
            "label": "Alex Lane / housekeeping team",
            "to": "referral_alex_lane"
          },
          {
            "label": "Eric Stone / someone else",
            "to": "referral_other"
          },
          {
            "label": "Actually, I can take a look myself",
            "to": "book_meeting"
          }
        ]
      },
      "referral_collins": {
        "label": "REFERRAL TO COLLINS",
        "say": "Perfect — would you be open to shooting Collins a quick note or looping him in? I'd love to put something tailored together so it's not just another cold email landing in his inbox. Even a quick 'hey Sam's gonna reach out, might be worth a look' goes a long way.",
        "note": "A warm intro from Angie to Collins is gold. If she won't intro, ask for the best way to reach him. Backup: collins@islandrealty.com, direct line (843) 242-1076.",
        "branches": [
          {
            "label": "Sure, I'll let him know",
            "to": "book_meeting_referral"
          },
          {
            "label": "Just reach out to him directly",
            "to": "referral_direct_reach"
          },
          {
            "label": "Let me think about it",
            "to": "send_email"
          }
        ]
      },
      "referral_alex_lane": {
        "label": "REFERRAL TO ALEX LANE",
        "say": "Makes sense — Alex would be right in the middle of this. Same ask — any chance you could give her a heads up that I'll reach out? Means a lot more coming from you than a random cold call.",
        "note": "Alex Lane is the Housekeeping Dept Manager — most direct owner of turnover execution. Backup contact: aunrine@islandrealty.com, direct line (843) 242-1070.",
        "branches": [
          {
            "label": "Sure, I'll mention it",
            "to": "book_meeting_referral"
          },
          {
            "label": "Just call her directly",
            "to": "referral_direct_reach"
          }
        ]
      },
      "referral_other": {
        "label": "REFERRAL TO OTHER CONTACT",
        "say": "Got it — that's really helpful. What's the best way to get in touch with them? And would you mind giving them a quick heads up? Makes a huge difference versus calling blind.",
        "note": "If she names Eric Stone (Director of Hospitality): (843) 242-1082, eric@islandrealty.com. If Alex Stone IV (CEO): (843) 242-1089, astone@islandrealty.com. Write down whoever she names.",
        "branches": [
          {
            "label": "Gives name and will intro",
            "to": "book_meeting_referral"
          },
          {
            "label": "Gives name but no intro",
            "to": "referral_direct_reach"
          }
        ]
      },
      "referral_direct_reach": {
        "label": "DIRECT REACH CONFIRMED",
        "say": "Awesome — I really appreciate that. I'll reach out to them directly and mention we chatted. Thanks for pointing me the right way, Angie.",
        "note": "You got the referral. Follow up within 24 hours. Open the next call with: 'Hey, I was just talking to Angie Schnell and she mentioned you'd be the right person to chat with about your turnover workflow.'",
        "branches": []
      },
      "book_meeting_referral": {
        "label": "BOOK MEETING WITH REFERRAL",
        "say": "That's awesome — would it make sense to just do a quick call together with all of you? I've got next Tuesday and Thursday open. What looks better on your end?",
        "note": "Try to get Angie AND the referral on the same call. If she defers to the other person's calendar, lock in a plan for follow-up and send the invite to both.",
        "branches": [
          {
            "label": "Picks a time",
            "to": "meeting_booked"
          },
          {
            "label": "Let me check with them first",
            "to": "send_email_with_times"
          }
        ]
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "I totally get it — I should've assumed you'd be all set. Otherwise you probably would've reached out to us. Just so nobody from my team cold calls you again — is it that turnover quality just isn't something you're focused on right now, or is it more that you just hate cold calls? Because honestly I get it either way.",
        "note": "Split the objection. If it's timing, you can circle back. If it's role-based, pivot to referral. If genuine disinterest, try the test drive or end gracefully.",
        "branches": [
          {
            "label": "Hate cold calls / bad timing",
            "to": "sell_test_drive"
          },
          {
            "label": "Not my area / not focused on this",
            "to": "referral_ask"
          },
          {
            "label": "We're genuinely all set",
            "to": "objection_all_set_push"
          },
          {
            "label": "Hard no",
            "to": "end_graceful"
          }
        ]
      },
      "objection_have_vendor": {
        "label": "OBJECTION — HAVE A VENDOR",
        "say": "That makes total sense — with 300-plus units you'd have to have something in place. Is it that you're fully covered and happy with how it's working, or is it more that switching anything right now heading into busy season would just be a headache?",
        "note": "Split the objection. If happy — learn what they use, compliment it, offer a comparison. If switching is the pain — position RapidEye as additive, not a rip-and-replace.",
        "branches": [
          {
            "label": "Happy with current setup",
            "to": "objection_happy_with_setup"
          },
          {
            "label": "Switching would be a pain right now",
            "to": "sell_test_drive"
          },
          {
            "label": "Opens up about frustrations or gaps",
            "to": "warm_discovery"
          }
        ]
      },
      "objection_happy_with_setup": {
        "label": "HAPPY WITH SETUP",
        "say": "Love that — honestly that's rare. Most folks I talk to have something but it's held together with duct tape. Out of curiosity, what are you guys using? I'd genuinely love to know what's working. And if nothing else, I can share what other companies your size in the Charleston market are doing differently. Worst case you steal some ideas and we part as friends.",
        "note": "Offer of value — the conversation itself is worth having even if she never buys. If she names a tool, learn about their experience. You're gathering intel either way.",
        "branches": [
          {
            "label": "Names their tool or describes process",
            "to": "warm_discovery"
          },
          {
            "label": "Not interested in comparing",
            "to": "end_graceful"
          },
          {
            "label": "That could actually be interesting",
            "to": "book_meeting"
          }
        ]
      },
      "objection_all_set_push": {
        "label": "GENUINELY ALL SET",
        "say": "Totally respect that. You're probably not buying anything right now, and I get it. But when things do open up — especially heading into summer — the people who already know what's out there are the ones who move fastest. Would you be open to just a quick look so it's on your radar? Fifteen minutes. Not for now — just so you know it exists.",
        "note": "Low-pressure test drive close. You're planting a seed. If she still says no, try the referral or go gracefully.",
        "branches": [
          {
            "label": "Fine, let's do a quick look",
            "to": "book_meeting"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "end_graceful"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally fair. Look — you're probably not buying anything off a cold call, and I respect that. But if nothing else, I could walk you through what other PM companies in the Charleston market are doing with their turnover photos and how they're thinking about quality data. Worst case you grab some ideas and we part as friends. Would you be open to fifteen minutes next week?",
        "note": "Frame the meeting as insight-sharing, not a sales demo. The meeting is valuable even if she never buys. If she says yes, lock in the time NOW.",
        "branches": [
          {
            "label": "Sure, let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Send me info first",
            "to": "send_email"
          },
          {
            "label": "No",
            "to": "end_graceful"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome — I've got next Tuesday and Thursday pulled up. What looks better on your end? Morning or afternoon?",
        "note": "Give her two specific days. Don't say 'when works for you.' Once she picks a day, narrow to a time. Send the invite while still on the phone.",
        "branches": [
          {
            "label": "Picks a day and time",
            "to": "meeting_booked"
          },
          {
            "label": "Let me check my calendar and get back to you",
            "to": "send_email_with_times"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING BOOKED",
        "say": "Perfect — I'll send the invite over right now so it's locked in. Really appreciate you taking my call, Angie. Talk to you then.",
        "note": "STOP SELLING. Send the calendar invite immediately. Keep it short and warm. Don't add more info or pitch features — you won the meeting, now protect it.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One question before I do — what would be most relevant to include so it's not just another generic pitch sitting in your inbox? Is it more the data and reporting side, or more seeing how it actually works with turnover photos?",
        "note": "Accept it but ask what to include. Keeps the conversation going and tells you what she cares about. Whatever she says, tailor the email to that angle.",
        "branches": [
          {
            "label": "Tells you what she wants to see",
            "to": "send_email_confirm"
          },
          {
            "label": "Just send whatever / general info",
            "to": "send_email_confirm"
          }
        ]
      },
      "send_email_confirm": {
        "label": "CONFIRM EMAIL DETAILS",
        "say": "Got it — I'll send that over to angie at islandrealty dot com. I'll include a couple times to chat next week in case anything catches your eye. Really appreciate your time, Angie.",
        "note": "Confirm the email. Send within 2 hours. Subject line should reference something specific from the call. Include 2-3 time slots. Follow up by phone in 2-3 days if no reply.",
        "branches": []
      },
      "send_email_with_times": {
        "label": "SEND CALENDAR OPTIONS",
        "say": "No problem — I'll shoot you an email with a few time options. Is angie at islandrealty dot com still the best one? I'll include a quick overview so you have context going in.",
        "note": "Confirm her email. Send within the hour with 3 specific time options. Follow up by phone in 48 hours if no reply.",
        "branches": [
          {
            "label": "Confirms email",
            "to": "send_email_confirm"
          }
        ]
      },
      "book_callback": {
        "label": "BOOK CALLBACK",
        "say": "Appreciate that — how about I try you tomorrow morning around ten? Or would the afternoon work better?",
        "note": "Lock in a specific time. Don't leave it vague. Her direct line is (843) 242-1502. Log the callback in your CRM immediately.",
        "branches": [
          {
            "label": "Picks a time",
            "to": "callback_confirmed"
          },
          {
            "label": "Just call whenever",
            "to": "callback_confirmed"
          }
        ]
      },
      "callback_confirmed": {
        "label": "CALLBACK CONFIRMED",
        "say": "Perfect — I'll catch you then. Thanks, Angie. Talk soon.",
        "note": "Set a reminder immediately. When you call back, open with: 'Hey Angie, it's Sam Parks — you told me to try you back today. Got a minute?'",
        "branches": []
      },
      "end_graceful": {
        "label": "END GRACEFULLY",
        "say": "Totally understand. If anything changes — especially heading into summer season — I'm easy to find. Appreciate your time, Angie.",
        "note": "Don't burn the bridge. Log the call details and her responses. Set a follow-up reminder for 60-90 days. Even if she's not the buyer, she's connected to Collins, Alex Lane, and Eric Stone internally.",
        "branches": []
      }
    }
  }
}