{
  "name": "Anna",
  "title": "Guest Services",
  "company": "Haustay Vacation Rentals",
  "location": "San Diego, CA",
  "phone": "+1-858-522-9127",
  "company_phone": "(858) 522-9127",
  "alt_phones": [],
  "flow": {
    "context": "Anna is Guest Services at Haustay Vacation Rentals — a boutique PM managing roughly 50-60 coastal properties across North County San Diego (Carlsbad, Encinitas, Oceanside, Solana Beach). She works under Tala (Head of Guest Services) and is likely the first person fielding guest complaints that surface missed cleaning or damage issues. Decision-makers are Nick and Elisa Foster (co-founders) and Agostina Baldi (Director of Hospitality). Haustay runs Streamline PMS, PriceLabs, in-house cleaners, and commits to post-stay inspections — but has no known photo/inspection platform. Sam's angle: fellow SoCal surfer who works with other coastal property managers on inspection workflows.",
    "start": "someone_answers",
    "nodes": {
      "someone_answers": {
        "label": "SOMEONE PICKS UP",
        "say": "Hey, could you get me through to Anna? It's Sam.",
        "note": "Keep it short and casual. Don't offer more unless asked. If Anna answers directly you'll know from context — jump to opener.",
        "branches": [
          {
            "label": "Anna answers directly",
            "to": "opener"
          },
          {
            "label": "Gatekeeper asks who's calling or what it's about",
            "to": "gatekeeper_context"
          },
          {
            "label": "Transferred without questions",
            "to": "opener"
          },
          {
            "label": "Goes to voicemail",
            "to": "voicemail"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER WANTS CONTEXT",
        "say": "Yeah — I work with a few other vacation rental managers down in North County. Would you mind letting Anna know it's Sam Parks?",
        "note": "Dose info slowly. Don't pitch. Don't explain RapidEye. You're just a guy trying to reach Anna.",
        "branches": [
          {
            "label": "Transferred to Anna",
            "to": "opener"
          },
          {
            "label": "More pushback — what's this regarding?",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "Anna's not available",
            "to": "gatekeeper_ask_for_others"
          },
          {
            "label": "Goes to voicemail",
            "to": "voicemail"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER PUSHBACK",
        "say": "Totally fair — we help a couple other property management companies with their inspection workflows. I sent Anna a note and just wanted to follow up. Would you mind giving her a heads up?",
        "note": "Last shot at the gate. If fully blocked, pivot to asking for another name — Tala, Agostina, Nick, or Elisa.",
        "branches": [
          {
            "label": "Transferred to Anna",
            "to": "opener"
          },
          {
            "label": "Still blocked — won't transfer",
            "to": "gatekeeper_ask_for_others"
          },
          {
            "label": "Takes a message",
            "to": "graceful_exit_gatekeeper"
          }
        ]
      },
      "gatekeeper_ask_for_others": {
        "label": "PIVOT TO ANOTHER CONTACT",
        "say": "No worries at all. Would Tala or Agostina be around? Either of them would work too.",
        "note": "Drop specific names so you sound like you know the org. If neither is available, try Nick or Elisa. Sound like this is routine, not desperate.",
        "branches": [
          {
            "label": "Transferred to Tala or Agostina",
            "to": "opener_alternate_contact"
          },
          {
            "label": "Transferred to Nick or Elisa",
            "to": "opener_alternate_contact"
          },
          {
            "label": "Nobody available — takes a message",
            "to": "graceful_exit_gatekeeper"
          }
        ]
      },
      "opener_alternate_contact": {
        "label": "OPENER — ALTERNATE CONTACT",
        "say": "Hey — this is Sam Parks with RapidEye. I work with a few other vacation rental managers along the coast in San Diego. Have you heard my name tossed around at all?",
        "note": "Same framework as Anna's opener. Adapt discovery to whoever you reached. If it's Nick or Elisa, they're the decision-maker — go deeper on business outcomes. If it's Tala or Agostina, they're closer to the daily pain.",
        "branches": [
          {
            "label": "No — who are you?",
            "to": "heard_name_no"
          },
          {
            "label": "Yeah actually / maybe",
            "to": "heard_name_yes"
          },
          {
            "label": "Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Guarded — what is this?",
            "to": "permission_fallback"
          }
        ]
      },
      "voicemail": {
        "label": "VOICEMAIL",
        "say": "Hey Anna — it's Sam Parks. I work with a few other vacation rental managers along the North County coast on their inspection workflows. Had a quick question for you — shoot me a text or call back when you get a sec. My number is [your number]. Thanks!",
        "note": "Keep it under 15 seconds. Sound like a peer not a salesperson. Don't mention RapidEye or AI. Leave curiosity not a pitch.",
        "branches": []
      },
      "graceful_exit_gatekeeper": {
        "label": "EXIT — GATEKEEPER",
        "say": "Appreciate it — if you could just let them know Sam Parks called, that'd be great. Thanks so much.",
        "note": "Don't burn bridges. Plan to call back in 2-3 days at a different time or try a direct number for Nick or Elisa.",
        "branches": []
      },
      "opener": {
        "label": "OPENER",
        "say": "Hey Anna — this is Sam Parks with RapidEye. I work with a few other vacation rental managers along the coast down in San Diego — I'm actually from SoCal originally. Have you heard my name tossed around at all?",
        "note": "Feet-up-on-the-desk energy. You're a fellow SoCal person who works with PMs in her market. Don't rush. Let her answer.",
        "branches": [
          {
            "label": "No — haven't heard of you",
            "to": "heard_name_no"
          },
          {
            "label": "Yeah / maybe / sounds familiar",
            "to": "heard_name_yes"
          },
          {
            "label": "Bad timing / busy",
            "to": "bad_timing"
          },
          {
            "label": "Guarded — what is this about?",
            "to": "permission_fallback"
          }
        ]
      },
      "heard_name_no": {
        "label": "HAVEN'T HEARD OF YOU",
        "say": "Oh — guess I'm not as popular as I thought. Well the reason for my call is — I work with a few other property managers in a pretty similar situation to you guys, managing forty, fifty, sixty coastal homes. And the thing I keep hearing is that after turnovers, someone's reviewing all these photos from the cleaners, trying to catch everything — stains on the couch, a missing throw pillow, towels staged wrong — and stuff still slips through. Then a guest checks in at four o'clock on a Friday, finds a problem, and now it's a fire drill plus a bad review on a property worth two, three million bucks. Does any of that sound familiar, or am I totally off base?",
        "note": "This is the pain trigger. You referenced their scale, in-house cleaners, coastal luxury homes. PAUSE at the end. Let her react. Don't rush to the solution.",
        "branches": [
          {
            "label": "Yeah that happens / that's real",
            "to": "pain_resonates"
          },
          {
            "label": "Kinda / not sure",
            "to": "pain_neutral"
          },
          {
            "label": "Not really my area / I just handle guest comms",
            "to": "not_my_area"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "heard_name_yes": {
        "label": "HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone like you. What'd you hear?",
        "note": "Let her talk. Whatever she says, validate it and steer toward inspection pain. If she heard from another PM, that's gold — lean into it.",
        "branches": [
          {
            "label": "Mentions inspections / photos / AI",
            "to": "pain_resonates"
          },
          {
            "label": "Vague — not sure what they heard",
            "to": "heard_name_no"
          },
          {
            "label": "Confused — maybe thinking of someone else",
            "to": "heard_name_no"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow or later this week?",
        "note": "Respect their time. Get a specific callback window. Don't pitch now.",
        "branches": [
          {
            "label": "Gives a better time",
            "to": "reschedule_confirmed"
          },
          {
            "label": "Just email me",
            "to": "send_email"
          },
          {
            "label": "Don't call back",
            "to": "graceful_exit"
          }
        ]
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not a fit?",
        "note": "Disarm with honesty. Most people give you 30 seconds if you own that it's a cold call.",
        "branches": [
          {
            "label": "Fine — go ahead",
            "to": "heard_name_no"
          },
          {
            "label": "No — not interested",
            "to": "permission_rejected"
          },
          {
            "label": "What is this about? (softening)",
            "to": "heard_name_no"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and this just isn't interesting?",
        "note": "Split the objection. Timing vs. true disinterest. Either way be gracious.",
        "branches": [
          {
            "label": "Bad timing — call back later",
            "to": "bad_timing"
          },
          {
            "label": "Just not interested",
            "to": "graceful_exit"
          },
          {
            "label": "Softens — okay what is it?",
            "to": "heard_name_no"
          }
        ]
      },
      "pain_resonates": {
        "label": "PAIN RESONATES",
        "say": "Yeah — that's exactly what we keep hearing. So we built something that basically looks at all the photos your cleaners are already taking after turnovers and flags anything that's off — damage, missing items, staging issues — before the guest ever walks in. Plugs right into your existing workflow, no extra steps. Would you be open to taking a look sometime when I'm not cold calling you out of the blue?",
        "note": "One-sentence solution plus low-friction CTA. Don't oversell. Don't mention AI unless asked. Pause and let her respond.",
        "branches": [
          {
            "label": "Yeah I'd be open to that",
            "to": "warm_discovery"
          },
          {
            "label": "That sounds cool but I'm not the right person",
            "to": "not_my_area"
          },
          {
            "label": "We already have a process for that",
            "to": "objection_have_process"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          },
          {
            "label": "Not interested / don't need it",
            "to": "objection_not_interested"
          }
        ]
      },
      "pain_neutral": {
        "label": "LUKEWARM RESPONSE",
        "say": "Yeah I mean — with fifty or sixty homes along the coast, somebody's gotta be looking at all those post-checkout photos, right? We built something that reviews those photos automatically and catches stuff before the next guest checks in. Would it make sense for me to show you what that looks like — even just a quick five minutes?",
        "note": "Re-anchor on their scale. Make it concrete. She might not be deep in the inspection workflow — be ready to pivot to a referral.",
        "branches": [
          {
            "label": "Sure / maybe",
            "to": "warm_discovery"
          },
          {
            "label": "That's really more of a Tala or Agostina thing",
            "to": "not_my_area"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          },
          {
            "label": "Email me",
            "to": "send_email"
          }
        ]
      },
      "not_my_area": {
        "label": "NOT HER AREA — REFERRAL PIVOT",
        "say": "Totally makes sense — honestly that's super helpful. Who on your team would typically own that inspection piece? Is that more Tala or Agostina's world?",
        "note": "Drop specific names from the research. Tala is Head of Guest Services, Agostina is Director of Hospitality. Sound like you already know the org. If she gives a name, ask for a warm intro or at least permission to name-drop.",
        "branches": [
          {
            "label": "Confirms Tala or Agostina",
            "to": "referral_got_name"
          },
          {
            "label": "Says it's Nick or Elisa (founders)",
            "to": "referral_got_name"
          },
          {
            "label": "Gives a different name",
            "to": "referral_got_name"
          },
          {
            "label": "Not sure / doesn't want to say",
            "to": "referral_push"
          }
        ]
      },
      "referral_push": {
        "label": "PUSH FOR REFERRAL",
        "say": "No worries — I totally get it. Would it be a terrible idea if I reached out to Agostina or Nick directly? I just want to make sure I'm talking to the right person so I'm not bugging people who don't need to hear from me.",
        "note": "Give her an easy out. You're asking permission not demanding. If she confirms any name that's your in.",
        "branches": [
          {
            "label": "Yeah try Agostina / Nick / Elisa",
            "to": "referral_got_name"
          },
          {
            "label": "I can pass along your info",
            "to": "send_email"
          },
          {
            "label": "No — just not interested here",
            "to": "graceful_exit"
          }
        ]
      },
      "referral_got_name": {
        "label": "GOT A REFERRAL NAME",
        "say": "Perfect — that's super helpful. Would you mind if I mentioned you pointed me their way? And what's the best way to reach them — is it just through the main line or do they have a direct number?",
        "note": "Get permission to name-drop Anna. Try to get a direct number or email. If she offers to introduce you, that's the best outcome.",
        "branches": [
          {
            "label": "Gives contact info or offers to connect you",
            "to": "book_meeting_referral"
          },
          {
            "label": "Use the main line or email the office",
            "to": "book_meeting_referral"
          },
          {
            "label": "I'll have them call you back",
            "to": "leave_info"
          }
        ]
      },
      "book_meeting_referral": {
        "label": "LOCK IN NEXT STEP — REFERRAL",
        "say": "Awesome. I'll reach out to them directly — and honestly, if it makes it easier, I could put something together that's specific to how Haustay runs turnovers so it actually makes sense when they see it. Really appreciate you helping me out, Anna.",
        "note": "Confirm the name, confirm the channel, exit clean. Follow up with the referral the same day while Anna's name is fresh.",
        "branches": [
          {
            "label": "Wrap up",
            "to": "graceful_exit_positive"
          }
        ]
      },
      "leave_info": {
        "label": "THEY'LL PASS IT ALONG",
        "say": "That works — it's Sam Parks, RapidEye. My number is [your number] and email is [your email]. If it helps, just let them know I work with a few other vacation rental managers in North County on their inspection workflows. Appreciate your help, Anna.",
        "note": "Don't rely on the callback. Plan to call back in 2-3 days and ask for the referred person directly.",
        "branches": []
      },
      "warm_discovery": {
        "label": "SHE'S WARM — DISCOVERY",
        "say": "Awesome. So just so I'm not wasting your time — what does the process look like right now after a guest checks out? Are your cleaners snapping photos during turnovers, or is someone going back in to inspect separately?",
        "note": "STOP PITCHING. Ask questions. You know they do clean plus inspect and have in-house Home Care Specialists. Let her describe it in her words. Listen for pain points.",
        "branches": [
          {
            "label": "Describes process — cleaners take photos",
            "to": "discovery_deeper"
          },
          {
            "label": "Describes process — separate inspection step",
            "to": "discovery_deeper"
          },
          {
            "label": "She's not deep in this — it's someone else's workflow",
            "to": "not_my_area"
          },
          {
            "label": "Starts asking about RapidEye / wants to know more",
            "to": "discovery_redirect"
          }
        ]
      },
      "discovery_deeper": {
        "label": "DIG INTO WORKFLOW",
        "say": "Got it. And when something does slip through — like a stain or something broken that the cleaner missed — how does that usually surface? Is it the guest calling in, or does your team catch it another way?",
        "note": "You're mapping their pain. Anna is Guest Services — she probably hears about missed issues from guests directly. Let her vent. The more she talks about the problem the more she'll want the solution.",
        "branches": [
          {
            "label": "Guest complaints — she feels this pain directly",
            "to": "validate_and_book"
          },
          {
            "label": "They catch most things internally",
            "to": "validate_and_book"
          },
          {
            "label": "Shifts to saying someone else should hear this",
            "to": "not_my_area"
          }
        ]
      },
      "discovery_redirect": {
        "label": "SHE WANTS TO KNOW MORE",
        "say": "Yeah for sure — so basically, whatever photos your cleaners or inspectors are already taking after turnovers, our system reviews them automatically and flags anything that's off. Damage, missing items, furniture moved, staging that doesn't match. No extra steps for your team. The PM companies we work with are catching stuff that was slipping through every single week.",
        "note": "Keep it brief. Don't demo on the phone. Steer toward booking a meeting where you can show them.",
        "branches": [
          {
            "label": "How does it work with Streamline?",
            "to": "streamline_question"
          },
          {
            "label": "Interested — wants to see it",
            "to": "validate_and_book"
          },
          {
            "label": "Let me talk to my team about this",
            "to": "not_my_area"
          }
        ]
      },
      "streamline_question": {
        "label": "STREAMLINE / TECH QUESTION",
        "say": "Great question — we plug into the tools you're already using, so there's no workflow change for your cleaners or inspectors. Honestly the best way to show you is with a quick walkthrough — takes like fifteen minutes. Would it make sense to loop in whoever handles the ops side? Maybe Agostina or Tala?",
        "note": "You know they use Streamline. Don't overpromise integration specifics on the phone. Use the tech question to bridge into booking a meeting with the right stakeholders.",
        "branches": [
          {
            "label": "Yeah let me check with them",
            "to": "book_meeting"
          },
          {
            "label": "Gives a name to include",
            "to": "book_meeting"
          },
          {
            "label": "I'll pass this along",
            "to": "send_email"
          }
        ]
      },
      "validate_and_book": {
        "label": "VALIDATE AND BOOK",
        "say": "Yeah — and honestly that's exactly why we built this. Would it make sense to set up a quick fifteen minutes so I can show you and whoever else would want to see it? I've got next Tuesday and Wednesday pretty open — what works better on your end?",
        "note": "Pick specific days. Lock it now. If she wants to include Tala, Agostina, or Nick, encourage it. Send the calendar invite while on the phone.",
        "branches": [
          {
            "label": "Picks a time",
            "to": "meeting_booked"
          },
          {
            "label": "Need to check with team first",
            "to": "anchor_and_follow_up"
          },
          {
            "label": "Just send me something first",
            "to": "send_email"
          },
          {
            "label": "Let me talk to Tala / Agostina / Nick first",
            "to": "referral_got_name"
          }
        ]
      },
      "anchor_and_follow_up": {
        "label": "ANCHOR A FOLLOW-UP",
        "say": "Totally fair. How about I pencil in something for later this week — say Thursday — and if you need to move it, no big deal. That way it's on the calendar and we're not playing phone tag. Sound good?",
        "note": "Don't let it end with 'I'll get back to you.' Anchor a tentative time. Easier to move a meeting than create one from scratch.",
        "branches": [
          {
            "label": "Agrees to tentative time",
            "to": "meeting_booked"
          },
          {
            "label": "Prefers email first",
            "to": "send_email"
          },
          {
            "label": "Noncommittal",
            "to": "send_email"
          }
        ]
      },
      "objection_not_interested": {
        "label": "NOT INTERESTED",
        "say": "Totally get it — I should've assumed you'd be all set. Otherwise you probably would've reached out to us. Just so nobody from my team cold calls you again — is it more that this isn't really a problem you guys deal with, or is it just that you hate cold calls? Because honestly I get it either way.",
        "note": "Agree first. Then split the objection. Separate reaction-to-cold-call from genuine disinterest. Most people soften here.",
        "branches": [
          {
            "label": "It's the cold call — softens up",
            "to": "test_drive"
          },
          {
            "label": "We don't really have that problem",
            "to": "test_drive"
          },
          {
            "label": "Genuinely not interested — done",
            "to": "graceful_exit"
          },
          {
            "label": "I'm not the right person for this",
            "to": "not_my_area"
          }
        ]
      },
      "objection_have_process": {
        "label": "ALREADY HAVE A PROCESS",
        "say": "That makes total sense — with fifty-plus homes you'd have to have something in place. Just out of curiosity — is it more that you're fully covered and everything's working great, or is it that switching anything right now would just be a headache?",
        "note": "They do inspect after each stay and have in-house cleaners. They probably DO have a process. Split the objection: happy or just stuck? If they name a specific tool, note it.",
        "branches": [
          {
            "label": "It's working fine",
            "to": "test_drive"
          },
          {
            "label": "Switching would be a pain",
            "to": "test_drive"
          },
          {
            "label": "Names a specific tool",
            "to": "test_drive"
          },
          {
            "label": "Hard no",
            "to": "graceful_exit"
          }
        ]
      },
      "test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally fair — you're probably not looking to buy anything right now and I respect that. But honestly, even if you never use us, I could walk you through what a couple other PM companies in San Diego are doing with their turnover photos. Worst case you steal some ideas and we part as friends. Would you be open to fifteen minutes just to see it?",
        "note": "Low pressure. The meeting has value even if they don't buy. You're offering industry intel not a sales pitch. If she's not the right person, pivot back to a referral.",
        "branches": [
          {
            "label": "Sure — let's do it",
            "to": "book_meeting"
          },
          {
            "label": "I'm not the right person but I could see someone being interested",
            "to": "referral_got_name"
          },
          {
            "label": "Email me and I'll think about it",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "graceful_exit"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next Tuesday and Wednesday pretty open — does morning or afternoon work better? And would it make sense to include anyone else from your team — maybe whoever handles the operations or inspection side?",
        "note": "Pick specific days. Get a time locked. Encourage her to bring Tala, Agostina, or Nick and Elisa. Send the invite while on the phone. Once booked STOP SELLING.",
        "branches": [
          {
            "label": "Picks a time",
            "to": "meeting_booked"
          },
          {
            "label": "Need to check schedules — will confirm",
            "to": "anchor_and_follow_up"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING BOOKED",
        "say": "Perfect — I'll shoot over a calendar invite right now so we're locked in. Really appreciate you taking my call, Anna. Talk to you then.",
        "note": "Send the invite immediately. Add any other stakeholders she mentioned. Stop selling. End warm.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most helpful to include so it's not just another generic pitch sitting in your inbox? Like, is it more about what other PM companies your size are doing, or more about how it'd actually plug into your current workflow?",
        "note": "Accept the email request but extract one piece of intel. Tailor the email to whatever she says. Include a specific meeting time suggestion. Confirm the email address.",
        "branches": [
          {
            "label": "Tells you what to include",
            "to": "email_confirmed"
          },
          {
            "label": "Just send whatever",
            "to": "email_confirmed"
          },
          {
            "label": "Gives you someone else's email instead",
            "to": "referral_got_name"
          }
        ]
      },
      "email_confirmed": {
        "label": "EMAIL FOLLOW-UP LOCKED",
        "say": "Got it — I'll send that over today. And I'll toss in a couple time options in case you want to hop on a quick call after. Appreciate your time, Anna.",
        "note": "Send the email within the hour. Personalize to Haustay — mention their scale, coastal properties, in-house cleaners, post-stay inspections. Include 2-3 specific time slots. Follow up by phone in 2-3 days.",
        "branches": []
      },
      "reschedule_confirmed": {
        "label": "RESCHEDULE LOCKED",
        "say": "Perfect — I'll try you then. Appreciate it, Anna.",
        "note": "Write down the exact day and time. Set a reminder. Call exactly when you said you would.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything ever comes up on the inspection side, I'm easy to find — Sam Parks, RapidEye. Appreciate your time, Anna.",
        "note": "Don't burn the bridge. Stay warm. Note the outcome in CRM. You can reach out to a different contact at Haustay or try again in 3-6 months.",
        "branches": []
      },
      "graceful_exit_positive": {
        "label": "POSITIVE EXIT — REFERRAL MADE",
        "say": "Thanks again, Anna — really appreciate the help. Have a good one.",
        "note": "Call the referral the same day. Open with: 'Hey [name], Anna on your team pointed me your way...' That warm intro changes everything.",
        "branches": []
      }
    }
  }
}