{
  "name": "Anne O'Donnell",
  "title": "Head of Guest Experience",
  "company": "Stay Duvet",
  "location": "Charleston, SC",
  "phone": "",
  "company_phone": "(843) 628-5327",
  "alt_phones": [
    "+1-843-628-3401",
    "+1-843-640-5837",
    "+1-843-306-8068",
    "+1-843-429-8611"
  ],
  "flow": {
    "context": "Anne O'Donnell is Head of Guest Experience at Stay Duvet, a high-touch STR operator in Charleston, SC managing 200-360+ properties across downtown Charleston and beach markets like Folly Beach, Isle of Palms, and Kiawah. She is the front-line escalation owner when missed turnover issues become guest complaints — a Vrbo review specifically names Anne handling a situation involving pests, loose hardware, and stained items, proving she personally firefights property-condition failures. Stay Duvet markets a 'Clean Duvet Guarantee' with pre/post-stay inspections and hotel-style standards, so every miss is amplified. They run proprietary internal software (possibly FeatherPMS-related) for owner dashboards and work orders, and distribute across Airbnb, Vrbo, Marriott, Booking.com, and AmEx. Strongest angle: Sam works with similar East Coast PM guest experience and ops teams running comparable luxury portfolios, and RapidEye's current East Coast client (600 properties) mirrors Stay Duvet's scale and pain.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Anne — I work with a few other guest experience teams at property managers up and down the East Coast, pretty similar setup to you guys at Stay Duvet. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Feet up on the desk energy. Casual, unhurried. Sound like you're calling someone who should already know you. Do not rush past the question — let her answer.",
        "branches": [
          {
            "label": "No / who?",
            "to": "heard_no"
          },
          {
            "label": "Yeah / maybe",
            "to": "heard_yes"
          },
          {
            "label": "Bad timing / busy",
            "to": "bad_timing"
          },
          {
            "label": "Skeptical / 'is this a sales call?'",
            "to": "permission_fallback"
          },
          {
            "label": "Gatekeeper answers",
            "to": "gatekeeper"
          }
        ]
      },
      "heard_no": {
        "label": "HAVEN'T HEARD — TRANSITION TO PAIN",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call — I was talking to another guest experience lead at a PM company running about 200 homes, pretty similar to Stay Duvet. And she was telling me how no matter how tight their turnover process is, stuff still slips through. A cleaner misses a stain on the sofa, there's a broken drawer handle, staging's off in a bedroom — and the first person who finds out is the guest. Then it's her phone blowing up trying to arrange a fix or a refund while the guest is already drafting the one-star review. And the brutal part? The photos were there the whole time. Someone just didn't catch it in the turnaround.",
        "note": "Paint the picture vividly — this IS Anne's daily life. She was literally named in a Vrbo review firefighting exactly this. PAUSE after 'someone just didn't catch it.' Let her react. Do NOT jump to the solution yet.",
        "branches": [
          {
            "label": "That resonates / 'yeah exactly'",
            "to": "warm_response"
          },
          {
            "label": "Silence or neutral — waiting",
            "to": "pitch_solution"
          },
          {
            "label": "Not interested / we're good",
            "to": "objection_not_interested"
          },
          {
            "label": "We already have a process for that",
            "to": "objection_have_process"
          }
        ]
      },
      "heard_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone in your exact role. What'd you hear?",
        "note": "Let her talk. Whatever she says, bridge to discovery or the pain trigger depending on how much she already knows.",
        "branches": [
          {
            "label": "Describes what RapidEye does",
            "to": "warm_response"
          },
          {
            "label": "Vague / not sure where",
            "to": "heard_no"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow, maybe in the afternoon?",
        "note": "Don't fight this. Be easy. Lock a specific callback time if possible.",
        "branches": [
          {
            "label": "Sure, try me then",
            "to": "callback_confirmed"
          },
          {
            "label": "What's this about?",
            "to": "heard_no"
          },
          {
            "label": "Don't call back",
            "to": "graceful_exit"
          }
        ]
      },
      "callback_confirmed": {
        "label": "CALLBACK SET",
        "say": "Perfect — I'll give you a ring tomorrow afternoon. Appreciate it, Anne.",
        "note": "Log the callback immediately with the specific time. Keep it short — don't oversell the callback.",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not relevant?",
        "note": "She's skeptical but hasn't hung up. Asking permission lowers resistance. If she gives you the 30 seconds, deliver the pain trigger with urgency — you're on a clock.",
        "branches": [
          {
            "label": "Fine, go ahead",
            "to": "heard_no"
          },
          {
            "label": "No / not interested",
            "to": "permission_denied"
          }
        ]
      },
      "permission_denied": {
        "label": "PERMISSION DENIED",
        "say": "Shoot — totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a terrible time, or is it more that you already know what we do and it's just not a fit?",
        "note": "Last chance. You're giving her an out while learning the real reason. If it's timing, you get a callback. If it's 'not a fit,' exit gracefully.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not a fit / not interested",
            "to": "graceful_exit"
          },
          {
            "label": "Wait — what do you do?",
            "to": "heard_no"
          }
        ]
      },
      "gatekeeper": {
        "label": "GATEKEEPER — FIRST ATTEMPT",
        "say": "Hey — could you get me through to Anne? It's Sam.",
        "note": "Minimal info. Sound like you belong. Don't explain, don't pitch. First name only for Anne.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Who is this / what's it about?",
            "to": "gatekeeper_context"
          },
          {
            "label": "She's not available",
            "to": "gatekeeper_not_available"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — ADD CONTEXT",
        "say": "Yeah — I work with a few other property managers in the Charleston area on their guest experience workflows. Would you mind letting her know it's Sam Parks?",
        "note": "Still no pitch. Just enough context to sound legitimate. End with a redirect question so you keep control.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "More pushback / what company?",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "She's not available",
            "to": "gatekeeper_not_available"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "Totally fair — we help a few other property management companies with their inspection workflows. I actually sent her a note already — would you mind just giving her a heads up that Sam from RapidEye called?",
        "note": "Third attempt is the ceiling. If this doesn't work, get a callback time or leave a message. Don't burn the gatekeeper relationship — they control access.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "I'll pass the message along",
            "to": "gatekeeper_message_left"
          },
          {
            "label": "Hard no",
            "to": "graceful_exit"
          }
        ]
      },
      "gatekeeper_not_available": {
        "label": "GATEKEEPER — NOT AVAILABLE",
        "say": "No worries — when's usually the best time to catch her? I'll try back then.",
        "note": "Get a specific time window. If they won't give one, ask to leave a message.",
        "branches": [
          {
            "label": "Gives a time",
            "to": "callback_confirmed"
          },
          {
            "label": "I'll have her call you back",
            "to": "gatekeeper_message_left"
          }
        ]
      },
      "gatekeeper_message_left": {
        "label": "MESSAGE LEFT WITH GATEKEEPER",
        "say": "Really appreciate that. It's Sam Parks — S-A-M, Parks like the parks. RapidEye. She can reach me at my number. Thanks so much.",
        "note": "Be warm to the gatekeeper. Spell your name. Log this and plan a follow-up call for the next day.",
        "branches": []
      },
      "warm_response": {
        "label": "THEY'RE WARM — STOP PITCHING, START ASKING",
        "say": "Yeah — it's a super common problem at your scale. So I'm curious, what does your inspection process actually look like right now between guests? Are your cleaners taking photos during turnovers, or is that a separate step?",
        "note": "She's engaged. Do NOT keep pitching. Ask questions and listen. You're trying to understand their current workflow — not sell. Let her talk about her world.",
        "branches": [
          {
            "label": "Describes their process / photos in turnovers",
            "to": "discovery_photo_workflow"
          },
          {
            "label": "We do pre and post-stay inspections",
            "to": "discovery_inspection_detail"
          },
          {
            "label": "It's kind of a mess / we're figuring it out",
            "to": "discovery_biggest_headache"
          },
          {
            "label": "We have our own internal system for that",
            "to": "discovery_proprietary_system"
          }
        ]
      },
      "discovery_photo_workflow": {
        "label": "DIG INTO PHOTO WORKFLOW",
        "say": "Got it — so when those photos come in, who's actually reviewing them? Is someone on your team going through each set in real time, or is it more like they're there if you need to go back and look after the fact?",
        "note": "You're looking for the gap: photos exist but nobody reviews them systematically or fast enough. That's the RapidEye opening.",
        "branches": [
          {
            "label": "Someone reviews them / we have a process",
            "to": "discovery_review_gap"
          },
          {
            "label": "Honestly nobody reviews them in real time",
            "to": "discovery_biggest_headache"
          },
          {
            "label": "Asks what RapidEye does",
            "to": "pitch_solution"
          }
        ]
      },
      "discovery_inspection_detail": {
        "label": "DIG INTO INSPECTION PROCESS",
        "say": "That's solid — I know you guys are big on that pre and post-stay inspection piece. At 200-plus homes though, how many turnovers is that a week during peak? And is that a dedicated inspection team, or are the cleaners doing double duty?",
        "note": "Stay Duvet promises inspections before and after each stay. You're probing whether that promise actually holds at scale. It almost never does perfectly — especially during Charleston's beach season.",
        "branches": [
          {
            "label": "It's a lot / hard to keep up at volume",
            "to": "discovery_biggest_headache"
          },
          {
            "label": "We have dedicated inspectors",
            "to": "discovery_review_gap"
          },
          {
            "label": "The cleaners handle it",
            "to": "discovery_review_gap"
          }
        ]
      },
      "discovery_proprietary_system": {
        "label": "THEY MENTION PROPRIETARY SYSTEM",
        "say": "Oh interesting — is that something you guys built in-house? I've actually heard Stay Duvet has some really solid internal tooling. So how does the photo piece work inside that — are photos getting flagged automatically for issues, or is it more of a manual review on your end?",
        "note": "Stay Duvet built proprietary ops software, possibly related to FeatherPMS. Don't be threatened by this — their system likely handles task management and work orders, not AI photo analysis. Find the gap between task management and photo intelligence.",
        "branches": [
          {
            "label": "It's manual / someone looks at them",
            "to": "discovery_review_gap"
          },
          {
            "label": "It flags some stuff automatically",
            "to": "discovery_review_gap"
          },
          {
            "label": "Photos are more for documentation / backup",
            "to": "discovery_biggest_headache"
          }
        ]
      },
      "discovery_review_gap": {
        "label": "SURFACE THE REVIEW GAP",
        "say": "That makes sense. So here's what I keep hearing from other guest experience leads at this scale — even when the photos are there and someone's reviewing them, at 200-plus properties with back-to-back turnovers, things still slip. It's just volume. And then the guest finds it first, and suddenly it's your problem to fix mid-stay. Is that something you're running into, or does your team feel like they're catching most of it?",
        "note": "Give her permission to admit the gap. She knows things slip — the Vrbo review proves it (pests, broken hardware, stained items). Most people in her role haven't been offered a real solution. Don't reference the review directly.",
        "branches": [
          {
            "label": "Yeah stuff definitely slips through",
            "to": "discovery_biggest_headache"
          },
          {
            "label": "We catch most of it / we're pretty good",
            "to": "pitch_solution_soft"
          },
          {
            "label": "Asks what you do about it",
            "to": "pitch_solution"
          }
        ]
      },
      "discovery_biggest_headache": {
        "label": "BIGGEST HEADACHE",
        "say": "Totally. So when something does slip through — what's the typical fallout for you? Is it mostly the guest calling in and you're scrambling to fix it same-day, or is it hitting reviews, or is it more the homeowner side asking why their place has damage nobody flagged?",
        "note": "Let her describe her pain in her own words. This is gold for the pitch and the follow-up email. Listen for specifics — types of issues, frequency, consequences, who she's answering to.",
        "branches": [
          {
            "label": "Guest complaints / scrambling to fix mid-stay",
            "to": "pitch_solution"
          },
          {
            "label": "Reviews getting hit",
            "to": "pitch_solution_reviews"
          },
          {
            "label": "Homeowner frustration / damage disputes",
            "to": "pitch_solution"
          },
          {
            "label": "All of the above",
            "to": "pitch_solution"
          }
        ]
      },
      "pitch_solution": {
        "label": "ONE-SENTENCE SOLUTION + CTA",
        "say": "Yeah — that's exactly why we built RapidEye. We plug into whatever system you're using for turnovers and automatically analyze the photos your team's already taking. It flags damage, missing items, staging issues — before the guest ever walks in. No workflow change on your cleaners' end. Would you be open to taking a look when I'm not cold calling you out of the blue?",
        "note": "One breath. Don't oversell. The CTA is a meeting, not a purchase. If she says yes, go straight to booking. Pause after the question.",
        "branches": [
          {
            "label": "Yeah I'd be open to that",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "How does it actually work?",
            "to": "explain_briefly"
          },
          {
            "label": "Not interested / we're good",
            "to": "objection_not_interested"
          },
          {
            "label": "Budget / not the right time",
            "to": "objection_no_budget"
          }
        ]
      },
      "pitch_solution_reviews": {
        "label": "SOLUTION — REVIEWS ANGLE",
        "say": "Yeah — and with the Clean Duvet Guarantee, the bar is even higher, right? A guest sees that promise and then finds a stain on the couch, it's not just a complaint — it's a broken promise. That's exactly what we built RapidEye to prevent. We analyze the turnover photos your team's already taking and flag anything off before the guest checks in. Stains, damage, missing items, staging issues. Would you be open to taking a quick look?",
        "note": "Tie directly to their brand promise. The Clean Duvet Guarantee raises guest expectations — misses hit harder. This is specific to Stay Duvet.",
        "branches": [
          {
            "label": "Yeah let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "Send me info first",
            "to": "send_email"
          },
          {
            "label": "How does it work?",
            "to": "explain_briefly"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "pitch_solution_soft": {
        "label": "SOFT PITCH — THEY FEEL COVERED",
        "say": "That's great — honestly that's rare at your scale. Most teams I talk to are drowning in photos nobody has time to actually review. We've been helping a few property managers on the East Coast — one running about 600 homes — basically automate that photo review so their team only sees the stuff that actually needs attention. It's been saving their guest experience people a ton of firefighting. Would it be worth a quick look just to see how it compares to what you've got?",
        "note": "Don't argue that they have problems. Acknowledge they're good, then make the meeting feel low-risk — 'just to compare.' Social proof from the 600-property East Coast client mirrors their scale.",
        "branches": [
          {
            "label": "Sure, I'd take a look",
            "to": "book_meeting"
          },
          {
            "label": "Send me info first",
            "to": "send_email"
          },
          {
            "label": "We're really happy with our process",
            "to": "objection_have_process"
          },
          {
            "label": "Not right now",
            "to": "objection_no_budget"
          }
        ]
      },
      "explain_briefly": {
        "label": "BRIEF EXPLANATION",
        "say": "Yeah totally — so your cleaners or inspectors take photos during turnovers, right? Those photos go into whatever system you're running. We connect to that and our AI scans every photo automatically — comparing against previous stays, flagging anything that changed. A new stain, a missing throw pillow, a dent in the wall, a broken handle — anything different. Your team gets a report before the next guest checks in. No extra steps for anyone in the field.",
        "note": "Keep it concrete and visual. Don't get into technical architecture unless she asks. Pivot back to the CTA after this.",
        "branches": [
          {
            "label": "That's interesting / I like that",
            "to": "book_meeting"
          },
          {
            "label": "What systems do you integrate with?",
            "to": "integration_question"
          },
          {
            "label": "What does it cost?",
            "to": "deflect_to_meeting"
          },
          {
            "label": "Who else is using this?",
            "to": "social_proof"
          }
        ]
      },
      "integration_question": {
        "label": "INTEGRATION QUESTION",
        "say": "We plug into Breezeway, Track, and a few others — but honestly we've been flexible with custom setups too. I know you guys have some pretty robust internal tooling at Stay Duvet. That's actually something we could dig into on a quick call — just to see if there's a clean way to connect. Would you be up for that?",
        "note": "Stay Duvet likely uses proprietary software. Don't overpromise integration without knowing their stack. Use this as a reason TO meet, not a blocker.",
        "branches": [
          {
            "label": "Yeah let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "I'd need to loop in someone from our ops/tech side",
            "to": "referral_technical"
          },
          {
            "label": "Send me info first",
            "to": "send_email"
          }
        ]
      },
      "social_proof": {
        "label": "SOCIAL PROOF",
        "say": "Yeah — we're working with a PM company in New York running about 200 luxury homes, another on the East Coast with around 600 properties, and a group out in Dubai. The luxury operators especially have been a strong fit because the stakes on missed damage are just so much higher — pretty similar to you guys with the hotel-style standards and the Clean Duvet Guarantee.",
        "note": "Match social proof to Stay Duvet's positioning: luxury, high standards, brand reputation. Then redirect to CTA.",
        "branches": [
          {
            "label": "That's compelling — let's talk",
            "to": "book_meeting"
          },
          {
            "label": "Send me more info",
            "to": "send_email"
          },
          {
            "label": "Still hesitant",
            "to": "sell_test_drive"
          }
        ]
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "Totally get it. I should've assumed you'd be all set — otherwise you probably would've reached out to us. Just so nobody from my team cold calls you again — is it that this just isn't a problem you're focused on right now, or is it more that you hate cold calls? Because honestly I get it either way.",
        "note": "Agree first — surprise her by not pushing back. Then split the objection to find out if it's a real 'no' or a reaction to the interruption.",
        "branches": [
          {
            "label": "It's the cold call / bad timing",
            "to": "recover_timing"
          },
          {
            "label": "We really don't need this",
            "to": "sell_test_drive"
          },
          {
            "label": "I'm not the right person for this",
            "to": "referral"
          },
          {
            "label": "Hard no / please stop calling",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_have_process": {
        "label": "OBJECTION — WE HAVE A PROCESS",
        "say": "That totally makes sense — at 200-plus properties with the standards you guys hold, you'd have to have something pretty dialed in. Just so I know — is it that you're fully covered and loving what you've got, or is it more that switching anything right now would just be a massive headache?",
        "note": "Acknowledge their scale and standards. Split the objection: 'happy' vs 'switching cost' are very different situations with different follow-ups.",
        "branches": [
          {
            "label": "We're happy with what we have",
            "to": "sell_test_drive"
          },
          {
            "label": "Switching would be too hard right now",
            "to": "sell_test_drive_no_switch"
          },
          {
            "label": "Actually it's not perfect...",
            "to": "warm_response"
          }
        ]
      },
      "objection_no_budget": {
        "label": "OBJECTION — NO BUDGET / NOT NOW",
        "say": "Totally get it. Nowadays it's harder to keep a tool you've already got, let alone buy something new. Just so I'm not bugging you — is it that budget this cycle is completely spoken for, or is it more that anything new has to go through a whole approval process with Michael and the team?",
        "note": "Agree and empathize. Drop Michael Gates (CEO) name naturally to show you know the org. Budget timing vs. approval process are different follow-up strategies.",
        "branches": [
          {
            "label": "Budget is locked for now",
            "to": "sell_test_drive"
          },
          {
            "label": "Approval process is painful",
            "to": "sell_test_drive"
          },
          {
            "label": "It's both",
            "to": "sell_test_drive"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally respect that. You're probably not buying this tomorrow, and I wouldn't expect you to. But what I've found is that when budget does free up or priorities shift — especially heading into summer season in Charleston — the people who move fastest are the ones who already know what's one, two, and three on their list. Would you be open to just taking a look? Worst case you see what other PM companies at your scale are doing with their turnover photos and you steal some ideas. We part as friends.",
        "note": "Reframe the meeting as free intel, not a sales commitment. Summer season is real pressure for Charleston STRs — high turnover volume, more damage, more guest complaints. Make the meeting feel zero-risk.",
        "branches": [
          {
            "label": "Alright fine — let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Maybe later, not now",
            "to": "recover_timing"
          },
          {
            "label": "No thanks",
            "to": "graceful_exit"
          }
        ]
      },
      "sell_test_drive_no_switch": {
        "label": "TEST DRIVE — NO SWITCHING NEEDED",
        "say": "Yeah and that's actually the thing — we don't replace anything. We plug into whatever your team is already using. No new app for your cleaners, no new workflow, no retraining. The photos they're already taking just get analyzed automatically. So it's less of a switch and more of a layer on top. Would it be worth a 15-minute look just to see if it fits?",
        "note": "Directly address the switching fear. RapidEye adds to their existing workflow, doesn't replace it. This is a key differentiator — especially for a company that built proprietary tooling they're proud of.",
        "branches": [
          {
            "label": "Okay that's different — let's talk",
            "to": "book_meeting"
          },
          {
            "label": "Send me info",
            "to": "send_email"
          },
          {
            "label": "I'd need to loop someone else in",
            "to": "referral_technical"
          },
          {
            "label": "Still no",
            "to": "graceful_exit"
          }
        ]
      },
      "recover_timing": {
        "label": "RECOVER — TIMING ISSUE",
        "say": "Totally fair. Would it be a terrible idea if I shot you a quick email and then tried you again in a couple weeks? That way you've got something to look at and it's not totally out of the blue next time.",
        "note": "Plant the seed for a warm follow-up. Get permission for email + callback. Any 'yes' here is a win.",
        "branches": [
          {
            "label": "Yeah send me an email",
            "to": "send_email"
          },
          {
            "label": "Sure, try me in a few weeks",
            "to": "callback_confirmed"
          },
          {
            "label": "No don't follow up",
            "to": "graceful_exit"
          }
        ]
      },
      "referral": {
        "label": "REFERRAL — WRONG PERSON",
        "say": "Oh totally — my bad. So who on your team would typically own the inspection workflow or the turnover quality piece? Is that more Charlene's world, or someone else?",
        "note": "You know Charlene Lambert is GM/Home Care — the most direct inspection owner. Drop her name naturally to show you've done homework. If Anne gives a different name, that's valuable intel. Robert Lambert (Chief Engineer) is another possibility.",
        "branches": [
          {
            "label": "Gives a name",
            "to": "referral_get_details"
          },
          {
            "label": "That would actually be me / it's shared",
            "to": "warm_response"
          },
          {
            "label": "Not sure / doesn't want to share",
            "to": "referral_push_gently"
          }
        ]
      },
      "referral_technical": {
        "label": "REFERRAL — NEED TECHNICAL PERSON",
        "say": "Makes total sense. Who would be the right person to bring into that conversation? I can put together something tailored for them so it actually lands when they look at it.",
        "note": "She might point you to whoever manages their proprietary system, Robert Lambert (Chief Engineer), or ops leadership. Get a name and ideally a warm intro.",
        "branches": [
          {
            "label": "Gives a name",
            "to": "referral_get_details"
          },
          {
            "label": "Let me check and get back to you",
            "to": "send_email"
          }
        ]
      },
      "referral_get_details": {
        "label": "GET REFERRAL DETAILS",
        "say": "Perfect — and what's the best way to reach them? If I can mention you pointed me their way, that'd go a long way so it doesn't land like another cold call.",
        "note": "Get name, title, email, phone if possible. Ask explicit permission to use Anne's name — this turns a cold outreach into a warm intro.",
        "branches": [
          {
            "label": "Gives contact info + permission to use her name",
            "to": "referral_confirmed"
          },
          {
            "label": "I'll forward your info to them",
            "to": "referral_passive"
          }
        ]
      },
      "referral_push_gently": {
        "label": "PUSH GENTLY FOR REFERRAL",
        "say": "No worries at all. If I can get just a name, I'll put something tailored together so it actually lands on their end. Even just a first name and I can take it from there.",
        "note": "One gentle push. If she won't share, don't force it — take whatever you can get and exit gracefully.",
        "branches": [
          {
            "label": "Gives a name",
            "to": "referral_get_details"
          },
          {
            "label": "Won't share",
            "to": "graceful_exit"
          }
        ]
      },
      "referral_confirmed": {
        "label": "REFERRAL CONFIRMED",
        "say": "Really appreciate that, Anne. I'll reach out to them and mention you pointed me their way. Thanks for taking my call — hope I didn't ruin your afternoon.",
        "note": "Be genuinely warm. She helped you. Log the referral immediately and follow up with the referred person same day while the conversation is fresh.",
        "branches": []
      },
      "referral_passive": {
        "label": "PASSIVE REFERRAL",
        "say": "That'd be awesome — I really appreciate it. And if it's easier, I'll shoot you a quick email with the key details so you can just forward it along. Sound good?",
        "note": "Make it effortless for her to forward. Send a clean, short email she can pass along without editing. Write it as if the recipient is seeing it fresh.",
        "branches": [
          {
            "label": "Sure send it over",
            "to": "send_email_for_referral"
          },
          {
            "label": "I'll just mention it to them",
            "to": "graceful_exit_warm"
          }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most useful to include so it's not just another generic vendor email sitting in your inbox? Is it more how it works technically, or more what other PM companies at your scale are actually seeing in terms of results?",
        "note": "Accept the email request immediately, then ask what to include. This gives you intel on what matters to her AND keeps the conversation going a few more seconds. Always include a specific meeting time suggestion in the email.",
        "branches": [
          {
            "label": "How it works / technical side",
            "to": "confirm_email_send"
          },
          {
            "label": "Results / what others are seeing",
            "to": "confirm_email_send"
          },
          {
            "label": "Just send whatever",
            "to": "confirm_email_send"
          }
        ]
      },
      "confirm_email_send": {
        "label": "CONFIRM EMAIL + PLANT MEETING SEED",
        "say": "Got it — I'll send that over today. I'll throw a couple time options on there too in case you want to hop on a quick call after you've had a chance to look at it. Best email — is it anne at stayduvet dot com?",
        "note": "Confirm the email address. Mentioning meeting times in the email normalizes the follow-up ask. If she gives a different email, note it for CRM.",
        "branches": [
          {
            "label": "Confirms email",
            "to": "email_confirmed"
          },
          {
            "label": "Gives different email",
            "to": "email_confirmed"
          }
        ]
      },
      "email_confirmed": {
        "label": "EMAIL CONFIRMED — WRAP UP",
        "say": "Perfect. I'll get that over to you today. Really appreciate you taking my call, Anne.",
        "note": "Send the email within 30 minutes of hanging up. Reference something specific from the conversation. Include 2 concrete meeting time options. Keep the email short — 4-5 sentences max.",
        "branches": []
      },
      "send_email_for_referral": {
        "label": "EMAIL FOR REFERRAL FORWARD",
        "say": "Perfect — I'll keep it super short and easy to forward. Really appreciate the help, Anne.",
        "note": "Write the email as if it's being forwarded to someone who has zero context. 3-4 sentences max. Include one pain-relevant line specific to Stay Duvet and a clear CTA.",
        "branches": []
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome — let me grab my calendar real quick. I've got next Tuesday and Thursday pulled up — do you have 15 minutes either afternoon? Like 2 o'clock?",
        "note": "Pick specific days and a specific time. Don't say 'when works for you' — that creates decision fatigue. Offer two options. Send the calendar invite while still on the phone if possible.",
        "branches": [
          {
            "label": "Picks a time",
            "to": "meeting_booked"
          },
          {
            "label": "Suggests a different time",
            "to": "meeting_booked"
          },
          {
            "label": "Let me check my calendar and get back to you",
            "to": "meeting_followup"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING BOOKED — STOP SELLING",
        "say": "Perfect — I'll send over a calendar invite right now so you've got it. Really appreciate you taking my call, Anne. Talk to you then.",
        "note": "STOP SELLING. The meeting is booked. Send the invite immediately. Do not add more pitch, more features, more value props. Short and warm. You won.",
        "branches": []
      },
      "meeting_followup": {
        "label": "MEETING NOT LOCKED — GET EMAIL",
        "say": "Totally — I'll shoot you an email with a couple options. What's the best email for the invite?",
        "note": "She's interested but not committing on the spot. Get the email and send the calendar options within the hour. Follow up if no response within 24 hours.",
        "branches": [
          {
            "label": "Gives email",
            "to": "email_confirmed"
          }
        ]
      },
      "deflect_to_meeting": {
        "label": "DEFLECT PRICING TO MEETING",
        "say": "Yeah — honestly it depends a lot on portfolio size and how you're set up operationally. That's actually one of the things I'd walk through on a quick call so I can give you something real instead of a range that doesn't mean anything. Would you have 15 minutes this week or next?",
        "note": "Never quote pricing on a cold call. Use it as a reason to meet. Be honest about why — it genuinely does depend on their setup, volume, and integration.",
        "branches": [
          {
            "label": "Okay let's set it up",
            "to": "book_meeting"
          },
          {
            "label": "Just ballpark me",
            "to": "deflect_to_meeting_firm"
          },
          {
            "label": "Send me info with pricing",
            "to": "send_email"
          }
        ]
      },
      "deflect_to_meeting_firm": {
        "label": "FIRM ON DEFLECTING PRICE",
        "say": "I hear you — I just don't want to throw out a number that's way off. For a portfolio your size it's not going to break the bank, but the right number really depends on turnover volume and your setup. Fifteen minutes and I can give you something actually accurate. How's your calendar looking this week?",
        "note": "Hold firm but respectfully. Don't make it sound like you're hiding the price — make it sound like you want to be accurate and fair.",
        "branches": [
          {
            "label": "Fine let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Send me info",
            "to": "send_email"
          },
          {
            "label": "Not now",
            "to": "graceful_exit"
          }
        ]
      },
      "graceful_exit_warm": {
        "label": "WARM GRACEFUL EXIT",
        "say": "Really appreciate it, Anne. If anything ever comes up where this is relevant, I'm super easy to find. Have a great rest of your day.",
        "note": "She was helpful or polite — match that energy. Don't burn the bridge. She may come back, or you may reach her through another contact at Stay Duvet.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes, I'm easy to find. Appreciate your time, Anne.",
        "note": "Don't push further. Leave a good impression. You have other contacts at Stay Duvet — Charlene Lambert, Robert Lambert, Seth Reeves, Michael Gates. This isn't the only path in.",
        "branches": []
      }
    }
  }
}