{
  "name": "Ben Wolff",
  "title": "Managing Partner & General Manager",
  "company": "Frias Properties of Aspen Snowmass",
  "location": "Aspen, CO",
  "phone": "+1-970-429-2435",
  "company_phone": "+1-970-920-2000",
  "alt_phones": [],
  "flow": {
    "context": "Ben Wolff is Managing Partner & General Manager at Frias Properties of Aspen Snowmass — 130+ luxury vacation rentals across Aspen and Snowmass Village. He was promoted from Director of Operations to GM, then became Managing Partner in Jan 2024, so he's been in the top seat about two years and oversees ALL operations. They run on Streamline for PMS and work orders. They expanded into Snowmass in 2023 (Chamonix, Homestead, The Enclave, Owl Creek), meaning more units, more turnovers, more photo volume. Sam's strongest hook: he was just skiing in Jackson Hole last month and works with resort-market property managers — that's a natural bridge into Ben's world.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Ben — bit of a random one. I was just out in Jackson Hole last month skiing and got to talking with a couple resort property managers about how they're handling turnover inspections. Frias kept coming up as one of the bigger operations in the Aspen-Snowmass market. It's Sam Parks with RapidEye — have you heard the name tossed around at all?",
        "note": "Ski connection is real — Sam was at Jackson Hole Jan 2026. Sound casual, like you're calling someone a mutual friend mentioned. Feet up on the desk energy.",
        "branches": [
          {
            "label": "No, haven't heard of you",
            "to": "heard_no"
          },
          {
            "label": "Yeah I have / maybe",
            "to": "heard_yes"
          },
          {
            "label": "Who is this? / What's this about?",
            "to": "clarify_who"
          },
          {
            "label": "Now's not a good time",
            "to": "bad_timing"
          }
        ]
      },
      "heard_no": {
        "label": "HAVEN'T HEARD — TRANSITION TO PAIN",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call — I've been working with another GM running a luxury rental operation, similar setup to you guys, maybe 120 units across a couple zones. And the thing he kept hitting was that his housekeeping teams were taking photos every single turnover like they're supposed to, but nobody actually had time to sit and review all of them. They'd just pile up. The only time someone looked was after a guest complained or an owner called about damage that'd been there for three turnovers. And with you guys expanding into Snowmass a couple years ago — Chamonix, The Enclave, all those — I'd imagine that photo volume only went up. We built something that plugs right into Streamline and uses AI to actually analyze those turnover photos automatically — flags damage, missing items, staging issues — without anyone changing what they're already doing. Would you be open to taking a look sometime when I'm not cold calling you out of the blue?",
        "note": "Reference Streamline and Snowmass expansion — shows you did homework. PAUSE after the pain description before the CTA. Let him sit with it.",
        "branches": [
          {
            "label": "Sure / yeah let's take a look",
            "to": "book_meeting"
          },
          {
            "label": "Sounds interesting, tell me more",
            "to": "discovery_warm"
          },
          {
            "label": "We already have a process for that",
            "to": "objection_have_process"
          },
          {
            "label": "Not really interested / we're good",
            "to": "objection_not_interested"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          },
          {
            "label": "No budget right now",
            "to": "objection_no_budget"
          }
        ]
      },
      "heard_yes": {
        "label": "THEY'VE HEARD OF RAPIDEYE",
        "say": "Oh nice — well normally we'd be working with someone like you. What'd you hear?",
        "note": "Let them talk. Whatever they say, pivot to discovery or pain trigger based on what they share.",
        "branches": [
          {
            "label": "Heard good things / someone mentioned it",
            "to": "discovery_warm"
          },
          {
            "label": "Vaguely / not sure",
            "to": "heard_no"
          },
          {
            "label": "Heard of you but not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "clarify_who": {
        "label": "WHO IS THIS / WHAT'S THIS ABOUT",
        "say": "Yeah totally — I mean it is a cold call, I'll be honest. Can I get 30 seconds to tell you why I reached out? And you can totally hang up on me if it's not relevant.",
        "note": "Disarm with honesty. Most people respect the candor and will give you 30 seconds.",
        "branches": [
          {
            "label": "Sure, go ahead",
            "to": "pain_trigger_short"
          },
          {
            "label": "No thanks / not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again later this week? Maybe Thursday or Friday?",
        "note": "Don't apologize too much. Suggest specific days. If they give you a time, lock it in.",
        "branches": [
          {
            "label": "Sure, try me Thursday/Friday",
            "to": "callback_locked"
          },
          {
            "label": "What's this about? (curious)",
            "to": "pain_trigger_short"
          },
          {
            "label": "No, don't call back",
            "to": "permission_rejected"
          }
        ]
      },
      "callback_locked": {
        "label": "CALLBACK SCHEDULED",
        "say": "Perfect — I'll try you Thursday afternoon. And just so you have context when I call back, we help property managers like you automatically review turnover photos for damage and issues using AI. Talk then, Ben.",
        "note": "Plant the seed so when you call back he has context. Keep it to one sentence. Don't oversell.",
        "branches": []
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED — SPLIT THE OBJECTION",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you've already got this handled and it's just not interesting?",
        "note": "Give him two options. 'Horrible time' reopens the door for a callback. 'Already handled' tells you they have a process you can probe.",
        "branches": [
          {
            "label": "It's a bad time",
            "to": "bad_timing"
          },
          {
            "label": "We've got it handled / not interesting",
            "to": "last_chance_value"
          },
          {
            "label": "Just take me off your list",
            "to": "ending_graceful"
          }
        ]
      },
      "pain_trigger_short": {
        "label": "30-SECOND PAIN TRIGGER",
        "say": "Appreciate it. So quick version — I work with a handful of luxury vacation rental operators, and the thing that keeps coming up is the photo problem. Housekeeping takes hundreds of photos every week during turnovers, but nobody has time to actually look at them all. Stuff slips through — a stain on a couch, a missing throw pillow, a crack in a countertop — and the first person who notices is the guest. Or worse, the owner. We built an AI that plugs into Streamline — which I know you guys use — and reviews those photos automatically. Flags anything off. No workflow change. Would it make sense to take a quick look?",
        "note": "This is the compressed version. Still hit Streamline and the specific photo-pile-up pain. Watch for engagement cues.",
        "branches": [
          {
            "label": "Sure / that's interesting",
            "to": "discovery_warm"
          },
          {
            "label": "We already have something for that",
            "to": "objection_have_process"
          },
          {
            "label": "Not a priority right now",
            "to": "objection_not_interested"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          }
        ]
      },
      "discovery_warm": {
        "label": "THEY'RE WARM — STOP PITCHING, ASK QUESTIONS",
        "say": "Cool — so I don't want to just pitch at you. Can I ask — what does your turnover inspection process actually look like right now across the Aspen and Snowmass properties? Are your housekeeping teams doing photo documentation on every turn?",
        "note": "STOP SELLING. You're in discovery. Let Ben talk. Listen for: who reviews photos, how often things get missed, what happens when damage is caught late, pain with owners. He's a GM — he'll talk operations if you let him.",
        "branches": [
          {
            "label": "Describes their process (photos, checklists, etc.)",
            "to": "discovery_dig_deeper"
          },
          {
            "label": "Yeah we do photos but it's not great",
            "to": "discovery_pain_confirmed"
          },
          {
            "label": "Chris or Zane handles that / not my area day-to-day",
            "to": "referral_to_ops"
          },
          {
            "label": "Manuel/Isidra/housekeeping team runs it",
            "to": "referral_to_housekeeping"
          }
        ]
      },
      "discovery_dig_deeper": {
        "label": "DIG DEEPER ON PROCESS",
        "say": "Got it. And when those photos come in — who's actually reviewing them? Is someone on your ops team going through each set, or is it more of a spot-check situation?",
        "note": "You're looking for the gap: photos exist but nobody reviews them systematically. That's where RapidEye lives.",
        "branches": [
          {
            "label": "Nobody reviews all of them / spot checks only",
            "to": "discovery_pain_confirmed"
          },
          {
            "label": "We have inspectors / someone reviews them",
            "to": "discovery_inspector_process"
          },
          {
            "label": "We use Streamline work orders for issues",
            "to": "discovery_streamline_deep"
          }
        ]
      },
      "discovery_pain_confirmed": {
        "label": "PAIN CONFIRMED — BRIDGE TO MEETING",
        "say": "Yeah, that's exactly what we keep hearing. And at 130-plus units — especially with luxury owners in Aspen who expect everything to be perfect — the stuff that slips through the cracks ends up being expensive. Either it's a damage deposit dispute, or a one-star review, or an owner pulling their property. What we could do is run a pilot on a handful of your properties — maybe one of the Snowmass buildings — and just show you what the AI catches that your current process doesn't. No commitment. Would that be worth 20 minutes to walk through?",
        "note": "Mirror his pain back, then tie it to business consequences he cares about as Managing Partner. Offer the pilot as low-risk.",
        "branches": [
          {
            "label": "Yeah let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "What would that look like?",
            "to": "explain_pilot"
          },
          {
            "label": "I'd need to loop in Chris/Zane",
            "to": "referral_to_ops_with_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          }
        ]
      },
      "discovery_inspector_process": {
        "label": "THEY HAVE INSPECTORS",
        "say": "That's solid. And how's that scaling with the Snowmass expansion? Are those inspectors covering both Aspen and Snowmass, or do you have separate teams? I ask because the companies I work with who do have inspectors — the issue isn't that they're bad, it's that they physically can't look at every photo from every turn, especially during peak season.",
        "note": "Don't dismiss their process. Acknowledge it, then plant the seed that it doesn't scale — especially with the Snowmass growth.",
        "branches": [
          {
            "label": "Yeah peak season is rough / hard to keep up",
            "to": "discovery_pain_confirmed"
          },
          {
            "label": "We've got it covered",
            "to": "objection_have_process"
          },
          {
            "label": "It's split between zones",
            "to": "discovery_pain_confirmed"
          }
        ]
      },
      "discovery_streamline_deep": {
        "label": "STREAMLINE WORKFLOW DISCUSSION",
        "say": "Nice — yeah, I know you guys run work orders through Streamline. The thing we've seen is that Streamline's great for tracking the work order once someone creates it, but the gap is between the photo being taken and someone noticing there's an issue to create the work order in the first place. That's the part we automate. Would it make sense to show you how that connects? It's like a 20-minute walkthrough.",
        "note": "Use their own system against the gap. Streamline handles work orders but doesn't analyze photos. That's the wedge.",
        "branches": [
          {
            "label": "Yeah that makes sense / let's look",
            "to": "book_meeting"
          },
          {
            "label": "How does it integrate with Streamline?",
            "to": "explain_integration"
          },
          {
            "label": "I'd need Chris or Zane for this",
            "to": "referral_to_ops"
          }
        ]
      },
      "explain_integration": {
        "label": "INTEGRATION EXPLANATION",
        "say": "So basically, we connect to the photo feed that's already flowing through your system. Your cleaners or inspectors take photos the same way they always do — nothing changes for them. Our AI reviews every image and flags anything that looks off — damage, missing items, staging problems, maintenance issues. Then it either creates the alert or feeds it back into your workflow so the right person sees it. The whole point is zero behavior change on your team's end. Would it be easier to just show you? I can pull up a quick demo — takes 20 minutes.",
        "note": "Keep it simple. He's a GM, not a technical buyer. Show, don't tell.",
        "branches": [
          {
            "label": "Sure, let's schedule it",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Loop in my ops team",
            "to": "referral_to_ops"
          }
        ]
      },
      "explain_pilot": {
        "label": "EXPLAIN THE PILOT",
        "say": "Super simple — we'd connect to your existing photo workflow, pick a handful of properties, and run the AI on your actual turnover photos for a couple weeks. You'd see exactly what it catches — damage your team missed, staging inconsistencies, maintenance flags. No cost for the pilot. At the end you'd have a clear picture of whether this saves you time and money. Would it make sense to walk through the details? I've got next Tuesday or Wednesday open.",
        "note": "Make the pilot sound zero-risk. Then immediately anchor to specific days.",
        "branches": [
          {
            "label": "Tuesday/Wednesday works",
            "to": "meeting_booked"
          },
          {
            "label": "Let me check my calendar / what time?",
            "to": "book_meeting"
          },
          {
            "label": "I'd want Chris or Zane in on this",
            "to": "referral_to_ops_with_meeting"
          }
        ]
      },
      "objection_have_process": {
        "label": "OBJECTION — WE HAVE A PROCESS",
        "say": "That makes total sense — with 130-plus luxury units you'd have to have something dialed in. And honestly, it'd be weird if you didn't. Just so I'm not bugging you unnecessarily — is it that you're fully covered and nothing's slipping through, or is it more that what you have works well enough and switching anything right now would be a headache?",
        "note": "Agree first. Then split. 'Nothing's slipping through' is almost impossible to say honestly at 130+ units. 'Works well enough' opens the door to improvement.",
        "branches": [
          {
            "label": "Things do slip through / it's not perfect",
            "to": "wedge_improvement"
          },
          {
            "label": "We're pretty buttoned up",
            "to": "last_chance_value"
          },
          {
            "label": "Switching would be a pain",
            "to": "no_switch_needed"
          }
        ]
      },
      "wedge_improvement": {
        "label": "WEDGE — IMPROVEMENT ANGLE",
        "say": "Yeah — and that's exactly where we live. We're not replacing your process. We're the layer on top that catches what humans miss. Think of it like a second set of eyes on every single turnover, every single time. The GM I mentioned earlier — he said the thing that sold him was when we caught a water stain under a bathroom vanity in the photo his cleaner took but nobody flagged. Turned out to be an active leak. Would've been a fifteen-thousand-dollar problem if a guest hadn't checked in for another week. Would it be worth seeing what it'd catch in your portfolio? Even just to know?",
        "note": "Specific damage story. Make it visceral. Water damage in a luxury Aspen property is a nightmare scenario for a Managing Partner.",
        "branches": [
          {
            "label": "Yeah let's take a look",
            "to": "book_meeting"
          },
          {
            "label": "Who else are you working with?",
            "to": "social_proof"
          },
          {
            "label": "Send me info",
            "to": "send_email"
          }
        ]
      },
      "no_switch_needed": {
        "label": "NO SWITCHING REQUIRED",
        "say": "Totally — and that's actually the thing. We don't replace anything. Your team keeps using Streamline, keeps taking photos the same way. We just sit on top and review what's already being captured. Zero workflow change. That's actually why most companies we work with were willing to test it — there's nothing to rip out. Would you be open to a quick look? Worst case you see what's out there and we part as friends.",
        "note": "Eliminate the switching fear. Reinforce that it's additive, not replacement.",
        "branches": [
          {
            "label": "Sure, let's look",
            "to": "book_meeting"
          },
          {
            "label": "Still not the right time",
            "to": "last_chance_value"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          }
        ]
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "I totally get it. Honestly, I should've assumed you'd be all set — otherwise you probably would've reached out yourself. Just so nobody from my team cold calls you again — is it that this isn't a problem you're focused on right now, or is it more that you just hate cold calls? Totally fair either way.",
        "note": "Agree. Don't fight. The split gives him a face-saving way to re-engage. Most people will say 'I just hate cold calls' which reopens the door.",
        "branches": [
          {
            "label": "I just hate cold calls / bad timing",
            "to": "reopen_from_hate_calls"
          },
          {
            "label": "Not a problem we're focused on",
            "to": "last_chance_value"
          },
          {
            "label": "Take me off your list",
            "to": "ending_graceful"
          }
        ]
      },
      "reopen_from_hate_calls": {
        "label": "REOPEN — THEY HATE COLD CALLS",
        "say": "Ha — honestly, same. I'd rather be skiing. Look, the only reason I'm calling is that what we built is genuinely saving property managers hours a week and catching stuff that costs them thousands. Would you be open to just seeing it in a quick email? I'll make it specific to your setup — Streamline, luxury units, the Snowmass expansion — so it's not just generic noise.",
        "note": "Match his energy. Be human. The skiing comment ties back to the opener. Pivot to email as lower friction.",
        "branches": [
          {
            "label": "Sure, send me something",
            "to": "send_email"
          },
          {
            "label": "Fine, give me the quick version now",
            "to": "pain_trigger_short"
          },
          {
            "label": "No thanks",
            "to": "ending_graceful"
          }
        ]
      },
      "objection_no_budget": {
        "label": "OBJECTION — NO BUDGET",
        "say": "Totally get it. Nowadays it's harder to keep a tool, let alone buy something new. And I'm not trying to sell you anything today. Just so I understand — is it that budget for this year is completely locked, or is it more that anything new you try to bring in has to go through a whole approval process?",
        "note": "Agree and split. If budget is locked, sell the future. If it's approval process, offer to help build the case.",
        "branches": [
          {
            "label": "Budget is locked / end of year",
            "to": "sell_the_future"
          },
          {
            "label": "Everything goes through approval",
            "to": "sell_the_future"
          },
          {
            "label": "We're just not spending on anything new",
            "to": "last_chance_value"
          }
        ]
      },
      "sell_the_future": {
        "label": "SELL THE FUTURE — PLANT THE SEED",
        "say": "Makes total sense. Here's my thinking though — the people who end up moving fastest when budget does open up are the ones who already know what's first on their list. Would you be open to a quick walkthrough — not to buy anything, just so you know what's out there? That way when the time comes, you're not starting from scratch. Plus I can show you what other resort-market PMs are doing with their turnover photos. Worst case you steal some ideas.",
        "note": "Remove all buying pressure. Frame the meeting as intelligence gathering. The 'steal some ideas' line gives him a reason to say yes without committing to anything.",
        "branches": [
          {
            "label": "Alright, let's take a look",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "ending_graceful"
          }
        ]
      },
      "social_proof": {
        "label": "SOCIAL PROOF — WHO ELSE",
        "say": "Yeah — so we're working with a luxury property management company in New York, about 200 homes, similar vibe to you guys — high-end units, demanding owners, lots of turnover volume. Also a group on the East Coast running around 600 properties, and an operator in Dubai with about 100. The common thread is they all had the same problem — photos being taken, nobody reviewing them, and expensive stuff getting missed. The New York company told us they caught more in the first month with us than their inspectors caught in the prior quarter.",
        "note": "Don't name-drop clients by name unless you have permission. Give enough detail to be credible — city, size, luxury positioning.",
        "branches": [
          {
            "label": "Interesting — let's set up a time",
            "to": "book_meeting"
          },
          {
            "label": "How much does it cost?",
            "to": "deflect_pricing"
          },
          {
            "label": "Send me a case study",
            "to": "send_email"
          }
        ]
      },
      "deflect_pricing": {
        "label": "DEFLECT PRICING — SELL THE MEETING",
        "say": "Honestly it depends on the portfolio size and how you'd want to roll it out — I don't want to throw a number at you without understanding your setup. That's actually the main thing I'd want to walk through. Would it make sense to grab 20 minutes? I can show you exactly what it does, and if it makes sense we can talk numbers then. If not, no hard feelings.",
        "note": "Never give pricing on a cold call. Always redirect to the meeting. The meeting is the product you're selling right now.",
        "branches": [
          {
            "label": "Sure, let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Just ballpark me",
            "to": "deflect_pricing_firm"
          },
          {
            "label": "Send me info with pricing",
            "to": "send_email"
          }
        ]
      },
      "deflect_pricing_firm": {
        "label": "FIRM ON PRICING — REDIRECT AGAIN",
        "say": "I hear you. Ballpark, most companies our size pay less per month than a single missed damage claim costs them. But honestly the number doesn't mean much until you see what it catches on your actual photos. Twenty minutes — I'll show you real examples, and if the math doesn't work I'll tell you that myself. Fair?",
        "note": "Give a soft anchor without a number. Redirect to the demo one more time. If he still pushes, give a rough range and book the meeting.",
        "branches": [
          {
            "label": "Alright, let's do 20 minutes",
            "to": "book_meeting"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "ending_graceful"
          }
        ]
      },
      "last_chance_value": {
        "label": "LAST CHANCE — OFFER OF VALUE",
        "say": "Totally respect that. If nothing else — I've been talking to a lot of property managers in resort markets, and I've got a pretty good picture of what the best operators are doing with their turnover documentation. Happy to share what I've seen — not a pitch, just what's working for companies similar to yours. And if it's ever relevant, you've got my number. Fair enough?",
        "note": "This is your last swing. Offer value with zero pressure. If he bites, pivot to email or a quick call. If not, exit gracefully.",
        "branches": [
          {
            "label": "Sure, send me what you've got",
            "to": "send_email"
          },
          {
            "label": "Appreciate it, not right now",
            "to": "ending_graceful"
          },
          {
            "label": "Actually, tell me more",
            "to": "discovery_warm"
          }
        ]
      },
      "referral_to_ops": {
        "label": "REFERRAL — TO OPS DIRECTORS",
        "say": "Totally makes sense — you've got a lot on your plate. Would it be Chris Longden or Zane Strickland who'd own something like this on the operations side? I want to make sure I'm reaching out to the right person so it actually lands.",
        "note": "You already know Chris (East Aspen) and Zane (West Aspen) are Directors of Operations. Dropping their names shows you've done homework and makes the referral feel warm.",
        "branches": [
          {
            "label": "Yeah talk to Chris / Zane",
            "to": "referral_get_intro"
          },
          {
            "label": "Actually it'd be me, I just need more info",
            "to": "discovery_warm"
          },
          {
            "label": "Talk to Manuel / housekeeping team",
            "to": "referral_to_housekeeping"
          },
          {
            "label": "I'll pass it along internally",
            "to": "referral_internal_pass"
          }
        ]
      },
      "referral_to_ops_with_meeting": {
        "label": "REFERRAL — INCLUDE OPS IN MEETING",
        "say": "Love that idea. Would it be Chris Longden or Zane Strickland who should be on the call? I can send an invite to all three of you — that way we knock it out in one go.",
        "note": "Upgrade the single meeting to a group meeting. More decision makers in the room equals a faster deal. Get emails confirmed.",
        "branches": [
          {
            "label": "Yeah include Chris / Zane / both",
            "to": "book_meeting"
          },
          {
            "label": "Let me check with them first",
            "to": "referral_internal_pass"
          }
        ]
      },
      "referral_to_housekeeping": {
        "label": "REFERRAL — TO HOUSEKEEPING",
        "say": "That makes sense — Manuel Nava or Isidra Santos would probably see this from the day-to-day side, right? Would it make sense for me to reach out to one of them directly, or would it be better coming as an intro from you?",
        "note": "Housekeeping managers are closer to the photo workflow. An intro from Ben is gold. Push gently for it.",
        "branches": [
          {
            "label": "I'll intro you / reach out to Manuel or Isidra",
            "to": "referral_get_intro"
          },
          {
            "label": "Yeah just call them directly",
            "to": "referral_direct_contact"
          },
          {
            "label": "Let me talk to them first",
            "to": "referral_internal_pass"
          }
        ]
      },
      "referral_get_intro": {
        "label": "GET THE INTRO",
        "say": "That'd be huge, Ben. I'll shoot you a quick email with a two-liner they can look at — makes it easy for you to just forward. What's the best email for you — is it Ben at FriasProperties dot com?",
        "note": "Confirm his email. Make the intro effortless for him — you'll write the forwardable email. This is the best outcome if he's not the direct evaluator.",
        "branches": [
          {
            "label": "Yeah that's my email / confirms",
            "to": "referral_confirmed"
          },
          {
            "label": "Use a different email",
            "to": "referral_confirmed"
          }
        ]
      },
      "referral_internal_pass": {
        "label": "THEY'LL PASS IT ALONG",
        "say": "Appreciate that. Would it be helpful if I sent you a quick one-pager you can forward? That way it's not just 'some guy called' — they'd have context. And is Ben at FriasProperties dot com the best email?",
        "note": "An internal pass without material usually dies. Give him something concrete to forward. Confirm email.",
        "branches": [
          {
            "label": "Yeah send it over",
            "to": "referral_confirmed"
          },
          {
            "label": "I'll just mention it to them",
            "to": "referral_confirmed"
          }
        ]
      },
      "referral_direct_contact": {
        "label": "DIRECT CONTACT FOR REFERRAL",
        "say": "Perfect. And would it be cool if I mentioned you pointed me their way? Just so it doesn't feel like a totally random cold call for them.",
        "note": "Getting permission to use Ben's name turns the next call into a warm lead. This is critical.",
        "branches": [
          {
            "label": "Yeah sure / go ahead",
            "to": "referral_confirmed"
          },
          {
            "label": "Rather you didn't",
            "to": "referral_confirmed"
          }
        ]
      },
      "referral_confirmed": {
        "label": "REFERRAL LOCKED",
        "say": "Really appreciate it, Ben. I'll send that over today and keep it tight. And if you ever want to see it yourself — my line's always open. Thanks for your time.",
        "note": "Exit clean. Send the email within the hour. Follow up with the referral contact within 24 hours.",
        "branches": []
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next week pulled up — how does Tuesday or Wednesday look for you? I just need 20 minutes.",
        "note": "Pick two specific days. Don't say 'when works for you' — that's too open. Lock in the day, then the time. Send the invite WHILE on the phone.",
        "branches": [
          {
            "label": "Tuesday works / picks a day",
            "to": "meeting_booked"
          },
          {
            "label": "What time?",
            "to": "meeting_pick_time"
          },
          {
            "label": "Next week is packed / later",
            "to": "meeting_push_later"
          }
        ]
      },
      "meeting_pick_time": {
        "label": "PICK A TIME",
        "say": "How's 10 AM Mountain Time? Or if afternoon works better, I could do 2 PM.",
        "note": "He's in Aspen — Mountain Time. Offer two options. Morning tends to work better for ops people before the day gets chaotic.",
        "branches": [
          {
            "label": "Picks a time",
            "to": "meeting_booked"
          },
          {
            "label": "Different time",
            "to": "meeting_booked"
          }
        ]
      },
      "meeting_push_later": {
        "label": "PUSH TO FOLLOWING WEEK",
        "say": "No worries — how about the week after? I can work around your schedule. I just want to make sure we get it on the calendar so it doesn't fall through the cracks.",
        "note": "Don't let it stay vague. Push for a specific date even if it's further out. A booked meeting beats a 'maybe later.'",
        "branches": [
          {
            "label": "Picks a date",
            "to": "meeting_booked"
          },
          {
            "label": "Just email me and we'll figure it out",
            "to": "send_email"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING CONFIRMED",
        "say": "Locked in. I'll send over a calendar invite right now so you've got it. And Ben — I really appreciate you taking my call. This won't be a waste of your time. Talk soon.",
        "note": "STOP SELLING. Send the invite immediately. Don't add anything else. End on a high note. He said yes — leave it there.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most useful to include so it's not just another generic pitch sitting in your inbox? Like, is it more about how it connects to Streamline, what it actually catches, ROI numbers — what would make you actually open it?",
        "note": "Don't just accept 'send me an email' and hang up. Ask what to include — it re-engages them AND tells you what they care about.",
        "branches": [
          {
            "label": "Tells you what they want to see",
            "to": "send_email_confirm"
          },
          {
            "label": "Just send me whatever / general info",
            "to": "send_email_confirm"
          },
          {
            "label": "Actually, just tell me now",
            "to": "discovery_warm"
          }
        ]
      },
      "send_email_confirm": {
        "label": "EMAIL CONFIRMED",
        "say": "Got it — I'll send that over today. Ben at FriasProperties dot com, right? And I'll include a couple times to connect in case you want to do a quick walkthrough after you've looked at it. Appreciate your time, Ben.",
        "note": "Confirm email address. Include specific meeting times in the email. Follow up by phone in 3 days if no response.",
        "branches": []
      },
      "ending_graceful": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand, Ben. If anything changes or this ever becomes a priority, I'm easy to find. Appreciate you giving me a minute. Enjoy the rest of ski season.",
        "note": "Don't burn the bridge. The ski season comment ties back to the opener and leaves it warm. You can try again in 3-6 months.",
        "branches": []
      },
      "gatekeeper": {
        "label": "GATEKEEPER — SOMEONE ELSE ANSWERS",
        "say": "Hey — could you get me through to Ben? It's Sam.",
        "note": "This is Ben's direct line so a gatekeeper is unlikely, but if someone else picks up — give minimal info. First name only. Sound like you know him.",
        "branches": [
          {
            "label": "Who's calling? / What's this about?",
            "to": "gatekeeper_context"
          },
          {
            "label": "Transfers you to Ben",
            "to": "opener"
          },
          {
            "label": "He's not available",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — GIVE CONTEXT",
        "say": "Yeah — I work with a few other property managers in the Aspen market on their inspection workflows. Would you mind letting him know it's Sam Parks?",
        "note": "Don't pitch the gatekeeper. Don't over-explain. Give just enough to sound legitimate, not like a vendor.",
        "branches": [
          {
            "label": "Transfers you",
            "to": "opener"
          },
          {
            "label": "Can I take a message?",
            "to": "gatekeeper_message"
          },
          {
            "label": "What company?",
            "to": "gatekeeper_company"
          }
        ]
      },
      "gatekeeper_company": {
        "label": "GATEKEEPER — COMPANY NAME",
        "say": "RapidEye — we help property management companies with their turnover inspection process. I sent Ben a note and just wanted to follow up. Would you mind giving him a heads up?",
        "note": "Third level of info. If they're still blocking after this, leave a message and try again another time.",
        "branches": [
          {
            "label": "Transfers you",
            "to": "opener"
          },
          {
            "label": "I'll let him know",
            "to": "gatekeeper_message"
          }
        ]
      },
      "gatekeeper_message": {
        "label": "LEAVE A MESSAGE",
        "say": "That'd be great. It's Sam Parks — S-A-M, P-A-R-K-S — with RapidEye. My number is [your number]. And if you could just let him know I work with a few property managers in the area on their inspection workflows, that'd be awesome. Appreciate it.",
        "note": "Spell your name. Leave your number. Keep the message short and non-salesy. Try calling again in 2 days at a different time.",
        "branches": []
      },
      "gatekeeper_unavailable": {
        "label": "BEN UNAVAILABLE",
        "say": "No worries — when's he usually back? I'll try him then.",
        "note": "Get a time. Don't leave a long message with a gatekeeper — it rarely gets passed along. Call back at the suggested time.",
        "branches": [
          {
            "label": "Gives you a time / try back later",
            "to": "gatekeeper_message"
          },
          {
            "label": "Not sure / can I take a message?",
            "to": "gatekeeper_message"
          }
        ]
      },
      "voicemail": {
        "label": "VOICEMAIL",
        "say": "Hey Ben — it's Sam Parks with RapidEye. I was talking to a couple other property managers in the Aspen market about how they're handling turnover inspections, and your name came up. Give me a ring back when you get a sec — [your number]. Or I'll try you again in a couple days. Talk soon.",
        "note": "Keep it under 20 seconds. Sound like a peer, not a pitch. Don't explain what RapidEye does. Mystery gets callbacks. Call again in 2 days. Send a short email within an hour of leaving the VM.",
        "branches": []
      }
    }
  }
}