{
  "name": "Brandi Boykin",
  "title": "Director of Marketing",
  "company": "Young's Suncoast Realty & Vacation Rentals",
  "location": "Gulf Shores, AL",
  "phone": "+1-251-968-2835",
  "company_phone": "+1-251-968-7158",
  "alt_phones": [],
  "flow": {
    "context": "Brandi Boykin is Director of Marketing at Young's Suncoast Realty & Vacation Rentals — 250+ vacation rental units across Gulf Shores, Orange Beach, and Fort Morgan, AL. Fifty-year-old company that explicitly markets 'Thorough Property Inspections' after every professional clean and runs an in-house maintenance team with 10 preventative visits per year. She is not the ops buyer — the real targets are Jordan Bodenhamer (Qualifying Broker + Dir. of Business Dev., 251-948-0408) and David Bodenhamer (Partner/Owner, 251-968-2820). Brandi's value is as an internal router: she has a confirmed direct line (251-968-2835) and plaintext email (bboykin@youngssuncoast.com). No personal connection to Sam found — lead with Gulf Coast vacation rental industry proximity. If she warm-intros you to Jordan, this call is a win.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Brandi — I work with a few other vacation rental companies along the Gulf Coast. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Casual, unhurried. Sound like you expected her to know who you are. Smile before you speak.",
        "branches": [
          {
            "label": "Yes / maybe",
            "to": "heard_name_yes"
          },
          {
            "label": "No / who?",
            "to": "heard_name_no"
          },
          {
            "label": "Bad timing / busy",
            "to": "bad_timing"
          },
          {
            "label": "Hostile / what is this",
            "to": "permission_fallback"
          }
        ]
      },
      "heard_name_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone in your world. What'd you hear?",
        "note": "Let her talk. Whatever she shares, bridge naturally to the pain trigger or discovery.",
        "branches": [
          {
            "label": "She asks what you do / shares something",
            "to": "pain_trigger"
          },
          {
            "label": "Vague / didn't really hear anything",
            "to": "heard_name_no"
          }
        ]
      },
      "heard_name_no": {
        "label": "HAVEN'T HEARD — BRIDGE TO PAIN",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason I'm calling —",
        "note": "Self-deprecating, light. Roll right into the pain trigger without a long pause.",
        "branches": [
          {
            "label": "She's listening",
            "to": "pain_trigger"
          },
          {
            "label": "She cuts in / pushes back",
            "to": "permission_fallback"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow or later this week?",
        "note": "Don't push. Lock in a callback window. Even a vague 'try Thursday' is a win.",
        "branches": [
          {
            "label": "She gives a time",
            "to": "reschedule"
          },
          {
            "label": "Just send an email",
            "to": "send_email"
          },
          {
            "label": "Don't call back / not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "reschedule": {
        "label": "CALLBACK LOCKED",
        "say": "Perfect — I'll try you then. Appreciate it, Brandi. Talk soon.",
        "note": "Write down the exact day and time. Call back exactly when you said you would — that alone sets you apart from every other cold caller.",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION ASK",
        "say": "Yeah totally — I mean it is a cold call. Can I get 30 seconds to tell you why I reached out? You can totally hang up on me if it's not a fit.",
        "note": "Disarm with radical honesty. Most people respect the transparency and give you the 30 seconds.",
        "branches": [
          {
            "label": "Sure / go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "No / not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED — DIAGNOSE",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and this just isn't interesting?",
        "note": "Split the rejection. 'Bad time' reopens a callback. 'Not interesting' lets you clarify or exit cleanly.",
        "branches": [
          {
            "label": "Bad time",
            "to": "bad_timing"
          },
          {
            "label": "Not interesting / don't call",
            "to": "end_graceful"
          },
          {
            "label": "She softens / asks what it is",
            "to": "pain_trigger"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER — MARKETING ANGLE",
        "say": "So I work with another vacation rental company about your size — around 250 units, beach market — and the thing they kept running into was their cleaners were taking photos after every turnover, they had inspectors checking behind them, and stuff was still getting missed. A cracked countertop here, a stained couch there, a broken cabinet door. And by the time anyone caught it, the next guest was already checked in and the one-star review was already written. Their marketing team told me they were spending more time on damage control and review responses than actually marketing the properties.",
        "note": "Pause here. Let her react. Young's literally promotes 'Thorough Property Inspections' as a selling point — this should hit close to home. Do NOT rush to the solution.",
        "branches": [
          {
            "label": "She relates / 'yeah that happens'",
            "to": "warm_response"
          },
          {
            "label": "She's quiet / neutral",
            "to": "one_sentence_solution"
          },
          {
            "label": "'That's more of an ops thing'",
            "to": "router_acknowledge"
          },
          {
            "label": "Not interested / pushback",
            "to": "objection_not_interested"
          }
        ]
      },
      "warm_response": {
        "label": "SHE'S WARM — STOP PITCHING",
        "say": "Yeah — it's one of those things where no amount of process fully solves it when you're doing hundreds of turnovers. So what does that look like on your side? Are you guys dealing with that at all with your inspections?",
        "note": "She's engaged. Ask questions now, don't pitch. Figure out if she has visibility into the ops pain or if you need to get routed.",
        "branches": [
          {
            "label": "She shares specifics about their process",
            "to": "discovery_process"
          },
          {
            "label": "'I'm not really on the ops side'",
            "to": "router_acknowledge"
          },
          {
            "label": "She mentions a specific person who handles it",
            "to": "she_identifies_contact"
          }
        ]
      },
      "one_sentence_solution": {
        "label": "ONE-SENTENCE SOLUTION + CTA",
        "say": "We built a tool that plugs into the photos your team's already taking after cleans and automatically flags damage, missing items, staging issues — no workflow change at all. I know this probably lives more on the operations side for you guys. Would you be open to pointing me toward whoever handles your inspection process? Or honestly, even just taking a quick look so you can see if it's worth passing along?",
        "note": "One sentence on what RapidEye does, then immediately acknowledge she's marketing and give her two easy paths: route you or look herself.",
        "branches": [
          {
            "label": "She names someone to talk to",
            "to": "she_identifies_contact"
          },
          {
            "label": "She's willing to look herself",
            "to": "sell_test_drive"
          },
          {
            "label": "'Interesting but not my area'",
            "to": "router_acknowledge"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "router_acknowledge": {
        "label": "ACKNOWLEDGE MARKETING — PIVOT TO REFERRAL",
        "say": "Totally makes sense — I figured this might not land squarely on your desk. Who on your team typically owns the inspection and turnover workflow? Like when a guest checks out and the cleaner goes through — who's making sure everything's good before the next guest?",
        "note": "This is the key moment. You need a name. Be specific — say 'inspections and turnovers,' not 'operations generally.' Don't let her off with 'just call the main number.'",
        "branches": [
          {
            "label": "She names someone (Jordan, David, a PM, etc.)",
            "to": "she_identifies_contact"
          },
          {
            "label": "She's not sure / 'I don't really know'",
            "to": "suggest_jordan"
          },
          {
            "label": "'Try our main office'",
            "to": "suggest_jordan"
          }
        ]
      },
      "discovery_process": {
        "label": "DISCOVERY — THEIR PROCESS",
        "say": "That's really helpful. So your team's doing inspections after every clean on 250-plus properties — are those mostly photo-based? Like are your inspectors or Property Care Specialists snapping photos and someone's reviewing them after?",
        "note": "Use their own language — 'Property Care Specialists' is what Young's calls their inspectors. You're trying to learn: photo-based or not, what platform, who reviews, where's the bottleneck.",
        "branches": [
          {
            "label": "Yes, photo-based / describes the process",
            "to": "discovery_deeper"
          },
          {
            "label": "'I'm not sure of the details — that's ops'",
            "to": "router_acknowledge"
          },
          {
            "label": "She mentions a specific tool or platform",
            "to": "discovery_tech"
          }
        ]
      },
      "discovery_deeper": {
        "label": "DIG INTO THE PAIN",
        "say": "Got it. And when stuff does slip through — a broken item, something a guest reports that should've been caught — who ends up dealing with that? Does that ever come back to bite you on the marketing side with reviews or owner complaints?",
        "note": "Connect the ops failure to her world. If she feels downstream pain from missed inspections, she becomes an internal champion, not just a router.",
        "branches": [
          {
            "label": "Yes, it affects reviews / owner retention",
            "to": "sell_test_drive"
          },
          {
            "label": "Not really my problem / routes to ops",
            "to": "router_acknowledge"
          },
          {
            "label": "She's curious — wants to know more",
            "to": "sell_test_drive"
          }
        ]
      },
      "discovery_tech": {
        "label": "TECH STACK DISCOVERY",
        "say": "Oh interesting — are they using that for the turnover photos specifically, or more for scheduling and task management? Reason I ask is we actually plug into a lot of those platforms and just layer on top.",
        "note": "Research found no Breezeway or Matterport. If she names a tool, note it. RapidEye integrates with Breezeway, Track, etc. — any PMS info is gold for the next conversation.",
        "branches": [
          {
            "label": "She describes the tool / gives details",
            "to": "sell_test_drive"
          },
          {
            "label": "She's not sure of the specifics",
            "to": "router_acknowledge"
          }
        ]
      },
      "she_identifies_contact": {
        "label": "SHE NAMES SOMEONE",
        "say": "That's super helpful. And is that someone I could reach out to directly? Would it be crazy to ask if you could shoot them a quick note or text just saying hey, Sam from RapidEye's gonna reach out — that way I'm not totally cold-calling them too?",
        "note": "The warm intro is the real prize. If she names Jordan Bodenhamer — jackpot, that's your #1 target. If she names a property manager like DeAnn Duhon or Linda Tresler, that works too. Get the intro if you can.",
        "branches": [
          {
            "label": "She'll send an intro / heads-up",
            "to": "intro_confirmed"
          },
          {
            "label": "She gives contact info but won't intro",
            "to": "cold_handoff"
          },
          {
            "label": "She's hesitant to share info",
            "to": "gentle_push_for_name"
          }
        ]
      },
      "suggest_jordan": {
        "label": "SUGGEST JORDAN BODENHAMER",
        "say": "No worries at all. I actually saw Jordan Bodenhamer's name come up when I was looking into you guys — she's your Qualifying Broker and Director of Business Development, right? Would she be the right person for something like this? Or is there someone on the property management side who'd be even closer to it?",
        "note": "Shows you did your homework without being weird about it. Jordan is target #1. If Brandi confirms or redirects to someone else, both are wins.",
        "branches": [
          {
            "label": "'Yeah, Jordan would be good'",
            "to": "ask_jordan_intro"
          },
          {
            "label": "She suggests someone else",
            "to": "she_identifies_contact"
          },
          {
            "label": "'I'm not sure / can't really help with that'",
            "to": "offer_email_to_brandi"
          }
        ]
      },
      "ask_jordan_intro": {
        "label": "ASK FOR JORDAN INTRO",
        "say": "Perfect. Would you mind giving Jordan a heads-up that I'll be reaching out? Even just a quick hey, this guy Sam called about inspection stuff — it makes a huge difference versus me cold-calling her out of nowhere.",
        "note": "The warm intro transforms the next call. Even a passing mention of your name to Jordan is worth the ask.",
        "branches": [
          {
            "label": "She'll do it",
            "to": "intro_confirmed"
          },
          {
            "label": "She won't but says go ahead and call",
            "to": "cold_handoff"
          },
          {
            "label": "'Just send me an email and I'll forward it'",
            "to": "send_email"
          }
        ]
      },
      "intro_confirmed": {
        "label": "WARM INTRO LOCKED",
        "say": "You're the best, Brandi — seriously, thank you. I'll reach out to them in the next day or two so your heads-up is still fresh. And if you want, I can send you a quick one-pager so you can see what it actually looks like too. Best email still bboykin at youngssuncoast?",
        "note": "Confirm her email. Lock a timeline for reaching out to the referral. Don't oversell — you got what you needed. Call Jordan within 24-48 hours while the intro is warm.",
        "branches": [
          {
            "label": "She confirms email / wraps up",
            "to": "referral_secured"
          },
          {
            "label": "She wants to see a demo herself too",
            "to": "book_meeting"
          }
        ]
      },
      "cold_handoff": {
        "label": "NO INTRO BUT GOT THE NAME",
        "say": "Totally fair — I appreciate it. And hey, if I mention your name just to say Brandi pointed me your way, you cool with that?",
        "note": "Even 'Brandi pointed me your way' is warmer than fully cold. Get permission to name-drop.",
        "branches": [
          {
            "label": "Sure, go ahead",
            "to": "referral_secured"
          },
          {
            "label": "She'd rather you didn't",
            "to": "referral_secured"
          }
        ]
      },
      "gentle_push_for_name": {
        "label": "GENTLE PUSH FOR A NAME",
        "say": "I totally get it — I'm not trying to put you on the spot. Even just a first name or a title would be huge so I'm calling the right person. Otherwise I'm gonna be cold-calling your whole office and nobody wants that.",
        "note": "Light humor. A title is almost as good as a name — you already know the org chart from research.",
        "branches": [
          {
            "label": "She gives a name or title",
            "to": "she_identifies_contact"
          },
          {
            "label": "She really can't or won't",
            "to": "offer_email_to_brandi"
          }
        ]
      },
      "offer_email_to_brandi": {
        "label": "OFFER EMAIL TO BRANDI TO FORWARD",
        "say": "No problem at all. How about this — let me send you a quick email with what we do. If it makes sense you can forward it to whoever you think should see it. If not, no hard feelings at all. Sound fair?",
        "note": "Give her an easy action. A forwarded email from a colleague gets opened way more than a cold email from a stranger. This is still a win.",
        "branches": [
          {
            "label": "Sure, send it over",
            "to": "email_tailoring"
          },
          {
            "label": "Not interested",
            "to": "end_graceful"
          }
        ]
      },
      "objection_not_interested": {
        "label": "NOT INTERESTED — AGREE FIRST",
        "say": "I totally get it — I should've assumed you'd be all set. Otherwise you probably would've reached out to us. Just so nobody from my team cold-calls you again — is it that this isn't a problem your team's focused on right now, or is it more that you just hate cold calls? Because honestly I get it either way.",
        "note": "Miyagi method. Agree fully, then split. 'Hate cold calls' usually gets a laugh and reopens the door. 'Not a problem' lets you probe further or pivot to a referral.",
        "branches": [
          {
            "label": "'I just hate cold calls' / laughs",
            "to": "sell_test_drive"
          },
          {
            "label": "'Not a problem we're focused on'",
            "to": "pivot_to_referral_from_objection"
          },
          {
            "label": "Still firm no",
            "to": "end_graceful"
          }
        ]
      },
      "pivot_to_referral_from_objection": {
        "label": "PIVOT — EVEN FROM A NO",
        "say": "Makes total sense — marketing's got enough on the plate without me adding to it. Is there someone on the operations or property management side who might care about this though? I just don't want to cold-call every number at Young's Suncoast if there's one person it actually makes sense for.",
        "note": "Even from a no, you can still extract a referral. She might be relieved to hand you off rather than deal with follow-up.",
        "branches": [
          {
            "label": "She names someone",
            "to": "she_identifies_contact"
          },
          {
            "label": "She doesn't know / won't say",
            "to": "suggest_jordan"
          },
          {
            "label": "Hard no",
            "to": "end_graceful"
          }
        ]
      },
      "objection_have_process": {
        "label": "THEY ALREADY HAVE A PROCESS — AGREE",
        "say": "That makes total sense — with 250-plus properties you'd have to have something in place. I actually saw you guys promote those thorough post-clean inspections on your site — that's a great differentiator. Just out of curiosity — is it that the team's fully covered and happy with how it's working, or is it more that changing anything right now would just be a headache?",
        "note": "Reference their own marketing to show you did your homework. The split reveals whether there's hidden dissatisfaction or just change fatigue.",
        "branches": [
          {
            "label": "'It works well' / fully happy",
            "to": "sell_test_drive_light"
          },
          {
            "label": "'Changing would be a headache' / hints at pain",
            "to": "sell_test_drive"
          },
          {
            "label": "She doesn't know the ops details",
            "to": "router_acknowledge"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Look — you're probably not buying anything from me on a cold call, and I totally respect that. But when your team does look at this stuff, it helps to already know what's out there. Would you be open to a quick fifteen-minute walkthrough? I could show you what a couple other Gulf Coast PM companies are doing with their turnover photos — worst case you steal some ideas and we part as friends.",
        "note": "Low pressure. Frame the meeting as worth their time even if they never buy. 'What other Gulf Coast PM companies are doing' is the hook — everyone wants to know what competitors do.",
        "branches": [
          {
            "label": "Sure / let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Send me an email first",
            "to": "send_email"
          },
          {
            "label": "I'm not the right person for that",
            "to": "router_acknowledge"
          },
          {
            "label": "No thanks",
            "to": "end_graceful"
          }
        ]
      },
      "sell_test_drive_light": {
        "label": "LIGHTER TEST DRIVE OFFER",
        "say": "That's great to hear — honestly most companies your size don't have it that dialed in. If nothing else, I could walk you through what we're seeing work for other companies in the Gulf Shores market — just so it's on your radar. No pitch, just fifteen minutes. Would that be worth a look?",
        "note": "They're happy with their current process, so lead with competitive intel value rather than pain. Even lighter touch.",
        "branches": [
          {
            "label": "Sure / why not",
            "to": "book_meeting"
          },
          {
            "label": "Send me some info first",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "end_graceful"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING NOW",
        "say": "Awesome. I've got next Tuesday and Thursday pulled up — does morning or afternoon work better for a quick fifteen minutes?",
        "note": "Offer two days, let her pick. Lock the time on THIS call. Don't say 'I'll send you a link later' — nail it down now.",
        "branches": [
          {
            "label": "She picks a time",
            "to": "meeting_booked"
          },
          {
            "label": "'Send me a calendar invite and I'll confirm'",
            "to": "meeting_booked"
          },
          {
            "label": "She hedges / 'let me check my calendar'",
            "to": "send_email"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING LOCKED — STOP SELLING",
        "say": "Perfect — I'll send that invite right over to bboykin at youngssuncoast dot com. Really appreciate you taking my call, Brandi. Talk to you then.",
        "note": "Send the calendar invite WHILE still on the phone if possible. Stop selling immediately. Be grateful and get off the phone. You won.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most useful to include so it's not just another generic pitch in your inbox? Like is it more about what the tool actually does, or would a quick case study from another vacation rental company be more relevant?",
        "note": "Don't just accept and hang up. The tailoring question keeps her engaged and makes your email 10x more likely to get opened.",
        "branches": [
          {
            "label": "She tells you what she wants",
            "to": "email_tailoring"
          },
          {
            "label": "'Just send whatever'",
            "to": "email_tailoring"
          },
          {
            "label": "She re-engages / asks a question",
            "to": "warm_response"
          }
        ]
      },
      "email_tailoring": {
        "label": "CONFIRM EMAIL + PLANT A TIME",
        "say": "Got it — I'll put that together and get it to you today. I'll throw a couple time options in there in case you want to hop on a quick call after you've looked it over. Best email is still bboykin at youngssuncoast dot com?",
        "note": "Confirm email. Include 2 specific meeting times in the email. Follow up in 48-72 hours if no response. If she said to forward to someone, tailor the email so it's easy for her to pass along.",
        "branches": [
          {
            "label": "She confirms email",
            "to": "end_graceful_email"
          },
          {
            "label": "She gives a different email",
            "to": "end_graceful_email"
          }
        ]
      },
      "end_graceful_email": {
        "label": "END — EMAIL FOLLOW-UP LOCKED",
        "say": "Perfect. I'll get that over to you today. Thanks for your time, Brandi — hope the rest of your day goes smooth.",
        "note": "Send the email within 1 hour. Personalize it — reference something specific from this conversation. Follow up in 48-72 hours. If she mentioned forwarding it, follow up specifically asking if she had a chance to pass it along.",
        "branches": []
      },
      "referral_secured": {
        "label": "WRAP UP — REFERRAL SECURED",
        "say": "Seriously, thanks for taking the time — I know this wasn't even your department so I really appreciate the help. Have a great rest of your day, Brandi.",
        "note": "You got what you came for. Send Brandi a quick thank-you email within the hour. Call the referred contact within 24 hours while the intro is fresh. If it's Jordan Bodenhamer: 251-948-0408. If it's David Bodenhamer: 251-968-2820.",
        "branches": []
      },
      "end_graceful": {
        "label": "END — GRACEFUL EXIT",
        "say": "Totally understand. If anything ever comes up on the inspection side, I'm easy to find. Appreciate your time, Brandi — have a good one.",
        "note": "Don't burn the bridge. She may mention you to someone later. Drop a brief, non-pushy LinkedIn connection or follow-up email in a week. She's still a potential internal champion even if this call didn't land.",
        "branches": []
      }
    }
  }
}