{
  "name": "Brandon Holmes",
  "title": "Broker in Charge (BIC) / Owner",
  "company": "Maui Rental Management",
  "location": "Scottsdale, AZ is already on the list. Let me provide the next best option:\\n\\nMaui, HI",
  "phone": "+1-805-835-2844",
  "company_phone": "+1-808-437-7737",
  "alt_phones": [],
  "flow": {
    "context": "Brandon Holmes is the Broker in Charge and Owner of Maui Rental Management (DBA Hawaii Equity Management LLC), based in Kihei, Maui. They manage 100+ residential units — primarily long-term but selectively vacation rentals — and operate a related vacation-rental brand called Hawaii Vacation Homes (run by Matt Buck). Brandon has a general contracting and maintenance background, which maps directly to RapidEye's damage-detection value. His phone is an 805 area code (Santa Barbara/Ventura region), giving Sam a natural SoCal connection. Maui's Bill 9 is phasing out ~6,200 vacation rental units by 2029-2031, creating regulatory pressure across the market.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Brandon — I work with a handful of property managers over in Hawaii, and your name came up when I was looking at operators on Maui. It's Sam Parks with RapidEye. Have you heard my name tossed around?",
        "note": "Feet up on the desk energy. Don't rush. Let the question hang. You're a peer, not a salesperson. Smile.",
        "branches": [
          {
            "label": "No / Who? / Doesn't ring a bell",
            "to": "not_popular"
          },
          {
            "label": "Yes / Maybe / Sounds familiar",
            "to": "heard_of_us"
          },
          {
            "label": "Bad timing / I'm busy / Can't talk",
            "to": "bad_timing"
          },
          {
            "label": "What is this about? / Are you selling something?",
            "to": "permission_ask"
          }
        ]
      },
      "not_popular": {
        "label": "HAVEN'T HEARD — TRANSITION",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call — I was actually looking into your operation, saw you guys manage over a hundred units on Maui and you've got a background in contracting and maintenance. That caught my eye because I work with a couple other PM companies your size, and the thing I keep hearing is the same headache.",
        "note": "This is the bridge to the pain trigger. Keep it casual. You're setting up the story, not pitching yet.",
        "branches": [
          {
            "label": "Okay / Go on / What headache?",
            "to": "pain_trigger"
          },
          {
            "label": "I'm not interested / We're good",
            "to": "not_interested_early"
          },
          {
            "label": "We're mostly long-term, not vacation rental",
            "to": "long_term_objection"
          }
        ]
      },
      "heard_of_us": {
        "label": "THEY'VE HEARD OF US",
        "say": "Oh no kidding — well normally we'd be working with someone like you. What'd you hear?",
        "note": "Let them talk. Whatever they say, validate it and transition to discovery. Don't correct them if they get details wrong — just flow with it.",
        "branches": [
          {
            "label": "Gives details / Mentions AI or inspections",
            "to": "warm_discovery"
          },
          {
            "label": "Not sure / Can't remember exactly",
            "to": "not_popular"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow or later this week? What works better?",
        "note": "Don't push. Lock in a callback time. If they give you a time, treat it like a booked meeting.",
        "branches": [
          {
            "label": "Gives a time / Sure try me later",
            "to": "lock_callback"
          },
          {
            "label": "Just email me",
            "to": "send_email"
          },
          {
            "label": "Don't call back / Not interested",
            "to": "graceful_exit"
          }
        ]
      },
      "permission_ask": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call, I'll own that. Can I get thirty seconds to tell you why I reached out, and if it's not relevant you can totally hang up on me?",
        "note": "Disarming honesty. Most people say yes to 30 seconds. If they do, go straight to the pain trigger.",
        "branches": [
          {
            "label": "Sure / Fine / Go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "No / Not interested / Take me off your list",
            "to": "reject_permission"
          },
          {
            "label": "We're mostly long-term rentals",
            "to": "long_term_objection"
          }
        ]
      },
      "reject_permission": {
        "label": "REJECTED — SPLIT THE OBJECTION",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it more that you already know what we do and it's just not interesting?",
        "note": "You're splitting the objection. Most people will soften and give you the real reason. That's your opening.",
        "branches": [
          {
            "label": "Bad time / Horrible time",
            "to": "bad_timing"
          },
          {
            "label": "Just not interested / Don't need it",
            "to": "not_interested_split"
          },
          {
            "label": "We're long-term, not vacation rental",
            "to": "long_term_objection"
          },
          {
            "label": "Hard no / Hangs up",
            "to": "graceful_exit"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER — MAINTENANCE & DAMAGE STORY",
        "say": "So I work with another PM company — they're running about a hundred and twenty units, similar to you — and their ops lead told me that the thing killing them wasn't the big obvious damage. It was the small stuff that slipped through. A scuff on a wall that nobody flagged for three turnovers. A missing throw pillow that the owner noticed before the team did. A drip under a bathroom sink that sat there for two weeks because the photos from the walkthrough looked fine from three feet away. And with a contracting background like yours, I know you see that stuff — but your team's reviewing hundreds of photos a week and things just fall through the cracks.",
        "note": "PAUSE HERE. Let him react. Do NOT rush into the solution. The contracting reference is personal — he'll feel seen. Wait for his response. If he engages on the pain, go to discovery. If silence, continue to the solution line.",
        "branches": [
          {
            "label": "Yeah that's real / We deal with that / Reacts to pain",
            "to": "solution_line"
          },
          {
            "label": "How does that connect to us?",
            "to": "solution_line"
          },
          {
            "label": "We already have a process for that",
            "to": "have_a_process"
          },
          {
            "label": "We're mostly long-term though",
            "to": "long_term_objection"
          },
          {
            "label": "Not really our problem / We're good",
            "to": "not_interested_post_pain"
          }
        ]
      },
      "solution_line": {
        "label": "ONE-SENTENCE SOLUTION + CTA",
        "say": "We built an AI that plugs into whatever photos your team's already taking — turnovers, walkthroughs, move-in move-out — and catches the damage, the missing items, anything that's off. Automatically. No workflow change. Would you be open to seeing what that looks like sometime when I'm not cold calling you out of the blue?",
        "note": "One sentence on the product. Then the CTA. Don't elaborate on features. If he says yes, book it. If he asks questions, go to discovery.",
        "branches": [
          {
            "label": "That's interesting / Tell me more / How does it work?",
            "to": "warm_discovery"
          },
          {
            "label": "Yeah I'd take a look / Sure",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Not right now / We're good",
            "to": "not_interested_post_pain"
          }
        ]
      },
      "long_term_objection": {
        "label": "LONG-TERM RENTAL OBJECTION",
        "say": "Totally — and I actually saw that. You guys are primarily long-term, which makes sense for Maui right now especially with everything going on with Bill 9. But I noticed you also have the Hawaii Vacation Homes brand for the short-term side, and honestly even on the long-term side — move-in, move-out documentation, catching damage between tenants, protecting owners from deposit disputes — that's where a lot of our value shows up too. Is the vacation rental side something you're still actively growing, or is that more on the back burner with everything happening?",
        "note": "You're showing you did your homework. Mentioning Bill 9 shows you understand their market. Mentioning Hawaii Vacation Homes shows you know the related brand. The question at the end gets them talking.",
        "branches": [
          {
            "label": "We're still doing some vacation rentals / Hawaii Vacation Homes is active",
            "to": "vr_side_active"
          },
          {
            "label": "Yeah Bill 9 is a mess / Talks about regulatory pressure",
            "to": "bill_9_conversation"
          },
          {
            "label": "Matt handles the vacation side / Talk to someone else",
            "to": "referral_to_matt"
          },
          {
            "label": "We're scaling back on VR / Not really focused there",
            "to": "long_term_value_pitch"
          },
          {
            "label": "Still not interested",
            "to": "not_interested_post_pain"
          }
        ]
      },
      "vr_side_active": {
        "label": "VR SIDE IS ACTIVE — PIVOT TO DISCOVERY",
        "say": "Got it — so you've got both worlds going. On the vacation rental turnovers specifically, what does your inspection process look like right now? Are your cleaners taking photos after every turn, or is it more of a spot-check situation?",
        "note": "You're in discovery mode now. Stop pitching. Let him describe his workflow. Listen for pain points you can mirror back.",
        "branches": [
          {
            "label": "Describes their process / Cleaners take photos",
            "to": "dig_deeper"
          },
          {
            "label": "We don't really have a formal process",
            "to": "no_process_hook"
          },
          {
            "label": "Matt or someone else handles that",
            "to": "referral_to_matt"
          }
        ]
      },
      "bill_9_conversation": {
        "label": "BILL 9 DISCUSSION",
        "say": "Yeah, I've been hearing about it from a couple operators over there — it sounds like everyone's trying to figure out what happens to their units. If anything, it makes every unit you do keep that much more valuable, right? Which is why documenting condition after every turnover becomes a bigger deal — protecting owners, protecting yourself from liability. Is that something you're already thinking about?",
        "note": "Don't pretend to be a Bill 9 expert. Just show awareness and connect it to documentation and property protection. Let him lead the conversation.",
        "branches": [
          {
            "label": "Yeah that's a concern / Talks about protecting properties",
            "to": "warm_discovery"
          },
          {
            "label": "We've already got that covered",
            "to": "have_a_process"
          },
          {
            "label": "It's more the long-term side we care about",
            "to": "long_term_value_pitch"
          }
        ]
      },
      "long_term_value_pitch": {
        "label": "LONG-TERM RENTAL VALUE ANGLE",
        "say": "Makes total sense. On the long-term side then — when a tenant moves out and a new one moves in, how are you guys documenting property condition right now? Is your team doing a walkthrough with photos, or is it more informal?",
        "note": "Even if VR isn't their focus, move-in/move-out documentation is a real pain point for long-term PMs. Deposit disputes, owner complaints, liability. If he engages, there's product fit. If not, go for the referral to Matt.",
        "branches": [
          {
            "label": "Describes move-in/move-out process",
            "to": "dig_deeper"
          },
          {
            "label": "We do walkthroughs with photos",
            "to": "dig_deeper"
          },
          {
            "label": "It's pretty informal / We could be better",
            "to": "no_process_hook"
          },
          {
            "label": "Not really our biggest problem right now",
            "to": "referral_to_matt"
          }
        ]
      },
      "warm_discovery": {
        "label": "WARM — DISCOVERY QUESTIONS",
        "say": "So let me ask you this — with a hundred-plus units across Maui, what's your biggest operational headache right now heading into this year? Is it more on the maintenance side, the turnover side, or something else entirely?",
        "note": "He's warm. Stop pitching. Ask open questions. Listen for: team size, current tools, what breaks, what he wishes he had. His contracting background means he cares about property condition details — lean into that.",
        "branches": [
          {
            "label": "Talks about maintenance / Property condition",
            "to": "dig_deeper"
          },
          {
            "label": "Talks about scaling / Growth challenges",
            "to": "dig_deeper"
          },
          {
            "label": "Asks about pricing / How it works technically",
            "to": "redirect_to_meeting"
          },
          {
            "label": "Mentions a specific tool or process they use",
            "to": "dig_deeper"
          }
        ]
      },
      "dig_deeper": {
        "label": "DIG DEEPER — FOLLOW-UP QUESTIONS",
        "say": "That makes sense. And when something does get missed — a maintenance issue, damage that goes unnoticed — how does that typically surface? Is it the owner catching it, a tenant complaint, or does your team find it on a walkthrough?",
        "note": "You're looking for the moment where things fall through the cracks. When he describes it, that's the pain you solve. Mirror his language back to him. Don't jump to pitching.",
        "branches": [
          {
            "label": "Describes issues / Gives specific examples",
            "to": "connect_to_solution"
          },
          {
            "label": "We catch most stuff / Our team is pretty good",
            "to": "scale_challenge"
          },
          {
            "label": "Asks what RapidEye actually does",
            "to": "connect_to_solution"
          }
        ]
      },
      "no_process_hook": {
        "label": "NO FORMAL PROCESS — HOOK",
        "say": "That's actually really common at your size. Most companies I talk to that are managing a hundred-plus units — they started with something informal, and it worked great at thirty or forty. But once you scale past that, stuff starts slipping through and you don't even know what you're missing. That's exactly what we built RapidEye for. Would you be open to seeing what it looks like? I could walk you through how a couple other companies your size are handling it.",
        "note": "No formal process plus 100+ units is a strong buying signal. Don't oversell. Just get the meeting.",
        "branches": [
          {
            "label": "Sure / Yeah let's take a look",
            "to": "book_meeting"
          },
          {
            "label": "Maybe / Send me some info first",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "not_interested_post_pain"
          }
        ]
      },
      "connect_to_solution": {
        "label": "CONNECT PAIN TO SOLUTION",
        "say": "Yeah — that's exactly the gap we sit in. Your team's already doing the work, already taking the photos. We just make sure nothing in those photos gets missed. The AI flags damage, missing items, staging issues — anything that's off from baseline — and kicks out a report automatically. No extra steps for your team. Honestly, it'd probably be way easier to just show you. Would you be open to a quick fifteen-minute walkthrough sometime this week or next?",
        "note": "You've earned the right to pitch because he shared pain. Keep it to two sentences about the product, then go for the meeting. Don't get into technical details.",
        "branches": [
          {
            "label": "Yeah let's do it / I'm open to that",
            "to": "book_meeting"
          },
          {
            "label": "Can you send me something first?",
            "to": "send_email"
          },
          {
            "label": "Who else are you working with?",
            "to": "social_proof"
          },
          {
            "label": "What does it cost?",
            "to": "redirect_to_meeting"
          }
        ]
      },
      "scale_challenge": {
        "label": "TEAM IS GOOD — SCALE CHALLENGE",
        "say": "I believe it — especially with your background, I bet your standards are higher than most. The question is what happens when you go from a hundred units to a hundred and fifty, or two hundred. The companies I work with that are growing fast — that's where it breaks. The team that was great at fifty can't physically eyeball every photo at a hundred and fifty. That's where the AI picks up the slack. Would you be open to just seeing what it looks like, even if it's just to have in your back pocket?",
        "note": "Don't argue with 'my team is good.' Validate it, then shift the frame to future scale. He's an owner — growth matters to him.",
        "branches": [
          {
            "label": "That's fair / We are growing",
            "to": "book_meeting"
          },
          {
            "label": "Maybe down the road",
            "to": "test_drive"
          },
          {
            "label": "Not really looking to add tools right now",
            "to": "not_interested_post_pain"
          }
        ]
      },
      "social_proof": {
        "label": "SOCIAL PROOF",
        "say": "So right now we're working with a company in New York managing about two hundred luxury homes — they were the first to really push us on the damage detection side. We've got another group on the East Coast running about six hundred properties. And a smaller operation in Dubai, about a hundred units. Different markets, but the problem's the same everywhere — too many photos, not enough eyes, stuff slipping through.",
        "note": "Keep it brief. Don't name-drop unless you have permission. The variety of markets shows this isn't niche. Then redirect to booking.",
        "branches": [
          {
            "label": "Interesting / Asks more questions",
            "to": "book_meeting"
          },
          {
            "label": "That's pretty different from our situation",
            "to": "redirect_to_meeting"
          }
        ]
      },
      "have_a_process": {
        "label": "ALREADY HAVE A PROCESS",
        "say": "That makes total sense — with a hundred-plus units you'd have to have something in place. Honestly, most people I talk to do have a process. The issue is usually not the process itself — it's that nobody has time to actually review everything the process generates. Is it more that your current setup is fully dialed in and you're happy with it, or is it more that switching anything right now would just be a headache?",
        "note": "Split the objection. 'Fully dialed in' vs 'switching is a headache' — most people admit it's the latter, which is your opening.",
        "branches": [
          {
            "label": "We're pretty happy with what we have",
            "to": "test_drive"
          },
          {
            "label": "It's more the switching / Adding something new is a pain",
            "to": "no_workflow_change"
          },
          {
            "label": "What would it actually involve?",
            "to": "redirect_to_meeting"
          }
        ]
      },
      "no_workflow_change": {
        "label": "NO WORKFLOW CHANGE PITCH",
        "say": "Totally get it — and that's actually why we built it the way we did. There's nothing new for your team to do. If they're already taking photos during turnovers or walkthroughs, we just plug into that. No new app, no new checklist, no retraining anyone. The AI reads the photos they're already taking and flags what's off. That's it. Would it be worth fifteen minutes to just see if it'd even work with whatever you're running right now?",
        "note": "The 'no workflow change' angle is your strongest card against the switching objection. Say it plainly. Then CTA.",
        "branches": [
          {
            "label": "Okay yeah let's take a look",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Still not the right time",
            "to": "test_drive"
          }
        ]
      },
      "not_interested_early": {
        "label": "NOT INTERESTED — EARLY",
        "say": "Totally get it — I should've assumed you'd already be all set, otherwise you probably would've reached out to us. Just so nobody from my team cold calls you again — is it more that this isn't really a problem you're focused on, or is it that you just hate cold calls? Because honestly, I get it either way.",
        "note": "Split the objection. If they say 'hate cold calls' you've got an opening to reframe. If it's 'not a problem,' dig into why.",
        "branches": [
          {
            "label": "I hate cold calls / Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not a problem we're focused on",
            "to": "not_interested_split"
          },
          {
            "label": "We're not really doing vacation rentals",
            "to": "long_term_objection"
          },
          {
            "label": "Hard no",
            "to": "graceful_exit"
          }
        ]
      },
      "not_interested_post_pain": {
        "label": "NOT INTERESTED — AFTER PAIN",
        "say": "Totally fair. You're probably not buying anything from a cold call today, and I respect that. But when this does become a priority — and with a hundred-plus units growing on Maui it usually does — the people who move fast are the ones who already know what's on their list. Would you be open to just a quick look, not to buy anything, just so you've seen it? Worst case you steal some ideas and we part as friends.",
        "note": "This is the 'sell the test drive' move. Low pressure. If he still says no, go for the referral or graceful exit.",
        "branches": [
          {
            "label": "Okay sure / Fine",
            "to": "book_meeting"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          },
          {
            "label": "Not right now / Maybe later",
            "to": "test_drive"
          },
          {
            "label": "No thanks",
            "to": "referral_attempt"
          }
        ]
      },
      "not_interested_split": {
        "label": "NOT A PROBLEM THEY'RE FOCUSED ON",
        "say": "Got it — is it more that your team's already handling inspections and property condition well enough, or is it that there are just bigger fires right now and this isn't even on the radar?",
        "note": "One more split. If it's 'bigger fires,' acknowledge and offer value later. If 'handling it well,' go test drive. Either answer gives you intel.",
        "branches": [
          {
            "label": "Bigger fires / Other priorities right now",
            "to": "test_drive"
          },
          {
            "label": "We handle it fine",
            "to": "test_drive"
          },
          {
            "label": "Opens up about a different problem",
            "to": "warm_discovery"
          }
        ]
      },
      "test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Completely hear you. If nothing else, I could walk you through what a couple other property managers in Hawaii are doing with their turnover photos and inspection documentation right now. Even if RapidEye isn't the move, it's fifteen minutes and you might pick up something useful. Would you be open to that?",
        "note": "This is your last shot before referral or exit. You're selling the value of the meeting itself, not the product. Make it about giving him something, not taking his time.",
        "branches": [
          {
            "label": "Okay / Sure why not",
            "to": "book_meeting"
          },
          {
            "label": "Email me first",
            "to": "send_email"
          },
          {
            "label": "No / Not now",
            "to": "referral_attempt"
          }
        ]
      },
      "referral_to_matt": {
        "label": "REFERRAL TO MATT BUCK",
        "say": "Totally makes sense. I actually noticed Matt Buck's name on the Hawaii Vacation Homes side — would he be the right person to talk to about the turnover and inspection workflow on the vacation rental units?",
        "note": "You know Matt's name and brand. Use it naturally. If Brandon confirms, you've got a warm referral from the owner. Ask for an intro if possible.",
        "branches": [
          {
            "label": "Yeah talk to Matt / He handles that",
            "to": "ask_for_intro"
          },
          {
            "label": "Actually I can handle it / Let me hear more",
            "to": "warm_discovery"
          },
          {
            "label": "Gives a different name",
            "to": "capture_referral"
          }
        ]
      },
      "referral_attempt": {
        "label": "REFERRAL — GENERAL",
        "say": "Totally respect that. One last thing — is there anyone on your team who handles the day-to-day property inspection or turnover workflow? Even if this isn't your thing right now, I'd love to put something tailored together for whoever does own that piece. If I can get a name, I won't bug you again.",
        "note": "You're fishing for Matt Buck, Christian Cramer, or any ops person. If he gives a name, treat it like gold. Send a personalized outreach immediately.",
        "branches": [
          {
            "label": "Gives a name (Matt, Christian, Jordan, etc.)",
            "to": "capture_referral"
          },
          {
            "label": "I handle everything / No one else to talk to",
            "to": "final_pitch"
          },
          {
            "label": "No / Just not interested",
            "to": "graceful_exit"
          }
        ]
      },
      "ask_for_intro": {
        "label": "ASK FOR INTRO",
        "say": "Awesome — would you be open to shooting him a quick text or email just saying I might reach out? That way I'm not totally cold-calling him too. If not, no worries at all — I'll just mention we chatted.",
        "note": "A warm intro from the owner is 10x better than another cold call. But don't push. Even 'mention we spoke' is valuable framing for the next call.",
        "branches": [
          {
            "label": "Sure I can do that / I'll mention it to him",
            "to": "confirm_referral_details"
          },
          {
            "label": "Just reach out to him directly",
            "to": "confirm_referral_details"
          }
        ]
      },
      "capture_referral": {
        "label": "CAPTURE REFERRAL DETAILS",
        "say": "Really appreciate that. And just so I put something relevant together for them — do you know if they're using any specific software for inspections or turnovers right now, or is it mostly manual?",
        "note": "Get intel while the door is open. Even one detail about their current process helps you tailor the next call. Then thank him and wrap.",
        "branches": [
          {
            "label": "Gives info about their tools or process",
            "to": "confirm_referral_details"
          },
          {
            "label": "Not sure / You'd have to ask them",
            "to": "confirm_referral_details"
          }
        ]
      },
      "confirm_referral_details": {
        "label": "CONFIRM AND WRAP REFERRAL",
        "say": "Perfect — I'll reach out to them and keep it super relevant. Really appreciate you taking my call, Brandon. If anything ever comes up on your side, I'm easy to find. Have a good one.",
        "note": "You got a referral from the owner. That's a win. Send a thank-you email to Brandon within 5 minutes. Call the referral within 24 hours and open with 'Hey, I was just talking to Brandon Holmes and he pointed me your way.'",
        "branches": []
      },
      "final_pitch": {
        "label": "FINAL PITCH — HE HANDLES EVERYTHING",
        "say": "Got it — so it all rolls up to you. Look, I know I'm a stranger on the phone and you've got a hundred things going on. But you clearly care about property condition — that's obvious from your background. If there's ever a week where you want fifteen minutes to see what AI can do with the photos your team's already taking, I'm an easy guy to get ahold of. Can I at least shoot you a quick email so you've got my info?",
        "note": "This is your final attempt. You're planting a seed. If he agrees to an email, send it within 10 minutes with something specific and personal. Reference his contracting background.",
        "branches": [
          {
            "label": "Sure send me something",
            "to": "send_email"
          },
          {
            "label": "Actually yeah let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "No thanks",
            "to": "graceful_exit"
          }
        ]
      },
      "redirect_to_meeting": {
        "label": "REDIRECT PRICING/DETAILS TO MEETING",
        "say": "Honestly it'd be way easier to show you than to try to explain it over the phone — and I'd want to understand what you guys are running right now before I throw anything out. Would you be open to a quick fifteen minutes this week or next? I can walk you through exactly how it'd work with your setup.",
        "note": "Never quote pricing on a cold call. Never get deep into technical details. Redirect everything to the meeting. The meeting is the product you're selling right now.",
        "branches": [
          {
            "label": "Sure / Yeah that works",
            "to": "book_meeting"
          },
          {
            "label": "Email me first",
            "to": "send_email"
          },
          {
            "label": "I need to think about it",
            "to": "test_drive"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next Tuesday and Thursday pulled up — do mornings or afternoons work better for you? And I know you're on Hawaii time so I'll make sure it's reasonable.",
        "note": "Pick specific days. Lock the time NOW. Don't say 'I'll send you a link.' Hawaii is 2-3 hours behind Pacific depending on daylight savings (Hawaii doesn't observe DST). Send the calendar invite while still on the phone.",
        "branches": [
          {
            "label": "Picks a day/time",
            "to": "confirm_meeting"
          },
          {
            "label": "Let me check my calendar and get back to you",
            "to": "pin_down_meeting"
          }
        ]
      },
      "pin_down_meeting": {
        "label": "PIN DOWN THE MEETING",
        "say": "Totally — how about I throw a couple options in an email right now and you just pick whichever works? That way it doesn't fall off both our radars. What's the best email for you — is it your mauihomesbyholmes Gmail?",
        "note": "Don't let it float. Offer specific options via email immediately. You already know his email is mauihomesbyholmes@gmail.com — let him confirm it. Sending options creates commitment.",
        "branches": [
          {
            "label": "Confirms email / Gives email",
            "to": "confirm_meeting"
          },
          {
            "label": "Just call me back",
            "to": "lock_callback"
          }
        ]
      },
      "confirm_meeting": {
        "label": "CONFIRM AND CLOSE",
        "say": "Done — I'll get that invite over to you right now. Really appreciate you taking my call, Brandon. I'll keep it tight and make sure it's worth your time. Talk to you then.",
        "note": "Stop selling. You got the meeting. Send the invite within 2 minutes. Include a one-line note: 'Looking forward to showing you what we're doing with inspection photos for PM companies in Hawaii.' Set a reminder email for the day before.",
        "branches": []
      },
      "lock_callback": {
        "label": "LOCK CALLBACK TIME",
        "say": "Works for me. Is there a specific day or time that's best to catch you? I'll put it in my calendar so I'm not just calling you randomly again.",
        "note": "Treat this like booking a meeting. Get a specific day and time. Log it in CRM immediately after the call with full context notes.",
        "branches": [
          {
            "label": "Gives a day/time",
            "to": "confirm_callback"
          },
          {
            "label": "Anytime / Just try me",
            "to": "confirm_callback"
          }
        ]
      },
      "confirm_callback": {
        "label": "CONFIRM CALLBACK",
        "say": "Got it — I'll try you then. Appreciate it, Brandon. Talk soon.",
        "note": "Log the callback time immediately. Set a reminder. When you call back, open with: 'Hey Brandon, it's Sam Parks — we spoke the other day and you said to try you back around now.'",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most useful to include so it's not just another generic pitch in your inbox? Is it more about how the tech actually works, or would seeing what other PM companies similar to yours are doing with it be more relevant?",
        "note": "Ask ONE qualifying question. His answer tells you what matters to him. Then confirm email and suggest a specific follow-up time.",
        "branches": [
          {
            "label": "How it works / Tech side",
            "to": "confirm_email_send"
          },
          {
            "label": "What others are doing / Case studies",
            "to": "confirm_email_send"
          },
          {
            "label": "Just send whatever / Doesn't specify",
            "to": "confirm_email_send"
          }
        ]
      },
      "confirm_email_send": {
        "label": "CONFIRM EMAIL AND WRAP",
        "say": "Got it — I'll keep it short and specific. Is mauihomesbyholmes at Gmail the best one, or do you prefer a different address? And I'll toss a couple times in there in case you want to hop on a quick call after you've looked it over.",
        "note": "Confirm the email address. Send within 30 minutes. Under 150 words. Include one specific insight about Maui PM operations, not a pitch deck. Suggest two specific meeting times. Follow up in 3 business days if no reply.",
        "branches": [
          {
            "label": "Confirms email",
            "to": "email_closing"
          },
          {
            "label": "Gives a different email",
            "to": "email_closing"
          }
        ]
      },
      "email_closing": {
        "label": "EMAIL WRAP AND CLOSE",
        "say": "Perfect — you'll have it in the next thirty minutes. Appreciate you taking my call, Brandon. Talk soon.",
        "note": "Send the email IMMEDIATELY. Personalize it — reference his contracting background and the specific thing he said mattered. Set a follow-up reminder for 3 business days. When you follow up, reference this call specifically.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes or you ever want to see what other Maui operators are doing on the inspection side, I'm easy to find. Appreciate your time, Brandon.",
        "note": "Don't burn the bridge. Log the outcome and any intel in CRM. Set a 90-day re-engagement reminder. He may warm up later — especially if Bill 9 pressure intensifies or they scale the vacation rental side.",
        "branches": []
      }
    }
  }
}