{
  "name": "Britton Nieslanik",
  "title": "Vice President",
  "company": "Luxury Estate Managers of Aspen (LEMA)",
  "location": "Aspen, CO",
  "phone": "+1-970-948-9896",
  "company_phone": "+1-970-920-1776",
  "alt_phones": [],
  "flow": {
    "context": "Britton Nieslanik is VP at Luxury Estate Managers of Aspen (LEMA) — the number two behind President Sarah Korpela. Lifelong Roaring Fork Valley resident with 18 years as an equine vet tech, so she's hardwired for detail-orientation and high-level care standards. LEMA is a premium, confidentiality-focused estate and property management firm in Aspen with no published unit count and no known tech stack — team includes 6+ property managers under Britton. Sam's strongest hook: he just got back from skiing Jackson Hole in January and Britton is a lifelong Aspen local, instant common ground in ski country.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Britton — I actually just got back from skiing Jackson Hole, so I know I'm probably calling enemy territory for a Roaring Fork lifer. It's Sam Parks with RapidEye. Have you heard my name tossed around?",
        "note": "Smile. Relaxed. Feet-up-on-the-desk energy. The Jackson Hole mention shows you know she's a lifelong Aspen local — it's personal, not salesy. Pause after the question.",
        "branches": [
          {
            "label": "No / Who? / I haven't",
            "to": "heard_no"
          },
          {
            "label": "Yes / Maybe / Sounds familiar",
            "to": "heard_yes"
          },
          {
            "label": "Bad timing / I'm busy / Can't talk",
            "to": "bad_timing"
          },
          {
            "label": "What is this about? / Are you selling something?",
            "to": "permission_fallback"
          }
        ]
      },
      "heard_no": {
        "label": "THEY HAVEN'T HEARD OF YOU",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call — I work with a few other luxury property managers, and one thing that keeps coming up is this: their teams are snapping hundreds of photos every turnover, but nobody actually has time to sit down and review them all carefully. Stuff slips through — a scratch on a marble countertop, a missing throw pillow, a water stain on a sofa — and it doesn't surface until the homeowner notices or a guest complains. And at the level you guys operate at, that's not a five-hundred-dollar problem, that's a ten-thousand-dollar conversation with an owner who expects perfection.",
        "note": "PAUSE here. Let the pain sit for two full seconds before continuing. Do NOT rush into the solution. The luxury angle is key — at LEMA's price point, a missed scratch is exponentially more expensive.",
        "branches": [
          {
            "label": "Silence / Listening / Hmm",
            "to": "pain_solution"
          },
          {
            "label": "Yeah, that's real / We've dealt with that",
            "to": "pain_confirmed"
          },
          {
            "label": "We already have a process for that",
            "to": "objection_have_process"
          },
          {
            "label": "Not interested / We're good",
            "to": "objection_not_interested"
          }
        ]
      },
      "pain_solution": {
        "label": "ONE-SENTENCE SOLUTION + CTA",
        "say": "We built something that analyzes those turnover photos automatically — catches damage, missing items, staging issues — without your team changing anything about how they work. Would you be open to taking a look when I'm not cold calling you out of the blue?",
        "note": "One sentence on the product, then straight to the CTA. Don't over-explain. Let her decide.",
        "branches": [
          {
            "label": "Sure / I'd take a look",
            "to": "book_meeting"
          },
          {
            "label": "Tell me more / How does that work?",
            "to": "warm_discovery"
          },
          {
            "label": "We already have something for that",
            "to": "objection_have_process"
          },
          {
            "label": "Not right now / Maybe later",
            "to": "test_drive"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          }
        ]
      },
      "heard_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone exactly like you. What'd you hear?",
        "note": "Let them talk. Whatever they say, use it to bridge into discovery or the pain trigger. Don't correct anything — just build on it.",
        "branches": [
          {
            "label": "Describes what they heard",
            "to": "warm_discovery"
          },
          {
            "label": "Vague / Not sure actually",
            "to": "heard_no"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow or later this week?",
        "note": "Don't push. Respect the timing. Get a specific callback window if possible.",
        "branches": [
          {
            "label": "Suggests a time / Sure try me later",
            "to": "reschedule_set"
          },
          {
            "label": "Just not interested / Don't call back",
            "to": "graceful_exit"
          },
          {
            "label": "What's this about? Give me the quick version",
            "to": "heard_no"
          }
        ]
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call, I'll be honest. Can I get thirty seconds to tell you why I reached out? And you can totally hang up on me if it's not a fit.",
        "note": "Disarm with honesty. Most people will give you 30 seconds if you're upfront about what this is.",
        "branches": [
          {
            "label": "Okay, go ahead / Fine, 30 seconds",
            "to": "heard_no"
          },
          {
            "label": "No / Not interested / Take me off your list",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and this just isn't interesting?",
        "note": "This split forces a real answer. Most people will reveal it's timing, not substance — which reopens the door.",
        "branches": [
          {
            "label": "It's just bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not interested at all",
            "to": "graceful_exit"
          },
          {
            "label": "What do you actually do?",
            "to": "heard_no"
          }
        ]
      },
      "warm_discovery": {
        "label": "DISCOVERY — THEY'RE WARM",
        "say": "Awesome. So I don't waste your time — what does the inspection or walkthrough process look like for you guys right now after a turnover? Are your property managers doing that manually, or do you have something in place?",
        "note": "STOP PITCHING. You're in discovery mode. Ask, listen, take notes. Britton is VP so she'll know the operational picture across all PMs.",
        "branches": [
          {
            "label": "Describes their current process",
            "to": "discovery_deeper"
          },
          {
            "label": "We don't really have a formal process",
            "to": "discovery_no_process"
          },
          {
            "label": "We use a specific tool or vendor",
            "to": "discovery_has_tool"
          },
          {
            "label": "Our PMs each handle that individually",
            "to": "discovery_pm_owned"
          }
        ]
      },
      "discovery_deeper": {
        "label": "DIG DEEPER",
        "say": "Got it. And when something does slip through — like damage that gets caught late or a homeowner notices something your team missed — how does that usually play out? Is that a big deal at the level of homes you guys manage?",
        "note": "You're trying to quantify the cost of a miss. At LEMA's luxury tier, one missed issue could be a five-figure problem and a damaged homeowner relationship. Let her tell you the story.",
        "branches": [
          {
            "label": "It's a big deal / Gives specific examples",
            "to": "pain_confirmed"
          },
          {
            "label": "Hasn't been a huge issue for us",
            "to": "pain_minimal"
          },
          {
            "label": "That's really more Sarah's area",
            "to": "referral_to_sarah"
          }
        ]
      },
      "discovery_no_process": {
        "label": "NO FORMAL PROCESS",
        "say": "That's actually really common — especially when you've got a strong team that just knows the homes. The tricky part is when you're managing a bunch of properties and everyone's got their own way of checking things. That's exactly what we help standardize. Would it make sense to block twenty minutes so I can show you what that looks like — no pressure, just so you can see if it's worth exploring?",
        "note": "This is a big opening. No formal process means high likelihood of inconsistency across their 6+ PMs. Don't oversell — just get the meeting.",
        "branches": [
          {
            "label": "Sure / Let's do it",
            "to": "book_meeting"
          },
          {
            "label": "I'd need to loop in Sarah on this",
            "to": "referral_to_sarah"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          }
        ]
      },
      "discovery_has_tool": {
        "label": "THEY HAVE A TOOL",
        "say": "Oh nice — what are you guys using? I'm just curious because we actually plug into most of the major platforms.",
        "note": "Find out the tool. If it's Breezeway, Track, Properly, etc. — RapidEye integrates. Position as additive, not a replacement.",
        "branches": [
          {
            "label": "Names a platform (Breezeway, Track, etc.)",
            "to": "integrate_pitch"
          },
          {
            "label": "It's internal / Spreadsheets / Checklists",
            "to": "discovery_no_process"
          }
        ]
      },
      "discovery_pm_owned": {
        "label": "PM-OWNED PROCESS",
        "say": "Yeah that makes sense — you've got what, six or seven PMs on the team? The thing I hear a lot is that each PM has their own standard, and as VP you're kind of the one making sure consistency holds across all the homes. Is that fair?",
        "note": "Show you know the team size. Frame RapidEye as a consistency layer across PMs — that's a VP-level value prop, not a PM-level one.",
        "branches": [
          {
            "label": "Yes, consistency is a challenge",
            "to": "pain_confirmed"
          },
          {
            "label": "We've actually got it pretty dialed in",
            "to": "pain_minimal"
          },
          {
            "label": "How do you know our team size?",
            "to": "transparency_response"
          }
        ]
      },
      "pain_confirmed": {
        "label": "PAIN CONFIRMED — BOOK IT",
        "say": "Yeah, that's exactly what I'm hearing from other luxury managers. Look — I don't want to take up your whole afternoon. Would it make sense to block twenty minutes later this week so I can show you what we built? Worst case, you see what other high-end PM companies are doing with their turnover photos and you steal some ideas.",
        "note": "The pain is real. Stop digging and pivot to booking. 'Steal some ideas' lowers the commitment bar. This is your strongest position — don't oversell it.",
        "branches": [
          {
            "label": "Sure / Let's do it",
            "to": "book_meeting"
          },
          {
            "label": "I'd want Sarah involved too",
            "to": "referral_to_sarah"
          },
          {
            "label": "Send me an email first",
            "to": "send_email"
          },
          {
            "label": "Not right now / Maybe later",
            "to": "test_drive"
          }
        ]
      },
      "pain_minimal": {
        "label": "PAIN MINIMAL — REFRAME",
        "say": "That's great — honestly that's a credit to your team. The angle I'd offer is this: we work with a PM company in New York managing about two hundred luxury homes, and they felt the same way until we ran their existing photos through our system and flagged a bunch of stuff that had been slipping through for months. Small things, but things that add up — especially when the homeowner's paying what Aspen homeowners pay. Would it be worth twenty minutes just to see if there's anything your current process might be missing? Totally fine if not.",
        "note": "Use the NYC social proof — 200 luxury homes. Don't argue that they have a problem. Reframe as 'even great teams have blind spots.' Keep it low-pressure.",
        "branches": [
          {
            "label": "Okay, I'd be open to that",
            "to": "book_meeting"
          },
          {
            "label": "Not right now",
            "to": "test_drive"
          },
          {
            "label": "We're really covered / No thanks",
            "to": "objection_not_interested"
          }
        ]
      },
      "integrate_pitch": {
        "label": "INTEGRATION ANGLE",
        "say": "Oh perfect — we actually plug right into that. So nothing changes for your team. Your PMs keep doing exactly what they're doing, uploading photos the same way, and we just add an AI layer on top that catches what the human eye misses. Would it make sense to show you how that connection works? Takes about twenty minutes.",
        "note": "Position as zero workflow change. That's the killer feature for an ops leader — no retraining, no new app, just better output from the existing process.",
        "branches": [
          {
            "label": "Sure / That's interesting",
            "to": "book_meeting"
          },
          {
            "label": "I'd need to talk to Sarah first",
            "to": "referral_to_sarah"
          },
          {
            "label": "Send me info",
            "to": "send_email"
          }
        ]
      },
      "objection_not_interested": {
        "label": "NOT INTERESTED — MIYAGI",
        "say": "Totally get it — I should've assumed you'd be all set. Otherwise you probably would've reached out to us. Just so nobody from my team cold calls you again — is it that this isn't really a problem you're focused on right now, or is it more that you just hate cold calls? Because honestly I get both.",
        "note": "Agree first. Don't push back. The split question surfaces the real reason. Most people soften when you validate their reaction instead of fighting it.",
        "branches": [
          {
            "label": "It's more the cold call / Bad timing",
            "to": "test_drive"
          },
          {
            "label": "We're genuinely not focused on this",
            "to": "referral_attempt"
          },
          {
            "label": "Both / Just not interested at all",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_have_process": {
        "label": "HAVE A PROCESS — MIYAGI",
        "say": "That makes total sense — managing luxury estates in Aspen, you'd have to have something dialed in. Is it that you're fully covered and happy with how it's working, or is it more that switching anything right now would just be a headache?",
        "note": "Agree and split. If they're happy, respect it and reframe. If switching is the issue, RapidEye doesn't require switching — it layers on top. That's your opening.",
        "branches": [
          {
            "label": "We're happy with what we have",
            "to": "pain_minimal"
          },
          {
            "label": "Switching would be a pain",
            "to": "no_switch_pitch"
          },
          {
            "label": "A bit of both",
            "to": "no_switch_pitch"
          }
        ]
      },
      "no_switch_pitch": {
        "label": "NO SWITCHING REQUIRED",
        "say": "Yeah that's the last thing I'd want to put on your plate. The whole point of what we built is that nothing changes for your team. Your PMs keep taking photos the same way, using whatever system you've already got, and we just sit on top and flag what's getting missed. No new app, no new process, no retraining. Would it be worth a quick look just to see how simple it actually is?",
        "note": "This is RapidEye's structural advantage — zero workflow change. Hammer it for the 'switching is hard' objection. Britton as VP would especially hate adding complexity for her team.",
        "branches": [
          {
            "label": "Okay, I'd look at that",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Still not the right time",
            "to": "test_drive"
          }
        ]
      },
      "test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally fair — you're probably not buying anything today, and I respect that. But honestly, the people who get the most out of something like this are the ones who already know what's on their list when budget or bandwidth does open up. If nothing else, I could walk you through what other luxury PM companies are doing with their turnover photos right now — worst case you steal some ideas and we part as friends. Would you be open to that?",
        "note": "This is your last real swing. Frame the meeting as valuable even if they never buy. 'Steal some ideas and part as friends' is the lowest commitment framing possible.",
        "branches": [
          {
            "label": "Fine / Sure, let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Email me and I'll look when I have time",
            "to": "send_email"
          },
          {
            "label": "No, really not right now",
            "to": "graceful_exit"
          }
        ]
      },
      "referral_to_sarah": {
        "label": "REFERRAL — SARAH KORPELA",
        "say": "Totally makes sense — Sarah's the one who'd pull the trigger on something like this, right? Would it be helpful if I reached out to her directly, or would it be better coming from you first? I want to make sure it lands the right way — I know you guys are protective of your homeowners and your process.",
        "note": "Britton may defer to Sarah as President. Get permission to use Britton's name. Ideal outcome: Britton warms the path. Sarah's direct line is 970.379.4705 and email is sarah@luxuryema.com.",
        "branches": [
          {
            "label": "I'll mention it to Sarah / Let me talk to her first",
            "to": "referral_sarah_warm"
          },
          {
            "label": "Just reach out to her directly",
            "to": "referral_sarah_direct"
          },
          {
            "label": "I can actually make this call / Let me see it first",
            "to": "book_meeting"
          }
        ]
      },
      "referral_sarah_warm": {
        "label": "BRITTON WILL INTRO TO SARAH",
        "say": "That'd be awesome — I really appreciate that. Would it make sense for me to send you a quick email you could forward to her? That way she's got context and it's not just another random cold call showing up.",
        "note": "Best possible outcome. Send a clean, short email Britton can forward. Keep it to 3-4 sentences. Include a suggested meeting time.",
        "branches": [
          {
            "label": "Sure, send it over",
            "to": "send_email_for_sarah"
          },
          {
            "label": "Just call her and mention my name",
            "to": "referral_sarah_direct"
          }
        ]
      },
      "referral_sarah_direct": {
        "label": "DIRECT PATH TO SARAH",
        "say": "Perfect. And is it cool if I mention you suggested I reach out? That goes a long way versus another random cold call.",
        "note": "Get explicit permission to name-drop Britton when calling Sarah. This turns the Sarah call from cold to warm.",
        "branches": [
          {
            "label": "Sure, go for it",
            "to": "referral_confirmed"
          },
          {
            "label": "I'd rather you just called her cold",
            "to": "referral_confirmed_no_namedrop"
          }
        ]
      },
      "referral_confirmed": {
        "label": "REFERRAL LOCKED — WITH NAME DROP",
        "say": "Awesome — really appreciate you pointing me in the right direction, Britton. I'll reach out to Sarah and keep it short. And hey, if you ever want to see what we're building yourself — totally open invite. Thanks for your time.",
        "note": "End warm. You now have a warm referral to Sarah Korpela. Call her ASAP and open with 'Britton suggested I reach out.' Log everything.",
        "branches": []
      },
      "referral_confirmed_no_namedrop": {
        "label": "REFERRAL LOCKED — NO NAME DROP",
        "say": "Totally understand. I'll give her a call and keep it brief. Really appreciate the help, Britton. Have a great rest of your day.",
        "note": "End warm. Call Sarah but don't mention Britton. You still know Sarah is the decision-maker — that intel alone is valuable.",
        "branches": []
      },
      "referral_attempt": {
        "label": "REFERRAL — GENERAL",
        "say": "Totally fair. Out of curiosity — who on your team would typically own the inspection or turnover quality piece? Is that something Sarah handles, or does it sit more with your property managers day to day?",
        "note": "If Britton isn't the buyer, figure out who is. Sarah Korpela (President) is the most likely decision-maker. Nathan Mohrman or Chris Woodring are the strongest PM-level contacts.",
        "branches": [
          {
            "label": "That'd be Sarah",
            "to": "referral_to_sarah"
          },
          {
            "label": "Our property managers handle that",
            "to": "referral_to_pm"
          },
          {
            "label": "That's my area but we're just not looking",
            "to": "graceful_exit"
          }
        ]
      },
      "referral_to_pm": {
        "label": "REFERRAL — PROPERTY MANAGER",
        "say": "Got it. Is there one PM in particular who's kind of the go-to on process and quality stuff? If I could get a name, I'll put something tailored together so it actually lands instead of being another generic pitch.",
        "note": "Nathan Mohrman (engineering mindset, systematic) or Chris Woodring (luxury hospitality background) are your strongest PM targets. See if Britton names one of them.",
        "branches": [
          {
            "label": "Names a specific PM",
            "to": "referral_pm_confirmed"
          },
          {
            "label": "You can try any of them / Not sure who to suggest",
            "to": "referral_pm_generic"
          }
        ]
      },
      "referral_pm_confirmed": {
        "label": "PM REFERRAL LOCKED",
        "say": "Perfect — I'll reach out to them and keep it really targeted. Appreciate you pointing me the right way, Britton. And hey, if you ever want to see it yourself — totally open invite. Thanks for your time.",
        "note": "End warm. Log the PM name. Call them and mention Britton pointed you their way.",
        "branches": []
      },
      "referral_pm_generic": {
        "label": "PM REFERRAL — GENERIC",
        "say": "No worries — I'll figure it out. Really appreciate the help, Britton. Have a great rest of your day.",
        "note": "End warm. Try Nathan Mohrman first (970.948.4455) — his engineering background makes him most likely to engage with a systematic tool. Mention Britton if she gave permission.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most relevant to include so it's not just another generic pitch sitting in your inbox? Like, is it more about how it works technically, or more about what other luxury managers have been seeing from it?",
        "note": "Accept the email request. Get intel on what matters to her. Send to britton@luxuryema.com. Include a specific meeting time suggestion in the email. Follow up in 48 hours if no reply.",
        "branches": [
          {
            "label": "Tells you what to include",
            "to": "email_confirmed"
          },
          {
            "label": "Just send whatever / General info is fine",
            "to": "email_confirmed"
          }
        ]
      },
      "send_email_for_sarah": {
        "label": "EMAIL FOR SARAH INTRO",
        "say": "Perfect — I'll send something short and clean to you at your LEMA email, and you can forward it to Sarah whenever makes sense. Really appreciate the help, Britton. I'll keep it to the point.",
        "note": "Send to britton@luxuryema.com. Keep the email to 3-4 sentences MAX. Make it dead simple for Britton to forward. Include a suggested time and Sam's direct number.",
        "branches": [
          {
            "label": "Sounds good",
            "to": "email_confirmed"
          }
        ]
      },
      "email_confirmed": {
        "label": "EMAIL LOCKED",
        "say": "Awesome. I'll get that over to you today. And Britton — if it makes sense after you take a look, I've got time Thursday or Friday afternoon if you wanted to hop on a quick call. Appreciate your time.",
        "note": "Lock a soft follow-up window. Send the email within the hour while the call is fresh. If no response in 48 hours, follow up once. Don't pester.",
        "branches": []
      },
      "transparency_response": {
        "label": "HOW DO YOU KNOW THAT",
        "say": "Ha — I'll be totally honest, I did my homework before calling. Your team bios are on the website. I'd rather know who I'm talking to than waste your time with a generic pitch.",
        "note": "Be transparent and own it. Frame the research as respectful preparation, not surveillance. Most people appreciate it once you're upfront.",
        "branches": [
          {
            "label": "Appreciates the honesty / Laughs it off",
            "to": "discovery_deeper"
          },
          {
            "label": "Seems uncomfortable",
            "to": "permission_fallback"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next week pulled up — how does Thursday afternoon look? Like two or two-thirty Mountain Time?",
        "note": "Pick a specific day and time. Don't say 'when works for you' — too open-ended. Aspen is Mountain Time. Send the calendar invite while you're still on the phone.",
        "branches": [
          {
            "label": "That works / Suggests a time",
            "to": "meeting_booked"
          },
          {
            "label": "Let me check my calendar and get back to you",
            "to": "meeting_fallback_email"
          },
          {
            "label": "Can we do the following week instead?",
            "to": "meeting_booked"
          }
        ]
      },
      "meeting_fallback_email": {
        "label": "MEETING — CHECKING CALENDAR",
        "say": "No problem — I'll shoot you an email with a couple time options so you can just pick one. What's the best email — is it britton at luxury EMA dot com?",
        "note": "Confirm the email. Send 2-3 specific time options within the hour. This is weaker than booking live but better than a vague 'I'll get back to you.'",
        "branches": [
          {
            "label": "Confirms email / Yes that's it",
            "to": "email_confirmed"
          },
          {
            "label": "Gives a different email",
            "to": "email_confirmed"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING BOOKED",
        "say": "Perfect — I'll send over a calendar invite right now so it's locked in. Really appreciate you taking my call, Britton. Talk soon.",
        "note": "STOP SELLING. Send the invite immediately to britton@luxuryema.com. If she mentioned involving Sarah, add sarah@luxuryema.com to the invite too. Confirm the time zone.",
        "branches": []
      },
      "reschedule_set": {
        "label": "CALLBACK SCHEDULED",
        "say": "Perfect — I'll try you then. Appreciate it, Britton.",
        "note": "Log the exact callback time. When you call back, open with: 'Hey Britton, it's Sam Parks — you told me to try you back today.' That reframes it as a scheduled call, not a cold call.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything ever changes, I'm easy to find — Sam Parks, RapidEye. Appreciate your time, Britton.",
        "note": "Don't burn the bridge. Stay warm. Send a short one-line follow-up email to britton@luxuryema.com with your contact info. She may mention you to Sarah later — you never know.",
        "branches": []
      }
    }
  }
}