{
  "name": "Cadara Sanders",
  "title": "Client Operations Specialist",
  "company": "Luxury Estate Managers of Aspen (LEMA)",
  "location": "Aspen, CO",
  "phone": "+1-808-346-5213",
  "company_phone": "+1-970-920-1776",
  "alt_phones": [],
  "flow": {
    "context": "Cadara Sanders is Client Operations Specialist at LEMA — a boutique luxury estate management firm in Aspen, CO with about 10 staff and no known tech stack. She has 10+ years in marketing, communications, and client experience and owns client-facing workflows, but she does NOT own property inspections or tooling decisions. The real decision-makers are Sarah Korpela (President, 970.379.4705) and Britton Nieslanik (VP, 970.948.9896). Cadara is most valuable as a referral path to leadership or as an internal champion for client-experience improvements. Strongest connection: Sam was just skiing Jackson Hole last month — natural Aspen-market proximity plus shared luxury hospitality world.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Cadara — I work with a few luxury property managers in mountain markets like Aspen. I was actually just out in Jackson Hole last month. It's Sam Parks with RapidEye — have you heard my name tossed around at all?",
        "note": "Relaxed. Smile. Let the Jackson Hole mention sit naturally — you're a peer in their world, not a vendor reading a script. Feet-up-on-the-desk energy.",
        "branches": [
          {
            "label": "No / Who? / I haven't",
            "to": "heard_no"
          },
          {
            "label": "Yeah actually / Maybe",
            "to": "heard_yes"
          },
          {
            "label": "Now's not a good time",
            "to": "bad_timing"
          },
          {
            "label": "What is this about? / Who are you?",
            "to": "who_is_this"
          }
        ]
      },
      "heard_no": {
        "label": "HAVEN'T HEARD THE NAME — PAIN TRIGGER",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason I'm calling — I work with a couple other luxury PM teams, and their client-facing people kept telling me the same thing. Their property managers were already snapping photos after every turnover, but nobody had time to actually go through them all carefully. So little things would slip — a scuff on the hardwood, a missing accent piece, a stain on a duvet — and the first person to hear about it was whoever was on the client side, because the owner would call in. And now it's a fire drill instead of something that could've been caught that morning.",
        "note": "Paint HER daily life — she's the one fielding owner calls when something slips. Pause after 'fire drill' and let her react. Do NOT rush to the solution.",
        "branches": [
          {
            "label": "Yeah that happens / That sounds familiar",
            "to": "warm_reaction"
          },
          {
            "label": "We actually have a good process for that",
            "to": "objection_have_process"
          },
          {
            "label": "I'm not really the person for that",
            "to": "not_my_area"
          },
          {
            "label": "Not interested / We don't need that",
            "to": "objection_not_interested"
          }
        ]
      },
      "heard_yes": {
        "label": "HEARD YES — EXPLORE",
        "say": "Oh nice — well normally we'd be working with someone in your shoes. What did you hear?",
        "note": "Rare but great. Let her talk. Whatever she says, bridge to: 'Yeah exactly — would it make sense to show you what that actually looks like?'",
        "branches": [
          {
            "label": "Describes what she heard",
            "to": "warm_reaction"
          },
          {
            "label": "Vague / Not really sure",
            "to": "heard_no"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow or later this week?",
        "note": "Don't push. Lock a specific callback time if possible.",
        "branches": [
          {
            "label": "Sure, try me [day/time]",
            "to": "callback_locked"
          },
          {
            "label": "Just email me",
            "to": "send_email"
          },
          {
            "label": "Not interested at all",
            "to": "objection_not_interested"
          }
        ]
      },
      "callback_locked": {
        "label": "CALLBACK CONFIRMED",
        "say": "Perfect — I'll try you then. Really appreciate it, Cadara. Talk soon.",
        "note": "Write down the exact time. Set a reminder immediately. Don't pitch anything else.",
        "branches": []
      },
      "who_is_this": {
        "label": "SKEPTICAL — PERMISSION FALLBACK",
        "say": "Yeah totally fair — it is a cold call, I'll be honest. I'm Sam Parks with RapidEye. Can I get 30 seconds to tell you why I called, and you can totally hang up on me if it's not a fit?",
        "note": "Disarm with honesty. Smile through it. The '30 seconds' ask is low-stakes enough most people say yes.",
        "branches": [
          {
            "label": "Sure, go ahead",
            "to": "pain_trigger_short"
          },
          {
            "label": "No thanks / Not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED — SPLIT",
        "say": "Totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it more that you already know what we do and it's just not interesting?",
        "note": "Genuine, not manipulative. If she says bad timing, offer a callback. If not interesting, end gracefully. Either answer is useful.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not interesting / Don't need it",
            "to": "ending_graceful"
          },
          {
            "label": "Actually… what is it?",
            "to": "pain_trigger_short"
          }
        ]
      },
      "pain_trigger_short": {
        "label": "SHORT PAIN TRIGGER",
        "say": "So I work with luxury PM companies — we built a tool that automatically reviews the photos your team's already taking after turnovers and catches stuff that gets missed. Damage, missing items, staging issues — things that usually don't surface until an owner or a guest calls in about it. Would you be open to taking a look when I'm not cold calling you out of the blue?",
        "note": "Compressed version — one breath. Don't oversell. Pause after the CTA and let her respond.",
        "branches": [
          {
            "label": "Sure / Maybe",
            "to": "book_meeting"
          },
          {
            "label": "I'm not really the person for that",
            "to": "not_my_area"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          }
        ]
      },
      "warm_reaction": {
        "label": "WARM — STOP PITCHING, START ASKING",
        "say": "Yeah — so we built something that automatically reviews those turnover photos and flags anything that looks off. Plugs right into whatever your team's already using. But before I talk your ear off — what does the process look like on your end right now? Like when a turnover happens, how does your team document it and make sure everything's good?",
        "note": "She's warm. DO NOT keep selling. Ask questions and listen. Her answers tell you whether to pitch deeper or ask for a referral to the right person. She may not know the operational details — that's fine, it still tells you who to ask next.",
        "branches": [
          {
            "label": "Describes their process",
            "to": "discovery_deeper"
          },
          {
            "label": "I don't really handle that side",
            "to": "not_my_area"
          },
          {
            "label": "We use [tool / specific process]",
            "to": "discovery_current_tool"
          }
        ]
      },
      "discovery_deeper": {
        "label": "DISCOVERY — DIG IN",
        "say": "Got it. And when something does get missed — like a small damage or a staging issue — how does that usually surface? Is it typically an owner calling in, or does your team catch it on a later walkthrough?",
        "note": "You're mapping their pain loop. If she describes the downstream headache vividly, she's your internal champion. If she's vague, pivot to referral.",
        "branches": [
          {
            "label": "Describes pain / gives detail",
            "to": "bridge_to_meeting"
          },
          {
            "label": "Honestly the PMs handle that part",
            "to": "not_my_area"
          },
          {
            "label": "We're pretty good at catching things",
            "to": "objection_have_process"
          }
        ]
      },
      "discovery_current_tool": {
        "label": "THEY MENTION A TOOL OR PROCESS",
        "say": "Oh interesting — and how's that been working for you guys? Does it catch most of what you need, or do things still slip through?",
        "note": "Don't bash their tool. If they're happy, respect it. If they mention gaps, that's your opening. Whatever they tell you is intel for the next call.",
        "branches": [
          {
            "label": "Works okay / Has some gaps",
            "to": "bridge_to_meeting"
          },
          {
            "label": "We're pretty happy with it",
            "to": "objection_have_process"
          },
          {
            "label": "I'm not sure, the PMs would know better",
            "to": "not_my_area"
          }
        ]
      },
      "bridge_to_meeting": {
        "label": "BRIDGE TO MEETING",
        "say": "Yeah that's exactly what I'm hearing from other teams in the Aspen market. Look — I don't want to take up your whole afternoon. Would it make sense to set up 15 minutes where I can show you what this actually looks like? Even if it's not the right fit, I think you'd find it interesting to see what other luxury PMs are doing with their turnover photos.",
        "note": "Sell the meeting, not the product. 'What other luxury PMs are doing' is value even if they never buy. If she wants to include someone else, even better.",
        "branches": [
          {
            "label": "Sure / Yeah let's do it",
            "to": "book_meeting"
          },
          {
            "label": "You should really talk to someone else here",
            "to": "referral_offered"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "test_drive_pitch"
          }
        ]
      },
      "not_my_area": {
        "label": "NOT HER AREA — PIVOT TO REFERRAL",
        "say": "Totally makes sense — I figured you'd know the lay of the land over there though. Who on your team usually owns the inspection and turnover workflow? Is that more Sarah's world or one of the property managers?",
        "note": "Drop Sarah's name naturally — shows you've done homework and makes it easy for Cadara to confirm or redirect. Don't be pushy — she's doing you a favor.",
        "branches": [
          {
            "label": "Sarah handles that / Talk to Sarah",
            "to": "referral_sarah"
          },
          {
            "label": "Britton would be better",
            "to": "referral_britton"
          },
          {
            "label": "One of the PMs handles it",
            "to": "referral_pm"
          },
          {
            "label": "I'm not sure / Can't really help",
            "to": "referral_gentle_push"
          }
        ]
      },
      "referral_offered": {
        "label": "REFERRAL PROACTIVELY OFFERED",
        "say": "Oh that's really helpful — who would you point me to?",
        "note": "She's giving you a name. Just ask and listen. Don't interrupt.",
        "branches": [
          {
            "label": "Sarah / the President",
            "to": "referral_sarah"
          },
          {
            "label": "Britton / the VP",
            "to": "referral_britton"
          },
          {
            "label": "One of the property managers",
            "to": "referral_pm"
          }
        ]
      },
      "referral_sarah": {
        "label": "REFERRAL TO SARAH KORPELA",
        "say": "Perfect — Sarah Korpela, right? Would it be cool if I mentioned you pointed me her way, or would you rather I just reach out cold?",
        "note": "Confirming the name shows you're not blind. Asking permission to use Cadara's name is respectful and makes the Sarah call dramatically warmer.",
        "branches": [
          {
            "label": "Yeah go ahead / Sure mention me",
            "to": "referral_lock_details"
          },
          {
            "label": "Just reach out on your own",
            "to": "referral_lock_details"
          },
          {
            "label": "Actually Britton might be better",
            "to": "referral_britton"
          }
        ]
      },
      "referral_britton": {
        "label": "REFERRAL TO BRITTON",
        "say": "Britton — great. Would she be the one who'd sign off on something like this, or should I loop Sarah in too?",
        "note": "Map the decision chain. Britton is VP so she has influence, but Sarah as President likely has final say. Try to understand if you need both.",
        "branches": [
          {
            "label": "Britton can handle it",
            "to": "referral_lock_details"
          },
          {
            "label": "You'd probably need Sarah too",
            "to": "referral_lock_details"
          },
          {
            "label": "Not sure about their process",
            "to": "referral_lock_details"
          }
        ]
      },
      "referral_pm": {
        "label": "REFERRAL TO A PM",
        "say": "Got it — is there one PM in particular who's most hands-on with turnovers? Like who'd feel this pain day to day?",
        "note": "LEMA has 6+ PMs. Getting a specific name is gold. Nathan (engineering brain), Joseph (military maintenance mindset), or Dane (construction background) would be ideal champions.",
        "branches": [
          {
            "label": "Names a specific PM",
            "to": "referral_lock_details"
          },
          {
            "label": "They all do / Not sure who",
            "to": "referral_lock_details"
          }
        ]
      },
      "referral_gentle_push": {
        "label": "GENTLE PUSH FOR A NAME",
        "say": "No worries at all. If I could even just get a first name, I'll put something tailored together so it actually lands and doesn't feel like a random cold pitch. Is Sarah Korpela still running things over there?",
        "note": "Dropping Sarah's name is a soft confirmation ask. Most people will confirm or correct. Either way you get intel.",
        "branches": [
          {
            "label": "Yeah Sarah's the one",
            "to": "referral_sarah"
          },
          {
            "label": "Gives another name",
            "to": "referral_lock_details"
          },
          {
            "label": "I really can't help",
            "to": "ending_graceful"
          }
        ]
      },
      "referral_lock_details": {
        "label": "LOCK REFERRAL DETAILS",
        "say": "Really appreciate that, Cadara. I'll put something specific together for them so it's not just a generic pitch. Is their direct line the best way to reach them, or do they prefer email?",
        "note": "You already have contact info from research — but asking shows respect and may surface preferences ('Sarah never answers her phone, email her'). Write down whatever she says.",
        "branches": [
          {
            "label": "Gives a contact preference",
            "to": "referral_thank_close"
          },
          {
            "label": "Just try their cell / the office",
            "to": "referral_thank_close"
          }
        ]
      },
      "referral_thank_close": {
        "label": "CLOSE AFTER REFERRAL — END WARM",
        "say": "This is super helpful. Seriously appreciate you taking my call — I know I caught you totally out of the blue. If you ever want to see what we're doing, you know where to find me. Have a great rest of your day, Cadara.",
        "note": "Leave a great impression. She may mention this call to Sarah or Britton before you even dial. Don't overstay.",
        "branches": []
      },
      "objection_not_interested": {
        "label": "NOT INTERESTED — AGREE FIRST",
        "say": "Totally get it — I should've assumed you guys would be all set. Otherwise you probably would've reached out to us. Just so nobody from my team cold calls you again — is it more that this isn't really a problem you're seeing over there, or is it that you just hate getting cold calls?",
        "note": "Agree first — surprise her by not pushing. The split gives her an easy out that still gives you information. 'Not a problem' is real intel. 'Hate cold calls' means the door might be open via email.",
        "branches": [
          {
            "label": "Not really a problem for us",
            "to": "test_drive_pitch"
          },
          {
            "label": "I just don't like cold calls",
            "to": "offer_email_instead"
          },
          {
            "label": "I'm just not the right person for this",
            "to": "not_my_area"
          }
        ]
      },
      "objection_have_process": {
        "label": "THEY HAVE A PROCESS — AGREE AND SPLIT",
        "say": "That makes total sense — with the level of service you guys promise your clients, you'd have to have something solid in place. Is it more that you're fully covered and everything's airtight, or that switching or adding anything right now would just be a headache?",
        "note": "Don't bash their process. The split reveals whether they're truly happy or just change-averse. Change-averse is actually better for you — it means there IS a gap.",
        "branches": [
          {
            "label": "We're pretty airtight / Happy with it",
            "to": "respect_and_plant_seed"
          },
          {
            "label": "It's more the hassle of changing things",
            "to": "test_drive_pitch"
          },
          {
            "label": "Actually there are some gaps",
            "to": "warm_reaction"
          }
        ]
      },
      "test_drive_pitch": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally fair — and honestly I'm not trying to get you to buy anything today. But the teams that make the best decisions are usually the ones who already know what's out there before they need it. Would you be open to just seeing what other luxury PMs in similar markets are doing with their turnover photos? Worst case you steal some ideas and we part as friends.",
        "note": "Low-pressure value offer. The meeting is valuable even if they never buy. If she still says no, respect it.",
        "branches": [
          {
            "label": "Sure / Fine / Why not",
            "to": "book_meeting"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          },
          {
            "label": "You should really talk to someone else here",
            "to": "not_my_area"
          },
          {
            "label": "No thanks",
            "to": "ending_graceful"
          }
        ]
      },
      "respect_and_plant_seed": {
        "label": "RESPECT IT — PLANT A SEED",
        "say": "Love to hear that — seriously. Not many teams can honestly say they've got that dialed. Look, I'll leave you alone, but if anything ever shifts or you guys are looking at process tweaks heading into busy season, I'm super easy to find. Is email the best way to stay in touch?",
        "note": "She said they're good. Respect it completely. But get permission to follow up by email — and she may still give you a referral as the call winds down.",
        "branches": [
          {
            "label": "Yeah email works",
            "to": "confirm_email_close"
          },
          {
            "label": "Actually you should talk to…",
            "to": "not_my_area"
          },
          {
            "label": "Nah we're good",
            "to": "ending_graceful"
          }
        ]
      },
      "confirm_email_close": {
        "label": "CONFIRM EMAIL AND CLOSE",
        "say": "Perfect — I'll shoot something over to you at LEMA. And honestly if you think Sarah or anyone on the PM team would find it useful, feel free to forward it along. Really appreciate your time, Cadara.",
        "note": "Dropping Sarah's name casually plants a seed. Cadara might forward it. Light touch — don't oversell it.",
        "branches": []
      },
      "offer_email_instead": {
        "label": "HATES COLD CALLS — OFFER EMAIL",
        "say": "Ha — honestly I don't blame you. Would it be less painful if I just sent you a quick note? I'll keep it short, no novel.",
        "note": "She's not rejecting the concept — she's rejecting the medium. Email is fine. Get confirmation and send something tailored within the hour.",
        "branches": [
          {
            "label": "Sure send an email",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "ending_graceful"
          }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question so I don't just send you another generic thing — what would be most useful to include? Is it more about the cost side, or more about how it actually works day to day?",
        "note": "This question does two things: (1) tailors your follow-up, (2) gets her talking about what she cares about — that's free discovery.",
        "branches": [
          {
            "label": "Tells you what she cares about",
            "to": "send_email_confirm"
          },
          {
            "label": "Just send whatever / I'll take a look",
            "to": "send_email_confirm"
          }
        ]
      },
      "send_email_confirm": {
        "label": "CONFIRM EMAIL SEND — CLOSE",
        "say": "Done — I'll get it over to you today. I'll throw a couple time options in there in case you want to hop on a quick call after you've looked at it. Really appreciate it, Cadara.",
        "note": "Send the email within 2 hours. 4-5 sentences max. Include one specific time suggestion and a one-line CTA. Subject line should reference LEMA by name.",
        "branches": []
      },
      "book_meeting": {
        "label": "BOOK THE MEETING — LOCK IT NOW",
        "say": "Awesome — I've got next week pulled up. Would Tuesday or Thursday work better for a quick 15 minutes?",
        "note": "Give two options — don't say 'whenever works.' Lock a specific day and time. Send the calendar invite while still on the phone.",
        "branches": [
          {
            "label": "Picks a day/time",
            "to": "meeting_locked"
          },
          {
            "label": "Let me check and get back to you",
            "to": "meeting_pin_down"
          },
          {
            "label": "Should we include Sarah / someone else?",
            "to": "meeting_add_stakeholder"
          }
        ]
      },
      "meeting_locked": {
        "label": "MEETING CONFIRMED",
        "say": "Perfect — I'm sending the invite right now so it doesn't get lost. Really appreciate you taking my call, Cadara. Looking forward to it.",
        "note": "STOP SELLING. Meeting is booked. Send the invite immediately. Short, warm, done.",
        "branches": []
      },
      "meeting_pin_down": {
        "label": "PIN DOWN THE MEETING",
        "say": "Totally — how about I throw a hold on Thursday at 2 your time, and if it doesn't work just let me know and we'll shift it? That way it's on the calendar and not floating around.",
        "note": "Propose a specific time. Vague 'I'll get back to you' meetings almost never happen. Get something on the calendar even if it moves.",
        "branches": [
          {
            "label": "Okay sure",
            "to": "meeting_locked"
          },
          {
            "label": "Just email me some times",
            "to": "send_email_confirm"
          }
        ]
      },
      "meeting_add_stakeholder": {
        "label": "ADD ANOTHER STAKEHOLDER",
        "say": "Great idea — who should I loop in? I can send one invite to both of you so it's easy.",
        "note": "If she wants to include a decision-maker, that's the best possible outcome. Get the name, confirm their email, send one invite to everyone.",
        "branches": [
          {
            "label": "Names someone to include",
            "to": "meeting_locked"
          },
          {
            "label": "Let me check with them first",
            "to": "meeting_pin_down"
          }
        ]
      },
      "voicemail": {
        "label": "VOICEMAIL",
        "say": "Hey Cadara — it's Sam Parks. I work with a few luxury property managers in the Aspen area on their inspection workflows. Was hoping to get your take on something quick — I'll try you again, but feel free to reach me at [your number]. Thanks.",
        "note": "Under 20 seconds. Sound like a peer. Don't mention RapidEye by name — creates curiosity. Don't pitch. Call back in 2-3 days if no response.",
        "branches": []
      },
      "ending_graceful": {
        "label": "END GRACEFULLY",
        "say": "Totally understand. If anything changes, I'm easy to find. Appreciate your time, Cadara — have a great one.",
        "note": "Don't burn the bridge. She talks to Sarah and Britton every day. Leave her with a positive impression even if the call went nowhere.",
        "branches": []
      }
    }
  }
}