{
  "name": "Carlos Corzo",
  "title": "Chief Technology Officer (CTO)",
  "company": "Vacasa",
  "location": "San Diego, CA",
  "phone": "+1-503-345-9399",
  "company_phone": "800-544-0300",
  "alt_phones": [
    "+1-800-544-0300",
    "+1-800-863-8415",
    "+1-850-299-9469",
    "+1-208-203-3377"
  ],
  "flow": {
    "context": "Carlos Corzo is CTO at Vacasa, now a wholly owned Casago subsidiary since May 2025. He owns Vacasa's proprietary tech stack — HomeCare Hub (AI-driven scheduling/dispatch), the field app (post-cleaning photo submissions + real-time inspection approval), and ticketing — across 40,000+ properties. Post-acquisition, he's navigating tech integration as Casago rolls out Breezeway and Guesty at the franchise level, creating architectural decisions about what stays proprietary vs. what gets standardized. Vacasa's field app already captures post-clean photos for inspection approval — the gap is that review at scale is manual and volume overwhelms human reviewers. Sam has no direct personal connection to Carlos — lead with industry proximity and the Casago network angle. Sam's SoCal roots (grew up in LA) and surfing background give a soft geographic tie to San Diego.",
    "start": "gatekeeper_initial",
    "nodes": {
      "gatekeeper_initial": {
        "label": "GATEKEEPER — SLIDE BY",
        "say": "Hey, could you get me through to Carlos? It's Sam.",
        "note": "Don't volunteer more info. Pause and wait. Sound like you already know him. Feet-up energy.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Asks who you are or what it's about",
            "to": "gatekeeper_context"
          },
          {
            "label": "He's not available",
            "to": "gatekeeper_voicemail"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — ADD CONTEXT",
        "say": "Yeah, I work with a few other property management companies on their inspection workflows — we've been in touch with some folks in the Casago network. Would you mind letting Carlos know it's Sam Parks?",
        "note": "Casago network reference is accurate — Vacasa IS Casago now. Don't elaborate. End with the redirect question.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Still screening or pushing back",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "He's not available",
            "to": "gatekeeper_voicemail"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "Totally understand. We help a couple other property management companies automate their inspection photo review — I sent Carlos a note and was just following up. Would you mind giving him a heads up that I called?",
        "note": "If you sent an email, this is true. If not, send one right after hanging up. Always end by redirecting with a question.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Takes a message or says they'll pass it along",
            "to": "graceful_exit_gatekeeper"
          },
          {
            "label": "Hard no",
            "to": "graceful_exit_gatekeeper"
          }
        ]
      },
      "gatekeeper_voicemail": {
        "label": "VOICEMAIL",
        "say": "Hey Carlos, it's Sam Parks — I've been talking to a few folks in the Casago network about their turnover photo workflows. Had something specific for you on the tech side. My number is [your number]. Again, Sam Parks — I'll try you again tomorrow.",
        "note": "Under 15 seconds. Casual, not scripted. Call back tomorrow at a different time of day.",
        "branches": []
      },
      "graceful_exit_gatekeeper": {
        "label": "EXIT — GATEKEEPER",
        "say": "Really appreciate that. Thanks so much.",
        "note": "Note the gatekeeper's name for next time. Call back at a different time of day tomorrow.",
        "branches": []
      },
      "opener": {
        "label": "OPENER",
        "say": "Hey Carlos — we haven't met yet. I've been talking to a few folks in the Casago network about their inspection workflows. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Casual tone — peer, not vendor. The Casago network reference is intentional: Vacasa IS Casago now. Pause after the question and let silence work.",
        "branches": [
          {
            "label": "No / who?",
            "to": "heard_name_no"
          },
          {
            "label": "Yeah / maybe",
            "to": "heard_name_yes"
          },
          {
            "label": "I'm busy / not a good time",
            "to": "bad_timing"
          },
          {
            "label": "Confused or skeptical",
            "to": "permission_fallback"
          }
        ]
      },
      "heard_name_no": {
        "label": "THEY HAVEN'T HEARD OF YOU",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call — I was talking to a CTO at another large PM company, pretty similar setup to yours. They had their field team snapping photos after every clean, submitting them through their ops app for approval. Sound familiar? The problem was nobody actually had time to review thousands of photo sets and catch every damaged countertop or missing TV remote. The approval step was basically a rubber stamp. Guest checks in, finds a cracked coffee table, and the photos from two hours earlier clearly showed it — but nobody caught it because the volume was just too high for human eyes. We built an AI layer that plugs into the photos your team's already capturing — analyzes them automatically, flags damage, missing items, staging issues — so that approval step actually catches things before the guest does. Would you be open to seeing how it'd work with your stack? Happy to do it when I'm not cold calling you out of the blue.",
        "note": "Pause after 'rubber stamp' — let it land. He'll likely recognize this because Vacasa's field app literally has post-clean photo approval. If he interrupts with recognition, stop and let him talk.",
        "branches": [
          {
            "label": "Interested / tell me more",
            "to": "warm_discovery"
          },
          {
            "label": "We already have something for that",
            "to": "objection_have_process"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          },
          {
            "label": "No budget / bad timing to buy",
            "to": "objection_no_budget"
          }
        ]
      },
      "heard_name_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone in your seat. What'd you hear?",
        "note": "Rare but great. Let them talk. Mirror what they say and transition naturally into discovery.",
        "branches": [
          {
            "label": "Shares what they heard",
            "to": "warm_discovery"
          },
          {
            "label": "Vague or testing you",
            "to": "pain_trigger_short"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow around the same time?",
        "note": "Respect it. Get a callback window. Don't pitch.",
        "branches": [
          {
            "label": "Sure / gives a time",
            "to": "book_callback"
          },
          {
            "label": "Just tell me what it is quickly",
            "to": "pain_trigger_short"
          },
          {
            "label": "Don't call back / not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "book_callback": {
        "label": "BOOK CALLBACK",
        "say": "Perfect — I'll try you then. Appreciate it, Carlos.",
        "note": "Set a reminder immediately. Call at exactly the time they said. Note any context from this exchange.",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not a fit?",
        "note": "Disarming honesty. Most people give you the 30 seconds. If yes, go straight to the condensed pain trigger.",
        "branches": [
          {
            "label": "Sure / go ahead",
            "to": "pain_trigger_short"
          },
          {
            "label": "No / not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it more that you already know what we do and it's just not interesting?",
        "note": "Split the objection. You're figuring out if it's timing or substance. Either answer gives you something to work with.",
        "branches": [
          {
            "label": "It's just bad timing",
            "to": "bad_timing_recovery"
          },
          {
            "label": "Not interested / don't need it",
            "to": "objection_not_interested"
          },
          {
            "label": "Hard no / hangs up",
            "to": "graceful_exit"
          }
        ]
      },
      "bad_timing_recovery": {
        "label": "BAD TIMING RECOVERY",
        "say": "Totally fair. When would be the least terrible time for me to try you back? I promise I'll keep it short.",
        "note": "Get a specific day and time. If they say 'just email me,' transition to send_email.",
        "branches": [
          {
            "label": "Gives a time",
            "to": "book_callback"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          }
        ]
      },
      "pain_trigger_short": {
        "label": "PAIN TRIGGER — CONDENSED",
        "say": "Here's the deal — I work with a few other large PM companies, and the pattern I keep seeing is: field teams are snapping hundreds of photos after every clean, submitting them for approval, but nobody has bandwidth to actually review them all at scale. Stuff gets missed, guest finds damage that was sitting right there in a photo from two hours earlier. We built an AI layer that analyzes those photos automatically — flags damage, missing items, staging issues — and plugs into whatever stack you're already running. Would you be open to taking a quick look?",
        "note": "Compressed version for limited time. Hit the pain, one-line solution, CTA. Pause after 'quick look' and wait.",
        "branches": [
          {
            "label": "Interested / tell me more",
            "to": "warm_discovery"
          },
          {
            "label": "We already have something for that",
            "to": "objection_have_process"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          },
          {
            "label": "No budget right now",
            "to": "objection_no_budget"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          }
        ]
      },
      "warm_discovery": {
        "label": "DISCOVERY — STOP PITCHING",
        "say": "Awesome — so I know you guys have HomeCare Hub and the field app handling a lot of the turnover workflow already. How does the photo review and approval step actually work today? Is that still mostly a manual process on someone's end?",
        "note": "You know from their SEC filings that the field app does post-clean photo submission for inspection approval. Naming HomeCare Hub shows you did your homework. Let him talk. Take notes on everything.",
        "branches": [
          {
            "label": "Describes their current process",
            "to": "warm_discovery_deeper"
          },
          {
            "label": "Surprised you know about HomeCare Hub",
            "to": "warm_discovery_deeper"
          },
          {
            "label": "Says it's mostly automated already",
            "to": "existing_automation_branch"
          },
          {
            "label": "Redirects to someone else on the team",
            "to": "referral_ask"
          }
        ]
      },
      "warm_discovery_deeper": {
        "label": "DEEPER DISCOVERY",
        "say": "That makes sense. And with the Casago integration happening — are you guys looking at keeping the proprietary stack as-is, or is there a move toward standardizing on something like Breezeway or Guesty across the franchise network? I'm asking because that'd change where something like ours plugs in.",
        "note": "High-value question for a CTO. Casago announced Breezeway and Guesty partnerships — Carlos is probably wrestling with this exact architectural question. Let him talk. Don't interrupt.",
        "branches": [
          {
            "label": "Shares tech direction or integration plans",
            "to": "bridge_to_meeting"
          },
          {
            "label": "Says it's too early or still figuring it out",
            "to": "bridge_to_meeting_early"
          },
          {
            "label": "Gets guarded or doesn't want to share",
            "to": "bridge_to_meeting"
          },
          {
            "label": "Says ops team would know better",
            "to": "referral_ask"
          }
        ]
      },
      "existing_automation_branch": {
        "label": "THEY CLAIM IT'S AUTOMATED",
        "say": "Oh interesting — so you've got something doing automated analysis on the photo sets themselves? Or is it more that the workflow is automated but the actual review is still eyeballs on screen?",
        "note": "Almost nobody has AI analyzing turnover photos at scale. They probably mean the submission/routing/approval workflow is automated but actual damage detection is still manual. Clarify without being confrontational.",
        "branches": [
          {
            "label": "Admits review is still manual",
            "to": "bridge_to_meeting"
          },
          {
            "label": "Says they truly have AI analyzing photos",
            "to": "genuine_competitor_path"
          },
          {
            "label": "Gets vague",
            "to": "bridge_to_meeting"
          }
        ]
      },
      "genuine_competitor_path": {
        "label": "GENUINE COMPETITOR",
        "say": "Oh that's awesome — who are you using for that? I'd genuinely love to know. We're building in this space and I always want to understand what's out there.",
        "note": "If they truly have AI photo analysis, learn what it is. Could be an internal build. Either way, be genuinely curious. If it's internal, there may still be a fit for change detection or baseline comparison they're not doing.",
        "branches": [
          {
            "label": "Names a tool or describes internal build",
            "to": "graceful_exit_competitor"
          },
          {
            "label": "Gets vague or can't name it specifically",
            "to": "bridge_to_meeting"
          }
        ]
      },
      "graceful_exit_competitor": {
        "label": "EXIT — COMPETITOR IN PLACE",
        "say": "That's really cool. Appreciate you sharing that. If you ever want a second set of eyes or want to compare approaches, I'm easy to find. Enjoy the rest of your day, Carlos.",
        "note": "Don't push. You now know what they use. Log it. Follow up in 6 months or if their situation changes.",
        "branches": []
      },
      "objection_have_process": {
        "label": "OBJECTION — WE HAVE SOMETHING",
        "say": "That makes total sense — with 40,000-plus properties you'd have to have something in place. Especially with everything your team built into the field app.",
        "note": "Agree first. Validate the work they've done. Don't fight the objection — then split it.",
        "branches": [
          {
            "label": "Elaborates on what they have",
            "to": "objection_split_process"
          },
          {
            "label": "Stays firm",
            "to": "objection_split_process"
          }
        ]
      },
      "objection_split_process": {
        "label": "SPLIT — PROCESS OBJECTION",
        "say": "Just so no one from my team cold calls you again — is it that you're fully covered and happy with how the photo review step is working at scale, or is it more that changing anything in the stack right now — especially mid-integration — would be a headache?",
        "note": "The mid-integration reference is key. Post-Casago acquisition, any tech change is harder. If it's headache-driven, position as 'look now, decide later.' If they're truly happy, exit gracefully.",
        "branches": [
          {
            "label": "It's a headache / bad timing to change anything",
            "to": "sell_test_drive"
          },
          {
            "label": "We're actually happy with how it works",
            "to": "sell_test_drive_light"
          },
          {
            "label": "Opens up about gaps in the process",
            "to": "warm_discovery"
          }
        ]
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "I totally get it — I should have assumed you'd be all set. Otherwise you probably would have reached out yourself.",
        "note": "Agree. Lower their guard. Pause briefly, then split.",
        "branches": [
          {
            "label": "Softens slightly",
            "to": "objection_split_interest"
          },
          {
            "label": "Stays firm",
            "to": "objection_split_interest"
          }
        ]
      },
      "objection_split_interest": {
        "label": "SPLIT — NOT INTERESTED",
        "say": "Just so nobody from my team bugs you again — is it that automated photo analysis isn't something you're focused on right now, or is it more that you just hate cold calls? Either way I'm cool with it.",
        "note": "The humor helps. If it's 'hate cold calls,' redirect to email. If it's 'not focused on it,' ask what IS the priority — or sell the test drive.",
        "branches": [
          {
            "label": "Hate cold calls / just don't want to talk right now",
            "to": "send_email"
          },
          {
            "label": "Not focused on this right now",
            "to": "sell_test_drive"
          },
          {
            "label": "Opens up about what they ARE focused on",
            "to": "warm_discovery_deeper"
          }
        ]
      },
      "objection_no_budget": {
        "label": "OBJECTION — NO BUDGET",
        "say": "Totally get it. Especially post-acquisition — I'm sure every dollar's getting scrutinized right now.",
        "note": "Reference the Casago acquisition casually. Shows you understand their world. Pause, then split.",
        "branches": [
          {
            "label": "Confirms budget is tight",
            "to": "objection_split_budget"
          },
          {
            "label": "Elaborates on constraints",
            "to": "objection_split_budget"
          }
        ]
      },
      "objection_split_budget": {
        "label": "SPLIT — BUDGET",
        "say": "Totally hear you. Is it that budget for this cycle is completely locked, or is it more that anything new you try to bring in has to go through Casago leadership and that's a whole process?",
        "note": "You're figuring out if it's a timing issue or an approval chain issue. If approval chain, you might need Joe Riley or Steve Schwab on your radar. Either answer is useful intel.",
        "branches": [
          {
            "label": "Budget is locked or frozen",
            "to": "sell_test_drive"
          },
          {
            "label": "Approval chain is the real issue",
            "to": "sell_test_drive_approval"
          },
          {
            "label": "Opens up more about the situation",
            "to": "warm_discovery"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "You're probably not buying anything right now, and I totally respect that. But when things do open up — whether that's next quarter or after the integration settles — the people who move fastest are the ones who already know what's on their list. Would you be open to a 20-minute look at how it works? Not a sales pitch — just so you've seen it and can make a call when the time's right.",
        "note": "You're not asking them to buy. You're asking them to be informed. Low pressure. Pause and let them answer.",
        "branches": [
          {
            "label": "Sure / open to it",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "offer_of_value"
          },
          {
            "label": "Someone else on my team would be better for this",
            "to": "referral_ask"
          }
        ]
      },
      "sell_test_drive_light": {
        "label": "TEST DRIVE — LIGHT VERSION",
        "say": "If nothing else, I could walk you through what a couple other large PM companies are doing with AI on their turnover photos — how they're catching stuff their manual review was missing. Worst case you steal some ideas and we part as friends. Would that be worth 20 minutes?",
        "note": "This is the offer-of-value frame. The meeting is worth their time even if they never buy from you.",
        "branches": [
          {
            "label": "Sure / that could be useful",
            "to": "book_meeting"
          },
          {
            "label": "Not right now / just email me",
            "to": "send_email"
          },
          {
            "label": "Hard no",
            "to": "graceful_exit"
          }
        ]
      },
      "sell_test_drive_approval": {
        "label": "TEST DRIVE — APPROVAL CHAIN",
        "say": "Totally makes sense. What if we did a quick look so you've got it in your back pocket — and if it makes sense, I can put together something tailored that makes it easy to bring upstairs? I've done that for a few other CTOs who had to get leadership buy-in post-merger.",
        "note": "You're offering to help him sell internally. CTOs appreciate that. If he mentions who approves, note the name — could be Joe Riley or Steve Schwab at Casago.",
        "branches": [
          {
            "label": "That could work / let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Not the right time",
            "to": "graceful_exit"
          }
        ]
      },
      "offer_of_value": {
        "label": "OFFER OF VALUE",
        "say": "Honestly Carlos — even if this isn't a fit right now, I could share what we're seeing other PM companies at your scale do with their turnover photo data. Some of it's pretty creative stuff. Worst case it's a useful 15 minutes and you've got my number if anything changes.",
        "note": "Last attempt before exit. Keep it genuinely light. You're offering value, not begging.",
        "branches": [
          {
            "label": "Okay / sure why not",
            "to": "book_meeting"
          },
          {
            "label": "Just email me",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "graceful_exit"
          }
        ]
      },
      "bridge_to_meeting": {
        "label": "BRIDGE TO MEETING",
        "say": "This is really helpful context. I don't want to take up your whole afternoon on a cold call — would you be open to a 20-minute call later this week where I can show you exactly how we'd plug into your setup? I can come prepared with specifics for your stack.",
        "note": "You've earned interest through discovery. Convert it to a booked meeting NOW. Be ready to suggest a specific day and time.",
        "branches": [
          {
            "label": "Sure / open to it",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Loop in my ops team or someone else",
            "to": "referral_ask"
          }
        ]
      },
      "bridge_to_meeting_early": {
        "label": "BRIDGE — EARLY STAGE INTEGRATION",
        "say": "That's actually perfect timing then — before you've locked in the architecture. A lot of what we do is designed to sit on top of whatever PMS or ops platform you land on. Breezeway, Guesty, your proprietary stuff — doesn't matter. Would it make sense to do a quick 20-minute look so you've got it on your radar as you're making those decisions?",
        "note": "If they're still deciding their tech stack post-Casago, you want to be part of that conversation early. Position RapidEye as platform-agnostic. This is a strong angle for a CTO.",
        "branches": [
          {
            "label": "That makes sense / let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Not my call alone / ops decision too",
            "to": "referral_ask"
          }
        ]
      },
      "referral_ask": {
        "label": "REFERRAL",
        "say": "Totally fair. Who on your team typically owns the inspection and turnover workflow day-to-day? I'm thinking someone on the ops side — would that be Bob Milne, or someone else?",
        "note": "You know Bob Milne is SVP Ops and John Banczak is COO. Dropping Bob's name shows you've done homework and makes it easy for Carlos to confirm or redirect. If he gives a name, get it and ask if you can mention Carlos pointed you there.",
        "branches": [
          {
            "label": "Confirms Bob Milne or gives his info",
            "to": "referral_get_name"
          },
          {
            "label": "Says John Banczak / COO",
            "to": "referral_get_name"
          },
          {
            "label": "Says Alex Johnson / franchise ops",
            "to": "referral_get_name"
          },
          {
            "label": "Gives a different name",
            "to": "referral_get_name"
          },
          {
            "label": "Doesn't want to give a name",
            "to": "graceful_exit"
          }
        ]
      },
      "referral_get_name": {
        "label": "GET THE REFERRAL",
        "say": "Perfect. Would you mind if I mention you pointed me their way? I'll put something tailored together so it actually lands and doesn't sound like another generic cold pitch.",
        "note": "A warm intro from the CTO is gold. Even 'Carlos mentioned I should reach out' completely changes the dynamic of that next call. Get the name and any direct contact info you can.",
        "branches": [
          {
            "label": "Sure / go ahead and mention me",
            "to": "referral_close"
          },
          {
            "label": "Rather you just reached out cold",
            "to": "referral_close"
          }
        ]
      },
      "referral_close": {
        "label": "CLOSE — REFERRAL",
        "say": "Really appreciate that, Carlos. And hey — if you ever want to see the tech side of what we've built, the integration architecture and all that, I'm always happy to show you. Enjoy the rest of your day.",
        "note": "Leave the door open with Carlos. As CTO he'll likely be needed later for integration review and security sign-off even if ops drives the decision. Log the referral name and any contact details immediately.",
        "branches": []
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I'm looking at next week — how does Tuesday or Wednesday afternoon look? I can do 2 PM Pacific if that works for you.",
        "note": "Pick a specific day and time. Don't say 'when works for you.' Send the calendar invite while still on the phone if possible. Once they confirm, STOP SELLING.",
        "branches": [
          {
            "label": "Confirms a time",
            "to": "meeting_confirmed"
          },
          {
            "label": "Suggests a different time",
            "to": "meeting_confirmed"
          },
          {
            "label": "Needs to check calendar first",
            "to": "send_email_with_time"
          }
        ]
      },
      "meeting_confirmed": {
        "label": "MEETING LOCKED",
        "say": "Perfect — I'll send over an invite right now. Really appreciate you taking my call, Carlos. Talk to you then.",
        "note": "Send the invite IMMEDIATELY after hanging up. Add context from this call to your CRM notes. Do not keep selling. You're done.",
        "branches": []
      },
      "send_email_with_time": {
        "label": "FOLLOW UP — CALENDAR",
        "say": "Totally — I'll shoot you an email with a couple time options. Best email for you — is it carlos.corzo at vacasa?",
        "note": "Confirm the email address. Include 2-3 specific time slots in the email. Send within 5 minutes of hanging up.",
        "branches": [
          {
            "label": "Confirms email",
            "to": "meeting_confirmed"
          },
          {
            "label": "Gives a different email",
            "to": "meeting_confirmed"
          }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most relevant to include? I don't want to send you a generic pitch deck. Is it more the technical integration side — how we'd hook into your existing photo workflow — or would a case study from another large PM company be more useful?",
        "note": "Get intel on what matters to him. A CTO will likely care about integration specifics and API architecture. Whatever he says, tailor the email to it. Include a specific time suggestion in the email.",
        "branches": [
          {
            "label": "Tells you what to include",
            "to": "send_email_close"
          },
          {
            "label": "Just send whatever / doesn't care",
            "to": "send_email_close"
          }
        ]
      },
      "send_email_close": {
        "label": "CLOSE — EMAIL",
        "say": "Got it — I'll have that over to you today. And I'll suggest a couple times in case you want to do a quick call after you've looked at it. Best email carlos.corzo at vacasa?",
        "note": "Confirm the email address. Send the email within 30 minutes — not end of day. Include a specific follow-up time. Call again in 2 business days if no response.",
        "branches": [
          {
            "label": "Confirms email",
            "to": "graceful_exit"
          },
          {
            "label": "Gives a different email",
            "to": "graceful_exit"
          }
        ]
      },
      "graceful_exit": {
        "label": "EXIT — GRACEFUL",
        "say": "Totally understand. If anything changes, I'm easy to find. Appreciate your time, Carlos.",
        "note": "Don't burn the bridge. Log everything from this call — what he said, his tone, any names mentioned, tech stack details. Set a follow-up reminder for 3-4 weeks.",
        "branches": []
      }
    }
  }
}