{
  "name": "Celina Cabo",
  "title": "Housekeeping Manager",
  "company": "Coldwell Banker Island Vacations",
  "location": "Scottsdale, AZ is already on the list. Let me provide the next best option:\\n\\nMaui, HI",
  "phone": "+1-808-891-2900",
  "company_phone": "+1-808-891-2900",
  "alt_phones": [],
  "flow": {
    "context": "Celina Cabo is Housekeeping Manager at Coldwell Banker Island Vacations — she owns the cleaner workflow and photo documentation across 300+ properties on Maui, Kauai, and Big Island. CBIV has operated since 2001 with on-island teams; no known inspection tech platform, so turnover QC is likely manual. Above her: Justin Simpson (Ops Manager, direct line 808-909-3103) and Amanda Franta (GM/Founder, amanda@cbislandvacations.com). Calling the main office line 808-891-2900, so you may hit a gatekeeper — ask for Celina by name. Sam's surfing background and work with similar Hawaii PM operations are the natural entry point.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Celina — this is Sam Parks with RapidEye. I work with a few other vacation rental teams out in Hawaii on their turnover inspection stuff, and your name came up as the person running housekeeping over at CB Island Vacations. Have you heard my name tossed around at all?",
        "note": "Smile. Relaxed. Feet up on the desk energy. Don't rush through it — sound like you belong in this conversation. If someone else answers, go to gatekeeper.",
        "branches": [
          {
            "label": "No / Who? / I haven't heard of you",
            "to": "heard_name_no"
          },
          {
            "label": "Yes / Maybe / Sounds familiar",
            "to": "heard_name_yes"
          },
          {
            "label": "I'm busy / bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Someone else answers the phone",
            "to": "gatekeeper_slide"
          }
        ]
      },
      "heard_name_no": {
        "label": "HAVEN'T HEARD OF ME",
        "say": "Ha — well I guess I'm not as popular as I thought. Well the reason for my call — I've been talking to a few other housekeeping leads at companies pretty similar to yours, and they keep bringing up the same thing...",
        "note": "Laugh it off naturally. This transitions straight into the pain trigger. Don't pause too long here — keep the momentum going.",
        "branches": [
          {
            "label": "Okay... / listening",
            "to": "pain_trigger"
          },
          {
            "label": "I'm not interested",
            "to": "objection_not_interested"
          },
          {
            "label": "What do you mean?",
            "to": "pain_trigger"
          }
        ]
      },
      "heard_name_yes": {
        "label": "HEARD THE NAME",
        "say": "Oh nice — well normally we'd be working with someone exactly in your seat. What'd you hear?",
        "note": "Let her talk. Whatever she says, bridge to pain trigger or discovery. Don't correct anything — just listen and flow.",
        "branches": [
          {
            "label": "Don't remember / not much",
            "to": "pain_trigger"
          },
          {
            "label": "Something about inspections / photos / AI",
            "to": "warm_discovery"
          },
          {
            "label": "Someone mentioned you / vague",
            "to": "pain_trigger"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — I know you've probably got turnovers stacking up. Would it be a terrible idea if I tried you again tomorrow, maybe first thing before the day gets crazy?",
        "note": "Respect the timing. Lock in a callback window. Don't pitch. If she gives you an opening, take it.",
        "branches": [
          {
            "label": "Sure, try me tomorrow / gives a time",
            "to": "bad_timing_callback"
          },
          {
            "label": "Just tell me quick",
            "to": "pain_trigger"
          },
          {
            "label": "Don't call back",
            "to": "end_graceful"
          }
        ]
      },
      "bad_timing_callback": {
        "label": "CALLBACK LOCKED",
        "say": "Perfect — I'll try you in the morning. Appreciate it, Celina.",
        "note": "Done. Don't push further. Call back exactly when you said you would. Add a calendar reminder now.",
        "branches": []
      },
      "gatekeeper_slide": {
        "label": "GATEKEEPER — SLIDE BY",
        "say": "Hey — could you get me through to Celina? It's Sam.",
        "note": "Casual. First name only. Don't explain why. Don't volunteer information. You ask the questions.",
        "branches": [
          {
            "label": "Who's calling? / What's this about?",
            "to": "gatekeeper_context"
          },
          {
            "label": "Let me transfer you / hold on",
            "to": "opener"
          },
          {
            "label": "She's not available",
            "to": "gatekeeper_voicemail"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — CONTEXT",
        "say": "Yeah — I work with a few other property management teams out in Hawaii. Would you mind letting her know it's Sam Parks?",
        "note": "Still casual. Give just enough. Don't pitch the gatekeeper. Redirect with a question.",
        "branches": [
          {
            "label": "Let me check / transferring",
            "to": "opener"
          },
          {
            "label": "She's busy / what company?",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "Can I take a message?",
            "to": "gatekeeper_voicemail"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "Totally get it — we help a couple other vacation rental companies with their inspection workflows. I sent her a note already, just wanted to follow up real quick. Would you mind giving her a heads up that Sam Parks called?",
        "note": "Last attempt. If this doesn't work, leave a message and move on. Don't get adversarial with the gatekeeper.",
        "branches": [
          {
            "label": "I'll let her know / taking a message",
            "to": "gatekeeper_voicemail"
          },
          {
            "label": "Transferring you",
            "to": "opener"
          }
        ]
      },
      "gatekeeper_voicemail": {
        "label": "GATEKEEPER — GET INFO",
        "say": "Appreciate that. If she's got a direct line or a good time to catch her, that'd be super helpful. Otherwise I'll try her again.",
        "note": "Try to get a direct number or best callback time. Write down whatever they give you. Then either leave a voicemail or hang up and retry.",
        "branches": [
          {
            "label": "Gives direct number or callback time",
            "to": "end_gatekeeper_info"
          },
          {
            "label": "No additional info / sending to voicemail",
            "to": "voicemail"
          }
        ]
      },
      "end_gatekeeper_info": {
        "label": "GOT GATEKEEPER INFO",
        "say": "That's awesome, thank you so much. I'll reach out then.",
        "note": "Write down the number or time immediately. Call at the suggested time. This is a win — treat it like one.",
        "branches": []
      },
      "voicemail": {
        "label": "VOICEMAIL",
        "say": "Hey Celina — it's Sam Parks. I work with a few vacation rental teams out in Hawaii on their turnover inspection workflows. Wanted to run something by you real quick — I'll try you again tomorrow. Or if it's easier, you can grab me at [your number]. Talk soon.",
        "note": "Under 20 seconds. No pitch. Create curiosity. Call back tomorrow regardless of whether she calls back. Try at a different time of day.",
        "branches": []
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "So I was talking to another housekeeping manager — actually runs a team about your size, three hundred-plus units across a couple islands — and she was telling me her cleaners are taking a hundred-plus photos every single turnover, which is great, but nobody actually has time to review them all. So stuff slips through — a stain on a couch, a missing coffee maker, a screen door that's off track — and it doesn't get caught until the next guest checks in and leaves a one-star review. And then it's her problem. Sound familiar at all?",
        "note": "PAUSE after 'sound familiar.' Count to three in your head. Let her react. Don't fill the silence. This is where you find out if the pain is real. The specifics — stain, coffee maker, screen door — are what make this land.",
        "branches": [
          {
            "label": "Yeah, that's exactly what happens / totally",
            "to": "solution_cta"
          },
          {
            "label": "We actually do a pretty good job with that",
            "to": "objection_have_process"
          },
          {
            "label": "Not really / we don't do it that way",
            "to": "pivot_curiosity"
          },
          {
            "label": "Who is this? / What is this about?",
            "to": "permission_fallback"
          }
        ]
      },
      "pivot_curiosity": {
        "label": "PIVOT — LEARN THEIR PROCESS",
        "say": "Oh interesting — how are you guys handling the post-clean verification right now? I'm always curious because everyone does it a little differently.",
        "note": "Genuine curiosity. Shut up and listen. You might find a different angle into the pain, or learn they're more manual than expected.",
        "branches": [
          {
            "label": "Describes their process",
            "to": "warm_discovery"
          },
          {
            "label": "We don't really have an issue",
            "to": "objection_not_interested"
          },
          {
            "label": "I don't have time for this",
            "to": "permission_fallback"
          }
        ]
      },
      "solution_cta": {
        "label": "SOLUTION + CTA",
        "say": "Yeah — so that's exactly why we built RapidEye. It plugs into whatever your cleaners are already using to take photos and automatically flags anything that's off — damage, missing stuff, staging issues — so your team doesn't have to eyeball every single photo. Would you be open to seeing what it looks like? I promise I won't waste your time.",
        "note": "One sentence on the product. One sentence CTA. Don't oversell. Don't list features. If she says yes, go straight to booking. Don't keep pitching.",
        "branches": [
          {
            "label": "Sure / yeah I'd look at that",
            "to": "booking"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "I'd need to talk to Justin or Amanda",
            "to": "referral_path_up"
          },
          {
            "label": "We don't have budget",
            "to": "objection_no_budget"
          },
          {
            "label": "I'm not sure I'm the right person",
            "to": "not_right_person"
          }
        ]
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call, I'll own that. Can I get thirty seconds to tell you why I reached out, and if it's not relevant you can totally hang up on me?",
        "note": "Disarm with honesty. Most people will give you 30 seconds if you ask directly and give them an out.",
        "branches": [
          {
            "label": "Okay, go ahead / make it quick",
            "to": "pain_trigger"
          },
          {
            "label": "No, I'm not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot — totally my bad for interrupting your day. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is this just not something you're focused on right now?",
        "note": "This isn't giving up — it's splitting the objection. Often they'll reveal the real reason and re-engage.",
        "branches": [
          {
            "label": "Bad timing / caught me at a bad time",
            "to": "permission_rejected_timing"
          },
          {
            "label": "Not focused on this / not interested",
            "to": "end_graceful"
          },
          {
            "label": "Actually... what is it exactly?",
            "to": "pain_trigger"
          }
        ]
      },
      "permission_rejected_timing": {
        "label": "RESCUE — BAD TIMING",
        "say": "Totally get it. When would be a less terrible time to try you? I can work around your schedule.",
        "note": "Get a specific day or time window. Even a vague 'try me Thursday' is a win.",
        "branches": [
          {
            "label": "Gives a time / try me tomorrow",
            "to": "bad_timing_callback"
          },
          {
            "label": "Don't call back",
            "to": "end_graceful"
          }
        ]
      },
      "warm_discovery": {
        "label": "DISCOVERY — THEIR PROCESS",
        "say": "Oh that's really helpful. So walk me through it — when a cleaner finishes a unit, what does the process look like from there? Do they upload photos somewhere, does someone review them, or is it more of a spot-check situation?",
        "note": "SHUT UP AND LISTEN. Take notes. You're learning their workflow to tailor the pitch. Don't interrupt. Don't jump to your product.",
        "branches": [
          {
            "label": "Describes process in detail",
            "to": "discovery_deeper"
          },
          {
            "label": "We use a specific tool or system",
            "to": "discovery_tech"
          },
          {
            "label": "It's kind of a mess honestly",
            "to": "discovery_pain_confirmed"
          }
        ]
      },
      "discovery_tech": {
        "label": "DISCOVERY — TECH STACK",
        "say": "Oh got it — and is that handling the actual photo review for you, or is it more for task management and scheduling? I ask because a lot of teams I talk to have great tools for assigning the work but nothing that actually looks at what's in the photos.",
        "note": "Distinguish between task management tools (Breezeway, Track, etc.) and actual photo analysis. That gap is RapidEye's lane. If they name a tool, note it for later.",
        "branches": [
          {
            "label": "It's more task management / scheduling",
            "to": "discovery_pain_confirmed"
          },
          {
            "label": "It does everything we need",
            "to": "objection_have_process"
          },
          {
            "label": "We don't really use anything fancy",
            "to": "discovery_pain_confirmed"
          }
        ]
      },
      "discovery_deeper": {
        "label": "DISCOVERY — COST OF MISSES",
        "say": "And when something does get missed — like a broken drawer or a stain that wasn't there before — how does that usually surface? Is it the next guest complaining, or does your team catch it on a re-inspect?",
        "note": "You're looking for the cost of misses: guest complaints, owner calls, review damage, re-cleans, deposit disputes. This is where the pain gets personal for her.",
        "branches": [
          {
            "label": "Usually the guest catches it",
            "to": "discovery_cost_of_miss"
          },
          {
            "label": "We do re-inspects / we catch most things",
            "to": "discovery_cost_of_miss"
          },
          {
            "label": "It depends / varies",
            "to": "discovery_cost_of_miss"
          }
        ]
      },
      "discovery_cost_of_miss": {
        "label": "DISCOVERY — ACCOUNTABILITY",
        "say": "And when that happens — guest finds something, leaves a review — does that come back on you and the housekeeping team, or does that land more on Justin and the ops side?",
        "note": "You're mapping the accountability chain. This also plants the seed that you know their org, which builds credibility. If it lands on her, the pain is personal. If it lands on ops, you have a referral angle.",
        "branches": [
          {
            "label": "It comes back on me / housekeeping",
            "to": "discovery_pain_confirmed"
          },
          {
            "label": "That's more of an ops thing / Justin handles it",
            "to": "referral_path_up"
          },
          {
            "label": "We all deal with it together",
            "to": "discovery_pain_confirmed"
          }
        ]
      },
      "discovery_pain_confirmed": {
        "label": "BRIDGE TO CTA",
        "say": "Yeah — that's exactly what I keep hearing. And with three hundred-plus units across multiple islands, I imagine it's not like you can personally walk every property. That's actually the exact problem we built RapidEye to solve. Would you be open to seeing what it looks like? Fifteen minutes, super casual.",
        "note": "Bridge from their pain to the CTA. Keep it conversational, not pitchy. If she says yes, book it immediately.",
        "branches": [
          {
            "label": "Sure / yeah let's do it",
            "to": "booking"
          },
          {
            "label": "I'd need to run it by someone",
            "to": "referral_path_up"
          },
          {
            "label": "Send me info first",
            "to": "send_email"
          },
          {
            "label": "I don't think we have budget",
            "to": "objection_no_budget"
          }
        ]
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "Totally get it — I should've figured you'd have everything dialed in already, otherwise you probably would've reached out to us. Just so nobody from my team cold calls you again — is it that this isn't really a problem you're dealing with, or is it more that you just hate cold calls? Because honestly, I get it either way.",
        "note": "Agree first. Then split. Most people soften when you validate them instead of pushing back. The 'hate cold calls' option usually gets a laugh.",
        "branches": [
          {
            "label": "I just don't like cold calls / laughs",
            "to": "sell_test_drive"
          },
          {
            "label": "We're really not having that problem",
            "to": "sell_test_drive_light"
          },
          {
            "label": "Actually we do deal with that but...",
            "to": "pain_trigger"
          },
          {
            "label": "Just not interested / firm no",
            "to": "end_graceful"
          }
        ]
      },
      "objection_have_process": {
        "label": "OBJECTION — HAVE A PROCESS",
        "say": "That totally makes sense — with three hundred properties across three islands, you'd have to have something solid in place. Just out of curiosity — is it that you're fully covered and happy with how it's working, or is it more that switching anything right now would be a pain with everything else going on?",
        "note": "Validate their process. Then split. 'Everything else going on' nods to Bill 9 regulatory pressure and operational complexity without being too direct. Let her tell you what 'everything else' means to her.",
        "branches": [
          {
            "label": "We're happy with what we have",
            "to": "sell_test_drive_light"
          },
          {
            "label": "Switching would be a headache",
            "to": "sell_test_drive"
          },
          {
            "label": "It works but it's not perfect",
            "to": "warm_discovery"
          },
          {
            "label": "What do you mean everything else?",
            "to": "bill_9_angle"
          }
        ]
      },
      "objection_no_budget": {
        "label": "OBJECTION — NO BUDGET",
        "say": "Totally get it — nowadays it's hard enough to keep the tools you've got, let alone bring on something new. Especially with everything shifting in the Maui market right now. Is it that budget this cycle is completely locked, or is it more that anything new would need to go through Amanda and the whole approval process?",
        "note": "Validate budget concern. Reference Maui market pressure (Bill 9 phase-out) to show you understand their world. Name-dropping Amanda shows homework and opens the referral path naturally.",
        "branches": [
          {
            "label": "Budget is locked / we're tight",
            "to": "sell_test_drive"
          },
          {
            "label": "It would need Amanda's approval / need to go up",
            "to": "referral_path_up"
          },
          {
            "label": "It's both honestly",
            "to": "sell_test_drive"
          },
          {
            "label": "How do you know Amanda?",
            "to": "credibility_response"
          }
        ]
      },
      "credibility_response": {
        "label": "CREDIBILITY CHECK",
        "say": "Oh — I've just been doing a bunch of research on your team before reaching out. Didn't want to be one of those people who calls without knowing who they're talking to. But that's actually why I wanted to start with you — you're the one who lives this every day on the housekeeping side.",
        "note": "Be honest about the research. It builds trust. Then redirect back to the conversation. This is a compliment — she's the expert, not just a stepping stone.",
        "branches": [
          {
            "label": "Fair enough / appreciates the research",
            "to": "sell_test_drive"
          },
          {
            "label": "What exactly do you do?",
            "to": "solution_cta"
          }
        ]
      },
      "bill_9_angle": {
        "label": "BILL 9 / MARKET PRESSURE",
        "say": "Yeah — I mean with Bill 9 and the phase-out timelines, a lot of the managers I've been talking to on Maui are trying to figure out how to do more with less. Tighter margins, fewer units potentially, more pressure to protect the ones you've got. That's actually a big part of why we're reaching out now — the companies getting ahead of this are locking in their inspection quality so they can protect owner relationships and reviews even as things shift. Does that resonate at all?",
        "note": "Don't oversell the regulatory angle — some people are stressed about Bill 9, others aren't worried yet. Let her tell you where she stands. If she says it's above her pay grade, that's a natural referral to Amanda or Justin.",
        "branches": [
          {
            "label": "Yeah, that's definitely on our minds",
            "to": "solution_cta"
          },
          {
            "label": "We're not too worried about that",
            "to": "solution_cta"
          },
          {
            "label": "That's above my pay grade / more of an Amanda thing",
            "to": "referral_path_up"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Look — you're probably not buying anything on a cold call, and I totally respect that. But when budget does open up or the timing's right, the teams that move fastest are the ones who already know what's out there. Would you be open to just taking a look — fifteen minutes, super casual — not to sell you anything today, but just so you know what we do? Worst case, I walk you through what other Hawaii PM companies are doing with their turnover photos and you steal some ideas.",
        "note": "Low pressure. Position the meeting as valuable even if they never buy. The 'steal some ideas' line usually lands well and reframes the meeting as peer-to-peer.",
        "branches": [
          {
            "label": "Okay sure / I could do that",
            "to": "booking"
          },
          {
            "label": "Send me an email first",
            "to": "send_email"
          },
          {
            "label": "I'm really not the right person for this",
            "to": "not_right_person"
          },
          {
            "label": "No thanks / not right now",
            "to": "end_graceful"
          }
        ]
      },
      "sell_test_drive_light": {
        "label": "SOFT TEST DRIVE",
        "say": "Totally fair. And honestly, if you've got it covered, that's great — I'm not trying to fix something that isn't broken. But would it be worth fifteen minutes just to compare notes? I can show you what a couple other companies your size are doing differently — and if your process is better, tell me and I'll steal your ideas instead.",
        "note": "Light touch. The ego play works well — telling her she might be doing it better than others is disarming and genuine.",
        "branches": [
          {
            "label": "Sure, that could work",
            "to": "booking"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "No, I'm good",
            "to": "end_graceful"
          }
        ]
      },
      "not_right_person": {
        "label": "NOT THE RIGHT PERSON",
        "say": "Totally get it — and honestly I appreciate you telling me that instead of just sitting through a call that's not relevant. Who on your team would typically make the call on something like inspection tooling? Would that be more Justin's world, or does that go straight to Amanda?",
        "note": "Name the people you know. It shows preparation and makes the referral feel natural. Give her two options — both of which you've researched.",
        "branches": [
          {
            "label": "Talk to Justin / ops would handle that",
            "to": "referral_get_name_justin"
          },
          {
            "label": "Talk to Amanda / it'd go to the top",
            "to": "referral_get_name_amanda"
          },
          {
            "label": "I'm not sure who handles that",
            "to": "referral_ask_general"
          },
          {
            "label": "Actually it might be me, tell me more",
            "to": "pain_trigger"
          }
        ]
      },
      "referral_path_up": {
        "label": "REFERRAL PATH UP",
        "say": "That makes total sense — I figured something like this would need a thumbs-up from higher up. Would it make more sense for me to reach out to Justin on the ops side, or would Amanda be the better starting point? I want to put something tailored together so it actually lands when they see it.",
        "note": "Give her two options. Both are researched. Makes it easy for her to direct you. If she offers to bring it up internally, that's the best outcome — warm intro.",
        "branches": [
          {
            "label": "Try Justin / he handles ops tools",
            "to": "referral_get_name_justin"
          },
          {
            "label": "Try Amanda / she makes those calls",
            "to": "referral_get_name_amanda"
          },
          {
            "label": "Let me bring it up internally first",
            "to": "referral_internal"
          },
          {
            "label": "Actually I can make this call / let me see it",
            "to": "booking"
          }
        ]
      },
      "referral_get_name_justin": {
        "label": "REFERRAL — JUSTIN",
        "say": "Perfect — Justin Simpson, right? Operations Manager? Do you know if he's got a good time to catch him, or should I just try his direct line?",
        "note": "Confirm what you already know. You have Justin's direct line (808-909-3103) but getting Celina to point you there makes it a warm intro. Ask if you can mention her name.",
        "branches": [
          {
            "label": "Gives info or confirms / yes that's him",
            "to": "referral_end"
          },
          {
            "label": "Just try the office / not sure",
            "to": "referral_end"
          }
        ]
      },
      "referral_get_name_amanda": {
        "label": "REFERRAL — AMANDA",
        "say": "Perfect — Amanda Franta? Do you happen to know the best way to reach her — is she more of an email person or phone person?",
        "note": "You already have amanda@cbislandvacations.com but getting Celina to validate the channel and potentially intro you is gold. Ask if you can mention Celina pointed you her way.",
        "branches": [
          {
            "label": "Gives info / email her / call the office",
            "to": "referral_end"
          },
          {
            "label": "Just try her",
            "to": "referral_end"
          }
        ]
      },
      "referral_ask_general": {
        "label": "REFERRAL — GENERAL ASK",
        "say": "No worries — who on your team would you say owns the inspection workflow from a decision-making standpoint? Like if you were going to bring a new tool to someone and say hey we should try this, who would that go to?",
        "note": "Let her think. Don't rush. You're mapping the org. Any name she gives you is valuable.",
        "branches": [
          {
            "label": "Gives a name",
            "to": "referral_end"
          },
          {
            "label": "I'm not sure / let me find out",
            "to": "referral_internal"
          }
        ]
      },
      "referral_internal": {
        "label": "INTERNAL CHAMPION PATH",
        "say": "That'd be amazing — if you could float it internally and I follow up in a couple days, that'd be perfect. Would it be cool if I sent you a quick email you could forward? Something super short — just so they have context when my name comes up.",
        "note": "Give her something easy to forward. Don't make her do the selling for you. The email should be short, specific, and forward-friendly. Email likely: celina@cbislandvacations.com based on the firstname@ pattern from Amanda's confirmed email.",
        "branches": [
          {
            "label": "Sure, send it over",
            "to": "send_email"
          },
          {
            "label": "I'll just mention it verbally",
            "to": "referral_end"
          }
        ]
      },
      "referral_end": {
        "label": "REFERRAL WRAP-UP",
        "say": "Really appreciate that, Celina. I'll reach out to them and mention you pointed me their way — won't make it weird, I promise. Thanks for your time.",
        "note": "Keep it warm. She just gave you a referral — that's a win. Don't overstay. Call the referred person within 24 hours and lead with Celina's name.",
        "branches": []
      },
      "booking": {
        "label": "BOOK THE MEETING",
        "say": "Awesome — let me grab a time real quick. I've got next Tuesday or Thursday open — what works better for you, morning or afternoon your time?",
        "note": "Give two days as options. Don't say 'when works for you' — too open-ended. Anchor to specific days. Remember she's on Hawaii time (HST).",
        "branches": [
          {
            "label": "Picks a day and time",
            "to": "booking_confirmed"
          },
          {
            "label": "Let me check my calendar / not sure",
            "to": "booking_soft"
          }
        ]
      },
      "booking_soft": {
        "label": "SOFT BOOK",
        "say": "No rush — how about I send you an invite for Thursday at ten your time, and if it doesn't work you just let me know and we'll move it? That way it's on the calendar and we don't have to play phone tag.",
        "note": "Anchor a specific time. It's easier to move a meeting than to schedule one from scratch. Send the invite immediately after hanging up.",
        "branches": [
          {
            "label": "Sure, that works / send it",
            "to": "booking_confirmed"
          },
          {
            "label": "Just email me first",
            "to": "send_email"
          }
        ]
      },
      "booking_confirmed": {
        "label": "MEETING BOOKED",
        "say": "Perfect — I'll send that invite right now so it's locked in. Really appreciate you taking my call, Celina. Talk to you then.",
        "note": "Send the calendar invite IMMEDIATELY while it's fresh. Then STOP TALKING. Don't keep selling. You won. Include a brief agenda in the invite: 'Quick 15-min look at how RapidEye works with turnover photos — no pressure.'",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question so it's not just another generic pitch sitting in your inbox — what would be most useful for me to include? Like would you want to see how it actually works with turnover photos, or more of a quick overview of what other companies your size are doing?",
        "note": "Tailor the email based on her answer. Her email is likely celina@cbislandvacations.com (firstname@ pattern confirmed from Amanda's). Include a specific time suggestion in the email. Send within the hour.",
        "branches": [
          {
            "label": "Show me how it works / the product",
            "to": "send_email_end"
          },
          {
            "label": "Just send whatever / keep it short",
            "to": "send_email_end"
          },
          {
            "label": "What other companies are doing",
            "to": "send_email_end"
          }
        ]
      },
      "send_email_end": {
        "label": "EMAIL WRAP-UP",
        "say": "Got it — I'll send that over today. And I'll throw a couple time options in there in case you want to hop on a quick call after you've had a chance to look. Thanks for your time, Celina.",
        "note": "Send it within one hour. Reference this conversation specifically so she knows it's not a template. Include two specific time slots. Follow up in 3 days if no response. Email: celina@cbislandvacations.com.",
        "branches": []
      },
      "end_graceful": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes, I'm easy to find — Sam Parks, RapidEye. Appreciate your time, Celina.",
        "note": "Don't burn bridges. Stay warm. Add her to a 30-day follow-up. Consider reaching out to Justin Simpson (Ops Manager) or Amanda Franta (GM) directly as your next move on this account.",
        "branches": []
      }
    }
  }
}