{
  "name": "Chip Nelson",
  "title": "General Manager, Beaver Creek & Vail; Breckenridge",
  "company": "Moving Mountains",
  "location": "Steamboat Springs, CO",
  "phone": "+1-970-445-2300",
  "company_phone": "(877) 624-2538",
  "alt_phones": [
    "+1-970-870-9359",
    "+1-970-445-2300",
    "+1-970-547-2122",
    "+1-970-870-9487"
  ],
  "flow": {
    "context": "Chip Nelson is GM for Beaver Creek, Vail, and Breckenridge at Moving Mountains — a luxury vacation rental company with ~250 homes across Colorado ski markets. He oversees operations in the markets that grew most aggressively via acquisition (Paragon Lodging in Breck, Triumph Mountain Properties in Vail Valley). His teams include dedicated QA inspectors, ops managers, and maintenance staff. They run Breezeway for ops and Track as their PMS. Sam's skiing connection is the opener — he skied Jackson Hole in January 2026, and Chip lives and breathes Colorado ski country.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Chip — this is gonna sound random, but I was just out in Jackson Hole in January and I've been working with a few luxury property managers across the Colorado ski markets. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Feet up on the desk energy. Skiing connection is natural — he manages luxury ski properties. Don't rush. Let the question hang.",
        "branches": [
          {
            "label": "No, I haven't heard of you",
            "to": "no_heard"
          },
          {
            "label": "Yeah / maybe / sounds familiar",
            "to": "yes_heard"
          },
          {
            "label": "Who? / What's this about?",
            "to": "whats_this_about"
          },
          {
            "label": "Now's not a good time",
            "to": "bad_timing"
          },
          {
            "label": "Gatekeeper / front desk picks up",
            "to": "gatekeeper_1"
          }
        ]
      },
      "no_heard": {
        "label": "NOT AS POPULAR",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call is — I've been working with another GM who runs a pretty similar setup to yours. Luxury portfolio, multiple mountain markets, dedicated QA teams doing inspections between every stay. And the thing that kept coming up was — their inspectors were taking hundreds of photos every turnover day, and nobody actually had time to review them all. Stuff was slipping through. A stain on a sofa in a six-thousand-dollar-a-night home, a missing set of towels in a place that promises fully stocked essentials. And the guest is the one who finds it. We built an AI that plugs into Breezeway and flags damage, missing items, and staging issues automatically from the photos your team's already taking — no workflow change. Would you be open to taking a look when I'm not cold calling you out of the blue?",
        "note": "Pause after 'the guest is the one who finds it.' Let it land. He manages luxury homes where small misses are huge. Reference Breezeway specifically — they use it.",
        "branches": [
          {
            "label": "Yeah, that's interesting / tell me more",
            "to": "warm_discovery"
          },
          {
            "label": "We're pretty covered on that",
            "to": "objection_have_process"
          },
          {
            "label": "Not really interested",
            "to": "objection_not_interested"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          },
          {
            "label": "What does it cost?",
            "to": "cost_question"
          },
          {
            "label": "How does it work with Breezeway?",
            "to": "breezeway_question"
          }
        ]
      },
      "yes_heard": {
        "label": "THEY'VE HEARD THE NAME",
        "say": "Oh nice — well normally we'd be working with someone like you on the inspection side. What did you hear?",
        "note": "Let them talk. They may have heard from another PM in the market or from a Breezeway/Track contact. Listen and adapt.",
        "branches": [
          {
            "label": "They share what they heard",
            "to": "warm_discovery"
          },
          {
            "label": "Not sure / vague",
            "to": "pivot_to_pain"
          },
          {
            "label": "Think someone mentioned it but not sure",
            "to": "pivot_to_pain"
          }
        ]
      },
      "whats_this_about": {
        "label": "WHAT'S THIS ABOUT",
        "say": "Yeah totally fair — it is a cold call, I'll own that. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not relevant?",
        "note": "Permission-based pivot. If he says yes, go to pain trigger. If no, go to rejection handler.",
        "branches": [
          {
            "label": "Sure, go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "No / not interested",
            "to": "rejection_handler"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow or later this week?",
        "note": "Don't push. Just get the callback window. If he gives a time, lock it in.",
        "branches": [
          {
            "label": "Sure, try me tomorrow / gives a time",
            "to": "lock_callback"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          },
          {
            "label": "Don't call back / not interested",
            "to": "graceful_exit"
          }
        ]
      },
      "gatekeeper_1": {
        "label": "GATEKEEPER — SLIDE BY",
        "say": "Hey — could you get me through to Chip? It's Sam.",
        "note": "Say it like you know him. First name only. No company name yet. No pitch.",
        "branches": [
          {
            "label": "Who's calling? / What's this regarding?",
            "to": "gatekeeper_2"
          },
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "He's not available",
            "to": "gatekeeper_not_available"
          }
        ]
      },
      "gatekeeper_2": {
        "label": "GATEKEEPER — CONTEXT",
        "say": "Yeah — I work with a few other property managers in the Vail Valley area. Would you mind letting him know it's Sam Parks?",
        "note": "Still no pitch. Dose information slowly. If they push again, go to step 3.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "What company / what's this about?",
            "to": "gatekeeper_3"
          },
          {
            "label": "He's not available / take a message",
            "to": "gatekeeper_not_available"
          }
        ]
      },
      "gatekeeper_3": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "Sure — it's Sam Parks with RapidEye. We help a couple other luxury property management companies with their inspection workflows. I sent Chip a note — would you mind giving him a heads up I'm on the line?",
        "note": "This is the last push. If they won't connect you, get info on when to call back or ask for email.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "He's not available / take a message",
            "to": "gatekeeper_not_available"
          }
        ]
      },
      "gatekeeper_not_available": {
        "label": "GATEKEEPER — NOT AVAILABLE",
        "say": "No worries at all. When's the best time to catch him — mornings or afternoons? And is this the best number to reach him on directly?",
        "note": "Get the callback window and direct line if possible. If they offer email, take it. Don't burn the gatekeeper.",
        "branches": [
          {
            "label": "Gives a time / number",
            "to": "lock_callback"
          },
          {
            "label": "Offers email instead",
            "to": "send_email"
          },
          {
            "label": "Won't share anything",
            "to": "graceful_exit"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "So I've been working with another GM who runs a pretty similar operation to yours — luxury ski market, couple hundred homes, dedicated QA inspectors doing walkthroughs between every stay. And the thing that kept eating him alive was — his team's taking photos of every single room, every single turnover. Hundreds of photos a day across multiple markets. And nobody has the bandwidth to actually look at all of them carefully. So things slip. A scratch on a hardwood floor after a big holiday weekend. A missing set of ski boot trays in a home that promises everything's stocked. And the next guest — who's paying five, six thousand a night — they're the quality control. That's the part that kills you. We built an AI that plugs right into Breezeway, analyzes the photos your team's already taking, and flags damage, missing items, staging problems automatically. No workflow change for your inspectors. Would you be open to taking a look when I'm not catching you off guard?",
        "note": "He manages Beaver Creek, Vail, AND Breckenridge — multiple markets. The 'hundreds of photos across multiple markets' framing hits his exact situation. Pause after 'they're the quality control.' Let it breathe.",
        "branches": [
          {
            "label": "Yeah that's interesting / tell me more",
            "to": "warm_discovery"
          },
          {
            "label": "We're pretty covered on that",
            "to": "objection_have_process"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          },
          {
            "label": "No budget for something like that",
            "to": "objection_no_budget"
          },
          {
            "label": "What does it cost?",
            "to": "cost_question"
          },
          {
            "label": "How does it work with Breezeway?",
            "to": "breezeway_question"
          }
        ]
      },
      "warm_discovery": {
        "label": "DISCOVERY — THEY'RE WARM",
        "say": "Appreciate that. So I'm curious — across Beaver Creek, Vail, and Breck, what does the inspection process actually look like day to day? Are your QA folks doing walkthroughs after every clean, or is it more spot-check based?",
        "note": "STOP PITCHING. He's warm. Ask questions. He has QA specialists in each market — get him talking about how it actually works on the ground. Listen for pain signals: volume, misses, staffing gaps, seasonal crunch.",
        "branches": [
          {
            "label": "Describes their QA process",
            "to": "discovery_followup"
          },
          {
            "label": "It varies by market",
            "to": "discovery_market_variance"
          },
          {
            "label": "Asks a question back about RapidEye",
            "to": "handle_product_question"
          },
          {
            "label": "Mentions Breezeway / Track",
            "to": "discovery_tech_stack"
          }
        ]
      },
      "discovery_followup": {
        "label": "DISCOVERY — DIG DEEPER",
        "say": "Got it — and when your inspectors flag something, how does that get over to maintenance? Is that running through Breezeway or is there a separate chain?",
        "note": "You know they use Breezeway. Confirm it naturally and understand the handoff. The inspection-to-maintenance loop is where things break in multi-market operations.",
        "branches": [
          {
            "label": "Describes the workflow / confirms Breezeway",
            "to": "discovery_pain_probe"
          },
          {
            "label": "It's messy / admits gaps",
            "to": "discovery_pain_probe"
          },
          {
            "label": "Asks what RapidEye does differently",
            "to": "pitch_tailored"
          }
        ]
      },
      "discovery_market_variance": {
        "label": "DISCOVERY — MARKET VARIANCE",
        "say": "That makes sense — especially after bringing the Triumph portfolio into the fold in Vail. When you're integrating properties from an acquisition, how do you get everybody on the same inspection standard? Is that something that's been a headache?",
        "note": "Triumph acquisition was Dec 2023, specifically in his Vail Valley territory. This is a very targeted question. If he reacts, lean in. If he's surprised you know about it, say you read the press release.",
        "branches": [
          {
            "label": "Yeah, integration has been a challenge",
            "to": "discovery_pain_probe"
          },
          {
            "label": "We've got it figured out",
            "to": "discovery_pain_probe"
          },
          {
            "label": "How do you know about that?",
            "to": "explain_research"
          }
        ]
      },
      "discovery_tech_stack": {
        "label": "DISCOVERY — TECH STACK",
        "say": "Oh nice — so if your inspectors are already uploading photos through Breezeway, that's actually the exact workflow we plug into. We sit on top of Breezeway and analyze what's already being uploaded. So your team wouldn't change a thing — they just start getting automatic flags on stuff that needs attention. What's the volume like on a big turnover day — how many units are you flipping across your three markets?",
        "note": "Breezeway integration is a confirmed fit. Anchor on 'no workflow change' — that's the unlock for ops people. Get turnover volume to size the problem.",
        "branches": [
          {
            "label": "Shares turnover volume / gets specific",
            "to": "pitch_tailored"
          },
          {
            "label": "That's interesting, how does the AI part work?",
            "to": "handle_product_question"
          },
          {
            "label": "We'd need to loop in Lisa / Chad",
            "to": "referral_up"
          }
        ]
      },
      "discovery_pain_probe": {
        "label": "DISCOVERY — PROBE FOR PAIN",
        "say": "When things do slip through — a stain, a missing item, something that wasn't caught before a guest checks in — what does that look like for you? Is it a guest complaint, an owner call, or both?",
        "note": "This is the money question. Luxury properties = the cost of a miss is huge. Let him tell you the story. If he gives a specific example, mirror it back later.",
        "branches": [
          {
            "label": "Shares a specific pain / story",
            "to": "pitch_tailored"
          },
          {
            "label": "It happens but we handle it",
            "to": "pitch_tailored"
          },
          {
            "label": "Honestly it's rare",
            "to": "pitch_soft_challenge"
          }
        ]
      },
      "pitch_soft_challenge": {
        "label": "SOFT CHALLENGE",
        "say": "That's awesome — honestly that's a credit to your QA team. The thing I hear from other GMs though is — it's rare until it's not. Especially during peak season when you're flipping the most units with the same team. The companies we work with said the same thing — they had a great process, until a holiday weekend exposed the cracks. What does peak season look like across your three markets? Are your QA people stretched?",
        "note": "Don't argue. Validate, then reframe around peak season. Beaver Creek and Vail peak during ski season — that's when turnover volume spikes and staffing gets strained.",
        "branches": [
          {
            "label": "Admits peak season is tough",
            "to": "pitch_tailored"
          },
          {
            "label": "We staff up / we're good",
            "to": "pitch_tailored"
          },
          {
            "label": "Still not seeing the fit",
            "to": "objection_not_interested"
          }
        ]
      },
      "pitch_tailored": {
        "label": "TAILORED PITCH + CTA",
        "say": "Makes total sense. So here's what I think would be worth showing you — we can take the photos your QA team is already uploading to Breezeway, run them through our AI, and within minutes flag anything that looks like damage, a missing item, a staging issue, or even a change from the last inspection. No new app for your inspectors. No new workflow. Just smarter flags coming back before the guest walks in. And with you running three markets, this is the kind of thing that scales without adding headcount. I'd love to show you what it actually looks like — I've got next Tuesday or Thursday pulled up. Does one of those work for 20 minutes?",
        "note": "Specific day and time. Don't leave it vague. If he pushes back on timing, offer alternatives. The Breezeway integration and 'no workflow change' are the two things that matter most to a GM.",
        "branches": [
          {
            "label": "Yeah, let's do it / picks a time",
            "to": "book_meeting"
          },
          {
            "label": "Let me check my calendar / not sure",
            "to": "lock_meeting_2"
          },
          {
            "label": "I'd need to loop in someone else",
            "to": "referral_up"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Not right now / maybe later",
            "to": "objection_timing"
          }
        ]
      },
      "handle_product_question": {
        "label": "HANDLE PRODUCT QUESTION",
        "say": "Yeah so in simple terms — your QA team takes photos during their inspections, uploads them through Breezeway like they already do. Our AI analyzes every photo automatically and flags anything that looks like damage, a missing item, a staging issue, or a change from the last time that room was inspected. Your team gets the flags before the guest checks in. No new app, no new process — it just makes the photos they're already taking way more useful. The companies we're working with said the biggest thing was catching stuff their inspectors were missing just because of volume — there's only so many photos a human can review carefully in a day.",
        "note": "Keep it simple and concrete. Don't get into technical weeds. Redirect back to a question or CTA after answering.",
        "branches": [
          {
            "label": "That makes sense / sounds useful",
            "to": "pitch_tailored"
          },
          {
            "label": "What does it cost?",
            "to": "cost_question"
          },
          {
            "label": "How accurate is it?",
            "to": "accuracy_question"
          },
          {
            "label": "We'd need to talk to our systems team",
            "to": "referral_up"
          }
        ]
      },
      "cost_question": {
        "label": "COST QUESTION",
        "say": "Totally fair question. It depends on portfolio size and turnover volume, but we're typically in the range where the first damage catch pays for a few months of the platform. I'd rather show you what it actually does first and then walk through pricing with real numbers — that way it's not abstract. Would you be open to a quick look next week?",
        "note": "Don't quote a number on a cold call. Redirect to the demo. The ROI framing — 'first damage catch pays for months' — is strong for luxury properties where a single damage event can be thousands.",
        "branches": [
          {
            "label": "Sure, let's take a look",
            "to": "book_meeting"
          },
          {
            "label": "Just ballpark me",
            "to": "cost_redirect"
          },
          {
            "label": "Send me pricing",
            "to": "send_email"
          }
        ]
      },
      "cost_redirect": {
        "label": "COST REDIRECT",
        "say": "I hear you — I'd be the same way. Rough range is a few hundred a month depending on units. But honestly the thing that makes or breaks it is seeing whether it catches stuff your current process doesn't — that's what sold it for the other companies we work with. Let me show you a 15-minute demo and I'll send pricing right after. Fair?",
        "note": "Give a vague range, then redirect again. The goal is the meeting, not a pricing negotiation on a cold call.",
        "branches": [
          {
            "label": "Okay, let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Send me info first",
            "to": "send_email"
          },
          {
            "label": "Let me think about it",
            "to": "objection_timing"
          }
        ]
      },
      "accuracy_question": {
        "label": "ACCURACY QUESTION",
        "say": "Good question. We're not trying to replace your inspectors' judgment — we're catching the stuff that gets missed when someone's reviewing their fiftieth unit of the week. Think of it like a second set of eyes that never gets tired. Our system compares current photos against a baseline for that property, so it's specific to each home — not some generic checklist. It flags and a human confirms. Would it be worth showing you with actual examples from properties similar to yours?",
        "note": "He manages luxury homes — accuracy matters a lot. The baseline comparison angle is strong because each home is unique in luxury.",
        "branches": [
          {
            "label": "Yeah, show me",
            "to": "book_meeting"
          },
          {
            "label": "Interesting but need to think about it",
            "to": "objection_timing"
          },
          {
            "label": "Who else uses this?",
            "to": "social_proof"
          }
        ]
      },
      "social_proof": {
        "label": "SOCIAL PROOF",
        "say": "Right now we're working with a company in New York managing about 200 luxury homes — similar profile to yours, high-end properties where the margin for error is basically zero. They're running it on every turnover. And we've got another group on the East Coast with about 600 units. The feedback from both has been the same — the stuff the AI catches isn't things their team was being careless about, it's stuff that's just physically hard to spot across that many photos in a day.",
        "note": "NYC luxury portfolio is the strongest comp for Moving Mountains. Emphasize 'luxury' and 'margin for error is zero' — that's his world.",
        "branches": [
          {
            "label": "That's solid / let's talk more",
            "to": "pitch_tailored"
          },
          {
            "label": "We're different / our market is different",
            "to": "acknowledge_difference"
          },
          {
            "label": "Let me loop in my ops team",
            "to": "referral_up"
          }
        ]
      },
      "acknowledge_difference": {
        "label": "ACKNOWLEDGE DIFFERENCE",
        "say": "Totally — every market's different and every operation runs their own way. That's actually why I'd rather show you than try to sell you on the phone. Worst case you see what other PM companies are doing with their turnover photos and steal some ideas. Can I grab 20 minutes next week?",
        "note": "Don't argue. Validate and redirect to the meeting. 'Steal some ideas' is the value offer.",
        "branches": [
          {
            "label": "Sure",
            "to": "book_meeting"
          },
          {
            "label": "Not right now",
            "to": "objection_timing"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          }
        ]
      },
      "objection_have_process": {
        "label": "OBJECTION — HAVE A PROCESS",
        "say": "That makes total sense — with properties across three mountain markets, you'd have to have something dialed in. Just so nobody from my team cold calls you again — is it that you're fully covered and happy with how inspections are working, or is it more that adding anything new right now would just be a headache?",
        "note": "Agree first. Then split the objection. If they say 'happy,' probe peak season. If they say 'headache,' sell the zero-change integration.",
        "branches": [
          {
            "label": "We're happy with what we have",
            "to": "probe_happy"
          },
          {
            "label": "Yeah, just bad timing / too much going on",
            "to": "objection_timing"
          },
          {
            "label": "A bit of both honestly",
            "to": "probe_happy"
          }
        ]
      },
      "probe_happy": {
        "label": "PROBE — HAPPY WITH PROCESS",
        "say": "Respect that. Out of curiosity — is your team reviewing every photo from every inspection, or is it more that they trust the inspectors and spot-check? I ask because that's usually where the gap shows up, even in really well-run operations.",
        "note": "This is a gentle challenge. If they admit they don't review every photo, that's the opening. If they say they do, challenge on time and volume.",
        "branches": [
          {
            "label": "Admits not every photo is reviewed",
            "to": "reframe_value"
          },
          {
            "label": "We review everything",
            "to": "reframe_volume"
          },
          {
            "label": "Look, we're just not interested",
            "to": "graceful_exit"
          }
        ]
      },
      "reframe_value": {
        "label": "REFRAME — THE GAP",
        "say": "That's exactly what we keep hearing. The photos exist, the process is there, but nobody has the bandwidth to actually look at all of them — especially on a packed turnover day. That's the gap we fill. Our AI reviews every single photo and only surfaces the ones that need a human's attention. You're probably not buying this right now, and I respect that. But would it be worth 15 minutes just to see it? Worst case you know it exists for when you're staffing up for next season.",
        "note": "Sell the test drive. 'Not buying right now' takes the pressure off. Seasonal staffing angle is real for ski markets.",
        "branches": [
          {
            "label": "Okay, let's take a look",
            "to": "book_meeting"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          },
          {
            "label": "Not now",
            "to": "graceful_exit"
          }
        ]
      },
      "reframe_volume": {
        "label": "REFRAME — VOLUME CHALLENGE",
        "say": "Honestly that's impressive if your team is reviewing every photo across Beaver Creek, Vail, and Breck. How many turnovers are you running on a peak weekend — like a President's Day or Christmas week?",
        "note": "Challenge the math. If he gives a number, multiply by rooms per unit and photos per room. The volume argument becomes obvious.",
        "branches": [
          {
            "label": "Shares the volume / admits it's a lot",
            "to": "reframe_value"
          },
          {
            "label": "Deflects / doesn't want to engage",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "I totally get it — I should have assumed you'd be all set, otherwise you probably would have reached out to us. Just so nobody from my team bugs you again — is it that inspection quality isn't something you're focused on right now, or is it more that you just hate cold calls?",
        "note": "Agree, then split. If 'hate cold calls' → they might actually be open to the product, just not the channel. If 'not focused on it' → try the seasonal angle or investment angle.",
        "branches": [
          {
            "label": "I just hate cold calls",
            "to": "hate_cold_calls"
          },
          {
            "label": "Not focused on this right now",
            "to": "not_focused"
          },
          {
            "label": "Both / just not a fit",
            "to": "graceful_exit"
          }
        ]
      },
      "hate_cold_calls": {
        "label": "THEY HATE COLD CALLS",
        "say": "Ha — honestly, fair. I'd feel the same way. What if I just shot you a two-minute video showing what it actually does, and if it's interesting you can reach back out on your own time? No follow-up calls, I promise.",
        "note": "Pivot to async. A video is lower friction than a meeting. If he agrees, send a personalized Loom showing the Breezeway integration.",
        "branches": [
          {
            "label": "Sure, send it over",
            "to": "get_email"
          },
          {
            "label": "No thanks",
            "to": "graceful_exit"
          }
        ]
      },
      "not_focused": {
        "label": "NOT FOCUSED ON THIS",
        "say": "Totally fair. Is there something bigger on your plate right now? I only ask because after the StayTerra investment, I'd imagine there's a lot of moving pieces on the operations side.",
        "note": "StayTerra invested in Moving Mountains (May 2025). This is a targeted probe — shows you know their business. If he reacts, lean in. If he's surprised, say you read the press release.",
        "branches": [
          {
            "label": "Reacts to StayTerra mention / opens up",
            "to": "warm_discovery"
          },
          {
            "label": "How do you know about that?",
            "to": "explain_research"
          },
          {
            "label": "Yeah, we've got a lot going on",
            "to": "objection_timing"
          },
          {
            "label": "That's not really your business",
            "to": "graceful_exit"
          }
        ]
      },
      "explain_research": {
        "label": "EXPLAIN RESEARCH",
        "say": "Ha — nothing creepy, I promise. I just do my homework before I call someone. I read the Business Wire piece about StayTerra and the Triumph acquisition coverage. I figured with that kind of growth, inspections and QA standardization would be top of mind. Am I off base?",
        "note": "Be transparent. He'll respect the preparation. Redirect to whether the growth is creating operational strain.",
        "branches": [
          {
            "label": "No, you're right / it is a priority",
            "to": "warm_discovery"
          },
          {
            "label": "We've got it handled",
            "to": "objection_have_process"
          },
          {
            "label": "Appreciates the research but still not interested",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_no_budget": {
        "label": "OBJECTION — NO BUDGET",
        "say": "Totally get it. Especially right now — it's harder to keep a tool than buy something new. Just so nobody from my team bugs you again — is it that budget for this kind of thing is completely off the table, or is it more that anything you try to buy has to go through the ringer with the new investment structure?",
        "note": "The StayTerra investment may have changed approval chains. If budget is genuinely locked, sell the test drive for future. If it's an approval process issue, offer to help build the case.",
        "branches": [
          {
            "label": "Budget is locked",
            "to": "sell_test_drive"
          },
          {
            "label": "It's an approval process thing",
            "to": "sell_test_drive"
          },
          {
            "label": "Just not spending on this",
            "to": "graceful_exit"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Makes sense. You're probably not buying this right now, and I totally respect that. But when budget does open up — especially heading into next season — the people who move fastest are the ones who already know what's first, second, third on their list. Would you be open to just seeing it? Not a pitch, just a walkthrough so you know it exists. Worst case you steal some ideas on what other luxury PMs are doing with their inspection photos.",
        "note": "'Steal some ideas' is the value offer. No pressure to buy. Plant the seed for next budget cycle.",
        "branches": [
          {
            "label": "Okay fine, let's take a look",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_timing": {
        "label": "OBJECTION — TIMING",
        "say": "Totally fair. When does timing get better for you — is there a point in the season where you come up for air and actually look at new stuff? I know ski season is a whole different animal.",
        "note": "Get a real timeline. Ski season = peak operational load = worst time to evaluate but best time to feel the pain. Off-season = evaluation window. Lock a follow-up.",
        "branches": [
          {
            "label": "Gives a timeframe / after ski season",
            "to": "lock_callback"
          },
          {
            "label": "Not sure / vague",
            "to": "sell_test_drive"
          },
          {
            "label": "Just not interested",
            "to": "graceful_exit"
          }
        ]
      },
      "referral_up": {
        "label": "REFERRAL UP",
        "say": "That makes total sense. If I were going to put something together for the right person on your team — or above you if it's more of a Chad or Lisa decision — who would you point me to? I want to make sure it actually lands with the person who'd own this.",
        "note": "Chad Rowe is COO, Lisa Riniker is Director of Operations. Use their names naturally to signal you've done homework. If Chip points you to Erin Hawthorne (Ops Manager BC/Vail) or Melissa Caton (Ops Manager Breck), those are also great contacts.",
        "branches": [
          {
            "label": "Points to Chad / Lisa / someone specific",
            "to": "get_referral_details"
          },
          {
            "label": "Just send it to me and I'll forward",
            "to": "send_email"
          },
          {
            "label": "I can make this decision",
            "to": "pitch_tailored"
          }
        ]
      },
      "get_referral_details": {
        "label": "GET REFERRAL DETAILS",
        "say": "Perfect — and what's the best way to reach them? If I can get a direct number or email, I'll put something tailored together so it's not just another generic cold pitch. I'll mention you pointed me their way.",
        "note": "Get name, title, email, and phone if possible. Confirm you can use Chip's name as the referral. This is gold.",
        "branches": [
          {
            "label": "Gives contact info",
            "to": "book_meeting_or_exit"
          },
          {
            "label": "Just email the main line",
            "to": "send_email"
          }
        ]
      },
      "breezeway_question": {
        "label": "BREEZEWAY INTEGRATION DETAIL",
        "say": "Yeah so we integrate directly with Breezeway. Your inspectors keep doing exactly what they're doing — taking photos, uploading them through Breezeway tasks. Our AI picks up those photos automatically, runs them against a baseline for that specific property, and flags anything that looks off. Damage, missing items, staging issues, furniture that's been moved or is gone. The flags show up before the guest checks in so your team can actually act on them. Zero change to your inspectors' workflow.",
        "note": "The Breezeway integration is confirmed. This is a huge selling point — no new tool, no new process. Emphasize 'zero change' and 'before the guest checks in.'",
        "branches": [
          {
            "label": "That's slick / sounds useful",
            "to": "pitch_tailored"
          },
          {
            "label": "We'd need to check with Liz / IT",
            "to": "referral_up"
          },
          {
            "label": "Let me see it in action",
            "to": "book_meeting"
          }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair — I'll send something over. One quick question so it's not just another generic pitch sitting in your inbox — what would be most relevant to include? Is it more the Breezeway integration piece, or the actual examples of what the AI catches?",
        "note": "Accept it. Ask what to include to tailor the email. Then suggest a specific follow-up time. Get his direct email if you don't have it.",
        "branches": [
          {
            "label": "Tells you what to include",
            "to": "get_email"
          },
          {
            "label": "Just send whatever / doesn't care",
            "to": "get_email"
          }
        ]
      },
      "get_email": {
        "label": "GET EMAIL + LOCK FOLLOW-UP",
        "say": "Got it — is chip at movingmountains dot com the best one to use? And I'll include a specific example from a similar luxury portfolio. If I send it today, would it be crazy to try you again Thursday just to see if it landed?",
        "note": "Confirm the email pattern (firstname@movingmountains.com). Suggest a specific follow-up day. Don't leave it open-ended.",
        "branches": [
          {
            "label": "Confirms email / agrees to follow-up",
            "to": "close_email"
          },
          {
            "label": "Don't call me back / I'll reach out if interested",
            "to": "close_email"
          }
        ]
      },
      "close_email": {
        "label": "CLOSE — EMAIL",
        "say": "Perfect — I'll get that over to you today. Appreciate you taking my call, Chip. Talk soon.",
        "note": "Send the email within 30 minutes. Include: personalized note referencing the ski market and Breezeway, one concrete example, a proposed meeting time. Keep it under 150 words.",
        "branches": []
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome — I've got next Tuesday and Thursday pulled up. Does morning or afternoon work better for you? I just need 20 minutes.",
        "note": "Pick specific days. Lock day first, then time. Send the calendar invite while still on the phone if possible.",
        "branches": [
          {
            "label": "Picks a day and time",
            "to": "confirm_meeting"
          },
          {
            "label": "Let me check and get back to you",
            "to": "lock_meeting_2"
          }
        ]
      },
      "lock_meeting_2": {
        "label": "LOCK MEETING — FOLLOW UP",
        "say": "Totally — how about I shoot you a calendar invite for Tuesday at 10 AM mountain time, and you can move it if you need to? That way we've got a placeholder and it doesn't fall through the cracks.",
        "note": "Default to sending the invite. A placeholder is better than a 'I'll check and get back to you' that never happens.",
        "branches": [
          {
            "label": "Sure, send it over",
            "to": "confirm_meeting"
          },
          {
            "label": "Let me email you back",
            "to": "get_email"
          },
          {
            "label": "Not ready to commit",
            "to": "send_email"
          }
        ]
      },
      "confirm_meeting": {
        "label": "CONFIRM MEETING",
        "say": "Locked in. I'll send the invite now — it'll come from Sam at RapidEye. I'll include a quick one-pager so you're not going in blind. Really appreciate you taking my call, Chip. Looking forward to it.",
        "note": "Send the invite immediately. Include a brief agenda in the invite body. Stop selling — the meeting is booked. Be warm and get off the phone.",
        "branches": []
      },
      "book_meeting_or_exit": {
        "label": "CLOSE WITH REFERRAL",
        "say": "Awesome — really appreciate you pointing me in the right direction. I'll reach out to them and mention you and I connected. If you ever want to see it yourself, I'm easy to find. Thanks Chip.",
        "note": "You got a referral. Send a tailored note to the referred contact within the hour mentioning Chip by name. Follow up with Chip via email to thank him.",
        "branches": []
      },
      "lock_callback": {
        "label": "LOCK CALLBACK TIME",
        "say": "Perfect — I'll try you then. Is this number the best one to catch you on? And is there a time of day that works better — mornings before the chaos starts, or end of day?",
        "note": "Get the specific number and time. Put it on the calendar immediately. Callbacks that aren't scheduled don't happen.",
        "branches": [
          {
            "label": "Gives time and number",
            "to": "close_callback"
          },
          {
            "label": "Just try me / vague",
            "to": "close_callback"
          }
        ]
      },
      "close_callback": {
        "label": "CLOSE — CALLBACK",
        "say": "Got it — I'll try you then. Appreciate it, Chip. Talk soon.",
        "note": "Short and clean. Add to calendar with context notes so the next call picks up where this left off.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes — especially heading into next season — I'm easy to find. Appreciate your time, Chip.",
        "note": "Don't burn the bridge. Add to a 90-day follow-up list. Consider a light-touch email in 2-3 months timed to off-season evaluation window.",
        "branches": []
      }
    }
  }
}