{
  "name": "Chloē Buss",
  "title": "Regional Director of Operations, East Coast",
  "company": "AvantStay",
  "location": "Cannon Beach, OR",
  "phone": "",
  "company_phone": "855-683-1768",
  "alt_phones": [],
  "flow": {
    "context": "Chloē Buss is Regional Director of Operations for AvantStay's entire East Coast portfolio. She owns turnover quality, cleaning standards, and maintenance execution across multiple markets — she's the person who feels it first when a damage or staging issue slips through. AvantStay is a tech-forward national vacation rental operator that uses Breezeway for ops workflows, Salesforce for CRM, and is expanding into hotels (Sense28 opening in Miami, March 2026). Strongest hook for Sam: she's an outdoors and beach person (Folly Beach is her favorite AvantStay property, loves lazy beach days), Sam's a surfer. She also works closely with Product to solve ops problems — exactly the profile that sponsors new tooling.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Chloē — I work with a couple other East Coast vacation rental ops teams on their Breezeway inspection workflows. It's Sam Parks with RapidEye. Have you heard my name tossed around?",
        "note": "Feet up on the desk energy. You know she uses Breezeway — that's your credibility. Say her name like you've talked before. Don't rush.",
        "branches": [
          {
            "label": "Yes / I think so",
            "to": "heard_yes"
          },
          {
            "label": "No / Who?",
            "to": "heard_no"
          },
          {
            "label": "Bad timing / busy",
            "to": "bad_timing"
          },
          {
            "label": "Gatekeeper answers instead",
            "to": "gatekeeper"
          }
        ]
      },
      "heard_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone like you on this. What'd you hear?",
        "note": "Let her talk. Whatever she says, bridge it into the pain trigger. Don't correct anything — just flow with it.",
        "branches": [
          {
            "label": "Describes something / vague recognition",
            "to": "pain_trigger"
          },
          {
            "label": "Confused / mixing you up with someone else",
            "to": "heard_no"
          }
        ]
      },
      "heard_no": {
        "label": "HAVEN'T HEARD — TRANSITION",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call — I've been talking with a few other regional ops directors managing scattered portfolios across multiple East Coast markets, and there's a problem that keeps coming up. Mind if I share real quick?",
        "note": "Self-deprecating, then pivot. You're softly asking permission. If she resists, go to permission_ask.",
        "branches": [
          {
            "label": "Sure / go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "I'm really busy / not interested",
            "to": "permission_ask"
          },
          {
            "label": "What's this about?",
            "to": "pain_trigger"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow or later this week?",
        "note": "Don't push. Get a callback window and move on. She might be mid-turnover chaos.",
        "branches": [
          {
            "label": "Gives a time / sure try later",
            "to": "lock_callback"
          },
          {
            "label": "Just email me",
            "to": "send_email"
          },
          {
            "label": "Don't call back",
            "to": "graceful_exit"
          }
        ]
      },
      "lock_callback": {
        "label": "LOCK THE CALLBACK",
        "say": "Perfect — I've got Thursday afternoon pulled up. Would 2 PM your time work, or is there a better window?",
        "note": "Offer a specific day and time. Confirm her time zone — she's East Coast. Don't leave it vague.",
        "branches": [
          {
            "label": "Confirms a time",
            "to": "callback_confirmed"
          },
          {
            "label": "Just try me whenever",
            "to": "callback_confirmed"
          }
        ]
      },
      "callback_confirmed": {
        "label": "CALLBACK SET",
        "say": "Got it — I'll give you a ring then. Appreciate it, Chloē.",
        "note": "Stop talking. Add the callback to your calendar immediately with notes on what happened.",
        "branches": []
      },
      "gatekeeper": {
        "label": "GATEKEEPER — SLIDE BY",
        "say": "Hey — could you get me through to Chloē? It's Sam.",
        "note": "Say it like you know her. First name only. Don't explain what you do. Don't say your last name unless asked.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Asks what it's about",
            "to": "gatekeeper_context"
          },
          {
            "label": "She's not available",
            "to": "gatekeeper_voicemail"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — ADD CONTEXT",
        "say": "Yeah — I work with a few other vacation rental ops teams on their Breezeway workflows. Would you mind letting her know it's Sam Parks?",
        "note": "Dose info bit by bit. You're not pitching the gatekeeper. End with a redirect question so you keep control.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Asks more / pushes back",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "She's not available",
            "to": "gatekeeper_voicemail"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "Totally understand — we help a couple other property management companies with their inspection workflows. I sent her a note already — would you mind giving her a heads up that I called?",
        "note": "Third attempt. If this doesn't work, leave a message and move on. Don't fight the gatekeeper.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Takes a message / offers voicemail",
            "to": "gatekeeper_voicemail"
          },
          {
            "label": "Hard no",
            "to": "graceful_exit"
          }
        ]
      },
      "gatekeeper_voicemail": {
        "label": "VOICEMAIL OR MESSAGE",
        "say": "No worries — if you could just let her know Sam Parks called about their Breezeway inspection workflow, that'd be great. I'll try her again. Thanks so much.",
        "note": "Keep it short and curiosity-driven. Don't pitch. The Breezeway mention gives her a reason to be curious when she sees the note.",
        "branches": []
      },
      "permission_ask": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean, it is a cold call. Can I get 30 seconds to tell you why I reached out? And you can totally hang up on me if it's not a fit.",
        "note": "Disarming honesty. Most people give you 30 seconds when you own it. Smile while you say this.",
        "branches": [
          {
            "label": "Fine / go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "No / not interested",
            "to": "permission_rejected"
          },
          {
            "label": "Laughs / sure why not",
            "to": "pain_trigger"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED — SPLIT",
        "say": "Shoot — totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and this just isn't interesting?",
        "note": "You're splitting the rejection. Most people clarify it's bad timing — that reopens the door.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / don't call again",
            "to": "graceful_exit"
          },
          {
            "label": "Actually… what do you do?",
            "to": "pain_trigger"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "So I've been working with another regional ops director — similar setup to you, managing East Coast markets across a bunch of different cities. Her team was using Breezeway, doing turnover photos every single time, checking all the boxes. But she kept running into the same thing — her cleaners would upload forty, fifty photos per unit, and nobody had time to actually look at all of them. Stuff would slip through. A gouge in a countertop, a missing set of towels, a stain on a sofa cushion. And she wouldn't find out until the next guest checked in — or worse, an owner saw it on their portal and called asking what happened. Sound familiar at all?",
        "note": "PAUSE after 'sound familiar.' Let her react. You said Breezeway on purpose — she uses it daily. This should hit close to home. Do NOT rush past the silence.",
        "branches": [
          {
            "label": "Yes / that resonates",
            "to": "warm_response"
          },
          {
            "label": "We actually have a pretty good process",
            "to": "objection_have_process"
          },
          {
            "label": "Not really our biggest problem",
            "to": "objection_not_interested"
          },
          {
            "label": "What do you do about it?",
            "to": "pitch_solution"
          }
        ]
      },
      "warm_response": {
        "label": "THEY'RE WARM — STOP PITCHING",
        "say": "Yeah — that's exactly what we keep hearing. Can I ask — what does your inspection workflow actually look like right now across your East Coast markets? Are your field teams uploading everything through Breezeway, or is some of it still manual?",
        "note": "She's warm. DO NOT PITCH. Ask questions. Learn her process. You want to understand how photos flow from cleaner to Breezeway to whoever reviews them.",
        "branches": [
          {
            "label": "Describes their process",
            "to": "discovery_deep"
          },
          {
            "label": "Yes Breezeway / describes photo workflow",
            "to": "discovery_breezeway"
          },
          {
            "label": "We use a different system",
            "to": "discovery_other_system"
          },
          {
            "label": "Asks what RapidEye does",
            "to": "pitch_solution"
          }
        ]
      },
      "discovery_deep": {
        "label": "DISCOVERY — DIG DEEPER",
        "say": "That makes sense. So when something does get missed — a damage, a staging issue — how does that usually surface? Is it a guest complaint, an owner calling in, or does your team catch it on a follow-up?",
        "note": "You're looking for consequences. Where does the pain land? Guest reviews? Owner escalations? Refunds? This is what you'll frame the value around.",
        "branches": [
          {
            "label": "Guest complaints / bad reviews",
            "to": "discovery_consequences"
          },
          {
            "label": "Owner escalations",
            "to": "discovery_consequences"
          },
          {
            "label": "We catch most things internally",
            "to": "discovery_volume"
          },
          {
            "label": "Asks what you do about it",
            "to": "pitch_solution"
          }
        ]
      },
      "discovery_breezeway": {
        "label": "DISCOVERY — BREEZEWAY WORKFLOW",
        "say": "Got it — so your teams are uploading photos into Breezeway after every turn. Who's actually reviewing those photos? Is it a market manager in each city, or does it roll up to your team?",
        "note": "You want to know if anyone's actually looking at the photos or just checking a box. Most teams upload as proof but nobody has bandwidth to review them all. That's the gap.",
        "branches": [
          {
            "label": "Market managers review / local teams",
            "to": "discovery_volume"
          },
          {
            "label": "Nobody really reviews them all",
            "to": "discovery_gap_confirmed"
          },
          {
            "label": "I review them / my team does",
            "to": "discovery_volume"
          }
        ]
      },
      "discovery_other_system": {
        "label": "DISCOVERY — DIFFERENT SYSTEM",
        "say": "Oh interesting — what are you guys using for turnover workflows on the East Coast?",
        "note": "Research says Breezeway company-wide, but her region might use something different or supplemental. Listen and adapt. RapidEye works with multiple platforms.",
        "branches": [
          {
            "label": "Names a system",
            "to": "discovery_volume"
          },
          {
            "label": "Still Breezeway but different workflow",
            "to": "discovery_breezeway"
          },
          {
            "label": "Asks what you do",
            "to": "pitch_solution"
          }
        ]
      },
      "discovery_volume": {
        "label": "DISCOVERY — VOLUME AND CAPACITY",
        "say": "How many turnovers are you looking at on a typical week across your East Coast markets? And is that ramping up heading into spring?",
        "note": "You're establishing scale. More volume = more photos nobody reviews = more value for RapidEye. Peak season is coming. AvantStay is also opening a hotel in Miami March 2026 — more complexity on her plate.",
        "branches": [
          {
            "label": "Gives a number / describes volume",
            "to": "pitch_solution"
          },
          {
            "label": "It's a lot and growing",
            "to": "pitch_solution"
          },
          {
            "label": "Mentions hotel expansion or Miami",
            "to": "discovery_hotel_expansion"
          }
        ]
      },
      "discovery_gap_confirmed": {
        "label": "GAP CONFIRMED — BRIDGE TO SOLUTION",
        "say": "Yeah, that's super common. The photos are there, the data's there — but nobody has time to actually look at every single one across every market. That's exactly what we built RapidEye for. We plug directly into Breezeway and automatically analyze every photo your team's already uploading — flags damage, missing items, staging issues, generates an inspection report. No workflow change on your end. Would you be open to seeing how it works when I'm not cold calling you out of the blue?",
        "note": "You confirmed the gap. Bridge naturally to the solution in one breath. Go straight to CTA. Don't linger.",
        "branches": [
          {
            "label": "Yeah / sure / sounds interesting",
            "to": "book_meeting"
          },
          {
            "label": "How does it actually work?",
            "to": "pitch_detail"
          },
          {
            "label": "We're not looking for new tools right now",
            "to": "objection_not_now"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          }
        ]
      },
      "discovery_consequences": {
        "label": "DISCOVERY — CONSEQUENCES",
        "say": "And when that happens — a guest finds something your team missed — what does that look like for you? Is that a refund conversation, a bad review, or more of an owner trust issue?",
        "note": "You're quantifying pain. Guest refunds, review damage, and owner churn are all expensive. Let her tell you which one hurts most. That's your selling angle.",
        "branches": [
          {
            "label": "Describes the fallout",
            "to": "pitch_solution"
          },
          {
            "label": "All of the above",
            "to": "pitch_solution"
          },
          {
            "label": "It's manageable honestly",
            "to": "pitch_solution"
          }
        ]
      },
      "discovery_hotel_expansion": {
        "label": "HOTEL EXPANSION ANGLE",
        "say": "Yeah — I actually saw the Sense28 opening in Miami coming up in March. That's exciting but I'd imagine it adds a whole different layer of complexity to your ops. Is that falling under your team too?",
        "note": "AvantStay is opening Sense28 hotel in Miami March 2026. If she's East Coast ops, Miami might be her territory. This shows you've done your homework and her world is getting more complex, not simpler.",
        "branches": [
          {
            "label": "Yes / describes involvement",
            "to": "pitch_solution"
          },
          {
            "label": "No that's someone else",
            "to": "pitch_solution"
          },
          {
            "label": "How did you know about that?",
            "to": "pitch_solution"
          }
        ]
      },
      "pitch_solution": {
        "label": "ONE-SENTENCE SOLUTION + CTA",
        "say": "So here's the short version — RapidEye plugs into Breezeway and automatically analyzes every turnover photo your team's already uploading. Catches damage, missing items, staging issues, and generates an inspection report without anyone changing what they're already doing. Would you be open to taking a look — maybe next week when I'm not interrupting your day?",
        "note": "One sentence on what it does. One CTA sentence. Then STOP. Let her respond. Don't keep selling.",
        "branches": [
          {
            "label": "Sure / that could be interesting",
            "to": "book_meeting"
          },
          {
            "label": "How does it actually work?",
            "to": "pitch_detail"
          },
          {
            "label": "We're pretty happy with our process",
            "to": "objection_have_process"
          },
          {
            "label": "Not a priority right now",
            "to": "objection_not_now"
          },
          {
            "label": "I'm not the right person for this",
            "to": "referral_ask"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          },
          {
            "label": "No budget for new tools",
            "to": "objection_no_budget"
          }
        ]
      },
      "pitch_detail": {
        "label": "HOW IT WORKS — BRIEF",
        "say": "Yeah — so your cleaners or field team do their turnover exactly like they do now, upload photos into Breezeway. RapidEye sits on top of that and runs every photo through our AI. It compares against baseline — what the property's supposed to look like — and flags anything off. A scratch on a table, a missing throw pillow, a stain that wasn't there last turn. Your market managers get a flagged report instead of scrolling through fifty photos hoping they spot something. We're live with a few PM companies right now — one running about 600 East Coast properties, actually. Would it make sense to show you how it looks on a quick call next week?",
        "note": "Keep it conversational. The 600 East Coast properties reference is real traction. Don't go into technical weeds. Push toward the meeting.",
        "branches": [
          {
            "label": "Yeah let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "Interesting but not right now",
            "to": "objection_not_now"
          },
          {
            "label": "I'd need to loop in someone else",
            "to": "referral_ask"
          },
          {
            "label": "Send me info first",
            "to": "send_email"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome — I've got next Tuesday and Thursday pulled up. What works better on your end? I'm flexible on time.",
        "note": "Give two day options. Lock the time NOW on the phone. Don't say 'I'll send you a link to book.' Pick the slot together.",
        "branches": [
          {
            "label": "Picks a day and time",
            "to": "confirm_meeting"
          },
          {
            "label": "Let me check my calendar / not sure yet",
            "to": "nudge_meeting"
          },
          {
            "label": "Actually just email me first",
            "to": "send_email"
          }
        ]
      },
      "confirm_meeting": {
        "label": "CONFIRM THE MEETING",
        "say": "Perfect — I'll shoot the invite over right now. Is chloe at avantstay dot com the best email? And would it be helpful to have anyone else on the call — maybe William Parkhouse or someone from your Product team?",
        "note": "Confirm her email. Suggesting William (Sr. Director Field Ops) or Product (Ashrit Kamireddi is CPO) shows you know the org. If she adds people, your meeting just got more powerful. Once confirmed, STOP SELLING.",
        "branches": [
          {
            "label": "Confirms email / adds people",
            "to": "meeting_wrap"
          },
          {
            "label": "Just me for now",
            "to": "meeting_wrap"
          }
        ]
      },
      "meeting_wrap": {
        "label": "WRAP — MEETING BOOKED",
        "say": "Done — you'll see that in your inbox in about thirty seconds. Really appreciate you taking my call, Chloē. Talk to you then.",
        "note": "Stop selling. Send the invite IMMEDIATELY. Add her to CRM. Note everything she said about their process, who she might add, and any pain points she mentioned.",
        "branches": []
      },
      "nudge_meeting": {
        "label": "NUDGE — SOFT PUSH",
        "say": "No rush — how about I pencil in Thursday at 1 PM Eastern and if something comes up we'll move it? Worst case you see what we're working on and steal some ideas for your own process.",
        "note": "Make it easy. Low commitment framing. 'Steal some ideas' positions the meeting as valuable even if she never buys.",
        "branches": [
          {
            "label": "Sure that works",
            "to": "confirm_meeting"
          },
          {
            "label": "Just email me and I'll find a time",
            "to": "send_email"
          }
        ]
      },
      "objection_have_process": {
        "label": "OBJECTION — HAVE A PROCESS",
        "say": "That totally makes sense — with as many markets as you're covering on the East Coast, you'd have to have something solid in place. Just so nobody from my team cold calls you again — is it that you're fully covered and happy with how things are working, or is it more that adding anything new right now would just be a headache?",
        "note": "Agree first. Then split the objection. 'Adding anything new is a headache' is the door you want open — that's a timing issue, not a fit issue.",
        "branches": [
          {
            "label": "We're happy with what we have",
            "to": "test_drive_happy"
          },
          {
            "label": "Adding anything new is hard right now",
            "to": "test_drive_timing"
          },
          {
            "label": "Bit of both",
            "to": "test_drive_timing"
          }
        ]
      },
      "test_drive_happy": {
        "label": "THEY'RE HAPPY — SELL THE BENCHMARK",
        "say": "Love that — honestly that's rare. Most ops leaders I talk to are duct-taping something together. If nothing else, would you be open to a fifteen-minute look at what some other PM companies are doing with AI on their turnover photos? Worst case you validate your process is already ahead of the curve and we part as friends.",
        "note": "Reframe the meeting as benchmarking, not buying. 'Validate you're ahead' appeals to pride. She works closely with Product to solve ops problems — this framing aligns with that.",
        "branches": [
          {
            "label": "Sure / why not",
            "to": "book_meeting"
          },
          {
            "label": "Not right now",
            "to": "graceful_exit_with_door"
          },
          {
            "label": "Who else are you working with?",
            "to": "social_proof_drop"
          }
        ]
      },
      "test_drive_timing": {
        "label": "TIMING ISSUE — PLANT THE SEED",
        "say": "Totally get it — you're probably not buying anything right now and I respect that. But the people who end up moving on something like this are usually the ones who already know what's out there when the window opens. Would you be open to a fifteen-minute look — not to buy anything, just so you know what RapidEye does — and if it's not useful we'll leave you alone?",
        "note": "Selling a future option, not a present commitment. Low pressure. If she agrees, you've got a meeting. If not, try to leave the door open.",
        "branches": [
          {
            "label": "Yeah okay fine",
            "to": "book_meeting"
          },
          {
            "label": "Just send me something",
            "to": "send_email"
          },
          {
            "label": "Not interested",
            "to": "graceful_exit_with_door"
          }
        ]
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "I totally get it — I should've assumed you'd be all set, otherwise you probably would've reached out to us. Just so no one from my team bugs you again — is it that this isn't a problem you're focused on right now, or is it more that you just hate cold calls?",
        "note": "Agree first. Disarm with humor on the cold call line. Split the objection to find out if it's a real no or a reaction to the interruption.",
        "branches": [
          {
            "label": "I hate cold calls / just busy",
            "to": "test_drive_timing"
          },
          {
            "label": "Not a problem we're focused on",
            "to": "not_a_priority_dig"
          },
          {
            "label": "Honestly both",
            "to": "graceful_exit_with_door"
          }
        ]
      },
      "not_a_priority_dig": {
        "label": "NOT A PRIORITY — DIG",
        "say": "Fair enough. Out of curiosity — what is top of mind for you heading into spring? I imagine with peak season coming up and the portfolio growing, you've got a full plate.",
        "note": "If inspections aren't her priority, learn what is. Spring and summer are peak season — her ops complexity is about to spike. She might name a problem RapidEye touches. If she opens up, listen for an angle. If not, exit gracefully.",
        "branches": [
          {
            "label": "Shares what she's focused on",
            "to": "warm_response"
          },
          {
            "label": "I really don't have time for this",
            "to": "graceful_exit_with_door"
          },
          {
            "label": "Mentions something adjacent to inspections",
            "to": "pitch_solution"
          }
        ]
      },
      "objection_not_now": {
        "label": "OBJECTION — NOT RIGHT NOW",
        "say": "Totally fair — and I wouldn't expect you to commit to anything on a cold call. Would you be open to just seeing how it works? Fifteen minutes — and if it's not relevant you'll never hear from me again. If nothing else I can show you what a couple other East Coast PM teams are doing with their turnover photos.",
        "note": "Reframe as zero commitment. The peer insight angle is the value offer. Push gently toward a meeting.",
        "branches": [
          {
            "label": "Okay sure",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "I'm really not interested",
            "to": "graceful_exit_with_door"
          }
        ]
      },
      "objection_no_budget": {
        "label": "OBJECTION — NO BUDGET",
        "say": "Totally get it — nowadays it's harder to keep a tool than buy something new. Just so nobody from my team calls you again — is it that budget this cycle is completely locked, or is it that anything new has to go through a gauntlet to get approved?",
        "note": "Agree. Then split. If it's an approval gauntlet, you can help her build the business case. If budget is truly locked, plant a seed for next cycle.",
        "branches": [
          {
            "label": "Budget is locked",
            "to": "test_drive_timing"
          },
          {
            "label": "Approval process is painful",
            "to": "test_drive_approval"
          },
          {
            "label": "We're just not spending on anything new",
            "to": "graceful_exit_with_door"
          }
        ]
      },
      "test_drive_approval": {
        "label": "APPROVAL GAUNTLET — OFFER HELP",
        "say": "Yeah I hear that a lot. Here's what usually helps — if I can show you the product and the numbers behind it, you'd have something concrete to bring to Ashrit or whoever makes the call on new ops tooling. Would it make sense to at least take a look so you're armed with something real if the window opens?",
        "note": "Ashrit Kamireddi is CPO and Head of Ops — likely who approves new tools. Dropping his name shows you know the org. If she confirms or corrects, you learn the approval chain.",
        "branches": [
          {
            "label": "Yeah that makes sense",
            "to": "book_meeting"
          },
          {
            "label": "It's actually someone else who decides",
            "to": "referral_ask"
          },
          {
            "label": "Just send me info",
            "to": "send_email"
          }
        ]
      },
      "social_proof_drop": {
        "label": "SOCIAL PROOF",
        "say": "We're live with a PM company running about 600 properties on the East Coast and another group doing around 200 luxury homes in New York. Both plugged us into their existing turnover photo workflow — no changes to how their teams operate. Happy to show you what that actually looks like.",
        "note": "Don't name client names unless you have permission. Keep it general but specific enough to be credible. Bridge back to the meeting.",
        "branches": [
          {
            "label": "Interested / tell me more",
            "to": "book_meeting"
          },
          {
            "label": "What PMS are they on?",
            "to": "pitch_detail"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          }
        ]
      },
      "referral_ask": {
        "label": "REFERRAL — FIND THE RIGHT PERSON",
        "say": "Totally makes sense — who on your team would typically own the decision around ops tooling like this? Is that something William Parkhouse would look at, or does it go through Product?",
        "note": "You're naming William (Sr. Director Field Ops) and referencing Product (Ashrit Kamireddi is CPO). If she corrects you, you learn the real decision path. If she confirms, ask for an intro.",
        "branches": [
          {
            "label": "Names someone / confirms William or Ashrit",
            "to": "referral_get_intro"
          },
          {
            "label": "I can bring it to them myself",
            "to": "referral_self_intro"
          },
          {
            "label": "Actually I'm the right person, just not now",
            "to": "test_drive_timing"
          }
        ]
      },
      "referral_get_intro": {
        "label": "REFERRAL — ASK FOR INTRO",
        "say": "Would you be open to connecting me? If I can get a name and the best way to reach them, I'll put something tailored together so it actually lands — and I'll mention you and I spoke.",
        "note": "Get the name, title, and ideally email or direct line. 'I'll mention we spoke' gives you warm social proof on the next call.",
        "branches": [
          {
            "label": "Gives name and contact info",
            "to": "referral_wrap"
          },
          {
            "label": "I'll forward something to them internally",
            "to": "send_email_for_referral"
          },
          {
            "label": "Let me think about it",
            "to": "send_email_for_referral"
          }
        ]
      },
      "referral_self_intro": {
        "label": "SHE'LL BRING IT UP INTERNALLY",
        "say": "That'd be amazing. Would it help if I sent you a quick one-pager you could forward? Something specific to the Breezeway integration and your East Coast use case — not a generic deck.",
        "note": "If she's willing to carry it internally, make it easy. A tailored one-pager beats a generic email. Also try to get a meeting with her and the decision maker.",
        "branches": [
          {
            "label": "Yeah send it over",
            "to": "confirm_email_for_referral"
          },
          {
            "label": "Sure and let's also set up a call with them",
            "to": "book_meeting"
          }
        ]
      },
      "confirm_email_for_referral": {
        "label": "CONFIRM EMAIL FOR REFERRAL SEND",
        "say": "Perfect — is chloe at avantstay dot com the best place to send that? And if you end up sharing it, would it be cool if I followed up next week to see if there's any interest?",
        "note": "Confirm the email. Get permission to follow up. You now have a warm path into the org.",
        "branches": [
          {
            "label": "Confirms email and follow up is fine",
            "to": "referral_wrap"
          },
          {
            "label": "I'll reach out if there's interest",
            "to": "referral_wrap"
          }
        ]
      },
      "send_email_for_referral": {
        "label": "EMAIL FOR INTERNAL FORWARD",
        "say": "Totally — I'll put something together that's easy to forward. Is chloe at avantstay dot com the best address? I'll keep it short and specific to how it plugs into Breezeway.",
        "note": "Same as send_email but framed for internal forwarding. Include the referral target's name if she gave one. Follow up in 3-4 days.",
        "branches": [
          {
            "label": "Confirms email",
            "to": "referral_wrap"
          },
          {
            "label": "Gives a different email",
            "to": "referral_wrap"
          }
        ]
      },
      "referral_wrap": {
        "label": "REFERRAL CONFIRMED — WRAP",
        "say": "Really appreciate that, Chloē. I'll send something over today and follow up next week. Thanks for taking my call.",
        "note": "You've got a warm referral path. Send the tailored piece immediately. Log the referral name and follow-up date in CRM.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair — I'll send something over. One quick question so it's not just another generic pitch sitting in your inbox: what would be most useful to see? Is it more about how we plug into Breezeway, or would you want to see the actual inspection output — like what the AI catches?",
        "note": "Accept the request, then ask ONE question to tailor it. This tells you what she actually cares about. You'll include a specific meeting time suggestion in the email.",
        "branches": [
          {
            "label": "Breezeway integration / process stuff",
            "to": "confirm_email_send"
          },
          {
            "label": "Show me the output / what it catches",
            "to": "confirm_email_send"
          },
          {
            "label": "Just send whatever",
            "to": "confirm_email_send"
          }
        ]
      },
      "confirm_email_send": {
        "label": "CONFIRM EMAIL AND WRAP",
        "say": "Got it — I'll keep it tight. Is chloe at avantstay dot com the best address? I'll drop in a couple times to connect next week in case you want to look at it together after you read it.",
        "note": "Confirm the email address. Include 2 specific meeting time options in the email. Follow up by calling again in 3-4 days. Don't send a novel — keep it short, visual, and specific to what she asked for.",
        "branches": [
          {
            "label": "Confirms email",
            "to": "email_wrap"
          },
          {
            "label": "Gives a different email",
            "to": "email_wrap"
          }
        ]
      },
      "email_wrap": {
        "label": "EMAIL WRAP",
        "say": "Perfect — you'll have it by end of day. Appreciate your time, Chloē. Talk soon.",
        "note": "Send the email within the hour. Subject line should reference Breezeway and AvantStay specifically — not generic. Follow up by phone in 3-4 days.",
        "branches": []
      },
      "graceful_exit_with_door": {
        "label": "GRACEFUL EXIT — DOOR OPEN",
        "say": "Totally understand. If anything changes — especially heading into peak season — I'm easy to find. Appreciate your time, Chloē.",
        "note": "Don't burn the bridge. Log the call. Try again in 6-8 weeks with a different angle — maybe the Miami hotel launch or a new case study. She works closely with Product so a product-focused trigger might reopen the door.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "No worries at all. Appreciate your time, Chloē. Have a good one.",
        "note": "Clean exit. Log the outcome. Move to the next call.",
        "branches": []
      }
    }
  }
}