{
  "name": "Christian Don Cramer",
  "title": "Principal Broker (P(B))",
  "company": "Maui Rental Management",
  "location": "Scottsdale, AZ is already on the list. Let me provide the next best option:\\n\\nMaui, HI",
  "phone": "+1-808-269-8227",
  "company_phone": "+1-808-437-7737",
  "alt_phones": [],
  "flow": {
    "context": "Christian Don Cramer is the Principal Broker (P(B)) at Maui Rental Management (DBA Hawaii Equity Management LLC) in Kihei — he controls the main company inbox and authors company communications, signaling active senior leadership. They manage 100+ residential units across Maui, primarily long-term but selectively do vacation rentals, and run a separate STR brand called Hawaii Vacation Homes. Brandon Holmes is the BIC/Owner and ultimate decision-maker; Matt Buck leads the vacation rental brand. Sam's hook: he's a legit surfer who's traveled to Indo and El Salvador for waves — calling someone on Maui makes this feel personal, not cold.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Christian — so I work with a few property managers out in Hawaii, and I'm not gonna lie, every time I talk to someone on Maui I get a little jealous — I'm a big surfer. Anyway, it's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Smile. Relaxed energy. The surfing line is real — just drop it casually and move on. Don't dwell on it or make it weird.",
        "branches": [
          {
            "label": "Yes / maybe I have",
            "to": "heard_yes"
          },
          {
            "label": "No, who is this?",
            "to": "heard_no"
          },
          {
            "label": "I'm busy / bad time",
            "to": "bad_timing"
          },
          {
            "label": "Guarded / suspicious",
            "to": "permission_fallback"
          }
        ]
      },
      "heard_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone in your shoes on this stuff. What'd you hear?",
        "note": "Let them talk. Whatever they say, bridge into asking about their inspection process. Don't correct anything they say.",
        "branches": [
          {
            "label": "Gives any answer",
            "to": "discovery_process"
          }
        ]
      },
      "heard_no": {
        "label": "HAVEN'T HEARD OF YOU",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call — I've been talking to a few property managers on Maui who are dealing with something you might relate to. You got a sec?",
        "note": "Keep it light and breezy. You're asking permission to continue without sounding desperate.",
        "branches": [
          {
            "label": "Yeah go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "What's this about? / hesitant",
            "to": "permission_fallback"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again later this week? Maybe Thursday or Friday?",
        "note": "Don't push. Just lock a callback window and get off the phone quickly.",
        "branches": [
          {
            "label": "Sure, call me back",
            "to": "reschedule"
          },
          {
            "label": "What's this about real quick?",
            "to": "pain_trigger"
          },
          {
            "label": "Don't call back",
            "to": "end_graceful"
          }
        ]
      },
      "reschedule": {
        "label": "CALLBACK LOCKED",
        "say": "Perfect — I'll try you Thursday afternoon. Appreciate it, Christian.",
        "note": "Write down the callback day and time immediately. Set a calendar reminder. Log in CRM.",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION ASK",
        "say": "Yeah totally — I mean it is a cold call. Can I get thirty seconds to tell you why I reached out? And you can totally hang up on me if it's not a fit.",
        "note": "Disarming honesty. Most people give you the 30 seconds. Smile through it — tone matters more than words here.",
        "branches": [
          {
            "label": "OK, 30 seconds",
            "to": "pain_trigger"
          },
          {
            "label": "No I'm good",
            "to": "permission_denied"
          }
        ]
      },
      "permission_denied": {
        "label": "PERMISSION DENIED",
        "say": "Shoot — totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and it's just not interesting?",
        "note": "This split question forces a self-diagnosis. Either opens a door or gives you clean intel for the CRM.",
        "branches": [
          {
            "label": "Bad timing actually",
            "to": "reschedule"
          },
          {
            "label": "Not interested",
            "to": "last_ditch_split"
          },
          {
            "label": "What do you actually do?",
            "to": "quick_elevator"
          }
        ]
      },
      "last_ditch_split": {
        "label": "FIRM NO — EXIT CLEAN",
        "say": "Totally fair. I appreciate you being straight with me. If anything ever comes up on the inspection side, I'm easy to find — Sam Parks, RapidEye. Have a good one, Christian.",
        "note": "Don't push further. Leave the door open. Log in CRM with details on why they passed.",
        "branches": []
      },
      "quick_elevator": {
        "label": "QUICK ELEVATOR",
        "say": "Short version — we built an AI that looks at the photos your team's already taking during turnovers and move-in move-outs, and automatically catches damage, missing items, staging issues. No workflow change, just plugs into what you're already doing. Would it make sense to chat for a couple minutes, or should I just shoot you something by email?",
        "note": "Two sentences on the product max, then hand them the choice. Don't oversell here — they asked, so keep it tight.",
        "branches": [
          {
            "label": "Tell me more",
            "to": "discovery_process"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          },
          {
            "label": "Not for us",
            "to": "not_interested"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "So I was talking to another property manager on Maui who's in a pretty similar spot to you guys — managing a big portfolio, over a hundred units, doing some vacation rentals on top of the long-term stuff. And what he kept running into was this: every turnover generates a bunch of photos — cleaners take them, inspectors take them — but nobody actually has time to look through every single one. So things slip. A scratch on a countertop, a stain on a sofa, something that got moved and nobody caught it. And it doesn't surface until the next guest checks in or the owner asks about it. And at that point, good luck figuring out who's responsible. Does any of that sound familiar?",
        "note": "PAUSE after asking. Give Christian real space to react. The silence is where they sell themselves. Don't rush past it.",
        "branches": [
          {
            "label": "Yeah that's real for us",
            "to": "warm_response"
          },
          {
            "label": "We're mostly long-term, not STR",
            "to": "mostly_long_term"
          },
          {
            "label": "We have a process for that",
            "to": "have_process"
          },
          {
            "label": "Not really our problem",
            "to": "not_interested"
          }
        ]
      },
      "warm_response": {
        "label": "THEY FEEL THE PAIN",
        "say": "Yeah — that's exactly what I keep hearing. So just so I'm not making assumptions — what does your inspection process look like right now? When a unit turns over, are your people taking photos, or is it more informal?",
        "note": "They're warm. STOP pitching. Ask questions and genuinely listen. Let them describe the pain in their own words — you'll use their language later.",
        "branches": [
          {
            "label": "Describes their process",
            "to": "discovery_process"
          }
        ]
      },
      "discovery_process": {
        "label": "DISCOVERY — WHO REVIEWS",
        "say": "Got it. And when those photos come in — who's actually reviewing them? Is that something you handle, or does someone else on the team own that?",
        "note": "You're mapping the workflow and identifying the real decision-maker. Listen for names — especially Brandon or Matt.",
        "branches": [
          {
            "label": "I review them / we do it manually",
            "to": "discovery_deeper"
          },
          {
            "label": "Nobody really reviews them",
            "to": "discovery_no_review"
          },
          {
            "label": "Brandon handles that",
            "to": "referral_to_brandon"
          },
          {
            "label": "Matt handles the STR side",
            "to": "referral_to_matt"
          }
        ]
      },
      "discovery_deeper": {
        "label": "DISCOVERY — QUANTIFY THE PAIN",
        "say": "And at a hundred-plus units — how many photos are we talking coming in per week? Is it manageable or is it starting to pile up?",
        "note": "You're quantifying volume to build the ROI case. The bigger the number, the stronger your pitch. Listen for any frustration or sighing — that's your signal.",
        "branches": [
          {
            "label": "It's a lot / piling up",
            "to": "solution_and_cta"
          },
          {
            "label": "It's manageable honestly",
            "to": "bill_9_thread"
          },
          {
            "label": "Mentions regulation or Bill 9",
            "to": "bill_9_thread"
          }
        ]
      },
      "discovery_no_review": {
        "label": "PHOTOS EXIST BUT NOBODY REVIEWS",
        "say": "So the photos are getting taken but nobody's really going back through them unless something goes wrong. That's honestly super common. And that's exactly the gap we fill — the photos already exist, they just need a second set of eyes. We built an AI that reviews every photo as it comes in and flags anything that's off — damage, missing items, staging issues. Would you be open to seeing how it works? Doesn't take long.",
        "note": "Huge opportunity — they already have the data, they're just not using it. Frame the AI as the second set of eyes they're missing.",
        "branches": [
          {
            "label": "Sure show me",
            "to": "meeting_accept"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Not sure I'm the right person",
            "to": "referral_ask"
          }
        ]
      },
      "bill_9_thread": {
        "label": "BILL 9 / REGULATION ANGLE",
        "say": "That makes sense. And I gotta ask — with Bill 9 going through and all the uncertainty around vacation rental permits on Maui, are you guys thinking about that at all? I've been hearing from a few managers that having airtight inspection documentation is becoming way more important, especially with enforcement potentially tightening up.",
        "note": "Bill 9 phases out ~6,200 STRs by 2029 in West Maui and 2031 in South Maui. Even for a mostly long-term shop, this creates regulatory pressure on their selective vacation rental operations and could drive documentation rigor across the board.",
        "branches": [
          {
            "label": "Yeah it's on our radar",
            "to": "solution_and_cta"
          },
          {
            "label": "We're pulling back from STR",
            "to": "mostly_long_term"
          },
          {
            "label": "Not really affecting us",
            "to": "solution_and_cta"
          }
        ]
      },
      "mostly_long_term": {
        "label": "MOSTLY LONG-TERM PIVOT",
        "say": "That totally makes sense — I saw you guys are primarily long-term, managing over a hundred units. Honestly the AI works just as well for move-in move-out documentation — same concept, just catching condition changes between tenants so you've got airtight evidence for deposit disputes. But I also noticed you guys have the Hawaii Vacation Homes brand on the STR side — is Matt Buck still running those properties?",
        "note": "Don't fight the objection. Pivot to long-term relevance AND open the referral path to Matt Buck who runs the vacation rental brand. Two shots with one response.",
        "branches": [
          {
            "label": "Yeah Matt handles STR",
            "to": "referral_to_matt"
          },
          {
            "label": "Tell me more about move-in move-out",
            "to": "solution_and_cta"
          },
          {
            "label": "We don't really need that either",
            "to": "not_interested"
          }
        ]
      },
      "have_process": {
        "label": "THEY HAVE A PROCESS",
        "say": "That makes total sense — at a hundred-plus units you'd have to have something dialed in. I'm definitely not trying to mess with what's working. Just curious — are your people reviewing photos manually, or are you using any software on the inspection side?",
        "note": "Agree first. Then get curious about WHAT the process is. You're looking for gaps — manual review at scale is always the gap.",
        "branches": [
          {
            "label": "Manual review",
            "to": "process_gap"
          },
          {
            "label": "We use a tool or software",
            "to": "vendor_split"
          },
          {
            "label": "It's fine, not interested",
            "to": "not_interested"
          }
        ]
      },
      "process_gap": {
        "label": "MANUAL PROCESS — SCALE GAP",
        "say": "Got it — so the photos come in and someone on the team goes through them. That's exactly what most of our customers were doing before. The thing they kept hitting was that at scale — a hundred units, hundreds of photos a week — stuff just slips through. Not because anyone's doing a bad job, just because there's too many photos and not enough hours in the day. That's literally the only thing we solve. Would you be open to taking a look sometime when I'm not cold calling you out of the blue?",
        "note": "Validate their process first, then name the scale problem gently. Keep the CTA relaxed and low-pressure.",
        "branches": [
          {
            "label": "Sure let's take a look",
            "to": "meeting_accept"
          },
          {
            "label": "Not right now",
            "to": "sell_test_drive"
          },
          {
            "label": "Just send me something",
            "to": "send_email"
          }
        ]
      },
      "vendor_split": {
        "label": "THEY USE A TOOL — DIG IN",
        "say": "Oh nice — which platform? Just so I know what I'm working with.",
        "note": "If they name Breezeway, Track, or another PMS — RapidEye plugs right in. If it's something else, note it. Never trash their current tool.",
        "branches": [
          {
            "label": "Names a platform",
            "to": "solution_and_cta"
          },
          {
            "label": "Doesn't want to get into it",
            "to": "sell_test_drive"
          }
        ]
      },
      "not_interested": {
        "label": "NOT INTERESTED — AGREE AND SPLIT",
        "say": "I totally get it — I should've assumed you'd be all set. Otherwise you probably would've been looking for something like this already. Just so no one from my team cold calls you again — is it that the inspection side just isn't a priority right now, or is it more that you hate cold calls? Honestly I'd totally get either one.",
        "note": "Agree fully then split the objection with a multiple choice. The humor disarms them and either answer gives you information to work with.",
        "branches": [
          {
            "label": "Not a priority right now",
            "to": "sell_test_drive"
          },
          {
            "label": "I hate cold calls / just email me",
            "to": "send_email"
          },
          {
            "label": "Just not interested at all",
            "to": "referral_ask"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally hear you — and you're probably not buying anything from a cold call today, I completely get that. But the people who end up using us are usually the ones who saw it before they actually needed it. Would you be open to a fifteen-minute look — not a commitment at all — just so it's on your radar? If nothing else I can show you what some other Maui property managers are doing with their turnover photos. Worst case you steal some ideas and we part as friends.",
        "note": "Low pressure. 'Worst case you steal some ideas' is the value offer — they get something even if they never buy. Smile and mean it.",
        "branches": [
          {
            "label": "OK sure let's do it",
            "to": "meeting_accept"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "referral_ask"
          }
        ]
      },
      "solution_and_cta": {
        "label": "SOLUTION AND CTA",
        "say": "So here's the short version — we built an AI that plugs into the photos your team's already taking. It automatically reviews every image and flags damage, missing items, furniture that's moved, staging issues — generates a report without anyone doing anything different. We're already doing this for property managers in New York, the East Coast, and Dubai. Would you be open to taking a look sometime this week or next?",
        "note": "One sentence on the product. One sentence on social proof. Then CTA with a specific time window. Don't add anything else — less is more here.",
        "branches": [
          {
            "label": "Yeah let's set something up",
            "to": "meeting_accept"
          },
          {
            "label": "Send me an email first",
            "to": "send_email"
          },
          {
            "label": "No budget for this",
            "to": "no_budget"
          },
          {
            "label": "Not the right time",
            "to": "sell_test_drive"
          }
        ]
      },
      "meeting_accept": {
        "label": "BOOK THE MEETING",
        "say": "Awesome — I've got next week pulled up. How does Tuesday or Wednesday look for you? I'm flexible on time, whatever's easiest on your end.",
        "note": "Pick specific days. Lock it NOW. Don't leave it open-ended or say 'I'll send you some times.'",
        "branches": [
          {
            "label": "Gives a day or time",
            "to": "lock_meeting"
          },
          {
            "label": "Let me check and get back to you",
            "to": "lock_meeting_push"
          }
        ]
      },
      "lock_meeting": {
        "label": "CONFIRM AND SEND INVITE",
        "say": "Perfect — I'll send you a calendar invite right now so it doesn't slip through the cracks. Should I send it to the Hawaii Equity Management Gmail, or is there a better email for you?",
        "note": "His primary email is HawaiiEquityManagement@gmail.com. Send the invite WHILE on the phone — don't hang up until it's sent and confirmed.",
        "branches": [
          {
            "label": "Confirms email or gives one",
            "to": "meeting_confirmed"
          }
        ]
      },
      "lock_meeting_push": {
        "label": "PUSH FOR TENTATIVE HOLD",
        "say": "Totally get it — how about I just throw something on the calendar for Wednesday afternoon, and if you need to move it you just let me know? That way it's there and neither of us has to remember to follow up.",
        "note": "Anchor a specific time so they just have to say yes. Make it easier to accept than to create an open loop.",
        "branches": [
          {
            "label": "OK that works",
            "to": "meeting_confirmed"
          },
          {
            "label": "Just email me",
            "to": "send_email"
          }
        ]
      },
      "meeting_confirmed": {
        "label": "MEETING LOCKED — WRAP UP",
        "say": "Done — you'll see that come through in a sec. Really appreciate you taking my call, Christian. I'll keep it short and useful, I promise. Talk to you then.",
        "note": "STOP SELLING. Thank them and get off the phone. Don't add anything that could create doubt or buyer's remorse.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair — I'll shoot you something. One quick question so it's not just another generic pitch in your inbox — would it be more useful to see the AI in action, or would you rather see what other property managers in your market are doing with their inspection workflows?",
        "note": "This question makes the email 10x more relevant and subtly re-engages them in the conversation.",
        "branches": [
          {
            "label": "Tells you a preference",
            "to": "email_tailor"
          },
          {
            "label": "Just send whatever",
            "to": "email_tailor"
          }
        ]
      },
      "email_tailor": {
        "label": "CLOSE THE EMAIL THREAD",
        "say": "Got it — I'll put that together and get it over to you today. I'll include a couple times to connect in case you want to chat after you look it over. Appreciate your time, Christian.",
        "note": "Send to HawaiiEquityManagement@gmail.com. Include two specific meeting time options in the email. Follow up in 3 business days if no response.",
        "branches": []
      },
      "no_budget": {
        "label": "NO BUDGET — AGREE AND SPLIT",
        "say": "Totally get it — nowadays it's hard enough to keep the tools you've got, let alone bring on something new. Just so I'm not wasting your time — is it that budget for this kind of thing is completely locked down, or is it more that anything new has to go through a bunch of approval hoops?",
        "note": "Agree completely then split. You're finding out if it's a real constraint or a process issue — and whether Brandon Holmes is the budget gatekeeper.",
        "branches": [
          {
            "label": "Budget is locked down",
            "to": "sell_test_drive"
          },
          {
            "label": "Has to go through Brandon or approval",
            "to": "referral_to_brandon"
          },
          {
            "label": "It's just tight right now",
            "to": "sell_test_drive"
          }
        ]
      },
      "referral_to_brandon": {
        "label": "REFERRAL — BRANDON HOLMES",
        "say": "That makes total sense. Would it make sense for me to reach out to Brandon directly on this? I don't want to put you in a weird spot — I'd just mention we talked and that he might want to take a look.",
        "note": "Brandon Holmes is the BIC/Owner and ultimate decision-maker. Direct: (805) 835-2844. Email: mauihomesbyholmes@gmail.com. Get Christian's blessing before calling — it turns a cold call into a warm one.",
        "branches": [
          {
            "label": "Yeah reach out to Brandon",
            "to": "end_with_brandon_referral"
          },
          {
            "label": "Let me talk to him first",
            "to": "end_with_internal_referral"
          },
          {
            "label": "I can handle it myself",
            "to": "sell_test_drive"
          }
        ]
      },
      "end_with_brandon_referral": {
        "label": "BRANDON REFERRAL LOCKED",
        "say": "Perfect — I really appreciate that. I'll give him a ring and mention we talked. And if it turns out to be a fit, maybe we can all jump on together. Thanks for your time, Christian — enjoy the waves out there.",
        "note": "Call Brandon Holmes next at (805) 835-2844. Open with: Christian and I were just talking and he suggested I reach out. This is now a warm call. Log the referral chain.",
        "branches": []
      },
      "referral_to_matt": {
        "label": "REFERRAL — MATT BUCK",
        "say": "That makes sense — would it be cool if I reached out to Matt and mentioned your name? He's probably the better person to talk to about the vacation rental inspection side anyway.",
        "note": "Matt Buck runs Hawaii Vacation Homes, the STR brand. Direct: (808) 793-5372. Email: matt@hawaiivacationhomes.com. Christian's name as a warm intro is gold.",
        "branches": [
          {
            "label": "Yeah talk to Matt",
            "to": "end_with_matt_referral"
          },
          {
            "label": "I'll pass your info to him",
            "to": "end_with_internal_referral"
          }
        ]
      },
      "end_with_matt_referral": {
        "label": "MATT REFERRAL LOCKED",
        "say": "Awesome — I'll reach out to Matt and let him know we connected. Thanks for pointing me in the right direction, Christian. Appreciate your time.",
        "note": "Call Matt Buck at (808) 793-5372. Open with: Christian suggested I reach out to you about the vacation rental side. Log the referral. This is now warm.",
        "branches": []
      },
      "end_with_internal_referral": {
        "label": "INTERNAL REFERRAL — SEND SUMMARY",
        "say": "That'd be great — I'll shoot you a quick email with a summary you can forward along. Way easier than trying to remember what some random cold caller said. Sound good?",
        "note": "Send a concise forwardable email to HawaiiEquityManagement@gmail.com. Keep it short — Christian needs to want to forward it. Follow up in 3-4 days.",
        "branches": []
      },
      "referral_ask": {
        "label": "ASK FOR REFERRAL",
        "say": "Totally fair — I appreciate you being straight with me. One last question — who on your team would typically own anything related to turnover operations or inspection workflows? I'd rather reach out to the right person than keep bugging you.",
        "note": "Most likely answers: Brandon Holmes (owner), Matt Buck (STR), or an ops team member like Jordan Parker. Get a name and ideally a direct number or email.",
        "branches": [
          {
            "label": "Mentions Brandon",
            "to": "referral_to_brandon"
          },
          {
            "label": "Mentions Matt",
            "to": "referral_to_matt"
          },
          {
            "label": "Gives another name",
            "to": "end_with_referral_name"
          },
          {
            "label": "Nobody / don't know",
            "to": "end_graceful"
          }
        ]
      },
      "end_with_referral_name": {
        "label": "GOT A NEW NAME",
        "say": "Perfect — and what's their best number or email? I'll put something tailored together so it actually lands. Really appreciate your help, Christian.",
        "note": "Get full name, title, and contact info. Note Christian as the referral source in CRM. This is now a warm outreach.",
        "branches": []
      },
      "end_graceful": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything ever changes on the inspection side, I'm easy to find — Sam Parks, RapidEye. Appreciate your time, Christian. Enjoy Maui.",
        "note": "Don't burn the bridge. Log in CRM with full notes on why they passed. Set a 90-day follow-up reminder.",
        "branches": []
      }
    }
  }
}