{
  "name": "Christopher Reap",
  "title": "Co-Owner / Local Franchise Owner",
  "company": "iTrip Telluride",
  "location": "Telluride, CO",
  "phone": "+1-970-708-7551",
  "company_phone": "855-244-9435",
  "alt_phones": [],
  "flow": {
    "context": "Calling Chris Reap, co-owner of iTrip Telluride — a vacation rental PM franchise covering Telluride and Mountain Village, CO. Also co-owns One Door Property Management with Holly Svendsen. Former career chef with 30 years in hospitality, 15+ years doing PM in Telluride specifically. Small owner-operator shop with no confirmed inspection or ops platform — they market a 'best-in-class software platform' but never name it. Telluride is a high-value luxury ski market where a single property can rent for thousands a night, and peak-season turnovers are relentless. Strongest connection: Sam just skied Jackson Hole in January — Telluride is a peer ski destination and Chris lives the mountain lifestyle daily.",
    "start": "confirm_chris",
    "nodes": {
      "confirm_chris": {
        "label": "CONFIRM IT'S CHRIS",
        "say": "Hey, is this Chris?",
        "note": "Quick confirm before launching the opener. Keep it casual — like you're expecting him to answer.",
        "branches": [
          {
            "label": "Yes / Speaking",
            "to": "opener"
          },
          {
            "label": "No / Someone else answers",
            "to": "gatekeeper"
          },
          {
            "label": "Who's calling?",
            "to": "opener"
          }
        ]
      },
      "opener": {
        "label": "THE OPENER",
        "say": "Hey Chris — this might be a little random, but I was actually just out in Jackson Hole skiing last month and I've been dying to get out to Telluride. I work with a few vacation rental managers in ski markets — it's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Sound like a peer, not a salesperson. Feet up on the desk energy. The skiing connection is real — you were in Jackson Hole in January. Let him react naturally. Don't rush past the ski comment if he bites on it.",
        "branches": [
          {
            "label": "No, I haven't heard of you",
            "to": "heard_name_no"
          },
          {
            "label": "Yeah / Maybe / Sounds familiar",
            "to": "heard_name_yes"
          },
          {
            "label": "I'm busy / Not a good time",
            "to": "bad_timing"
          },
          {
            "label": "What's this about? / Guarded",
            "to": "permission_fallback"
          }
        ]
      },
      "heard_name_no": {
        "label": "HASN'T HEARD OF YOU — PAIN TRIGGER",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call — I work with another property manager in a ski market, pretty similar setup to you guys. And the thing that kept biting him was peak season turnovers. His cleaners were taking photos, doing their thing, but nobody actually had time to go through every single one before the next guest walked in. A guest checks in, finds a scratched-up hardwood floor or a cracked hot tub cover, and now he's eating that repair because he can't prove which guest did it. In a market like Telluride where a single property's renting for two, three grand a night — that adds up fast. And then the owner's calling asking what happened.",
        "note": "PAUSE here. Let the pain land. Do not rush to the solution. Chris is an owner-operator who takes those owner phone calls himself — this should hit close to home. He also came from a hospitality background, so quality and guest experience are personal to him.",
        "branches": [
          {
            "label": "Yeah, that's definitely a problem / Engaged",
            "to": "warm_response"
          },
          {
            "label": "We've got that handled / We have a process",
            "to": "objection_have_process"
          },
          {
            "label": "I'm not really interested",
            "to": "objection_not_interested"
          },
          {
            "label": "What are you selling? / So what do you do?",
            "to": "one_sentence_solution"
          }
        ]
      },
      "heard_name_yes": {
        "label": "HAS HEARD OF YOU",
        "say": "Oh no kidding — well normally we'd be working with someone like you. What'd you hear?",
        "note": "Rare path but powerful. Let him talk. He may be confusing you with someone else — that's fine, just roll with it and steer the conversation naturally.",
        "branches": [
          {
            "label": "Tells you what they heard",
            "to": "warm_response"
          },
          {
            "label": "I don't remember exactly",
            "to": "pain_trigger_short"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again later this week? Maybe Thursday or Friday morning?",
        "note": "Don't push. Lock in a specific callback time. If he gives you a window, treat it like a booked meeting. Chris's hours are Mon-Fri 9-5:30 and weekends 8-3 so morning slots should work.",
        "branches": [
          {
            "label": "Sure, try me Thursday / Gives a time",
            "to": "bad_timing_locked"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          },
          {
            "label": "Not interested / Don't call back",
            "to": "end_graceful"
          }
        ]
      },
      "bad_timing_locked": {
        "label": "CALLBACK LOCKED",
        "say": "Perfect — I'll try you Thursday morning. Really appreciate it, Chris. Talk soon.",
        "note": "Write down the exact callback time immediately. Set a reminder. When you call back, open with: Hey Chris, Sam Parks — you told me to try you back today.",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call, I'll be honest with you. Can I get 30 seconds to tell you why I reached out? And you can totally hang up on me if it's not a fit.",
        "note": "Honesty disarms. Most people respect the transparency and give you the 30 seconds. Keep your voice relaxed — you're not begging.",
        "branches": [
          {
            "label": "Alright, go ahead / Sure",
            "to": "pain_trigger_short"
          },
          {
            "label": "No, I'm not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it more that you already know what we do and it's just not interesting?",
        "note": "This split forces a real answer. 'Horrible time' reopens the door for a callback. 'Not interesting' lets you gracefully exit or pivot.",
        "branches": [
          {
            "label": "It's just bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / Don't call me",
            "to": "end_graceful"
          },
          {
            "label": "What do you guys do exactly?",
            "to": "pain_trigger_short"
          }
        ]
      },
      "pain_trigger_short": {
        "label": "PAIN TRIGGER — 30 SECOND VERSION",
        "say": "Real quick — I work with property managers in vacation rental markets, and the thing we keep hearing is that cleaners are taking photos during turnovers, but nobody's actually reviewing them in time to catch issues before the next guest walks in. In a market like Telluride with high-value properties, a missed damage or a staging issue can turn into a bad review or an owner phone call real fast. We built a tool that automatically analyzes those turnover photos and flags problems — no workflow change. Would you be open to taking a look when I'm not cold calling you out of the blue?",
        "note": "This is the compressed version — pain plus solution plus CTA in 30 seconds. You promised 30 seconds, so deliver. Pause after the CTA and let him respond.",
        "branches": [
          {
            "label": "Sure, that could be interesting",
            "to": "book_meeting"
          },
          {
            "label": "How does that actually work?",
            "to": "warm_response"
          },
          {
            "label": "We've got something for that already",
            "to": "objection_have_process"
          },
          {
            "label": "Not really a priority right now",
            "to": "objection_not_interested"
          }
        ]
      },
      "warm_response": {
        "label": "THEY'RE WARM — STOP PITCHING",
        "say": "Yeah — honestly that's what we keep hearing. I'm curious though, what does your turnover process look like right now? Like when a cleaner finishes a unit, are they taking photos, running through a checklist, or is it more of a visual walkthrough?",
        "note": "STOP SELLING. He's engaged — now ask questions and listen. Chris is hands-on and has been doing this 15-plus years. Let him talk about his process. He'll tell you where the gaps are himself.",
        "branches": [
          {
            "label": "Describes their process / Cleaners take photos",
            "to": "discovery_deeper"
          },
          {
            "label": "We use checklists / Have a system in place",
            "to": "discovery_system"
          },
          {
            "label": "It's honestly pretty manual",
            "to": "discovery_manual"
          }
        ]
      },
      "discovery_deeper": {
        "label": "DIG INTO THE PAIN",
        "say": "Got it. And when those photos come in — who's actually reviewing them? Is that you, is Holly looking at those, or does someone on the team handle it before the next guest checks in?",
        "note": "You're finding out who owns the inspection workflow and whether photos are actually being used or just collected. Chris and Holly are the only known decision-makers — no named ops staff. This question also surfaces whether Holly should be in the conversation.",
        "branches": [
          {
            "label": "I review them / We both do",
            "to": "discovery_volume"
          },
          {
            "label": "Holly handles more of that side",
            "to": "referral_holly"
          },
          {
            "label": "Honestly nobody reviews them consistently",
            "to": "discovery_gap_confirmed"
          }
        ]
      },
      "discovery_system": {
        "label": "THEY HAVE A SYSTEM",
        "say": "That's great — you're ahead of most people I talk to. Out of curiosity, are you using something like Breezeway for that, or is it more of an internal system you guys built out?",
        "note": "Research shows no confirmed ops platform. If he names a tool, note it — tells you whether this is a replacement sale or greenfield. If it's internal or manual, there's your opening.",
        "branches": [
          {
            "label": "We use Breezeway / Names a specific tool",
            "to": "discovery_tool_satisfaction"
          },
          {
            "label": "It's more internal / Spreadsheets / Homegrown",
            "to": "discovery_gap_confirmed"
          },
          {
            "label": "We use whatever iTrip provides",
            "to": "discovery_tool_satisfaction"
          }
        ]
      },
      "discovery_manual": {
        "label": "MANUAL PROCESS — PAIN IS REAL",
        "say": "Yeah, that's super common — especially with a smaller team in a market like Telluride where you're handling everything from the owner relationship to the guest experience yourself. How many units are you guys managing right now between iTrip and One Door?",
        "note": "Unit count was never published — this is critical intel. Mentioning One Door shows you've done your homework. A franchise operator in Telluride is likely in the 20-80 unit range. Don't make it sound like surveillance — say it naturally.",
        "branches": [
          {
            "label": "Gives a number",
            "to": "discovery_gap_confirmed"
          },
          {
            "label": "Why do you ask? / How do you know about One Door?",
            "to": "discovery_gap_confirmed"
          }
        ]
      },
      "discovery_tool_satisfaction": {
        "label": "PROBE TOOL SATISFACTION",
        "say": "Makes sense. And are you pretty happy with how that's catching things? Like, does it actually flag damage or staging issues from the photos, or is it more of a checklist-completion tool — confirming tasks got done?",
        "note": "Most ops tools confirm tasks were done but don't analyze what's actually in the photos. That's the gap RapidEye fills. Let him realize the difference himself.",
        "branches": [
          {
            "label": "It works fine / We're happy with it",
            "to": "objection_have_process"
          },
          {
            "label": "It's more of a checklist thing / Doesn't catch everything",
            "to": "discovery_gap_confirmed"
          },
          {
            "label": "We've had some stuff slip through",
            "to": "discovery_gap_confirmed"
          }
        ]
      },
      "discovery_volume": {
        "label": "VOLUME AND SEASONAL PRESSURE",
        "say": "Got it. And during peak season — like right now in ski season — how many turnovers are you guys flipping in a week? And is that when stuff tends to slip through, or is it pretty consistent year-round?",
        "note": "Telluride ski season is peak revenue time. If he's in the middle of it right now, the pain is fresh and immediate, not theoretical. This makes the conversation about right now, not some future maybe.",
        "branches": [
          {
            "label": "Describes volume / Peak season is hectic",
            "to": "discovery_gap_confirmed"
          },
          {
            "label": "We manage it pretty well actually",
            "to": "discovery_gap_confirmed"
          }
        ]
      },
      "discovery_gap_confirmed": {
        "label": "GAP CONFIRMED — BRIDGE TO SOLUTION",
        "say": "Yeah, and that's exactly what we keep running into with other managers. The photos are there — the data exists — but nobody has time to actually look at every single one and compare it to what the property's supposed to look like. We built something that does that automatically. It plugs into whatever you're already using, analyzes the photos your team's already taking, and flags anything that looks off — damage, missing items, staging problems — before the next guest shows up. No workflow change on your end.",
        "note": "Keep it tight. One breath. Then go straight to the CTA. Don't over-explain the tech. Don't mention AI unless he asks.",
        "branches": [
          {
            "label": "That's interesting / Tell me more",
            "to": "soft_cta"
          },
          {
            "label": "What does that cost?",
            "to": "soft_cta"
          },
          {
            "label": "I'd need to think about it",
            "to": "sell_test_drive"
          },
          {
            "label": "I'm not sure we need that",
            "to": "objection_not_interested"
          }
        ]
      },
      "one_sentence_solution": {
        "label": "QUICK PITCH — THEY ASKED",
        "say": "Yeah — so we built a tool that analyzes the turnover photos your cleaners are already taking and automatically flags damage, missing items, staging issues — before the next guest checks in. No workflow change, it just plugs into whatever system you're using. The idea is you catch stuff before it turns into a bad review or an owner phone call you don't want to have.",
        "note": "He asked, so give him a real answer. But don't ramble — land it and get to the CTA or a question.",
        "branches": [
          {
            "label": "That's cool / Sounds interesting",
            "to": "soft_cta"
          },
          {
            "label": "How does it actually work?",
            "to": "warm_response"
          },
          {
            "label": "We don't really have that problem",
            "to": "objection_not_interested"
          }
        ]
      },
      "soft_cta": {
        "label": "ASK FOR THE MEETING",
        "say": "Would you be open to taking a quick look? I could walk you through what a couple other managers in ski markets are doing with their turnover photos — worst case you steal some ideas and we part as friends. I've got next week pulled up — how does Tuesday or Wednesday afternoon look?",
        "note": "Offer specific days. Don't say 'sometime next week.' Pin it down. If he says he needs Holly involved, that's a great sign — roll with it.",
        "branches": [
          {
            "label": "Sure, let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Send me an email first",
            "to": "send_email"
          },
          {
            "label": "I'd want Holly in on that too",
            "to": "book_meeting_with_holly"
          },
          {
            "label": "I'm not sure / Let me think about it",
            "to": "sell_test_drive"
          },
          {
            "label": "No budget right now",
            "to": "objection_no_budget"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. How's Wednesday at 2 your time? I'll shoot you over a calendar invite — what's the best email? Is it chris at 1door dot net or do you prefer the iTrip one?",
        "note": "You know his emails: chris@1door.net and telluride@itrip.net. Offering a choice shows you've done homework without being creepy. Send the invite WHILE on the phone. Once booked, STOP SELLING.",
        "branches": [
          {
            "label": "Confirms email and time",
            "to": "end_booked"
          },
          {
            "label": "That time doesn't work / Suggests another",
            "to": "end_booked"
          }
        ]
      },
      "book_meeting_with_holly": {
        "label": "INCLUDE HOLLY",
        "say": "Yeah absolutely — that makes total sense, especially since you two are running this together. Does her schedule line up with yours, or should I reach out to Holly separately to find a time that works for both of you?",
        "note": "Great sign — he wants his co-owner involved, which means he's taking it seriously. Holly's email is holly@1door.net. Offer to coordinate so it doesn't stall.",
        "branches": [
          {
            "label": "Let me check with her and get back to you",
            "to": "book_meeting"
          },
          {
            "label": "Just reach out to her directly",
            "to": "referral_holly_warm"
          }
        ]
      },
      "referral_holly_warm": {
        "label": "WARM REFERRAL TO HOLLY",
        "say": "Perfect — I'll reach out to Holly and mention we chatted. Is holly at 1door dot net the best way to get her? And would you mind giving her a heads up that I'll be reaching out so she's expecting it?",
        "note": "This is a warm referral, not a cold pivot. Chris is giving you permission. Get the intro confirmed and lock it down. If he offers to just set something up for all three, even better.",
        "branches": [
          {
            "label": "Yes, I'll give her a heads up",
            "to": "end_booked"
          },
          {
            "label": "Let me just set something up for all of us",
            "to": "book_meeting"
          }
        ]
      },
      "referral_holly": {
        "label": "CHRIS DEFERS TO HOLLY",
        "say": "Got it — Holly handles more of that day-to-day. Would you mind if I reached out to her directly? And would it help if I mentioned we spoke, or would it be better coming from you?",
        "note": "Chris might defer ops decisions to Holly. That's fine — getting a warm referral from the co-owner is gold. Don't make him feel like you're going around him. You're respecting the structure.",
        "branches": [
          {
            "label": "Sure, mention my name / I'll let her know",
            "to": "referral_holly_warm"
          },
          {
            "label": "Just call the office and ask for her",
            "to": "referral_holly_warm"
          },
          {
            "label": "We'd both need to be involved honestly",
            "to": "book_meeting_with_holly"
          }
        ]
      },
      "objection_not_interested": {
        "label": "NOT INTERESTED",
        "say": "I totally get it — honestly I should've assumed you'd be all set. Otherwise you probably would've reached out to us. Just so nobody from my team cold calls you again — is it that this isn't really a problem you're focused on right now, or is it more that you just hate cold calls?",
        "note": "Agree first — surprise him by not pushing back. Then split the objection. 'Hate cold calls' gives you room to offer value a different way. 'Not a problem' lets you probe whether it genuinely isn't or they just haven't quantified it yet.",
        "branches": [
          {
            "label": "It's not a priority right now",
            "to": "sell_test_drive"
          },
          {
            "label": "I just don't like cold calls",
            "to": "sell_test_drive"
          },
          {
            "label": "We really don't have that problem",
            "to": "sell_test_drive_light"
          },
          {
            "label": "Just not interested, period",
            "to": "end_graceful"
          }
        ]
      },
      "objection_have_process": {
        "label": "ALREADY HAVE A PROCESS",
        "say": "That totally makes sense — with your experience in this market you'd have to have something dialed in by now. Is it that you've got a tool handling that and you're happy with it, or is it more that switching anything right now would just be a headache?",
        "note": "Chris has been doing this 15-plus years. Respect his experience — don't imply he's doing it wrong. The split reveals whether this is a satisfaction objection or a timing objection. Two very different paths.",
        "branches": [
          {
            "label": "We've got something and it works",
            "to": "sell_test_drive_light"
          },
          {
            "label": "It's more of a switching headache / Bad timing",
            "to": "sell_test_drive"
          },
          {
            "label": "What would make you guys different?",
            "to": "discovery_gap_confirmed"
          }
        ]
      },
      "objection_no_budget": {
        "label": "NO BUDGET",
        "say": "Totally get it. Nowadays it's harder to keep a tool than to buy something new — especially running a franchise where every dollar counts. Is it that budget for this cycle is completely locked, or is it more that anything you try to buy right now puts you through the ringer?",
        "note": "Franchise operators often have tight margins and may need to justify new purchases carefully. Splitting the objection reveals whether it's a real financial constraint or a process and approval issue.",
        "branches": [
          {
            "label": "Budget is locked / Can't spend right now",
            "to": "sell_test_drive"
          },
          {
            "label": "It's more the hassle of adding something new",
            "to": "sell_test_drive"
          },
          {
            "label": "What does it actually cost?",
            "to": "soft_cta"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally respect that. You're probably not buying anything off a cold call — and I wouldn't expect you to. But the managers I talk to who end up pulling the trigger are the ones who already had it on their radar before they actually needed it. Would you be open to just taking a look — not for today, but so you know what's out there? If nothing else I could walk you through what other PM companies in mountain markets are doing with their turnover workflows. Worst case you steal some ideas and we part as friends.",
        "note": "You're not asking him to buy. You're asking him to be informed. The meeting has value even if he never becomes a customer. That's the pitch. Keep your tone easy — no pressure.",
        "branches": [
          {
            "label": "Alright, sure",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "end_graceful"
          }
        ]
      },
      "sell_test_drive_light": {
        "label": "LIGHT CLOSE — THEY'RE COVERED",
        "say": "Totally fair. If nothing else, I'd love to just keep you in the loop. We're working with a few companies in mountain markets and learning a lot about what's working on the ops side. Would it be cool if I sent you a quick note with some of that? No strings — just figured it'd be relevant given what you're doing out there.",
        "note": "They're genuinely covered or uninterested. Don't push hard. An email follow-up keeps the door open without burning the relationship. This person may come back in 6 months when something changes.",
        "branches": [
          {
            "label": "Sure, send it over",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "end_graceful"
          }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair — I'll send you something. One quick question before I do so it's not just another generic pitch sitting in your inbox: would it be more useful to see what this actually looks like for a property like yours, or more of a quick overview of how other managers in ski markets are handling turnover inspections?",
        "note": "Ask what to include so the email actually gets read. This also keeps him engaged for 10 more seconds and builds a micro-commitment to actually opening the email.",
        "branches": [
          {
            "label": "Tells you what they'd want to see",
            "to": "send_email_confirm"
          },
          {
            "label": "Either is fine / Doesn't matter",
            "to": "send_email_confirm"
          }
        ]
      },
      "send_email_confirm": {
        "label": "CONFIRM EMAIL AND CLOSE",
        "say": "Perfect — I'll put that together. What's the best email for you? And I'll throw a couple times in there in case you want to hop on for 15 minutes after you take a look.",
        "note": "Get the email address confirmed. You know chris@1door.net and telluride@itrip.net — if he doesn't offer one, suggest chris at 1door. Follow up within 24 hours. Include a specific day and time suggestion in the email.",
        "branches": [
          {
            "label": "Gives email address",
            "to": "end_email_sent"
          },
          {
            "label": "Just use the iTrip email",
            "to": "end_email_sent"
          }
        ]
      },
      "gatekeeper": {
        "label": "GATEKEEPER",
        "say": "Hey — could you get me through to Chris? It's Sam.",
        "note": "Don't pitch. Don't explain. Dose information one bit at a time. Sound like you know Chris and expect to be put through. Keep it short and casual.",
        "branches": [
          {
            "label": "Who's calling? / What's this about?",
            "to": "gatekeeper_context"
          },
          {
            "label": "He's not available right now",
            "to": "gatekeeper_not_available"
          },
          {
            "label": "Putting you through / Hold on",
            "to": "opener"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — MORE CONTEXT",
        "say": "Yeah, I work with a few vacation rental managers in the Telluride area. Would you mind letting him know it's Sam Parks?",
        "note": "Still no pitch. Just enough context to sound legitimate. If this is Holly, even better — adjust and talk to her directly. The office is small so it's likely Holly or a part-time admin.",
        "branches": [
          {
            "label": "Let me see if he's available",
            "to": "opener"
          },
          {
            "label": "What company are you with?",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "He's not in / Can I take a message?",
            "to": "gatekeeper_not_available"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "Sam Parks with RapidEye — we help a couple other property management companies with their inspection workflows. I sent him a note and just wanted to follow up. Would you mind giving him a heads up?",
        "note": "Third dose of info. This is your last push with the gatekeeper. If they still block, take the message gracefully. Don't argue. If it turns out to be Holly, pivot — she's a decision-maker too.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Take a message / He'll call you back",
            "to": "gatekeeper_not_available"
          }
        ]
      },
      "gatekeeper_not_available": {
        "label": "GATEKEEPER — NOT AVAILABLE",
        "say": "No worries at all. When's the best time to try him back? And is this the best number to reach him on?",
        "note": "Get a specific callback window and confirm the number. You have multiple numbers: mobile (970) 432-8611, One Door (970) 708-7551, local office (970) 514-0496. Try a different number next attempt if this one didn't work.",
        "branches": [
          {
            "label": "Gives a time or best number",
            "to": "end_graceful"
          },
          {
            "label": "Just email him",
            "to": "end_graceful"
          }
        ]
      },
      "end_booked": {
        "label": "MEETING BOOKED — STOP SELLING",
        "say": "Awesome — I'll get that invite out right now. Really appreciate you taking my call, Chris. Looking forward to it. And seriously — if you ever need Jackson Hole recommendations, I got you.",
        "note": "Meeting is booked. STOP SELLING. End on the personal skiing note to keep it warm. Send the calendar invite immediately while hanging up. Add Holly to the invite if he mentioned her.",
        "branches": []
      },
      "end_email_sent": {
        "label": "EMAIL FOLLOW-UP CONFIRMED",
        "say": "Perfect — I'll get that over to you today. Appreciate your time, Chris. Enjoy the rest of ski season out there.",
        "note": "Send the email within the hour. Personalize it — mention the skiing connection, reference anything he told you about his process. Include a specific day and time for a follow-up call. Subject line should feel personal, not templated.",
        "branches": []
      },
      "end_graceful": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes, I'm easy to find. Appreciate your time, Chris — and enjoy the rest of ski season out there.",
        "note": "Don't burn the bridge. The skiing sign-off keeps it warm and human. Log this call with notes on what he said. He may come back in 6 months when a damage dispute hits or peak season gets hectic.",
        "branches": []
      }
    }
  }
}