{
  "name": "Collins Atkinson",
  "title": "Director of Property Management",
  "company": "Island Realty",
  "location": "Charleston, SC",
  "phone": "+1-843-242-1076",
  "company_phone": "800-707-6421",
  "alt_phones": [
    "+1-843-886-8144",
    "+1-844-347-5483"
  ],
  "flow": {
    "context": "Collins Atkinson is Director of Property Management at Island Realty — the single person accountable for property condition standards across 300+ vacation rentals on Isle of Palms, Wild Dunes, and Sullivan's Island. Hired in 2016 originally as a business development manager, native South Carolinian, studied accounting and business management at Southern Wesleyan. Island Realty is family-owned by the Stone family for 40+ years, runs in-house housekeeping (Isle Clean It) and maintenance (Isle Fix It), uses Escapia for PMS — no known inspection or photo verification platform. They are pushing shoulder-season promos right now and heading into peak summer. No direct personal tie to Sam — lead with Charleston coastal vacation rental market proximity. If conversation goes casual, Sam's surfing and fishing background is natural rapport for this barrier island market.",
    "start": "initial_contact",
    "nodes": {
      "initial_contact": {
        "label": "FIRST WORDS",
        "say": "Hey, is this Collins?",
        "note": "Direct number. If he picks up, move straight to opener. Keep it casual and confident.",
        "branches": [
          {
            "label": "Yes, this is Collins",
            "to": "opener"
          },
          {
            "label": "No / someone else answers",
            "to": "gatekeeper_initial"
          },
          {
            "label": "Voicemail",
            "to": "voicemail"
          }
        ]
      },
      "gatekeeper_initial": {
        "label": "GATEKEEPER — SLIDE BY",
        "say": "Oh hey — could you get me through to Collins? It's Sam.",
        "note": "First name only. Sound like you know him. Don't explain anything yet.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Who's calling / what's this about?",
            "to": "gatekeeper_context"
          },
          {
            "label": "He's not available",
            "to": "voicemail"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — CONTEXT",
        "say": "Yeah, I work with a few other vacation rental managers around the Charleston beaches. Would you mind letting Collins know it's Sam Parks?",
        "note": "Just enough to sound credible. End with a redirect question. Don't pitch.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "More pushback / what exactly is this?",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "He's not taking calls / refused",
            "to": "gatekeeper_blocked"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "Totally understand. We help a couple property management companies with their inspection workflows — I actually sent Collins a note. Would you mind just giving him a heads up?",
        "note": "Last attempt. If this fails, ask for best callback time or confirm his email.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Refused / take a message",
            "to": "gatekeeper_blocked"
          }
        ]
      },
      "gatekeeper_blocked": {
        "label": "GATEKEEPER — BLOCKED",
        "say": "No worries at all. Is there a better time to catch Collins directly? Or would it be easier if I just emailed him?",
        "note": "Capture a callback window or confirm email. Don't burn the gatekeeper relationship — you may need them next time.",
        "branches": []
      },
      "voicemail": {
        "label": "VOICEMAIL",
        "say": "Hey Collins, it's Sam Parks. I work with a few vacation rental companies around the Charleston beaches on their inspection workflows — wanted to run something by you real quick. My number is [your number]. Again, it's Sam Parks with RapidEye. Talk soon.",
        "note": "Under 20 seconds. Mention the market, not the product. Sound like a peer leaving a quick message, not a salesperson reading a script.",
        "branches": []
      },
      "opener": {
        "label": "OPENER",
        "say": "Hey Collins — I've been working with a few vacation rental companies around the Charleston beaches. It's Sam Parks with RapidEye. Have you heard my name tossed around?",
        "note": "Relaxed, curious tone. Slow down. Let the question hang after you ask it. Feet up on the desk energy.",
        "branches": [
          {
            "label": "Yes / I think so / maybe",
            "to": "heard_name_yes"
          },
          {
            "label": "No / doesn't ring a bell",
            "to": "heard_name_no"
          },
          {
            "label": "I'm busy / bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Who is this / what's this about?",
            "to": "permission_fallback"
          }
        ]
      },
      "heard_name_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well usually we'd be working with someone in your shoes. What'd you hear?",
        "note": "Let them talk. Whatever they say, steer toward what their inspection or turnover process looks like today.",
        "branches": [
          {
            "label": "Shares what they heard / engages",
            "to": "warm_discovery"
          },
          {
            "label": "Vague / not sure / deflects",
            "to": "pain_trigger"
          }
        ]
      },
      "heard_name_no": {
        "label": "HAVEN'T HEARD — TRANSITION",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call — I've been talking to a few other PM directors running vacation rental portfolios along the coast, and something keeps coming up that I figured would hit home for you.",
        "note": "Carry momentum right into the pain trigger. Don't pause too long — you already have implicit permission by them still being on the line.",
        "branches": [
          {
            "label": "Go ahead / I'm listening",
            "to": "pain_trigger"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          },
          {
            "label": "I'm busy right now",
            "to": "bad_timing"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow, maybe mid-morning?",
        "note": "Suggest a specific window. Get a micro-commitment. If they counter with a different time, take it immediately.",
        "branches": [
          {
            "label": "Sure / gives a time",
            "to": "bad_timing_set"
          },
          {
            "label": "Just email me",
            "to": "send_email"
          },
          {
            "label": "Don't call back / not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "bad_timing_set": {
        "label": "CALLBACK LOCKED",
        "say": "Perfect, I'll give you a ring then. Appreciate it, Collins.",
        "note": "Write down the exact day and time. Call back precisely when you said you would — not a minute late.",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION ASK",
        "say": "Yeah totally fair — it is a cold call. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not a fit?",
        "note": "Light and self-aware. You're naming the elephant in the room. Most people will give you the 30 seconds out of curiosity.",
        "branches": [
          {
            "label": "Sure / go ahead / make it quick",
            "to": "pain_trigger"
          },
          {
            "label": "No / I'm good / not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION DENIED — DIAGNOSE",
        "say": "Totally on me. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it more that you already know what we do and it's just not interesting?",
        "note": "You're diagnosing, not begging. The multiple choice disarms them and gives you a clear next step either way.",
        "branches": [
          {
            "label": "Bad timing / caught me at a bad time",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / don't need it",
            "to": "rejection_diagnostic"
          },
          {
            "label": "Hangs up",
            "to": "ending_graceful"
          }
        ]
      },
      "rejection_diagnostic": {
        "label": "REJECTION — LAST SHOT + REFERRAL",
        "say": "Totally fair. Last thing — is this something someone else on your team handles? I know you've got Alex Lane running housekeeping and Scott Hudson on maintenance. Would one of them be a better person for this conversation?",
        "note": "Using real names from their org chart shows serious homework. Even a no plants a seed. A referral from the Director of PM is gold.",
        "branches": [
          {
            "label": "Gives a name or referral",
            "to": "referral_get_name"
          },
          {
            "label": "No, don't call them",
            "to": "ending_graceful"
          },
          {
            "label": "Wait — what is this actually about?",
            "to": "pain_trigger"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "So here's what I keep running into. I was talking to another PM director managing about 300 vacation rentals along the coast — in-house cleaning crew, the whole thing. And his biggest headache was this: cleaners finish a unit, mark it complete, and then the next guest walks in and finds a cracked coffee maker or a stain on the couch nobody flagged. Three hundred units, back-to-back turnovers as summer ramps up — there's just no way to physically inspect every single one. And when something slips through, it's his phone ringing at nine PM, not the housekeeper's. Does any of that sound familiar, or is your world totally different?",
        "note": "PAUSE after the question. Do NOT fill the silence. His reaction tells you everything — a sigh or 'yeah' means he feels it. If he deflects, he may not own this problem or may need a different angle.",
        "branches": [
          {
            "label": "Yes / that resonates / shares their own version",
            "to": "solution_cta"
          },
          {
            "label": "We handle that pretty well already",
            "to": "objection_have_process"
          },
          {
            "label": "That's not really my area / wrong person",
            "to": "referral_ask"
          }
        ]
      },
      "solution_cta": {
        "label": "SOLUTION + CTA",
        "say": "That's exactly why we built this. RapidEye plugs into the photos your cleaners are already taking during turnovers — analyzes them automatically, flags damage, missing items, staging issues — before the next guest checks in. No workflow change for your team at all. Would you be open to taking a look sometime when I'm not cold calling you out of the blue?",
        "note": "One sentence on product, one sentence CTA. Don't over-explain. If they ask 'how does it work' — that's buying interest. Answer briefly and push for the meeting.",
        "branches": [
          {
            "label": "Yeah, I'd take a look / sure",
            "to": "book_meeting"
          },
          {
            "label": "How does that work? / Tell me more",
            "to": "warm_discovery"
          },
          {
            "label": "Not right now / maybe down the road",
            "to": "sell_test_drive"
          },
          {
            "label": "Just send me something",
            "to": "send_email"
          }
        ]
      },
      "warm_discovery": {
        "label": "DISCOVERY — STOP PITCHING, ASK QUESTIONS",
        "say": "Love to dig in. So let me ask you this — right now when your Isle Clean It team finishes a turnover, what does that look like? Are they snapping photos, filling out a checklist, or is it more of a spot-check kind of thing?",
        "note": "You are in LISTEN mode. Stop selling. Every answer is fuel for the demo. Take notes. Use their language back to them.",
        "branches": [
          {
            "label": "Describes their process / engages",
            "to": "discovery_process"
          },
          {
            "label": "Not sure / someone else handles that",
            "to": "referral_ask"
          }
        ]
      },
      "discovery_process": {
        "label": "DISCOVERY — DIG DEEPER",
        "say": "Got it. And when something does get missed — a guest reports damage or something's off — how does that flow? Does it come back to you first, or does it hit Alex's housekeeping team or Scott's maintenance crew?",
        "note": "You're mapping their internal workflow using their real team names. The more specific you get here, the more tailored your demo will be.",
        "branches": [
          {
            "label": "Explains the flow / keeps talking",
            "to": "season_pressure"
          },
          {
            "label": "Getting short on time",
            "to": "book_meeting"
          }
        ]
      },
      "season_pressure": {
        "label": "SEASONAL URGENCY ANGLE",
        "say": "That makes sense. I noticed you guys are running some shoulder-season promos right now to fill the spring calendar — I'm guessing once summer hits and those Isle of Palms turnovers are stacking back-to-back, that's when the cracks really start to show. Is summer your biggest crunch or is it pretty consistent year-round?",
        "note": "Shows you know their business and seasonal calendar. Tie urgency to their peak season. If they confirm summer is the crunch, use it to create meeting urgency — get on their calendar before things get crazy.",
        "branches": [
          {
            "label": "Summer is the crunch / confirms seasonality",
            "to": "book_meeting"
          },
          {
            "label": "It's pretty year-round",
            "to": "book_meeting"
          },
          {
            "label": "We manage it fine",
            "to": "sell_test_drive"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Perfect — let me not take up any more of your time on a cold call. I've got next Tuesday and Thursday pulled up — which one works better for a quick 20 minutes? I can show you exactly how it works with a portfolio like yours.",
        "note": "Two specific days — not 'sometime next week.' Lock the day first, then nail down the time. Send the calendar invite WHILE still on the phone.",
        "branches": [
          {
            "label": "Picks a day / gives a time",
            "to": "meeting_confirmed"
          },
          {
            "label": "Can't do those / suggests another day",
            "to": "meeting_confirmed"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Not ready to commit to a meeting",
            "to": "sell_test_drive"
          }
        ]
      },
      "meeting_confirmed": {
        "label": "MEETING LOCKED",
        "say": "Done — I'll send you a calendar invite at collins@islandrealty.com right now. Really appreciate you taking my call, Collins. Talk to you then.",
        "note": "Send the invite IMMEDIATELY. Stop selling. Don't add anything else. End on a high note and get off the phone.",
        "branches": []
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "Totally get it. Honestly I should've assumed you'd be all set — otherwise you probably would've reached out to us. Just so nobody from my team cold calls you again — is it that this isn't a problem you're focused on right now, or is it more that you just hate cold calls?",
        "note": "Agree first. Don't push back. The multiple choice disarms them and re-opens the conversation without pressure.",
        "branches": [
          {
            "label": "Hate cold calls / it's the timing",
            "to": "split_not_interested"
          },
          {
            "label": "Not a problem we're focused on",
            "to": "split_not_interested"
          },
          {
            "label": "Firmly not interested / done",
            "to": "ending_graceful"
          }
        ]
      },
      "objection_no_budget": {
        "label": "OBJECTION — NO BUDGET",
        "say": "Totally get it. Nowadays it's hard enough to keep the tools you've got, let alone buy something new. Just so nobody bugs you again — is it that budget this cycle is completely locked up, or is it more that anything you try to add has to go through the Stones and that's a whole process?",
        "note": "Mentioning the Stone family shows you know their ownership and decision-making structure. This splits 'no budget ever' from 'approval chain is hard' — very different next steps for each.",
        "branches": [
          {
            "label": "Budget is locked / timing issue",
            "to": "split_no_budget"
          },
          {
            "label": "Approval process is tough",
            "to": "split_no_budget"
          },
          {
            "label": "It's not really about budget",
            "to": "pain_trigger"
          }
        ]
      },
      "objection_have_process": {
        "label": "OBJECTION — ALREADY HAVE A PROCESS",
        "say": "That makes total sense — with 300-plus properties and Isle Clean It running everything in-house, you'd have to have something dialed in. Just out of curiosity — is it that you're fully covered and happy with how things get caught, or is it more that ripping anything out right now would be a headache?",
        "note": "Naming Isle Clean It shows deep research. The split question lets them admit gaps without feeling judged. Listen carefully to which side they land on.",
        "branches": [
          {
            "label": "Pretty happy with what we have",
            "to": "split_have_process"
          },
          {
            "label": "Switching would be a headache",
            "to": "split_have_process"
          },
          {
            "label": "Actually we do have some gaps",
            "to": "warm_discovery"
          }
        ]
      },
      "split_not_interested": {
        "label": "RE-ENGAGE — VALUE OFFER",
        "say": "Totally fair. Only reason I called is we're working with a couple other PM companies your size on the coast and it's been a pretty big deal for them heading into summer. If nothing else, I could walk you through what other companies in the Charleston vacation rental market are doing with their turnover photos right now — worst case you steal some ideas and we part as friends.",
        "note": "The 'steal some ideas' reframe makes the meeting valuable even if they never buy. Peer comparison hits hard in a competitive coastal market like Charleston.",
        "branches": [
          {
            "label": "That's actually interesting / sure",
            "to": "book_meeting"
          },
          {
            "label": "Not right now",
            "to": "sell_test_drive"
          },
          {
            "label": "No thanks",
            "to": "ending_graceful"
          }
        ]
      },
      "split_no_budget": {
        "label": "NO BUDGET — FUTURE PLANNING ANGLE",
        "say": "Makes total sense. You're probably not buying anything today and I totally respect that. But the folks who end up pulling the trigger on something like this are usually the ones who already know what their options are when budget does open up. Would you be open to a quick look — not to buy anything, just so it's on your radar when the time's right?",
        "note": "Remove all buying pressure. Frame the meeting as smart future planning, not a sales commitment.",
        "branches": [
          {
            "label": "Sure / that's fair",
            "to": "book_meeting"
          },
          {
            "label": "Just send me something",
            "to": "send_email"
          },
          {
            "label": "No / not right now",
            "to": "ending_graceful"
          }
        ]
      },
      "split_have_process": {
        "label": "HAVE A PROCESS — LAYER ON ANGLE",
        "say": "Totally hear you — and I'm not trying to rip out anything that's working. The thing that's been interesting for the other companies I work with is RapidEye actually layers on top of whatever you're already doing. It reads the photos that are already being taken — no new workflow, nothing to rip and replace. Would it be worth 20 minutes to see if it catches anything your current process doesn't?",
        "note": "Position as additive, not a replacement. This completely neutralizes the switching-cost objection.",
        "branches": [
          {
            "label": "Sure / might be worth a look",
            "to": "book_meeting"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          },
          {
            "label": "No thanks / we're good",
            "to": "sell_test_drive"
          }
        ]
      },
      "sell_test_drive": {
        "label": "TEST DRIVE — LAST REAL SHOT",
        "say": "Tell you what — you're clearly not buying anything over a cold call, and I totally respect that. But if nothing else, I could show you what a few other PM companies in the Charleston market are doing with their turnover photos heading into summer. Twenty minutes, worst case you steal some ideas for your Isle Clean It process. Would that be worth it?",
        "note": "This is your final value offer. Competitive intel plus actionable ideas makes the meeting worth their time even if they never buy. If they say no here, exit gracefully — don't push further.",
        "branches": [
          {
            "label": "Alright / sure / let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Just send me info",
            "to": "send_email"
          },
          {
            "label": "No / not right now / we're good",
            "to": "ending_graceful"
          }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question so I don't just send you another generic vendor email — what would be most useful to include? Is it more how the tech actually works, or what the ROI looks like for a portfolio your size?",
        "note": "This question makes the email personal and dramatically increases the chance they actually open it. Whatever they say, include it plus two specific meeting time options in the email.",
        "branches": [
          {
            "label": "Tells you what they want",
            "to": "send_email_confirmed"
          },
          {
            "label": "Just send whatever / general info",
            "to": "send_email_confirmed"
          }
        ]
      },
      "send_email_confirmed": {
        "label": "EMAIL CONFIRMED",
        "say": "Done — I'll get that over to collins@islandrealty.com today. I'll drop in a couple time options for next week in case you want to dig in further. Appreciate your time, Collins.",
        "note": "Send the email within 30 minutes. Include exactly what they asked for, a one-paragraph product summary, and two specific meeting times. Follow up in 3 days if no reply.",
        "branches": []
      },
      "referral_ask": {
        "label": "REFERRAL — FIND THE RIGHT PERSON",
        "say": "Totally makes sense. Who on your team typically owns the inspection side of turnovers day-to-day? I know you've got Alex Lane managing housekeeping and Scott Hudson on maintenance — would one of them be the better person to talk to about this?",
        "note": "Using real names from their employee directory shows serious research. Collins is senior enough to refer you down. A warm intro from the Director of PM is extremely valuable.",
        "branches": [
          {
            "label": "Suggests someone / gives a name",
            "to": "referral_get_name"
          },
          {
            "label": "I actually do handle this",
            "to": "sell_test_drive"
          },
          {
            "label": "Don't call my team / no",
            "to": "ending_graceful"
          }
        ]
      },
      "referral_get_name": {
        "label": "REFERRAL — LOCK IT IN",
        "say": "Perfect — would you mind if I mention your name when I reach out? I'll put something tailored together so it actually lands with them. Really appreciate the help, Collins.",
        "note": "Confirm permission to name-drop Collins. Ask for the referral's direct number or email if they don't offer it. Send the personalized outreach same day.",
        "branches": []
      },
      "ending_graceful": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes heading into the summer rush, I'm easy to find — Sam Parks, RapidEye. Appreciate your time, Collins.",
        "note": "Don't burn the bridge. Stay warm and professional. Add Collins to a follow-up sequence for a check-in in 3-4 weeks before peak season hits.",
        "branches": []
      }
    }
  }
}