{
  "name": "Dan Hutchins",
  "title": "Maintenance Manager",
  "company": "Coldwell Banker Island Vacations",
  "location": "Scottsdale, AZ is already on the list. Let me provide the next best option:\\n\\nMaui, HI",
  "phone": "+1-808-891-2900",
  "company_phone": "+1-808-891-2900",
  "alt_phones": [],
  "flow": {
    "context": "Dan Hutchins is the Maintenance Manager at Coldwell Banker Island Vacations — the person who deals with the downstream cost of every missed damage and repeat issue across 300+ vacation rental properties on Maui, Kauai, and Big Island. CBIV has operated since 2001 with an established team: Amanda Franta (GM/Founder, amanda@cbislandvacations.com), Justin Simpson (Ops Manager, direct line 808-909-3103), and Celina Cabo (Housekeeping Manager). No known inspection tech platform — their ops stack isn't publicly disclosed, and we're calling the main office line (808-891-2900) so we may hit a receptionist first. Sam's strongest bridge: he's a surfer who spends real time in Hawaii and works with similar-scale vacation rental operators on inspection workflows.",
    "start": "initial_contact",
    "nodes": {
      "initial_contact": {
        "label": "INITIAL CONTACT",
        "say": "Hey, is this Dan?",
        "note": "Calling main office line (808-891-2900). Could get Dan directly or a receptionist. Keep it casual — just trying to reach a person by first name.",
        "branches": [
          {
            "label": "Yes, this is Dan",
            "to": "opener"
          },
          {
            "label": "No / Who's calling? / Front desk answers",
            "to": "gatekeeper_slide"
          },
          {
            "label": "Dan's not available right now",
            "to": "gatekeeper_availability"
          }
        ]
      },
      "gatekeeper_slide": {
        "label": "GATEKEEPER — SLIDE BY",
        "say": "Oh hey — could you get me through to Dan Hutchins? It's Sam.",
        "note": "Don't pitch. Don't explain. First name basis, like you know him. Let them ask if they need more.",
        "branches": [
          {
            "label": "Puts you through / hold on",
            "to": "initial_contact"
          },
          {
            "label": "What's this about? / Who are you with?",
            "to": "gatekeeper_context"
          },
          {
            "label": "He's not available / not in today",
            "to": "gatekeeper_availability"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — ADD CONTEXT",
        "say": "Yeah totally — I work with a few other vacation rental managers out in Hawaii on their inspection workflows. Would you mind letting Dan know it's Sam Parks?",
        "note": "Still no pitch. Just enough context to sound legitimate. End with a redirect — you're asking them to do something, not waiting for permission.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "initial_contact"
          },
          {
            "label": "Still pushing back / Can you send an email?",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "He's not available",
            "to": "gatekeeper_availability"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "For sure. We help a couple other property management companies with their turnover inspection process — companies running a few hundred units, similar to you guys. I sent Dan a note but wanted to give him a heads up. Would you mind passing that along?",
        "note": "Last attempt. If they still block, get a callback time or ask for Dan's direct line or email. Don't burn the bridge.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "initial_contact"
          },
          {
            "label": "I'll pass the message along / send an email",
            "to": "gatekeeper_get_info"
          },
          {
            "label": "Hard no",
            "to": "end_graceful"
          }
        ]
      },
      "gatekeeper_get_info": {
        "label": "GET DIRECT CONTACT INFO",
        "say": "Appreciate that. Hey quick question — do you happen to have a direct number or email for Dan so I'm not bugging the front desk next time?",
        "note": "Try to get dan@cbislandvacations.com or a direct line. If they won't give it, ask for best time to reach him.",
        "branches": [
          {
            "label": "Gives email or direct number",
            "to": "end_graceful"
          },
          {
            "label": "Won't share / try back later",
            "to": "gatekeeper_best_time"
          }
        ]
      },
      "gatekeeper_best_time": {
        "label": "ASK BEST TIME",
        "say": "Totally get it. When's usually the best time to catch Dan — mornings or afternoons?",
        "note": "Get a callback window. Hawaii is HST (UTC-10), 2-3 hours behind Pacific, 5-6 behind Eastern. Note the time for follow-up.",
        "branches": [
          {
            "label": "Gives a time suggestion",
            "to": "end_graceful"
          },
          {
            "label": "Not sure / won't say",
            "to": "end_graceful"
          }
        ]
      },
      "gatekeeper_availability": {
        "label": "DAN NOT AVAILABLE",
        "say": "No worries at all. When's usually the best time to catch him — mornings or afternoons?",
        "note": "Get a callback window. If they offer voicemail, take it but also get a time to call back live.",
        "branches": [
          {
            "label": "Gives a time / suggests calling back",
            "to": "end_graceful"
          },
          {
            "label": "Want me to transfer to voicemail?",
            "to": "voicemail_option"
          },
          {
            "label": "Can I take a message?",
            "to": "gatekeeper_get_info"
          }
        ]
      },
      "voicemail_option": {
        "label": "VOICEMAIL",
        "say": "Hey Dan, it's Sam Parks — I work with a few vacation rental managers out in Hawaii on their inspection process. Had a quick question for you. My number is [your number]. Again, it's Sam Parks with RapidEye. Talk soon.",
        "note": "Keep it under 15 seconds. Sound casual, not salesy. Don't pitch. 'Had a quick question' creates curiosity without giving anything away.",
        "branches": []
      },
      "opener": {
        "label": "OPENER",
        "say": "Hey Dan — so I actually spend a bunch of time out in Maui, I'm a big surfer out there. I also work with a few other vacation rental managers on their inspection workflows. It's Sam Parks with RapidEye — have you heard my name tossed around?",
        "note": "Surfing in Hawaii is the real personal bridge. Feet up on the desk energy. Not chipper. Pause after 'tossed around' and let him respond — don't fill the silence.",
        "branches": [
          {
            "label": "No, I haven't",
            "to": "heard_name_no"
          },
          {
            "label": "Yeah / Maybe / Sounds familiar",
            "to": "heard_name_yes"
          },
          {
            "label": "I'm busy / not a good time",
            "to": "bad_timing"
          },
          {
            "label": "What is this about? / Are you selling something?",
            "to": "permission_fallback"
          }
        ]
      },
      "heard_name_no": {
        "label": "HAVEN'T HEARD THE NAME",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call — I work with another vacation rental manager running about 300 units across a few islands, pretty similar setup to you guys. And one thing their maintenance lead kept telling me is he'd get dispatched to fix something that had clearly been broken for weeks — a cracked lanai slider, missing patio furniture, water damage under a sink — but nobody caught it during the last few turnovers because the cleaners' photos just sat somewhere and nobody had time to actually look through all of them. And by that point he can't even figure out which guest caused it. Does any of that sound familiar?",
        "note": "This is the pain trigger. Hairy lollipop specificity — lanai slider, patio furniture, water damage. All Hawaii-specific, maintenance-specific. PAUSE after 'sound familiar' and let Dan talk. Do not fill the silence.",
        "branches": [
          {
            "label": "Yeah, that happens / tells a story",
            "to": "warm_response"
          },
          {
            "label": "Not really / we handle that fine",
            "to": "objection_have_process"
          },
          {
            "label": "I'm not the right person for this",
            "to": "referral_wrong_person"
          },
          {
            "label": "I'm not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "heard_name_yes": {
        "label": "HEARD THE NAME",
        "say": "Oh nice — well normally we'd be working with someone like you on this. What'd you hear?",
        "note": "Let them talk. They may have seen an email, heard from a colleague, or are just being polite. Either way they're engaged — ride the wave.",
        "branches": [
          {
            "label": "Tells you what they heard",
            "to": "warm_response"
          },
          {
            "label": "Not sure / can't remember / just being polite",
            "to": "heard_name_no"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow? Or would later this week be better?",
        "note": "Give two options, not an open-ended 'when works.' Lock a real time if possible.",
        "branches": [
          {
            "label": "Sure, try me at a specific time",
            "to": "bad_timing_lock"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          },
          {
            "label": "Don't call back / not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "bad_timing_lock": {
        "label": "LOCK CALLBACK TIME",
        "say": "Perfect — I'll try you [repeat their time]. Talk to you then, Dan.",
        "note": "Write down the exact day and time. Call back exactly when you said. That reliability builds trust before the next conversation even starts.",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call, I'll be straight with you. Can I get 30 seconds to tell you why I reached out? And you can totally hang up on me if it's not a fit.",
        "note": "Honesty disarms. Most people respect the transparency and will give you the 30 seconds. If they say yes, go straight to the compressed pain trigger.",
        "branches": [
          {
            "label": "Sure, go ahead / 30 seconds",
            "to": "pain_trigger_short"
          },
          {
            "label": "No / I'm good / not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it more that you already know what we do and this just isn't interesting?",
        "note": "Split the objection. If it's timing, you get a callback. If it's disinterest, you learn why and can potentially re-engage or exit cleanly.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / don't need it",
            "to": "last_chance_value"
          },
          {
            "label": "Hangs up",
            "to": "end_graceful"
          }
        ]
      },
      "pain_trigger_short": {
        "label": "PAIN TRIGGER — 30 SECOND VERSION",
        "say": "So I work with another vacation rental manager in a pretty similar spot to you guys — 300-plus units, multiple islands. Their maintenance manager kept telling me the same thing: he'd show up to a unit and find damage that had obviously been there for multiple turnovers, but nobody caught it in the photos because there's just too many to review. We built a tool that plugs into the turnover photos your team's already taking and automatically flags damage, missing items, staging issues — so stuff gets caught the first time instead of three guests later. Would you be open to taking a look sometime when I'm not cold calling you out of the blue?",
        "note": "Compressed version — still hit the maintenance-specific pain. Pause after the CTA and let Dan respond. Don't keep talking.",
        "branches": [
          {
            "label": "Yeah, that'd be interesting / sure",
            "to": "book_meeting"
          },
          {
            "label": "Tell me more / how does it work?",
            "to": "warm_response"
          },
          {
            "label": "We already have something for that",
            "to": "objection_have_process"
          },
          {
            "label": "I'm not the right person",
            "to": "referral_wrong_person"
          },
          {
            "label": "Not interested / no budget",
            "to": "objection_not_interested"
          }
        ]
      },
      "warm_response": {
        "label": "THEY'RE WARM — STOP PITCHING",
        "say": "Yeah, I hear that a lot from maintenance leads. So tell me — what does it look like right now when your team does a turnover? Are the cleaners taking photos and sending them somewhere, or is it more of a visual walkthrough?",
        "note": "STOP SELLING. Start asking. Dan is maintenance — he knows the pain but may not own the inspection workflow. Listen for: photo volume, what platform they use, who reviews photos, how Dan gets notified of issues.",
        "branches": [
          {
            "label": "Describes their process / shares pain",
            "to": "discovery_dig_deeper"
          },
          {
            "label": "That's more of a housekeeping thing",
            "to": "referral_to_celina"
          },
          {
            "label": "We don't really have a formal process",
            "to": "discovery_no_process"
          }
        ]
      },
      "discovery_dig_deeper": {
        "label": "DIG DEEPER",
        "say": "Got it. And when something does get missed — like damage from a guest that nobody documents in time — what happens? Does that just come out of the owner's pocket, or are you guys able to go back and charge the guest?",
        "note": "Gets to the financial pain. With 300+ properties and no known inspection tech, money is falling through the cracks on uncharged damage. Listen for owner complaints, deposit disputes, insurance claims.",
        "branches": [
          {
            "label": "We lose money on it / owner pays / hard to charge guest",
            "to": "solution_bridge"
          },
          {
            "label": "We have a process for that / it's handled",
            "to": "solution_bridge"
          },
          {
            "label": "That's more of an ops or accounting question",
            "to": "referral_wrong_person"
          }
        ]
      },
      "discovery_no_process": {
        "label": "NO FORMAL INSPECTION PROCESS",
        "say": "That's actually pretty common at your scale — when you're running 300-plus units across three islands, it's tough to standardize anything. How do you usually find out about damage right now — is it guest complaints, or does your team catch it on the next clean?",
        "note": "No formal process means huge opportunity. Keep asking questions. The goal is to get Dan to articulate the pain himself so he owns it.",
        "branches": [
          {
            "label": "Guest complaints / we find out late",
            "to": "solution_bridge"
          },
          {
            "label": "We catch most of it / our team is good",
            "to": "solution_bridge"
          }
        ]
      },
      "referral_to_celina": {
        "label": "REDIRECT TO HOUSEKEEPING OR OPS",
        "say": "That makes sense — so Celina on the housekeeping side or Justin in ops would probably be closer to the photo and inspection piece. Between the two of them, who would you say has more pull on what tools the team uses?",
        "note": "Dan just told you this is housekeeping's domain. Use the names you know — Celina Cabo (Housekeeping Manager) and Justin Simpson (Operations Manager). Get Dan to tell you who the real decision-maker is.",
        "branches": [
          {
            "label": "Points to Justin (Ops Manager)",
            "to": "referral_get_intro"
          },
          {
            "label": "Points to Celina (Housekeeping Manager)",
            "to": "referral_get_intro"
          },
          {
            "label": "Points to Amanda (GM)",
            "to": "referral_get_intro"
          },
          {
            "label": "Not sure / doesn't want to say",
            "to": "referral_ask_general"
          }
        ]
      },
      "solution_bridge": {
        "label": "BRIDGE TO RAPIDEYE",
        "say": "Yeah — so that's exactly what we built RapidEye for. It plugs into whatever photo workflow your team's already using and automatically scans every turnover photo for damage, missing items, staging issues — stuff a human would catch on a good day but misses when they're reviewing photos from 20 units back to back. Your cleaners don't change anything they do. It just catches the stuff that's slipping through. Would you be open to seeing what it looks like? Not a big production — I could walk you through it in like 15 minutes.",
        "note": "One-sentence solution, then CTA. Don't oversell the tech. Keep it simple: plugs in, catches stuff, no workflow change. The 15-minute frame makes it feel low-commitment.",
        "branches": [
          {
            "label": "Yeah, I'd look at that / sure",
            "to": "book_meeting"
          },
          {
            "label": "I'd need to loop in my ops team or Justin or Amanda",
            "to": "book_meeting_with_team"
          },
          {
            "label": "Not really my call / I just do maintenance",
            "to": "referral_wrong_person"
          },
          {
            "label": "We don't have budget for that",
            "to": "objection_no_budget"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next Tuesday and Thursday pulled up — do mornings or afternoons work better for you? And I know Hawaii time can be tricky so whatever's easiest on your end.",
        "note": "Pick two specific days. Lock the time NOW. Don't leave it open-ended. Hawaii is HST (UTC-10). Send the calendar invite while still on the phone if possible.",
        "branches": [
          {
            "label": "Picks a day and time",
            "to": "meeting_confirmed"
          },
          {
            "label": "Let me check my calendar / get back to you",
            "to": "book_meeting_pin"
          }
        ]
      },
      "book_meeting_with_team": {
        "label": "BOOK WITH THE TEAM",
        "say": "Makes total sense — honestly it'd probably be more useful with Justin or your ops team on too. Would it be easier if I set something up and looped everyone in, or would you rather float it to them first?",
        "note": "Dan wants to include Justin Simpson (Ops) or others. Offer to own the logistics. If he wants to float it internally, get a specific follow-up date so it doesn't die.",
        "branches": [
          {
            "label": "Set it up and include them",
            "to": "book_meeting"
          },
          {
            "label": "Let me talk to them first",
            "to": "book_followup_date"
          }
        ]
      },
      "book_followup_date": {
        "label": "PIN A FOLLOW-UP DATE",
        "say": "Totally fair. How about this — I'll shoot you an email with a quick summary you can forward to them, and I'll try you again Thursday to see where things landed. That way you're not doing my job for me.",
        "note": "Don't let it float. Lock a specific follow-up day. The email gives Dan something tangible to share internally. Use dan@cbislandvacations.com (inferred from Amanda's email pattern).",
        "branches": [
          {
            "label": "Sounds good / agrees to follow-up",
            "to": "confirm_email_address"
          },
          {
            "label": "Just email me and I'll reach out if interested",
            "to": "send_email"
          }
        ]
      },
      "confirm_email_address": {
        "label": "CONFIRM EMAIL",
        "say": "Perfect. Is dan at cbislandvacations dot com the best email for you?",
        "note": "Email pattern is firstname@cbislandvacations.com based on Amanda's confirmed address. If Dan corrects it, note the real address immediately.",
        "branches": [
          {
            "label": "Yes / confirms email",
            "to": "meeting_confirmed"
          },
          {
            "label": "Gives a different email",
            "to": "meeting_confirmed"
          }
        ]
      },
      "book_meeting_pin": {
        "label": "PIN IT DOWN",
        "say": "For sure — how about I pencil in Thursday afternoon just as a placeholder, and if you need to move it, no stress at all?",
        "note": "Don't let 'let me check' become a dead end. Suggest a specific placeholder. People are much more likely to keep a meeting that's already on the calendar.",
        "branches": [
          {
            "label": "Sure, that works",
            "to": "meeting_confirmed"
          },
          {
            "label": "I'll get back to you",
            "to": "send_email"
          }
        ]
      },
      "meeting_confirmed": {
        "label": "MEETING LOCKED",
        "say": "Done deal. I'll send over an invite right now so it's on both our calendars. Really appreciate you taking my call, Dan — I know you've got units to keep running. Talk soon.",
        "note": "STOP SELLING. Confirm and get off the phone. Send the calendar invite immediately after hanging up. If others need to be looped in (Justin, Celina, Amanda), add them or note it for the invite email.",
        "branches": []
      },
      "objection_not_interested": {
        "label": "NOT INTERESTED",
        "say": "I totally get it. I should've assumed you'd be all set — otherwise you probably would've reached out to us. Just so no one from my team cold calls you again — is it that this isn't really a problem you're dealing with, or is it more that you just hate cold calls?",
        "note": "Agree first, then split. Don't argue. The 'so no one calls again' line incentivizes them to give you a real answer instead of just hanging up.",
        "branches": [
          {
            "label": "It's not a problem for us / we're good",
            "to": "sell_test_drive"
          },
          {
            "label": "I hate cold calls / bad timing",
            "to": "bad_timing"
          },
          {
            "label": "I'm just not the right person",
            "to": "referral_wrong_person"
          },
          {
            "label": "Hard no / hangs up",
            "to": "end_graceful"
          }
        ]
      },
      "objection_have_process": {
        "label": "ALREADY HAVE SOMETHING",
        "say": "That makes total sense — with 300-plus properties across three islands, you'd have to have something in place. Is it that you're fully covered and happy with how it's working, or is it more that switching anything right now would just be a massive headache?",
        "note": "Agree, then split. You don't know their ops platform (not publicly disclosed). Let Dan tell you what they use — if he names a tool, that's gold for the follow-up and for your market research.",
        "branches": [
          {
            "label": "We're happy with what we have",
            "to": "sell_test_drive"
          },
          {
            "label": "It's more of a switching headache / too much going on",
            "to": "sell_test_drive_timing"
          },
          {
            "label": "Tells you what they use or how they handle it",
            "to": "warm_response"
          }
        ]
      },
      "objection_no_budget": {
        "label": "NO BUDGET",
        "say": "Totally get it. Nowadays it's harder to keep a tool, let alone buy something new — especially with everything going on in Maui right now with the regulatory changes. Is it that budget for this cycle is completely locked, or is it more that anything new you try to bring in puts you through the ringer with approval?",
        "note": "Reference Bill 9 subtly ('everything going on in Maui with the regulatory changes') — it validates that you understand their market. Bill 9 is phasing out ~6,200 Maui vacation rentals by 2029-2031. Split into timing vs. approval process.",
        "branches": [
          {
            "label": "Budget is locked / end of cycle",
            "to": "sell_test_drive_timing"
          },
          {
            "label": "Approval is a pain / need ops or Amanda to sign off",
            "to": "sell_test_drive"
          },
          {
            "label": "This just isn't a priority right now",
            "to": "last_chance_value"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally hear you. Look, you're probably not buying anything off a cold call, and I respect that. But when you do look at this stuff down the road, the people who have an easy time are the ones who already know what's out there. If nothing else, I could walk you through what a few other PM companies running a similar setup are doing with their turnover photos — worst case you steal some ideas and we part as friends. Would you be open to 15 minutes?",
        "note": "Reframe the meeting as informational, not a sales pitch. 'Steal some ideas' lowers the stakes. 15 minutes makes it feel painless.",
        "branches": [
          {
            "label": "Sure / I could do that",
            "to": "book_meeting"
          },
          {
            "label": "Send me an email first",
            "to": "send_email"
          },
          {
            "label": "No thanks / not right now",
            "to": "last_chance_value"
          }
        ]
      },
      "sell_test_drive_timing": {
        "label": "SELL THE TEST DRIVE — TIMING ANGLE",
        "say": "That makes sense. Look — I know right now isn't when you're buying anything. But when budget does open up, the people who move fast are the ones who already know what they want. Would you be open to a quick look — not to buy now, but so when the time comes, you've already got a shortlist? I'm talking 15 minutes, super low-key.",
        "note": "Future-state framing removes pressure from now and positions the demo as prep work, not a commitment. Works especially well if budget cycles are rigid or Bill 9 uncertainty is freezing spending.",
        "branches": [
          {
            "label": "Yeah, that works",
            "to": "book_meeting"
          },
          {
            "label": "Maybe later / follow up with me",
            "to": "book_followup_date"
          },
          {
            "label": "Send me info",
            "to": "send_email"
          },
          {
            "label": "No",
            "to": "last_chance_value"
          }
        ]
      },
      "last_chance_value": {
        "label": "LAST CHANCE — VALUE OFFER",
        "say": "Totally understand, Dan. Last thing and I'll let you go — even outside of what we do, I've been talking to a lot of vacation rental operators in Hawaii lately, especially with the Bill 9 stuff shaking things up. If you or your team ever want to compare notes on what other companies your size are doing operationally, I'm an open book. I'll shoot you a quick email so you've got my info. Is dan at cbislandvacations dot com good?",
        "note": "Bill 9 is a real and immediate regulatory pressure — Maui County voted to phase out ~6,200 vacation rentals. Mentioning it shows you understand their world. Even if Dan says no to everything, confirming the email keeps the door open for follow-up.",
        "branches": [
          {
            "label": "Confirms email / appreciates the offer",
            "to": "end_graceful"
          },
          {
            "label": "Not interested at all / just end the call",
            "to": "end_graceful"
          }
        ]
      },
      "referral_wrong_person": {
        "label": "NOT THE RIGHT PERSON",
        "say": "Totally fair — appreciate you telling me that. Who on your team would typically own the inspection or turnover workflow? Would that be more of an ops thing with Justin, or does Amanda handle that directly?",
        "note": "Use the names you already know. Dan might confirm Justin Simpson (Ops Manager, 808-909-3103) or point to Celina Cabo (Housekeeping) or Amanda Franta (GM, amanda@cbislandvacations.com). Getting a name and warm intro is the goal.",
        "branches": [
          {
            "label": "Points to Justin Simpson (Ops)",
            "to": "referral_get_intro"
          },
          {
            "label": "Points to Celina Cabo (Housekeeping)",
            "to": "referral_get_intro"
          },
          {
            "label": "Points to Amanda Franta (GM)",
            "to": "referral_get_intro"
          },
          {
            "label": "Gives another name",
            "to": "referral_get_intro"
          },
          {
            "label": "Doesn't know / won't say",
            "to": "referral_ask_general"
          }
        ]
      },
      "referral_get_intro": {
        "label": "GET THE INTRO",
        "say": "Perfect. Would you mind giving them a heads up that I'll reach out? That way it's not totally out of the blue for them. And what's the best way to get them — is there a direct number or email?",
        "note": "A warm intro from Dan makes the next call 10x easier. If he won't intro, at least get contact info. You already know Justin's direct is (808) 909-3103 and Amanda's email is amanda@cbislandvacations.com — but let Dan give it to you so it feels natural.",
        "branches": [
          {
            "label": "Sure, I'll mention it / gives contact info",
            "to": "referral_confirmed"
          },
          {
            "label": "Just call the main number / I'd rather not",
            "to": "referral_confirmed"
          }
        ]
      },
      "referral_ask_general": {
        "label": "GENERAL REFERRAL ASK",
        "say": "No worries at all. Who would you say handles the day-to-day operations stuff — like if there was a new tool for inspections, who would be the person to evaluate that?",
        "note": "Keep it general if Dan doesn't want to name names. You're looking for the right altitude — someone who owns the workflow and can approve tools.",
        "branches": [
          {
            "label": "Gives a name or role",
            "to": "referral_get_intro"
          },
          {
            "label": "Won't say / doesn't know",
            "to": "end_graceful"
          }
        ]
      },
      "referral_confirmed": {
        "label": "REFERRAL LOCKED",
        "say": "Really appreciate that, Dan. I'll put something tailored together so it actually lands with them. And hey — if you ever need anything on the maintenance side or just want to compare notes, I'm easy to find. Thanks for your time.",
        "note": "Thank Dan genuinely. Note exactly who he referred you to and any context he gave. Mention Dan by name when you call the referral — 'Dan Hutchins mentioned you'd be the right person to talk to.'",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question so I don't send you something generic — what would be most useful to see? Is it more about how the photo analysis actually works, or would you rather see what it catches on a real turnover?",
        "note": "Accept the email request, then ask one question to tailor it. This keeps them talking and tells you what they care about. Whatever they say, use it to customize the follow-up.",
        "branches": [
          {
            "label": "Tells you what they want to see",
            "to": "send_email_confirm"
          },
          {
            "label": "Just send whatever / doesn't care",
            "to": "send_email_confirm"
          }
        ]
      },
      "send_email_confirm": {
        "label": "CONFIRM EMAIL AND CLOSE",
        "say": "Got it — I'll send that over today. Is dan at cbislandvacations dot com the best one? And I'll include a couple times to connect next week in case you want to dig in more. Appreciate it, Dan.",
        "note": "Confirm the email address. Include 2-3 specific time options in the email for a follow-up call. Follow up by phone 2-3 days after sending if no reply. Log everything in CRM.",
        "branches": [
          {
            "label": "Confirms email",
            "to": "end_graceful"
          },
          {
            "label": "Gives different email",
            "to": "end_graceful"
          }
        ]
      },
      "end_graceful": {
        "label": "END CALL — GRACEFUL EXIT",
        "say": "Totally understand. If anything changes, I'm easy to find — Sam Parks, RapidEye. Appreciate your time, Dan.",
        "note": "Don't burn the bridge. Stay warm. Log everything you learned — current process, tools mentioned, org dynamics, referral names, best callback times. If you got a referral, call them within 24 hours while Dan's memory is fresh.",
        "branches": []
      }
    }
  }
}