{
  "name": "Danielle Gularte",
  "title": "President/Shareholder",
  "company": "Crown Vacation Rentals (Napa Vacation Condos)",
  "location": "Napa Valley, CA",
  "phone": "+1-707-333-5149",
  "company_phone": "(707) 256-2130",
  "alt_phones": [],
  "flow": {
    "context": "Calling Danielle Gularte, President/Shareholder of Crown Realty Property Management, which runs Crown Vacation Rentals (Napa Vacation Condos) — a condo-focused STR operation in Napa Valley. She's listed in the California Apartment Association directory, signaling she cares about professional standards and compliance. They use Streamline as their PMS (owner portal links to ownerx.streamlinevrs.com). Key ops people below her: Fernanda Navarro (Ops Manager), Janett Sanchez (Maintenance Director), Rebecca Daigle (Property Maintenance Review Coordinator). Sam has regular access to SF — Napa is an easy drive — and works with other NorCal property managers. Calling her direct line: (707) 333-5149.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Danielle — I've been working with a few property managers up in Wine Country and saw Crown keeps popping up. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Feet up energy. Sound like a peer, not a pitch. Pause and let her answer. You're calling her direct cell — she may be guarded.",
        "branches": [
          {
            "label": "No / Who? / Don't think so",
            "to": "not_popular"
          },
          {
            "label": "Yes / Maybe / Sounds familiar",
            "to": "heard_of_us"
          },
          {
            "label": "Bad timing / I'm busy",
            "to": "bad_timing"
          },
          {
            "label": "What is this about? / Are you selling something?",
            "to": "permission_fallback"
          }
        ]
      },
      "not_popular": {
        "label": "NOT POPULAR PIVOT",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call — I work with another vacation rental company in a pretty similar spot to you guys. They run condos, use Streamline, similar setup. And the thing that was killing them was turnover photos. Their team was taking hundreds of photos every turnover, uploading them into the system, and nobody actually had time to review them all. So stuff was slipping through — a stain on a couch, a missing throw pillow, a scratch on a countertop — and they wouldn't find out until the next guest checked in or worse, the owner noticed. We built something that plugs into the photos they're already taking and uses AI to catch the stuff humans miss — damage, missing items, staging issues. Would you be open to taking a look sometime when I'm not cold calling you out of the blue?",
        "note": "Pause after 'the owner noticed.' Let the pain land. She's president — owner complaints and brand risk hit her level. One breath on the solution, then CTA. Don't over-explain.",
        "branches": [
          {
            "label": "Sure / Yeah I'd look at that",
            "to": "warm_discovery"
          },
          {
            "label": "How does that work exactly?",
            "to": "warm_discovery"
          },
          {
            "label": "We already have a process for that",
            "to": "have_a_process"
          },
          {
            "label": "Not interested / We're good",
            "to": "not_interested"
          },
          {
            "label": "No budget / Not right now",
            "to": "no_budget"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          }
        ]
      },
      "heard_of_us": {
        "label": "HEARD OF US",
        "say": "Oh nice — well normally we'd be working with someone like you. What'd you hear?",
        "note": "Let her talk. Whatever she says, bridge to discovery. Don't correct or re-pitch.",
        "branches": [
          {
            "label": "Describes something / vague reference",
            "to": "warm_discovery"
          },
          {
            "label": "Actually no, thinking of something else",
            "to": "not_popular"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow or later this week?",
        "note": "Don't push. Get a specific callback window. If she gives one, confirm the number and move on.",
        "branches": [
          {
            "label": "Sure, try me [specific time]",
            "to": "book_callback"
          },
          {
            "label": "What's this about? (softening)",
            "to": "not_popular"
          },
          {
            "label": "No, don't call back / not interested",
            "to": "not_interested"
          }
        ]
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not a fit?",
        "note": "Disarm with honesty. Most people respect the transparency and give you the 30 seconds.",
        "branches": [
          {
            "label": "Fine, go ahead / 30 seconds",
            "to": "not_popular"
          },
          {
            "label": "No / I'm really not interested",
            "to": "rejection_split"
          }
        ]
      },
      "rejection_split": {
        "label": "REJECTION SPLIT",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and this just isn't interesting?",
        "note": "Split the objection. Most people pick timing, which reopens the door.",
        "branches": [
          {
            "label": "It's just bad timing",
            "to": "bad_timing"
          },
          {
            "label": "It's not interesting / we're set",
            "to": "not_interested"
          },
          {
            "label": "What do you actually do? (curiosity)",
            "to": "not_popular"
          }
        ]
      },
      "warm_discovery": {
        "label": "WARM — DISCOVERY",
        "say": "Awesome. So I don't waste your time — what does your inspection process look like right now on the vacation rental side? Are your cleaners taking photos after every turnover, or is it more spot-check?",
        "note": "STOP PITCHING. She's warm. Ask questions and listen. You know they use Streamline — if she mentions it, acknowledge it naturally. Tailor based on what she says.",
        "branches": [
          {
            "label": "Describes their process (photos, checklists, etc.)",
            "to": "dig_deeper"
          },
          {
            "label": "We use Streamline / our PMS handles it",
            "to": "streamline_angle"
          },
          {
            "label": "Fernanda / Janett / someone else handles that",
            "to": "referral_to_ops"
          },
          {
            "label": "We don't really have a formal process",
            "to": "no_process"
          }
        ]
      },
      "dig_deeper": {
        "label": "DIG DEEPER",
        "say": "Got it. And when stuff does slip through — like a stain that should've been caught or something broken between guests — how does that usually surface? Is it the guest calling in, or does your team catch it on the next turnover?",
        "note": "Get her to describe the pain in her own words. If she mentions owner complaints, deposit disputes, or bad reviews — those are gold. Let her talk.",
        "branches": [
          {
            "label": "Guests find it / we get complaints",
            "to": "pain_confirmed"
          },
          {
            "label": "We usually catch it / not a big issue",
            "to": "minimal_pain"
          },
          {
            "label": "It depends / sometimes both",
            "to": "pain_confirmed"
          }
        ]
      },
      "streamline_angle": {
        "label": "STREAMLINE ANGLE",
        "say": "Yeah, I saw you guys are on Streamline — that's actually one of the systems we connect with. The thing we keep hearing from Streamline shops is the photos go in, but nobody's actually reviewing them systematically — it's more like they're there for CYA if something goes wrong. Does that sound about right, or do you guys actually have someone going through every set?",
        "note": "You know they use Streamline from the owner portal link. This shows homework without being creepy. Rebecca Daigle's title is literally Property Maintenance Review Coordinator — if Danielle mentions someone reviews photos, it's probably Rebecca.",
        "branches": [
          {
            "label": "Yeah, that's pretty accurate / nobody reviews them all",
            "to": "pain_confirmed"
          },
          {
            "label": "We actually have someone reviewing them",
            "to": "review_coordinator"
          },
          {
            "label": "It's more for documentation / CYA",
            "to": "pain_confirmed"
          }
        ]
      },
      "review_coordinator": {
        "label": "REVIEW COORDINATOR",
        "say": "Oh interesting — is that a dedicated role on your team? Most companies I talk to, that person is buried. They're reviewing hundreds of photos and stuff still gets through just because of volume. What's that look like for you guys?",
        "note": "Rebecca Daigle is their Property Maintenance Review Coordinator. If Danielle names her, remember it for the referral path. This role is the perfect end-user for RapidEye.",
        "branches": [
          {
            "label": "Yeah, it's a lot / they're overwhelmed",
            "to": "pain_confirmed"
          },
          {
            "label": "It works fine / we've got it covered",
            "to": "minimal_pain"
          },
          {
            "label": "Mentions Rebecca or someone by name",
            "to": "referral_to_ops"
          }
        ]
      },
      "no_process": {
        "label": "NO FORMAL PROCESS",
        "say": "That's actually more common than you'd think — especially with condos where the turnover volume is high but each unit looks similar enough that people assume it's fine. The problem we keep seeing is that's exactly when stuff accumulates — small damages nobody documents, and then three months later an owner's asking why their unit looks different and there's no photo trail. Has that come up for you at all?",
        "note": "No process means bigger pain they may not feel yet. Connect it to owner relationships — she's president, owner retention is her problem.",
        "branches": [
          {
            "label": "Yeah, that's happened / owners have asked",
            "to": "pain_confirmed"
          },
          {
            "label": "Not really / haven't had that issue",
            "to": "minimal_pain"
          }
        ]
      },
      "pain_confirmed": {
        "label": "PAIN CONFIRMED — BOOK",
        "say": "Yeah, that's exactly what we're solving. Look, I don't want to take up your whole afternoon — would it make sense to set up 20 minutes where I can show you what this actually looks like? I could walk you through what a couple other vacation rental companies in California are doing with their turnover photos — worst case you steal some ideas and we part as friends. I've got next Tuesday or Wednesday pulled up — what works better?",
        "note": "Offer specific days. Lock it NOW. If she wants to include Fernanda or Janett, even better — multi-stakeholder meeting is a great sign.",
        "branches": [
          {
            "label": "Sure, [picks a time]",
            "to": "book_meeting"
          },
          {
            "label": "Can you include my ops team?",
            "to": "include_ops_team"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Not right now / maybe later",
            "to": "no_budget"
          }
        ]
      },
      "minimal_pain": {
        "label": "MINIMAL PAIN — REFRAME",
        "say": "That's great — honestly most companies I talk to aren't in crisis mode, it's more like insurance. The ones that get ahead of it are the ones who aren't scrambling when an owner disputes a damage charge or a guest leaves a one-star review over something that should've been caught. If nothing else, I could show you what other vacation rental managers in the Napa area are doing — it's a pretty quick look. Would that be worth 20 minutes?",
        "note": "She's not feeling acute pain. Shift to peer benchmarking and risk prevention. Presidents care about protecting the brand and owner relationships long-term.",
        "branches": [
          {
            "label": "Sure, I'd look at that",
            "to": "book_meeting"
          },
          {
            "label": "Not right now",
            "to": "no_budget"
          },
          {
            "label": "Send me info first",
            "to": "send_email"
          }
        ]
      },
      "have_a_process": {
        "label": "HAVE A PROCESS — OBJECTION",
        "say": "That makes total sense — with a vacation rental operation you'd have to have something in place. Just so no one from my team cold calls you again — is it that you're fully covered and happy with how it's working, or is it more that switching anything right now would be a headache?",
        "note": "Agree first. Then split. Most people pick the second option — switching is always a headache — which reopens the conversation.",
        "branches": [
          {
            "label": "We're happy with what we have",
            "to": "happy_vendor"
          },
          {
            "label": "It's more the switching / timing",
            "to": "sell_test_drive"
          },
          {
            "label": "A little of both",
            "to": "sell_test_drive"
          }
        ]
      },
      "happy_vendor": {
        "label": "HAPPY WITH CURRENT SETUP",
        "say": "Totally respect that. Out of curiosity — are you using something like Breezeway for inspections, or is it more of an internal process your team built?",
        "note": "Research showed no Breezeway on their site. If she names a tool, learn what it is. If it's manual or internal, that's your opening. Either way you're gathering intel for future outreach.",
        "branches": [
          {
            "label": "We use [names a tool]",
            "to": "known_tool"
          },
          {
            "label": "It's internal / manual / checklists",
            "to": "internal_process_opening"
          },
          {
            "label": "I don't want to get into it",
            "to": "graceful_exit"
          }
        ]
      },
      "known_tool": {
        "label": "KNOWN TOOL",
        "say": "Got it — that's helpful to know. We actually sit on top of tools like that, not replace them. We just analyze the photos that are already being captured. But look, sounds like you're in a good spot. If anything ever changes or you want a second set of eyes on the photo workflow, I'm easy to find. Really appreciate your time, Danielle.",
        "note": "Don't push. Plant the seed and exit clean. She'll remember you if their current tool falls short. Add to a light follow-up sequence.",
        "branches": []
      },
      "internal_process_opening": {
        "label": "INTERNAL PROCESS — REOPEN",
        "say": "Yeah, that's actually what most of the companies I work with were doing before — internal checklists, cleaners taking photos. The thing that kept coming up was the photos were there but nobody had time to actually go through all of them. We basically just automate that review. You're probably not buying this right now, and I totally respect that — but would it be worth a quick look so you know it's out there when you're evaluating options down the road?",
        "note": "She said she's happy, but an internal process is always improvable. Low-pressure framing — position it as future awareness, not a sales pitch.",
        "branches": [
          {
            "label": "Sure, I'll take a look",
            "to": "book_meeting"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          },
          {
            "label": "No, we're good",
            "to": "graceful_exit"
          }
        ]
      },
      "not_interested": {
        "label": "NOT INTERESTED — OBJECTION",
        "say": "I totally get it — I should've assumed you'd be all set. Otherwise you probably would've reached out. Just so no one from my team cold calls you again — is it that this isn't a problem you're focused on right now, or is it more that you just hate cold calls?",
        "note": "Agree completely. Then split. Most people admit it's the cold call, not the topic — which gives you an opening to continue.",
        "branches": [
          {
            "label": "I just hate cold calls / bad timing",
            "to": "sell_test_drive"
          },
          {
            "label": "Not a priority / not a problem for us",
            "to": "minimal_pain"
          },
          {
            "label": "Both / just not interested",
            "to": "referral_attempt"
          }
        ]
      },
      "no_budget": {
        "label": "NO BUDGET — OBJECTION",
        "say": "Totally get it. Nowadays it's harder to keep a tool, let alone buy something new. Just so no one from my team bugs you again — is it that budget for this cycle is completely locked, or is it more that anything you try to buy has to go through a whole approval process?",
        "note": "Split the objection. If it's an approval process, offer the test drive as a way to build the internal case before budget opens.",
        "branches": [
          {
            "label": "Budget is locked / not spending right now",
            "to": "sell_test_drive"
          },
          {
            "label": "It's the approval process / multiple stakeholders",
            "to": "sell_test_drive"
          },
          {
            "label": "Just not the right time",
            "to": "sell_test_drive"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally fair. You're probably not buying this right now, and I respect that. But the people who end up moving on stuff like this are the ones who already know what's on their list when budget does open up. Would you be open to a quick look — not to buy anything, just so you know what's out there? If nothing else, I can walk you through what other vacation rental companies in California are doing with their inspection photos. Worst case you steal some ideas and we part as friends.",
        "note": "This is the test drive close. Low commitment. Peer benchmarking is the value prop for the meeting itself — not the product.",
        "branches": [
          {
            "label": "Okay, sure",
            "to": "book_meeting"
          },
          {
            "label": "Send me an email first",
            "to": "send_email"
          },
          {
            "label": "No, really not right now",
            "to": "referral_attempt"
          }
        ]
      },
      "referral_to_ops": {
        "label": "REFERRAL TO OPS",
        "say": "Oh yeah, that makes sense — as president you're probably not in the weeds on turnover photos day to day. Would it be Fernanda or someone on the ops side who owns that? If I can get a name I'll put something tailored together so it actually lands with the right person instead of going into a black hole.",
        "note": "You know Fernanda Navarro is Ops Manager, Janett Sanchez is Maintenance Director, and Rebecca Daigle is the Review Coordinator. If she names any of them, confirm and ask for a warm intro or permission to name-drop Danielle.",
        "branches": [
          {
            "label": "Yeah, talk to Fernanda / Janett / Rebecca",
            "to": "get_referral_details"
          },
          {
            "label": "Gives another name",
            "to": "get_referral_details"
          },
          {
            "label": "Just email me and I'll forward it",
            "to": "send_email"
          },
          {
            "label": "I handle it / I'm the right person",
            "to": "warm_discovery"
          }
        ]
      },
      "referral_attempt": {
        "label": "REFERRAL ATTEMPT",
        "say": "Totally understand. Last thing — is there someone on your ops team, maybe Fernanda or whoever runs the turnover side, who'd be better to loop in on something like this? I know you're busy running the whole show. If I can get a name I'll reach out directly so it doesn't land on your plate.",
        "note": "Even if she's done, try for the referral. Mentioning Fernanda by name shows you know the org and makes it easy for her to confirm or redirect. If she shuts it down, exit gracefully.",
        "branches": [
          {
            "label": "Yeah, reach out to [name]",
            "to": "get_referral_details"
          },
          {
            "label": "No, don't call anyone / we're all set",
            "to": "graceful_exit"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          }
        ]
      },
      "get_referral_details": {
        "label": "GET REFERRAL DETAILS",
        "say": "Perfect. And would it be okay if I mentioned you pointed me their way? Just so it doesn't feel like a total cold call on their end. What's the best way to reach them — do they have a direct line or is it through the main office?",
        "note": "Get permission to name-drop Danielle. Get the direct number or email. This turns your next call into a warm referral — completely different energy.",
        "branches": [
          {
            "label": "Sure, mention my name + gives contact info",
            "to": "referral_booked"
          },
          {
            "label": "Just call the main office and ask for them",
            "to": "referral_booked"
          },
          {
            "label": "Don't mention me / just reach out cold",
            "to": "referral_booked"
          }
        ]
      },
      "referral_booked": {
        "label": "REFERRAL LOCKED",
        "say": "Really appreciate that, Danielle. I'll reach out to them this week and keep it relevant. Thanks for taking my call — enjoy the rest of your day.",
        "note": "You got the referral. Stop talking. Note the name, number, email, and whether you can name-drop Danielle. Follow up with that person same day or next morning.",
        "branches": []
      },
      "include_ops_team": {
        "label": "INCLUDE OPS TEAM",
        "say": "Love that — honestly that's even better. Would it be Fernanda or your maintenance team too? The more context from the people actually doing turnovers, the more relevant I can make it. Want me to send the invite to you and you forward it, or should I loop them in directly?",
        "note": "Multi-stakeholder meeting is a great sign. Try to get Fernanda Navarro and/or Janett Sanchez on the call. Get their emails if you can. Rebecca Daigle would be the perfect end-user to demo for.",
        "branches": [
          {
            "label": "Send it to me, I'll forward",
            "to": "book_meeting"
          },
          {
            "label": "Here are their emails / loop them in",
            "to": "book_meeting"
          },
          {
            "label": "Let me check with them first",
            "to": "send_email"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next Tuesday and Wednesday open — does morning or afternoon work better for you? I'll send over a calendar invite right now so it doesn't get lost.",
        "note": "Lock it in NOW. Pick specific days. Get the exact time and confirm attendees. Send the invite while still on the phone. Once booked, STOP SELLING.",
        "branches": [
          {
            "label": "Picks a day/time",
            "to": "meeting_confirmed"
          },
          {
            "label": "Let me check my calendar and get back to you",
            "to": "send_email"
          }
        ]
      },
      "meeting_confirmed": {
        "label": "MEETING CONFIRMED",
        "say": "Perfect — you'll get the invite in the next couple minutes. Really appreciate you taking my call, Danielle. Talk to you then.",
        "note": "STOP. Don't add anything. Don't re-pitch. Send the invite immediately after hanging up. Include one line in the description: 'Quick look at how AI reviews turnover photos to catch damage before guests do — plus what other CA vacation rental companies are doing.' Send to danielle@crownpm.com.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most relevant to include so it's not just another generic pitch sitting in your inbox? Is it more the cost side, the ops side, or just a quick overview of what it actually does?",
        "note": "Accept the email request but ask what to include. This keeps the conversation going and gives you intel to tailor the follow-up. Send to danielle@crownpm.com. Include a specific time suggestion in the email.",
        "branches": [
          {
            "label": "Gives direction on what to include",
            "to": "email_confirmed"
          },
          {
            "label": "Just send me whatever / a general overview",
            "to": "email_confirmed"
          }
        ]
      },
      "email_confirmed": {
        "label": "EMAIL CONFIRMED",
        "say": "Done — I'll get that over to you today. It's danielle at crownpm, right? I'll throw in a couple time options in case you want to do a quick call after you've had a chance to look it over. Appreciate your time, Danielle.",
        "note": "Confirm the email address. Mention you'll include time options — this sets up the follow-up call. Send within 1 hour. Follow up by phone in 2-3 business days if no reply.",
        "branches": []
      },
      "book_callback": {
        "label": "BOOK CALLBACK",
        "say": "Perfect — I'll try you then. Is this the best number to reach you on? Talk to you soon, Danielle.",
        "note": "Confirm the number. Add callback to your calendar immediately. When you call back, open with: 'Hey Danielle — Sam Parks, you told me to try you back today.' Then go straight to the pain trigger.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes on your end, I'm easy to find — Sam Parks, RapidEye. Appreciate your time, Danielle. Have a good one.",
        "note": "Don't burn the bridge. Add her to a low-touch follow-up sequence — one email in 2 weeks, another in 6 weeks. No more cold calls unless something changes in their org or you get a referral in.",
        "branches": []
      }
    }
  }
}