{
  "name": "David L. Bodenhamer",
  "title": "Partner, Owner-operator, Department Manager",
  "company": "Young's Suncoast Realty & Vacation Rentals",
  "location": "Gulf Shores, AL",
  "phone": "+1-251-968-2820",
  "company_phone": "+1-251-968-7158",
  "alt_phones": [],
  "flow": {
    "context": "David L. Bodenhamer is the partner and owner-operator of Young's Suncoast Realty & Vacation Rentals in Gulf Shores, AL — he has been in the business since 1975 and the company has managed vacation rentals for 50 years. They run 250+ vacation rental units plus condo association management for properties like Crystal Tower and Boardwalk, with dedicated Property Care Specialists doing post-clean inspections and an in-house maintenance team performing 10 preventative visits per year. His daughter Jordan recently took over as Qualifying Broker in September 2024, signaling a generational leadership transition. No Breezeway or Matterport usage found — likely manual inspections. No shared schools or cities with Sam — lead with Gulf Coast vacation rental industry proximity and their explicit thorough-inspection positioning.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey David — I work with a few other vacation rental managers along the Gulf Coast on their inspection workflows. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Feet up on the desk energy. You're calling a peer, not pitching. Slow down, pause naturally after the question. Let him answer.",
        "branches": [
          {
            "label": "No / Who? / Don't think so",
            "to": "heard_no"
          },
          {
            "label": "Yeah / Maybe / Sounds familiar",
            "to": "heard_yes"
          },
          {
            "label": "Busy / Bad time / Can't talk",
            "to": "bad_timing"
          },
          {
            "label": "Who is this? / What's this about?",
            "to": "permission_fallback"
          }
        ]
      },
      "heard_no": {
        "label": "HAVEN'T HEARD — TRANSITION TO PAIN",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call is — I actually work with another property manager in a pretty similar spot to you guys. They run about 300 units on the coast, full-service, in-house maintenance team, the whole deal. And the thing they kept running into was — their cleaners would take photos after every turnover, inspectors would do their walkthrough, and stuff was still slipping through. A stain on a couch cushion nobody flagged, a chipped countertop that showed up in a photo three turnovers ago but nobody caught it. And then the owner finds out before they do. With 250-plus units turning over in peak season on the Gulf, that's a lot of photos nobody really has time to look at carefully.",
        "note": "Pause here. Let him react. Do not rush to the solution. You want him to feel this — he has lived it for 50 years. The silence after this is where the magic happens.",
        "branches": [
          {
            "label": "Yeah that's real / We deal with that / Relates to the problem",
            "to": "warm_response"
          },
          {
            "label": "We've got a pretty good process / Our inspections are solid",
            "to": "objection_have_process"
          },
          {
            "label": "Not really interested / We're all set",
            "to": "objection_not_interested"
          },
          {
            "label": "What do you do about it? / How do you solve that?",
            "to": "solution_bridge"
          }
        ]
      },
      "heard_yes": {
        "label": "THEY'VE HEARD OF SAM",
        "say": "Oh nice — well normally we'd be working with someone like you. What'd you hear?",
        "note": "Let him talk. Whatever he says, use it to bridge into discovery or the pain trigger. Don't correct him if he's off — just redirect naturally.",
        "branches": [
          {
            "label": "Vague / Not sure / Someone mentioned it",
            "to": "warm_response"
          },
          {
            "label": "Something about inspections / AI photos",
            "to": "solution_bridge"
          },
          {
            "label": "Actually I haven't, just being polite",
            "to": "heard_no"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again later this week? Maybe Thursday or Friday?",
        "note": "Don't push. Lock in a specific day. If he gives you a window, take it and end clean. His direct line is 251-968-2820 and mobile is 251-979-1020 — note which one you reached him on.",
        "branches": [
          {
            "label": "Sure try me Thursday / Friday / next week",
            "to": "bad_timing_callback"
          },
          {
            "label": "What's this about? Give me the quick version",
            "to": "heard_no"
          },
          {
            "label": "No don't call back / Not interested",
            "to": "ending_graceful"
          }
        ]
      },
      "bad_timing_callback": {
        "label": "CALLBACK LOCKED",
        "say": "Perfect — I'll try you Thursday afternoon. Appreciate it, David.",
        "note": "Write down the exact day and time. Call back exactly when you said. That builds trust before you even pitch.",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call, I'll be honest. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not a fit?",
        "note": "Disarming honesty. Most people give you the 30 seconds when you acknowledge reality. Smile when you say this.",
        "branches": [
          {
            "label": "Sure / Go ahead / You've got 30 seconds",
            "to": "heard_no"
          },
          {
            "label": "No / I'm good / Not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED — SPLIT",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and this just isn't interesting?",
        "note": "Two doors. One leads back to a callback. One leads to a real conversation about why not. Either way you learn something.",
        "branches": [
          {
            "label": "Bad time / Just busy right now",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / Don't need it",
            "to": "objection_not_interested"
          },
          {
            "label": "Don't call again",
            "to": "ending_graceful"
          }
        ]
      },
      "warm_response": {
        "label": "THEY'RE WARM — STOP PITCHING, START ASKING",
        "say": "Yeah — so that's what we've been hearing from a lot of folks along the Gulf. Out of curiosity, what does your inspection process look like right now after a cleaner finishes a turnover?",
        "note": "He's engaged. Do NOT pitch. Ask questions. Let him talk about his world. You are learning, not selling. He's proud of his operation — let him show it off.",
        "branches": [
          {
            "label": "Describes process — inspectors walk through, photos, checklists",
            "to": "discovery_photo_volume"
          },
          {
            "label": "Our Property Care Specialists handle it / We have inspectors",
            "to": "discovery_pain_points"
          },
          {
            "label": "It's a lot / Pretty manual honestly",
            "to": "discovery_pain_points"
          },
          {
            "label": "Why do you ask? / Gets guarded",
            "to": "solution_bridge"
          }
        ]
      },
      "discovery_photo_volume": {
        "label": "DIG INTO PHOTO VOLUME",
        "say": "Got it. And with 250-plus units — during a peak summer week, roughly how many turnovers are you doing? And are those cleaners or inspectors taking photos every time?",
        "note": "You want to quantify the problem. More turnovers and photos means stronger case. Gulf Shores peak is Memorial Day through Labor Day — he knows the volume.",
        "branches": [
          {
            "label": "Gives numbers / Yes lots of photos",
            "to": "discovery_pain_points"
          },
          {
            "label": "Not sure / Would have to ask the ops team",
            "to": "referral_attempt"
          },
          {
            "label": "We don't take that many photos",
            "to": "discovery_pain_points"
          }
        ]
      },
      "discovery_pain_points": {
        "label": "DIG INTO PAIN POINTS",
        "say": "Makes sense. So when something does slip through — a damage that gets missed or something that should've been flagged between turnovers — how does that usually surface? Is it the guest complaining, or the owner finding it, or your team catching it later?",
        "note": "You want the emotional pain. Owners discovering damage before the PM team is a nightmare for someone who built a 50-year reputation on thorough inspections.",
        "branches": [
          {
            "label": "Yeah owners find stuff / Guest complaints / It happens",
            "to": "discovery_owner_impact"
          },
          {
            "label": "Rarely happens / We catch most things",
            "to": "discovery_scale_challenge"
          },
          {
            "label": "That's more of a Jordan question / Someone else handles that",
            "to": "referral_attempt"
          }
        ]
      },
      "discovery_owner_impact": {
        "label": "OWNER IMPACT — DEEPEN",
        "say": "Yeah — that's exactly what I keep hearing. Especially with the condo association side too, right? You're managing Crystal Tower, Boardwalk — those owners are paying close attention. Has that been getting harder to stay on top of as the portfolio's grown?",
        "note": "You just showed you know his specific properties by name. That builds credibility fast. Don't overdo it — one or two specifics is enough.",
        "branches": [
          {
            "label": "Yeah it's a lot / Growing pains / Acknowledges challenge",
            "to": "solution_bridge"
          },
          {
            "label": "We handle it fine / Pushes back",
            "to": "solution_bridge"
          },
          {
            "label": "How do you know about our properties?",
            "to": "credibility_bridge"
          }
        ]
      },
      "discovery_scale_challenge": {
        "label": "PROBE THE SCALE CHALLENGE",
        "say": "That's impressive honestly — 50 years of doing this, you guys clearly have a dialed-in process. The thing I keep hearing from managers at your scale is it's not that the process is bad, it's that peak season volume just makes it physically impossible to give every photo the same attention. Is that fair, or is it genuinely not an issue for you?",
        "note": "Compliment the process, then reframe the problem as a scale issue, not a competence issue. David has enormous pride in 50 years of operations — respect it.",
        "branches": [
          {
            "label": "Yeah peak season is tough / Fair point",
            "to": "solution_bridge"
          },
          {
            "label": "Honestly we're good / It's handled",
            "to": "objection_have_process"
          },
          {
            "label": "What exactly are you proposing?",
            "to": "solution_bridge"
          }
        ]
      },
      "credibility_bridge": {
        "label": "CREDIBILITY BRIDGE",
        "say": "Ha — no I just did my homework before calling. I work with vacation rental managers specifically, so I actually try to understand the operation before I pick up the phone. You guys are one of the more impressive ones I've looked at honestly — 50 years, in-house maintenance, the whole Property Care Specialist setup. That's rare.",
        "note": "Genuine compliment, then transition naturally back to the problem or solution. Don't linger here.",
        "branches": [
          {
            "label": "Appreciates it / Opens up more",
            "to": "solution_bridge"
          },
          {
            "label": "So what do you actually do?",
            "to": "solution_bridge"
          }
        ]
      },
      "solution_bridge": {
        "label": "ONE-SENTENCE SOLUTION + CTA",
        "say": "So what we built — it's pretty simple actually. We plug into whatever system your team is already using to take photos during turnovers, and our AI analyzes every photo automatically. Flags damage, missing items, staging issues — stuff a human eye would catch if they had unlimited time to stare at every single image. No workflow change for your cleaners or inspectors. Would you be open to taking a look sometime this week when I'm not cold calling you out of the blue?",
        "note": "One breath. Then stop talking. Let him respond. You are asking for a meeting, not a sale. The pause after this question is critical.",
        "branches": [
          {
            "label": "Yeah I'd take a look / Sure",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first / Email me",
            "to": "send_email"
          },
          {
            "label": "What does it cost? / What's the pricing?",
            "to": "pricing_deflect"
          },
          {
            "label": "Not interested / We're all set",
            "to": "objection_not_interested"
          },
          {
            "label": "I'm not the right person / Talk to Jordan",
            "to": "referral_jordan"
          },
          {
            "label": "We don't have budget for that",
            "to": "objection_no_budget"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Perfect. I've got next week pulled up — how does Tuesday or Wednesday afternoon look for you? Just 20 minutes, I'll show you exactly what it looks like on a real property.",
        "note": "Pick specific days. Don't say whenever works. Lock it in NOW. If he says a day, confirm the exact time immediately.",
        "branches": [
          {
            "label": "Gives a day or time",
            "to": "meeting_booked"
          },
          {
            "label": "Let me check my calendar / I'll get back to you",
            "to": "pin_down_meeting"
          },
          {
            "label": "Can Jordan or someone else sit in?",
            "to": "meeting_with_jordan"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING LOCKED — WRAP UP",
        "say": "Awesome — I'll send over a calendar invite right now so it's locked in. Really appreciate you taking my call, David. Talk to you then.",
        "note": "Send the invite WHILE on the phone. Stop selling. Don't add anything. End clean.",
        "branches": []
      },
      "pin_down_meeting": {
        "label": "PIN DOWN THE MEETING",
        "say": "Totally get it. How about I throw a placeholder on for Wednesday at 2 PM and if you need to move it, just let me know? That way it doesn't fall off both our radars.",
        "note": "Don't let it float. A placeholder is better than I'll follow up. If he still pushes, offer to send email with a specific time.",
        "branches": [
          {
            "label": "Sure that works",
            "to": "meeting_booked"
          },
          {
            "label": "Just email me",
            "to": "send_email"
          }
        ]
      },
      "meeting_with_jordan": {
        "label": "MEETING WITH JORDAN TOO",
        "say": "That'd be great actually — Jordan would probably want to see this given her property management background and the business development side. Want me to loop her in on the invite? I'll send it to both of you.",
        "note": "This is a huge win. Getting both the owner and the new Qualifying Broker on one call is ideal. Jordan has ops experience AND she's driving business development.",
        "branches": [
          {
            "label": "Yeah include her / Sure",
            "to": "meeting_booked"
          },
          {
            "label": "Let me talk to her first",
            "to": "send_email"
          }
        ]
      },
      "pricing_deflect": {
        "label": "PRICING QUESTION — DEFLECT TO MEETING",
        "say": "Yeah good question — it honestly depends on the unit count and turnover volume, so I don't want to throw a number out that's wrong. That's actually one of the things we'd cover in a quick call. For most companies at your size it ends up paying for itself pretty fast just on the damage recovery side. Would it make sense to walk through it together for like 20 minutes?",
        "note": "Don't quote pricing on a cold call. Bridge to the meeting. The ROI framing is real — damage detection pays for the tool.",
        "branches": [
          {
            "label": "Sure / Yeah let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Just ballpark me",
            "to": "pricing_ballpark"
          },
          {
            "label": "We don't have budget",
            "to": "objection_no_budget"
          }
        ]
      },
      "pricing_ballpark": {
        "label": "PRICING BALLPARK — REDIRECT",
        "say": "For 250-ish units you're probably looking at a few hundred bucks a month range — but honestly the better question is how much you're losing to missed damage right now. Most of the managers I work with tell me it's way more than they thought once they actually track it. That's part of what I'd show you. Worth 20 minutes?",
        "note": "Keep it vague but honest. Immediately redirect to ROI and the meeting. Don't get into a pricing negotiation on a cold call.",
        "branches": [
          {
            "label": "Okay let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "Let me think about it / Send me info",
            "to": "send_email"
          }
        ]
      },
      "objection_not_interested": {
        "label": "NOT INTERESTED — AGREE + SPLIT",
        "say": "I totally get it. I should've assumed you'd be all set — otherwise you probably would've reached out to us. Just so no one from my team cold calls you again — is it that this isn't really a problem you're focused on right now, or is it more that you just hate cold calls?",
        "note": "Agree first. Don't argue. The split gives him two doors — one emotional, one logical. Either one gives you a path forward.",
        "branches": [
          {
            "label": "I just hate cold calls / Bad timing",
            "to": "hate_cold_calls"
          },
          {
            "label": "Not a priority / We're focused on other things",
            "to": "not_priority_reframe"
          },
          {
            "label": "Both / Just don't call again",
            "to": "referral_attempt_last"
          }
        ]
      },
      "hate_cold_calls": {
        "label": "HATES COLD CALLS — OFFER VALUE",
        "say": "Ha — honestly, fair. I hate making them too. Look, I won't take up more of your time. But if nothing else, I could send you a quick breakdown of what a couple other Gulf Coast PM companies are doing with their turnover photos to catch damage faster. Worst case you steal some ideas and we part as friends. Fair?",
        "note": "You're offering value with zero obligation. This plants a seed and gives you permission to follow up by email.",
        "branches": [
          {
            "label": "Sure send it over",
            "to": "send_email"
          },
          {
            "label": "No I'm good",
            "to": "referral_attempt_last"
          }
        ]
      },
      "not_priority_reframe": {
        "label": "NOT A PRIORITY — REFRAME",
        "say": "Totally makes sense. You're probably not buying anything right now and I respect that. But when it does come back around — especially heading into summer — the people who move fastest are the ones who already know what's out there. Would you be open to a quick look just so it's on your radar? Not for now, just so you know it exists when timing's right.",
        "note": "Gulf Shores summer season is the natural urgency lever — David knows exactly what peak volume feels like. Plant the seed for future without being pushy.",
        "branches": [
          {
            "label": "Okay fine / I guess that's fair",
            "to": "book_meeting"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          },
          {
            "label": "No really not interested",
            "to": "referral_attempt_last"
          }
        ]
      },
      "objection_have_process": {
        "label": "ALREADY HAVE A PROCESS — AGREE + SPLIT",
        "say": "That makes total sense — with 250-plus units you'd have to have something dialed in. Just so nobody from my team bugs you about this again — is it that you're fully covered and happy with how it's working, or is it more that switching anything right now would just be a headache?",
        "note": "Research shows no Breezeway or Matterport — likely manual inspections or a basic tool. The split exposes whether it's real satisfaction or change-aversion inertia.",
        "branches": [
          {
            "label": "We're happy with what we have / It works fine",
            "to": "process_happy_probe"
          },
          {
            "label": "Switching would be a pain / Too much going on",
            "to": "sell_test_drive"
          },
          {
            "label": "What would it even replace?",
            "to": "solution_bridge"
          }
        ]
      },
      "process_happy_probe": {
        "label": "HAPPY WITH PROCESS — LIGHT PROBE",
        "say": "Love to hear it honestly. Out of curiosity — are your Property Care Specialists reviewing every photo manually after each turnover, or do you have software helping with that part?",
        "note": "Reference their own terminology — Property Care Specialists. If it's manual, that's your opening. If they name software, that's gold intel for integration positioning.",
        "branches": [
          {
            "label": "It's manual / Our inspectors walk through",
            "to": "manual_process_hook"
          },
          {
            "label": "We use software / We have a system",
            "to": "existing_software_probe"
          },
          {
            "label": "I'd have to ask / That's more of an ops question",
            "to": "referral_attempt"
          }
        ]
      },
      "manual_process_hook": {
        "label": "MANUAL PROCESS — REFRAME",
        "say": "Yeah that's exactly what most companies at your size are doing. And it works — until summer hits and you're doing a hundred-plus turnovers a week. That's when stuff starts falling through the cracks. We're not replacing your inspectors — we're just giving them a second set of eyes that never gets tired. Would you be open to seeing what that looks like on one of your actual properties? Twenty minutes, no commitment.",
        "note": "Frame as augmenting the team, not replacing it. David built this operation over decades — don't imply it's broken. It's an enhancement for scale.",
        "branches": [
          {
            "label": "Okay sure / I'll take a look",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Still not sure we need it",
            "to": "sell_test_drive"
          }
        ]
      },
      "existing_software_probe": {
        "label": "EXISTING SOFTWARE — LEARN MORE",
        "say": "Oh interesting — what are you guys using?",
        "note": "Research found no Breezeway or Matterport. Whatever he names is gold intel. If it's a PMS with basic photo capture, RapidEye layers on top — it does not replace it. Just listen.",
        "branches": [
          {
            "label": "Names a tool — Breezeway, Track, etc.",
            "to": "integrates_with_tool"
          },
          {
            "label": "Homegrown / Spreadsheets / Basic system",
            "to": "manual_process_hook"
          },
          {
            "label": "Not sure / Would have to check",
            "to": "referral_attempt"
          }
        ]
      },
      "integrates_with_tool": {
        "label": "THEY USE A TOOL — INTEGRATION PLAY",
        "say": "Oh perfect — we actually plug right into that. We're not replacing anything, we just sit on top and analyze the photos your team's already uploading. Same workflow, same tool, we just make sure nothing slips through. Would you be open to seeing how that works? Quick 20-minute call.",
        "note": "Integration and zero workflow change is the key for a 50-year-old company. David's team has been doing things their way for decades. Respect that.",
        "branches": [
          {
            "label": "Sure let's take a look",
            "to": "book_meeting"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          },
          {
            "label": "We're happy as-is",
            "to": "sell_test_drive"
          }
        ]
      },
      "objection_no_budget": {
        "label": "NO BUDGET — AGREE + SPLIT",
        "say": "Totally get it. Nowadays it's harder to keep a tool, let alone buy something new. Just so nobody bugs you again — is it that budget for this kind of thing is completely locked up, or is it more that anything new has to go through a whole approval process?",
        "note": "You're finding out if it's a real constraint or a buying process issue. If there's a CFO gate, that's Patrick Avinger — you already have his direct line and email.",
        "branches": [
          {
            "label": "Budget is tight / Locked up right now",
            "to": "sell_test_drive"
          },
          {
            "label": "Everything has to get approved / It's a process",
            "to": "sell_test_drive_approval"
          },
          {
            "label": "It's just not a priority spend",
            "to": "not_priority_reframe"
          }
        ]
      },
      "sell_test_drive_approval": {
        "label": "APPROVAL PROCESS — POSITION AS PREP",
        "say": "Yeah that makes total sense. Honestly that's even more reason to take a look now — so when you do go through that process, you already know exactly what it does, what it costs, and whether it's worth fighting for. Would you be open to a quick 20-minute walkthrough just so you've got the full picture? No pressure to buy, just information.",
        "note": "Reframe the approval hurdle as a reason to meet now, not later. If he mentions Patrick or a CFO needing to approve, offer to include them.",
        "branches": [
          {
            "label": "That makes sense / Sure",
            "to": "book_meeting"
          },
          {
            "label": "Send me something I can share internally",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "referral_attempt_last"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally respect that. You're probably not buying this right now. But when budget does free up — especially heading into summer — the people who move fast are the ones who already know what they want. Would you be open to just seeing what it looks like? Not a sales pitch, just a 20-minute walkthrough so it's on your radar. Worst case you steal some ideas for how other Gulf Coast managers are handling the photo problem and we part as friends.",
        "note": "The meeting IS the value even if he never buys. Gulf Shores summer season is the natural urgency — he knows what peak volume looks like better than anyone.",
        "branches": [
          {
            "label": "Alright fine / Sure why not",
            "to": "book_meeting"
          },
          {
            "label": "Send me an email first",
            "to": "send_email"
          },
          {
            "label": "No thanks / Really not interested",
            "to": "referral_attempt_last"
          }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One thing before I do — what would be most useful to include so it's not just another generic pitch sitting in your inbox? Are you more curious about the damage detection side, how it plugs into your current setup, or the ROI piece?",
        "note": "Qualify the email so it actually gets read. Whatever he says, tailor the follow-up exactly to that. Include a specific time suggestion for a follow-up call.",
        "branches": [
          {
            "label": "Gives a preference / Tells you what to include",
            "to": "email_confirm"
          },
          {
            "label": "Just send me whatever / General info",
            "to": "email_confirm"
          }
        ]
      },
      "email_confirm": {
        "label": "CONFIRM EMAIL + PLANT CALLBACK",
        "say": "Got it — I'll put something together and send it over today. Is dbodenhamer at youngssuncoast dot com the best one? And I'll toss a time suggestion in there in case you want to hop on a quick call after you've looked at it. Appreciate your time, David.",
        "note": "Confirm the email. The suggested callback in the email gives you a natural reason to follow up in a few days. Send it within 10 minutes of hanging up.",
        "branches": [
          {
            "label": "Confirms email / Yes that works",
            "to": "ending_graceful_warm"
          },
          {
            "label": "Gives a different email",
            "to": "ending_graceful_warm"
          }
        ]
      },
      "referral_attempt": {
        "label": "REFERRAL — FIND THE RIGHT PERSON",
        "say": "Makes total sense — you've got a lot on your plate running the whole operation. Who on your team typically owns the inspection workflow day to day? Is that Jordan, or is it one of your property managers?",
        "note": "David may delegate to Jordan (Qualifying Broker since Sep 2024, former floating PM), DeAnn Duhon (Crystal Tower PM), or Linda Tresler (Boardwalk PM). Get a specific name and permission to name-drop David.",
        "branches": [
          {
            "label": "Talk to Jordan / My daughter handles that",
            "to": "referral_jordan"
          },
          {
            "label": "Names a property manager or ops person",
            "to": "referral_ops"
          },
          {
            "label": "I handle it / No one specific",
            "to": "solution_bridge"
          }
        ]
      },
      "referral_jordan": {
        "label": "REFERRAL TO JORDAN",
        "say": "Perfect — Jordan would actually be great for this given her property management background. Would it help if I mentioned you pointed me her way, or would you rather I just reach out cold?",
        "note": "Getting David's blessing to name-drop is gold. Jordan's direct numbers are 251-948-0408 and 251-223-7564. She became Qualifying Broker Sep 2024 and used to be a floating Property Manager — she has hands-on ops experience.",
        "branches": [
          {
            "label": "Sure tell her I said to call / Use my name",
            "to": "referral_jordan_confirm"
          },
          {
            "label": "Just reach out to her directly",
            "to": "referral_jordan_confirm"
          }
        ]
      },
      "referral_jordan_confirm": {
        "label": "JORDAN REFERRAL LOCKED",
        "say": "Awesome — I'll reach out to her this week. Really appreciate you taking the time, David. And if you ever want to see it yourself, I'm easy to find.",
        "note": "You now have a warm intro to Jordan Bodenhamer. Call her next and lead with David pointed me your way. Send David a quick thank-you email too.",
        "branches": []
      },
      "referral_ops": {
        "label": "REFERRAL TO OPS PERSON",
        "say": "Got it. If I can get their name, I'll put something tailored together so it actually lands and doesn't feel like a random cold call. Who would that be?",
        "note": "You're looking for DeAnn Duhon (Crystal Tower PM), Linda Tresler (Boardwalk PM), or another ops team member. Get the name and ask if you can mention David sent you.",
        "branches": [
          {
            "label": "Gives a name",
            "to": "referral_ops_confirm"
          },
          {
            "label": "Let me have them call you / I'll pass it along",
            "to": "referral_ops_fallback"
          }
        ]
      },
      "referral_ops_confirm": {
        "label": "OPS REFERRAL LOCKED",
        "say": "Perfect — and would it be alright if I mention you sent me their way? Makes it a lot easier than cold calling them too. Appreciate your time, David.",
        "note": "Get the name, get permission to name-drop. Send a tailored email to that person referencing David within the hour.",
        "branches": []
      },
      "referral_ops_fallback": {
        "label": "THEY'LL PASS IT ALONG — ANCHOR FOLLOW-UP",
        "say": "Appreciate that. You know what — let me send you a quick one-pager you can forward to them. That way they've got context and it's not just some guy called. I'll keep it short. And if I don't hear back in a few days, mind if I give you a quick ring just to check in?",
        "note": "Don't let it die in the I'll pass it along graveyard. Give him something tangible to forward and set a callback expectation.",
        "branches": [
          {
            "label": "Sure that works",
            "to": "ending_graceful_warm"
          },
          {
            "label": "Just email me",
            "to": "email_confirm"
          }
        ]
      },
      "referral_attempt_last": {
        "label": "LAST CHANCE REFERRAL",
        "say": "Totally understand. Before I let you go — is there anyone else on your team who handles the property inspection or turnover workflow? I'd rather bug the right person than keep cold calling the wrong one.",
        "note": "One final shot at a referral. Even just a name is valuable. If he says Jordan, you have a warm lead. If he shuts it down completely, exit clean.",
        "branches": [
          {
            "label": "Talk to Jordan / Names someone",
            "to": "referral_jordan"
          },
          {
            "label": "Names another person on the team",
            "to": "referral_ops"
          },
          {
            "label": "No / Just don't call again",
            "to": "ending_graceful"
          }
        ]
      },
      "ending_graceful_warm": {
        "label": "WARM ENDING",
        "say": "Really appreciate your time, David. I'll get that over to you today. Have a good one.",
        "note": "Send the email within 10 minutes. Reference something specific from the conversation. Include a suggested meeting time. Set a follow-up reminder for 3 days later.",
        "branches": []
      },
      "ending_graceful": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes, I'm easy to find. Appreciate your time, David.",
        "note": "Don't burn the bridge. Log the call and note the objection. Set a reminder to try again in 60-90 days. You can also try Jordan at 251-948-0408 or Patrick Avinger at 251-968-2826 directly.",
        "branches": []
      }
    }
  }
}