{
  "name": "David Angotti",
  "title": "Chief Digital Officer",
  "company": "Casago",
  "location": "Cannon Beach, OR",
  "phone": "",
  "company_phone": "877-276-5745",
  "alt_phones": [],
  "flow": {
    "context": "David Angotti is Casago's brand-new Chief Digital Officer, hired in November 2025 specifically to spearhead digital strategy and roll out AI-powered systems across Casago's franchise network. This is a huge mandate — Casago acquired Vacasa in May 2025 and now manages 40,000+ vacation rental properties through distributed franchise teams, running Guesty as their PMS with a Breezeway relationship for safety/ops. David is based in Cannon Beach, OR, a coastal surf town. Strongest connection to Sam: David was literally hired to find and deploy AI-powered operational tools, which is exactly what RapidEye is — and Sam's a surfer who knows the Oregon coast.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey David — I saw Casago brought you on a couple months ago to lead the digital and AI rollout, especially after the Vacasa acquisition. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Sound like a peer, not a pitch. Feet-up energy. You know his mandate — show it immediately. Pause after the question and let him respond.",
        "branches": [
          {
            "label": "No, haven't heard of you",
            "to": "heard_no"
          },
          {
            "label": "Yeah / maybe / sounds familiar",
            "to": "heard_yes"
          },
          {
            "label": "Bad timing / busy / can't talk",
            "to": "bad_timing"
          },
          {
            "label": "Who is this? / What's this about?",
            "to": "permission_ask"
          }
        ]
      },
      "heard_no": {
        "label": "HAVEN'T HEARD — TRANSITION TO PAIN",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call — I've been working with a few other property management companies that went through something similar to what you guys are doing. They scaled up fast, ended up with tens of thousands of doors across a bunch of different local teams, and the big headache was that every location was documenting turnovers differently. Some teams were great with photos, some were just checking boxes, and corporate had basically zero visibility into what was actually happening at the property level across the network. We built an AI layer that sits on top of whatever they're already using — Breezeway, Guesty, whatever — and actually analyzes the turnover photos automatically. Catches damage, missing items, staging problems, without changing anyone's workflow. Would you be open to taking a look when I'm not cold calling you out of the blue?",
        "note": "This is the full pain trigger + solution + CTA. Slow down and pause after 'at the property level across the network' — let the pain land. Then deliver the solution in one breath. Don't rush the CTA.",
        "branches": [
          {
            "label": "Sure / yeah that could be interesting",
            "to": "warm_response"
          },
          {
            "label": "We already have something for that",
            "to": "have_vendor_objection"
          },
          {
            "label": "Not really interested",
            "to": "not_interested_objection"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          },
          {
            "label": "I'm not the right person for this",
            "to": "referral_ask"
          }
        ]
      },
      "heard_yes": {
        "label": "HEARD OF YOU — EXPLORE",
        "say": "Oh nice — well normally we'd be working with someone exactly in your seat. What'd you hear?",
        "note": "Let them talk. Don't correct or pitch. Listen for what they know and what matters to them. Mirror their language back.",
        "branches": [
          {
            "label": "Describes what they heard (vague or specific)",
            "to": "warm_response"
          },
          {
            "label": "Actually not sure / might be confusing it",
            "to": "heard_no"
          },
          {
            "label": "Yeah someone mentioned it but not interested",
            "to": "not_interested_objection"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again later this week? Maybe Thursday or Friday?",
        "note": "Respect the timing but lock a specific callback window. Don't pitch anything here — just get permission to call again.",
        "branches": [
          {
            "label": "Sure, try me Thursday / Friday",
            "to": "bad_timing_lock"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          },
          {
            "label": "What's this about? (now curious)",
            "to": "heard_no"
          },
          {
            "label": "No, don't call back",
            "to": "end_graceful"
          }
        ]
      },
      "bad_timing_lock": {
        "label": "LOCK CALLBACK TIME",
        "say": "Perfect — I've got Thursday pulled up. Would morning or afternoon work better for you?",
        "note": "Get as specific as possible. Morning vs afternoon, then narrow to a time. Treat this like booking a meeting.",
        "branches": [
          {
            "label": "Gives a time preference",
            "to": "confirm_callback"
          },
          {
            "label": "Just whenever / doesn't commit",
            "to": "confirm_callback"
          }
        ]
      },
      "confirm_callback": {
        "label": "CONFIRM CALLBACK",
        "say": "Got it — I'll try you Thursday. Really appreciate it, David. Talk soon.",
        "note": "Keep it short. Don't pitch. You have permission to call back — that's the win. Log it immediately.",
        "branches": []
      },
      "permission_ask": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — it is a cold call, I'll be honest. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not relevant?",
        "note": "Disarm with honesty. The 'hang up on me' line gives them control, which paradoxically makes them more likely to listen.",
        "branches": [
          {
            "label": "Okay, go ahead / 30 seconds",
            "to": "heard_no"
          },
          {
            "label": "No / not interested / take me off your list",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED — SPLIT",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it more that you already know what we do and it's just not interesting?",
        "note": "This splits the objection. If it's timing, you get a callback. If it's disinterest, you learn why and can pivot or exit gracefully.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / don't need it",
            "to": "not_interested_last_shot"
          },
          {
            "label": "I'm not the right person",
            "to": "referral_ask"
          }
        ]
      },
      "not_interested_last_shot": {
        "label": "LAST SHOT — VALUE OFFER",
        "say": "Totally respect that. Honestly the only reason I reached out is because your role is literally about rolling out AI tools across the network, and we've been doing exactly that for a few other PM companies at scale. If nothing else, I could share what we're seeing other companies do with their turnover data post-acquisition — worst case you steal some ideas and we part as friends. But if it's a hard no, I totally get it.",
        "note": "This is your last swing. If they say no again, exit gracefully. Don't push past two no's. The 'steal some ideas' framing makes the meeting valuable even if he never buys.",
        "branches": [
          {
            "label": "Okay fine, what do you have",
            "to": "warm_response"
          },
          {
            "label": "No thanks",
            "to": "end_graceful"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          }
        ]
      },
      "warm_response": {
        "label": "THEY'RE WARM — STOP PITCHING, START ASKING",
        "say": "Awesome. So I don't waste your time — you're a couple months into the CDO role now. What's been the biggest priority so far in terms of the digital and AI rollout?",
        "note": "STOP SELLING. You're in discovery mode now. Let David talk about his world. Listen for: what tools he's evaluating, what problems he's solving first, who else is involved in decisions, what the timeline looks like. Take notes.",
        "branches": [
          {
            "label": "Talks about AI / digital priorities",
            "to": "discovery_ai_rollout"
          },
          {
            "label": "Talks about post-acquisition integration challenges",
            "to": "discovery_post_acquisition"
          },
          {
            "label": "Talks about ops / inspection / turnover challenges",
            "to": "discovery_current_process"
          },
          {
            "label": "Asks what RapidEye actually does",
            "to": "explain_rapideye"
          }
        ]
      },
      "discovery_ai_rollout": {
        "label": "DISCOVERY — AI ROLLOUT PRIORITIES",
        "say": "That makes a lot of sense. Where does the inspection and turnover side of things fall on that priority list? Like when a cleaner finishes a unit and takes photos — is there anything in place right now that actually reviews those automatically, or is that still pretty manual across the franchise network?",
        "note": "You're steering toward RapidEye's sweet spot without pitching. Listen for whether they have a current solution, how bad the pain is, and whether turnover quality is on his radar.",
        "branches": [
          {
            "label": "It's manual / inconsistent / a known problem",
            "to": "pain_confirmed"
          },
          {
            "label": "We use Breezeway for that",
            "to": "breezeway_pivot"
          },
          {
            "label": "That's more of an ops thing, not my focus",
            "to": "referral_ask"
          },
          {
            "label": "We have something but it's not great",
            "to": "pain_confirmed"
          }
        ]
      },
      "discovery_post_acquisition": {
        "label": "DISCOVERY — POST-ACQUISITION INTEGRATION",
        "say": "Yeah I can only imagine — integrating 40,000-plus doors across different franchise teams, everyone running their own playbook. On the inspection and turnover side specifically, how standardized is that right now? Like are all the franchisees documenting turnovers the same way, or is it kind of all over the place?",
        "note": "The Vacasa acquisition is a massive pain multiplier. Every franchise doing things differently means zero consistency and zero corporate visibility. This is where RapidEye shines — one AI layer across everything.",
        "branches": [
          {
            "label": "It's inconsistent / we're working on standardizing",
            "to": "pain_confirmed"
          },
          {
            "label": "We use Breezeway / Guesty for that",
            "to": "breezeway_pivot"
          },
          {
            "label": "That's more the ops team's world, not mine directly",
            "to": "referral_ask"
          }
        ]
      },
      "discovery_current_process": {
        "label": "DISCOVERY — CURRENT TURNOVER PROCESS",
        "say": "Got it. So when a cleaner finishes a unit and takes their photos — what happens to those photos right now? Does someone actually review every single one, or do they mostly just sit in Breezeway or wherever unless there's a guest complaint?",
        "note": "Most companies collect tons of turnover photos that nobody ever looks at. They sit in Breezeway or a folder until something goes wrong. This is the gap RapidEye fills. If they mention Breezeway, lean into the integration angle.",
        "branches": [
          {
            "label": "Nobody really reviews them / they pile up",
            "to": "pain_confirmed"
          },
          {
            "label": "We have a process but it's not great",
            "to": "pain_confirmed"
          },
          {
            "label": "We use Breezeway and it works fine",
            "to": "breezeway_pivot"
          }
        ]
      },
      "explain_rapideye": {
        "label": "EXPLAIN RAPIDEYE — KEEP IT BRIEF",
        "say": "Yeah so in a nutshell — you know how your teams are already taking photos during turnovers, probably through Breezeway or just on their phones? We plug into that existing flow and use AI to actually analyze every photo automatically. It flags damage, missing items, staging issues — stuff that would normally take a human reviewer hours, or just never get caught at all. No workflow change for the cleaners, no new app. And at your scale — 40,000-plus doors — there's just no way a human reviews every photo from every turnover. That's the gap we fill.",
        "note": "One breath. Keep it tight. Then pivot back to asking questions — don't let this become a monologue. If he asks a technical question, that's a buy signal.",
        "branches": [
          {
            "label": "That's interesting, tell me more",
            "to": "pain_confirmed"
          },
          {
            "label": "How does it integrate with our stack?",
            "to": "integration_question"
          },
          {
            "label": "We already have something like that",
            "to": "have_vendor_objection"
          },
          {
            "label": "Who else is using this?",
            "to": "social_proof"
          }
        ]
      },
      "pain_confirmed": {
        "label": "PAIN CONFIRMED — BRIDGE TO MEETING",
        "say": "Yeah that's exactly what we keep hearing. And honestly at 40,000-plus properties across a franchise network, the math just doesn't work for manual review. That's really why I called — I think there's a version of this that fits right into what you're already building out on the digital side. I don't want to take up your whole afternoon on a cold call though. Would it make sense to carve out 20 minutes this week or next so I can show you what it actually looks like inside a Breezeway or Guesty workflow? Worst case it gives you another data point for the AI roadmap.",
        "note": "You've confirmed pain. Now book the meeting. Stop adding features or selling. Suggest specific days — make it easy to say yes. '20 minutes' is low commitment. 'Worst case another data point for the AI roadmap' speaks directly to his CDO mandate.",
        "branches": [
          {
            "label": "Yeah let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "I'd need to loop in Carlos / our CTO / someone else",
            "to": "loop_in_others"
          },
          {
            "label": "Timing isn't great right now",
            "to": "timing_objection"
          }
        ]
      },
      "breezeway_pivot": {
        "label": "BREEZEWAY MENTIONED — COMPLEMENT, DON'T COMPETE",
        "say": "Oh perfect, you're already on Breezeway — that actually makes this way easier. So Breezeway's great for the workflow piece — assigning tasks, checklists, collecting photos. But the gap we keep seeing is that nobody's actually looking at those photos after they get uploaded. They just sit there unless something goes wrong. We plug directly into Breezeway and run AI analysis on every photo that comes through — so instead of a manager trying to spot-check a fraction of turnovers, every single one gets reviewed automatically. It's kind of like giving Breezeway eyes. Does that match what you're seeing on your end?",
        "note": "Breezeway is a complement, NOT a competitor. Make that crystal clear. RapidEye adds the analysis layer that Breezeway doesn't have. End with a question to keep them talking.",
        "branches": [
          {
            "label": "Yeah that makes sense / that is a gap we have",
            "to": "pain_confirmed"
          },
          {
            "label": "Interesting — how does the integration actually work?",
            "to": "integration_question"
          },
          {
            "label": "We're happy with Breezeway as-is",
            "to": "have_vendor_objection"
          }
        ]
      },
      "integration_question": {
        "label": "INTEGRATION QUESTION — TECHNICAL CREDIBILITY",
        "say": "Yeah so we plug into your existing stack — Breezeway, Guesty, whatever you're running. Photos flow through the normal turnover workflow, we analyze them in real time, and the results show up as flagged issues your team can act on. No new app for the cleaners, no workflow change on their end. The technical setup is honestly pretty lightweight — my co-founder Rohan is the one who built the integration layer, he's got a Masters in AI Engineering from CMU, four patents in computer vision. He'd be the right person to walk Carlos through the technical side if that's helpful. Would it make sense to get 20 minutes on the calendar — you, maybe Carlos, and us — so Rohan can show the integration and you can see what the output actually looks like?",
        "note": "Mentioning Rohan's credentials and CMU adds technical credibility. Suggesting Carlos Corzo (their CTO) be included shows you know the org chart. Don't oversell the tech — keep it practical.",
        "branches": [
          {
            "label": "Yeah let's set that up",
            "to": "book_meeting"
          },
          {
            "label": "Let me check with Carlos first",
            "to": "loop_in_others"
          },
          {
            "label": "Send me something I can forward to the team",
            "to": "send_email"
          }
        ]
      },
      "social_proof": {
        "label": "SOCIAL PROOF — WHO ELSE USES THIS",
        "say": "Yeah so right now we're working with a luxury PM company in New York — about 200 high-end homes — and another group on the East Coast running around 600 properties. Also a portfolio out in Dubai. The New York one is probably the most relevant for you — similar deal where they had distributed cleaning teams, inconsistent documentation, and the AI is catching stuff their manual QA was missing every single day. The scale is obviously different from 40,000 doors, but the problem's the same — just way bigger for you guys.",
        "note": "Be honest about current traction. Don't inflate. The relevance is the problem match, not the exact scale match. If he pushes on scale, pivot to the pilot framing.",
        "branches": [
          {
            "label": "Interesting — what kind of results are they seeing?",
            "to": "pain_confirmed"
          },
          {
            "label": "We're a lot bigger than those companies",
            "to": "scale_response"
          },
          {
            "label": "That's helpful — let's set up a call",
            "to": "book_meeting"
          }
        ]
      },
      "scale_response": {
        "label": "SCALE CONCERN — REFRAME AS ADVANTAGE",
        "say": "Totally — and that's actually part of why I reached out to you specifically. At 40,000 doors across a franchise network, you can't solve this with people. The math just doesn't work. That's exactly where an AI layer makes the most sense — it scales infinitely and it doesn't get tired after photo number 500. A pilot with one franchise market would be the way to prove it out before rolling anything network-wide. Would you be open to exploring what that looks like?",
        "note": "Acknowledge the scale gap honestly, then reframe it as why they NEED AI more than smaller operators. Pilot framing de-risks the decision — he's not committing to 40,000 doors, just one market.",
        "branches": [
          {
            "label": "Yeah a pilot could make sense",
            "to": "book_meeting"
          },
          {
            "label": "I'd need to involve other people for that",
            "to": "loop_in_others"
          },
          {
            "label": "Not right now",
            "to": "timing_objection"
          }
        ]
      },
      "have_vendor_objection": {
        "label": "OBJECTION — ALREADY HAVE SOMETHING",
        "say": "That makes total sense — with 40,000-plus properties and the Vacasa integration, you'd have to have something in place. Just so nobody from my team cold calls you again — is it that you're fully covered and happy with how turnover photos are being reviewed across the network, or is it more that adding anything new right now during the integration would just be a headache?",
        "note": "Split the objection. 'Fully covered and happy' vs 'adding something is a headache right now' — these require completely different responses. The acquisition reference shows you understand their world. Listen carefully.",
        "branches": [
          {
            "label": "We're happy with what we have",
            "to": "happy_with_vendor"
          },
          {
            "label": "It's more the timing / integration headache",
            "to": "timing_objection"
          },
          {
            "label": "Honestly it's not perfect but we're making it work",
            "to": "pain_confirmed"
          }
        ]
      },
      "happy_with_vendor": {
        "label": "HAPPY WITH VENDOR — SELL THE TEST DRIVE",
        "say": "Respect that. Honestly, I'm not asking you to swap anything out. You're probably not buying something new today and I totally get it. But when you do start evaluating AI tools for the ops side — which is kind of your whole mandate now — the people who move fastest are the ones who already know what's on the market. Would you be open to a quick look, even just to benchmark what you've got against what's out there? Worst case you confirm you're in good shape and we part as friends.",
        "note": "Sell the test drive, not the product. Position the meeting as useful for his AI evaluation mandate regardless of whether he buys. 'Your whole mandate now' ties it directly to his CDO role.",
        "branches": [
          {
            "label": "Fine, let's do a quick look",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "No thanks, we're good",
            "to": "end_graceful"
          }
        ]
      },
      "not_interested_objection": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "Totally get it — I should have assumed you'd be all set, otherwise you probably would've reached out yourself. Just so no one from my team bugs you again — is it that inspection quality isn't really a priority for you right now, or is it more that you just hate cold calls?",
        "note": "Split with humor. The 'hate cold calls' option gives them a non-product-related out — and often opens the door back up because they laugh and soften.",
        "branches": [
          {
            "label": "It's not a priority / not my area",
            "to": "referral_ask"
          },
          {
            "label": "Ha — yeah I just hate cold calls",
            "to": "not_interested_last_shot"
          },
          {
            "label": "Both / hard no",
            "to": "end_graceful"
          }
        ]
      },
      "timing_objection": {
        "label": "OBJECTION — TIMING / POST-ACQUISITION",
        "say": "Yeah especially with the Vacasa integration still in progress, I'm sure the last thing you need is one more thing on the pile. Totally get it. When does the dust usually settle on something like that — are you guys thinking Q2, Q3 before you're actively layering in new AI tools?",
        "note": "Acknowledge the acquisition complexity — it's genuine and shows you understand their world. Get a timeline so you know when to follow up. If they give you a window, lock a future touchpoint.",
        "branches": [
          {
            "label": "Gives a timeline (Q2, Q3, etc.)",
            "to": "future_touchpoint"
          },
          {
            "label": "Not sure / hard to say",
            "to": "future_touchpoint"
          },
          {
            "label": "Actually we are looking at things now",
            "to": "warm_response"
          }
        ]
      },
      "future_touchpoint": {
        "label": "LOCK FUTURE TOUCHPOINT",
        "say": "Makes total sense. Would it be a terrible idea if I circled back around then? That way I'm not bugging you now, but when you are actively evaluating AI tools for ops, you've already got someone who knows your stack and can show you something relevant. I can shoot you a quick note around that time.",
        "note": "Get permission to follow up at a specific time. Even a vague 'sure' is a win — you now have a warm callback with context. Log the timeline immediately.",
        "branches": [
          {
            "label": "Sure, circle back then",
            "to": "confirm_future"
          },
          {
            "label": "Just email me",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "end_graceful"
          }
        ]
      },
      "confirm_future": {
        "label": "CONFIRM FUTURE FOLLOW-UP",
        "say": "Perfect — I'll put a reminder in for that. Really appreciate you taking the call, David. Talk to you then.",
        "note": "Don't oversell. You got a future touchpoint — that's a win. Log the timeline in CRM immediately after hanging up. Set a reminder 1 week before the window opens.",
        "branches": []
      },
      "loop_in_others": {
        "label": "LOOP IN OTHERS — MULTI-THREAD",
        "say": "That makes total sense. Would it be Carlos Corzo on the tech side you'd want in the room, or is there someone else who'd own the evaluation? I want to make sure I put the right thing in front of the right people so it's actually worth everyone's time.",
        "note": "You know Carlos is CTO and John Banczak is COO with inspection software background from TurnKey. If David names someone, great — use it. If he's surprised you know Carlos, it shows you did your homework. This is your chance to multi-thread into the org.",
        "branches": [
          {
            "label": "Yeah Carlos / our CTO",
            "to": "book_meeting_multi"
          },
          {
            "label": "It'd be John / someone on the ops team",
            "to": "book_meeting_multi"
          },
          {
            "label": "Let me figure out who internally and get back to you",
            "to": "send_email"
          },
          {
            "label": "Names someone else",
            "to": "book_meeting_multi"
          }
        ]
      },
      "book_meeting_multi": {
        "label": "BOOK MEETING — MULTIPLE STAKEHOLDERS",
        "say": "Perfect. I've got next week pulled up — would Tuesday or Wednesday work better for you and them? I can keep it to 20 minutes. My co-founder Rohan can join on our side to handle any technical or integration questions.",
        "note": "Offer two specific days, not open-ended availability. Mention Rohan for technical credibility. 20 minutes = low commitment for a group. Send the invite while still on the phone if possible.",
        "branches": [
          {
            "label": "Picks a day / time",
            "to": "confirm_meeting"
          },
          {
            "label": "Let me check calendars and get back to you",
            "to": "send_email_with_times"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next week pulled up — does Tuesday or Wednesday work better for you? I can keep it to 20 minutes.",
        "note": "Two options, not open-ended. Lock the day first, then the time. Send the calendar invite while on the phone if possible. Don't keep selling once they say yes.",
        "branches": [
          {
            "label": "Picks a day / time",
            "to": "confirm_meeting"
          },
          {
            "label": "Let me check my calendar and get back",
            "to": "send_email_with_times"
          }
        ]
      },
      "confirm_meeting": {
        "label": "CONFIRM MEETING — STOP SELLING",
        "say": "Locked in. I'll send over a calendar invite right now so it doesn't get lost. Really appreciate you taking my call, David — looking forward to it.",
        "note": "STOP SELLING. The meeting is booked. Send the invite immediately after hanging up. Keep the goodbye warm and brief. Don't add anything else about the product.",
        "branches": []
      },
      "send_email_with_times": {
        "label": "SEND EMAIL WITH TIME OPTIONS",
        "say": "Totally — I'll shoot you an email with a couple time slots. What's the best email for you — is it david.angotti at casago?",
        "note": "Confirm the email address. Casago's pattern is firstname.lastname@casago.com based on other contacts. Send within 5 minutes of hanging up with 2-3 specific time options. Include a one-sentence reminder of what you discussed.",
        "branches": [
          {
            "label": "Confirms email or gives a different one",
            "to": "confirm_email_send"
          }
        ]
      },
      "confirm_email_send": {
        "label": "CONFIRM EMAIL — WRAP UP",
        "say": "Got it — you'll have it within the hour. Appreciate the time, David. Talk soon.",
        "note": "Send the email FAST. Include 2-3 specific time options, a one-liner on what you'll cover, and nothing else. No fluff, no pitch deck, no 12-paragraph email. Follow up in 2 days if no response.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL — ASK WHAT MATTERS",
        "say": "Totally fair. One quick question before I do — what would actually be useful to include so it's not just another generic vendor email sitting in your inbox? Like are you more interested in the integration side with Guesty and Breezeway, or more the ROI and what other PM companies are seeing at scale?",
        "note": "Don't just accept 'send an email' and hang up. This question tells you what they care about AND keeps the conversation going for another 30 seconds. Sometimes they'll just say 'tell me now' and you're back in the call.",
        "branches": [
          {
            "label": "Integration / tech side",
            "to": "send_email_confirm"
          },
          {
            "label": "ROI / results / case studies",
            "to": "send_email_confirm"
          },
          {
            "label": "Just send whatever / general overview",
            "to": "send_email_confirm"
          },
          {
            "label": "Actually — just tell me now",
            "to": "warm_response"
          }
        ]
      },
      "send_email_confirm": {
        "label": "CONFIRM EMAIL ADDRESS",
        "say": "Got it — I'll tailor it to that. Is david.angotti at casago the best one? And I'll throw a couple times in there in case you want to hop on a quick call after you've had a chance to look it over.",
        "note": "Confirm the email address. Planting the meeting times in the email keeps the door open. Follow up in 2-3 business days if no response.",
        "branches": [
          {
            "label": "Confirms email",
            "to": "email_end"
          },
          {
            "label": "Gives a different email",
            "to": "email_end"
          }
        ]
      },
      "email_end": {
        "label": "EMAIL CONFIRMED — WRAP UP",
        "say": "Perfect — you'll have it today. Appreciate the time, David.",
        "note": "Send within 30 minutes. Personalize based on what they said they care about. Include 2 specific meeting time options. Subject line should reference something from the conversation, not a generic pitch. Follow up in 3 days if no reply.",
        "branches": []
      },
      "referral_ask": {
        "label": "NOT THE RIGHT PERSON — GET A REFERRAL",
        "say": "Totally makes sense — I appreciate you being straight with me on that. Who on your side would typically own the inspection and turnover workflow? Would that be more the ops team — like John Banczak or Alex Johnson's world — or does it sit somewhere else?",
        "note": "You know the org chart. Name-dropping John (COO, built inspection software at TurnKey) and Alex (VP Franchise Ops) shows you've done homework and makes it easier for David to confirm or redirect. If he gives you a name, ask for an intro.",
        "branches": [
          {
            "label": "Yeah it'd be John / Alex / ops team",
            "to": "referral_get_intro"
          },
          {
            "label": "Names someone else",
            "to": "referral_get_intro"
          },
          {
            "label": "Not sure / you'd have to figure that out",
            "to": "referral_general"
          }
        ]
      },
      "referral_get_intro": {
        "label": "ASK FOR THE INTRO",
        "say": "Super helpful. Would you be open to connecting me, or would it be better if I just reached out directly and mentioned we spoke? I want to make sure I put something relevant in front of them so it actually lands.",
        "note": "A warm intro from David is 10x more valuable than a cold outreach to their ops team. Push for the intro but gracefully accept the name-drop if that's what he offers. Either way, you're now going in warm.",
        "branches": [
          {
            "label": "I can intro you / I'll forward something",
            "to": "referral_confirm"
          },
          {
            "label": "Just reach out directly and mention we talked",
            "to": "referral_confirm"
          },
          {
            "label": "Doesn't want to help further",
            "to": "end_graceful"
          }
        ]
      },
      "referral_general": {
        "label": "REFERRAL — NO SPECIFIC NAME GIVEN",
        "say": "No worries at all. If I figure out who owns that side, would you mind if I mentioned we chatted? Just so it's not a totally cold outreach for them.",
        "note": "Even permission to name-drop David is valuable. You already know Carlos (CTO), John (COO), and Alex (VP Franchise Ops) from your research — you just need David's blessing to reference the conversation.",
        "branches": [
          {
            "label": "Sure, that's fine",
            "to": "referral_confirm"
          },
          {
            "label": "I'd rather you didn't",
            "to": "end_graceful"
          }
        ]
      },
      "referral_confirm": {
        "label": "CONFIRM REFERRAL — EXIT WARM",
        "say": "Really appreciate that, David. I'll put something tailored together so it actually lands with them. Thanks for taking my call — enjoy Cannon Beach, that's one of my favorite stretches of coast.",
        "note": "End warm and human. The Cannon Beach comment is genuine — Sam surfs and knows the Oregon coast. It humanizes the goodbye. Log the referral name and follow up with that person within 24 hours. Mention David by name in your outreach.",
        "branches": []
      },
      "gatekeeper": {
        "label": "GATEKEEPER — SLIDE BY",
        "say": "Hey — could you get me through to David? It's Sam.",
        "note": "First name only for David. Your first name only. Nothing else. Sound like you belong on the line. Don't explain why you're calling unless asked.",
        "branches": [
          {
            "label": "Puts you through / transferring now",
            "to": "opener"
          },
          {
            "label": "Who's calling? / What's this regarding?",
            "to": "gatekeeper_context"
          },
          {
            "label": "He's not available right now",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — ADD CONTEXT",
        "say": "Yeah — I work with a few other property management companies in the vacation rental space. Would you mind letting David know it's Sam Parks?",
        "note": "Still no pitch. Dose information slowly. End with a redirect question — you ask the questions, you control the flow. Stay relaxed and polite.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "What company are you with? / What's it about specifically?",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "He's in meetings / not available",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "It's RapidEye — we help property management companies with their inspection workflows, kind of in the same world as Breezeway. I sent David a note and just wanted to give him a heads up. Would you mind passing that along?",
        "note": "Mentioning Breezeway is a vendor they already know — it gives you instant credibility without misrepresenting anything. If they still block, ask for David's direct line or best time to reach him.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "I'll pass the message along",
            "to": "gatekeeper_leave_message"
          },
          {
            "label": "Still won't connect you",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_unavailable": {
        "label": "GATEKEEPER — DAVID NOT AVAILABLE",
        "say": "No worries — when's typically the best time to catch David? And would you mind if I grabbed his direct line so I'm not tying up your main number?",
        "note": "Get a callback window and a direct number if possible. Be genuinely kind — this person controls access. Don't argue or push.",
        "branches": [
          {
            "label": "Gives a time and / or direct number",
            "to": "gatekeeper_confirm"
          },
          {
            "label": "I can take a message for him",
            "to": "gatekeeper_leave_message"
          },
          {
            "label": "Won't share anything further",
            "to": "gatekeeper_leave_message"
          }
        ]
      },
      "gatekeeper_leave_message": {
        "label": "LEAVE MESSAGE WITH GATEKEEPER",
        "say": "That'd be great — just let David know Sam Parks from RapidEye called about their inspection workflow, and I'll try him again Thursday. Really appreciate your help.",
        "note": "Leave a simple, specific message. Mention a concrete day you'll call back. Be genuinely warm — gatekeepers remember rude callers and will block you forever.",
        "branches": []
      },
      "gatekeeper_confirm": {
        "label": "CONFIRM CALLBACK INFO FROM GATEKEEPER",
        "say": "Perfect — I'll try him then. Really appreciate it. Have a great day.",
        "note": "Log the direct number and optimal callback time in CRM immediately after hanging up. Call at exactly that time.",
        "branches": []
      },
      "end_graceful": {
        "label": "END GRACEFULLY — DON'T BURN THE BRIDGE",
        "say": "Totally understand, David. If anything changes on your end, I'm easy to find — Sam Parks, RapidEye. Appreciate your time.",
        "note": "Don't beg, don't pitch one more time, don't guilt trip. Keep it warm and brief. Log the outcome and set a 90-day follow-up reminder in CRM. The door stays open for email outreach or a future call.",
        "branches": []
      }
    }
  }
}