{
  "name": "Dee Bruggeman",
  "title": "Director of Business Development",
  "company": "Dunes Properties / Charleston Coast Vacations",
  "location": "Charleston, SC",
  "phone": "+1-888-250-8730",
  "company_phone": "800-476-8444",
  "alt_phones": [
    "+1-800-476-8444",
    "+1-843-881-5600"
  ],
  "flow": {
    "context": "Dee Bruggeman is Director of Business Development at Dunes Properties / Charleston Coast Vacations — she's the person homeowners contact when deciding whether to put their beach house into the rental program. Her name is the literal CTA on the owner management page. Dunes runs ~183 vacation rentals across Folly Beach, IOP, Wild Dunes, Sullivan's Island, and Kiawah with all cleaning and maintenance outsourced to third-party vendors — they explicitly do not employ housekeeping or maintenance staff. PMS is TrackHS. Trustpilot sits at 2.1 out of 5 with recurring guest complaints about cleanliness and maintenance, which directly undermines Dee's pitch to prospective owners. New COO Layne Kipp was appointed March 2025 with an explicit mandate around operational excellence and efficiencies. Best angle: Sam works with coastal PM companies, RapidEye plugs into Track, and Dee needs defensible quality claims to win homeowners away from competitors like Island Realty, Stay Duvet, and Sewee.",
    "start": "gatekeeper_initial",
    "nodes": {
      "gatekeeper_initial": {
        "label": "GATEKEEPER — SLIDE BY",
        "say": "Hey, could you get me through to Dee? It's Sam.",
        "note": "Casual. Sound like you know her. If they ask 'Dee who?' say 'Dee Bruggeman.' Don't volunteer anything else unless asked.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Who's calling / what's this about?",
            "to": "gatekeeper_context"
          },
          {
            "label": "She's not available",
            "to": "gatekeeper_voicemail"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — CONTEXT",
        "say": "Yeah — I work with a few other vacation rental managers in the Charleston area. Would you mind letting her know it's Sam Parks?",
        "note": "Still casual. Don't pitch the gatekeeper. End with a redirect question so you control the conversation.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "What company / pushes back more",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "She's not available / take a message",
            "to": "gatekeeper_voicemail"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "Totally fair — it's RapidEye. We help a couple other property management companies with their inspection workflows. I sent her a note already — would you mind just giving her a heads up I'm on the line?",
        "note": "Third attempt. If this doesn't work, take the voicemail gracefully or ask for a good time to call back. Don't burn the gatekeeper relationship.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Take a message / not available",
            "to": "gatekeeper_voicemail"
          }
        ]
      },
      "gatekeeper_voicemail": {
        "label": "VOICEMAIL OR NOT AVAILABLE",
        "say": "Hey Dee, it's Sam Parks — I work with a few vacation rental companies along the Southeast coast on their inspection workflows. Had something specific for Dunes I wanted to run by you. My number's [your number]. I'll try you again tomorrow — talk soon.",
        "note": "Under 20 seconds. Sound like a peer, not a pitch. Try again tomorrow at a different time of day. Also send a brief email to dbruggeman@dunesproperties.com referencing the call attempt.",
        "branches": []
      },
      "opener": {
        "label": "OPENER — LEAD WITH CONTEXT",
        "say": "Hey Dee — I work with a few vacation rental companies along the Southeast coast. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Sound like you're calling a referral. Relaxed energy — feet up on the desk. Not chipper. Pause after the question and let her answer. Don't fill the silence.",
        "branches": [
          {
            "label": "No, I haven't",
            "to": "heard_no"
          },
          {
            "label": "Yeah / maybe / sounds familiar",
            "to": "heard_yes"
          },
          {
            "label": "I'm busy / bad time",
            "to": "bad_timing"
          },
          {
            "label": "What is this? / Who are you?",
            "to": "permission_fallback"
          }
        ]
      },
      "heard_no": {
        "label": "HEARD NO — TRANSITION TO PAIN",
        "say": "Oh, I guess I'm not as popular as I thought. Well the reason for my call — I saw you're heading up business development for Charleston Coast Vacations, and I've been working with a few other VR companies your size that outsource their cleaning the same way you guys do. Wanted to share something that might be relevant to how you're pitching new homeowners. You got a sec?",
        "note": "Light and self-deprecating. Mentioning outsourced cleaning signals you've done homework — she'll notice. 'You got a sec' is a soft permission check before the pain trigger.",
        "branches": [
          {
            "label": "Sure / go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "I'm really busy right now",
            "to": "bad_timing"
          },
          {
            "label": "Not interested",
            "to": "not_interested"
          }
        ]
      },
      "heard_yes": {
        "label": "HEARD YES — EXPLORE",
        "say": "Oh nice — well normally we'd be working with someone in your position. What'd you hear?",
        "note": "Let her talk. She might reference a competitor using RapidEye, an email you sent, or a colleague mentioning it. She might also be bluffing. Either way, let her lead and listen.",
        "branches": [
          {
            "label": "She explains what she heard",
            "to": "warm_response"
          },
          {
            "label": "Not much / just the name",
            "to": "pain_trigger"
          },
          {
            "label": "I think someone emailed me",
            "to": "pain_trigger"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING — RESCHEDULE",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow morning? Or is later this week better?",
        "note": "Give two specific options. Don't ask 'when's a good time' — too open-ended. Lock a day. If she gives a time, note it and set a reminder.",
        "branches": [
          {
            "label": "Gives a time / agrees to callback",
            "to": "end_callback"
          },
          {
            "label": "Just email me",
            "to": "send_email"
          },
          {
            "label": "Not interested at all",
            "to": "not_interested"
          }
        ]
      },
      "permission_fallback": {
        "label": "PERMISSION — 30 SECOND ASK",
        "say": "Yeah totally — I mean it is a cold call. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not a fit?",
        "note": "Disarming honesty. Acknowledging the cold call breaks the tension instantly. Most people will give you 30 seconds out of curiosity.",
        "branches": [
          {
            "label": "Ok, go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "No / not interested",
            "to": "permission_rejected"
          },
          {
            "label": "Make it quick",
            "to": "pain_trigger"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED — DIAGNOSE",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it more that you already know what we do and it's just not interesting?",
        "note": "Last play. Two choices — 'bad time' reopens the door for a callback. 'Not interesting' lets you pivot to a referral or graceful exit. Don't push past a hard no.",
        "branches": [
          {
            "label": "Bad time actually",
            "to": "end_callback"
          },
          {
            "label": "Not my area / not interesting",
            "to": "not_my_department"
          },
          {
            "label": "What do you actually do?",
            "to": "pain_trigger"
          },
          {
            "label": "Hard no / hangs up",
            "to": "end_graceful"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER — OWNER RECRUITMENT ANGLE",
        "say": "So I was talking to a business development director at another coastal PM company — similar setup to you guys, about 180 properties, all third-party cleaners. She told me the toughest part of her job wasn't finding new homeowners — it was keeping the ones she signed up. She'd pitch them on these great quality standards, get them onboarded, and then a couple months in the owner's seeing guest reviews about a maintenance issue nobody caught between turns, or a cleanliness thing that slipped through. And it wasn't even the team's fault — when you've got outside vendors handling cleaning across that many properties, stuff just falls through no matter how good your coordinators are. We built a tool that catches those issues automatically from the photos your cleaners are already taking — plugs right into Track. Would you be open to seeing what it looks like when I'm not cold calling you out of the blue?",
        "note": "PAUSE after 'stuff just falls through no matter how good your coordinators are.' Let her react before you pitch the solution. If she jumps in — stop and listen. The Track mention shows you know their stack. The peer story makes it safe to agree. Don't mention Trustpilot directly — she knows.",
        "branches": [
          {
            "label": "That resonates / tell me more",
            "to": "warm_response"
          },
          {
            "label": "That's really more of an ops thing",
            "to": "not_my_department"
          },
          {
            "label": "Send me something on it",
            "to": "send_email"
          },
          {
            "label": "Not interested / we're fine",
            "to": "not_interested"
          }
        ]
      },
      "warm_response": {
        "label": "SHE'S WARM — STOP PITCHING, START ASKING",
        "say": "Yeah, it's a really common thing we hear. Out of curiosity — when you're sitting across from a homeowner who's deciding between you guys and one of the other companies in the market, what do you usually point to on the quality and care side to set Dunes apart?",
        "note": "She's engaged. DO NOT keep pitching. Ask about her world. This question gets her thinking about her competitive pitch and where the gaps are. Whatever she says becomes the language you use to position RapidEye. Listen for mentions of inspections, vendor quality, reporting to owners, or review management.",
        "branches": [
          {
            "label": "She describes her owner pitch",
            "to": "discovery_owner_onboarding"
          },
          {
            "label": "She mentions quality checks or inspections",
            "to": "discovery_inspection_process"
          },
          {
            "label": "She's honest about challenges / gaps",
            "to": "discovery_inspection_process"
          }
        ]
      },
      "discovery_owner_onboarding": {
        "label": "DISCOVERY — OWNER PITCH",
        "say": "That makes sense. And when it comes to the actual property care — like after a turnover, before a guest checks in — how does the team verify everything's good to go? Is it the cleaners self-reporting, or does someone from Dunes go check?",
        "note": "You know they outsource cleaning and likely don't have formal post-clean inspections for rentals. Let her describe the reality. Don't correct or judge — just understand how it works today. This builds the case for RapidEye naturally.",
        "branches": [
          {
            "label": "Cleaners handle it / self-report",
            "to": "discovery_inspection_gap"
          },
          {
            "label": "Area managers do spot checks",
            "to": "discovery_inspection_gap"
          },
          {
            "label": "We have a process but it's not perfect",
            "to": "discovery_inspection_gap"
          },
          {
            "label": "Not sure — that's the ops team",
            "to": "not_my_department"
          }
        ]
      },
      "discovery_inspection_process": {
        "label": "DISCOVERY — CURRENT INSPECTION WORKFLOW",
        "say": "Interesting. And are the third-party cleaners taking photos after they finish a turn, or is it more of a trust-based system right now?",
        "note": "This reveals whether photos are already being collected — if yes, RapidEye plugs in immediately with zero workflow change. If no, different conversation about getting vendors to document. Either answer works.",
        "branches": [
          {
            "label": "Yes cleaners take photos",
            "to": "discovery_inspection_gap"
          },
          {
            "label": "Not consistently",
            "to": "discovery_inspection_gap"
          },
          {
            "label": "I'm not sure honestly",
            "to": "discovery_inspection_gap_bd"
          }
        ]
      },
      "discovery_inspection_gap": {
        "label": "DISCOVERY — NAME THE GAP",
        "say": "Yeah, that's exactly what we keep hearing. The photos either exist but nobody has time to review all of them across every property, or they're not consistent enough to catch things. And then when something slips through — a broken screen door, a stained couch, a missing coffee maker — it's the guest who finds it, not the team. That's what we solve. We analyze every photo automatically, flag the stuff that needs attention before the guest checks in. No workflow change for your team or your vendors — plugs into Track and works. Would it make sense to carve out 15 minutes so I can show you what it actually looks like?",
        "note": "Specific examples paint the picture — broken screen door, stained couch, missing coffee maker. Emphasize no workflow change — critical for a company with outsourced vendors they don't directly control. Then CTA.",
        "branches": [
          {
            "label": "Yeah let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "I'd want to loop in our ops team",
            "to": "referral_ask_ops"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "I'm not sure we need this",
            "to": "not_interested_late"
          }
        ]
      },
      "discovery_inspection_gap_bd": {
        "label": "DISCOVERY — BD DOESN'T KNOW OPS DETAILS",
        "say": "Totally fair — you wouldn't necessarily be in the weeds on that. But here's why it matters for your side of the house: if you can tell a prospective homeowner that every single turnover gets an automated quality check — AI reviewing every photo, flagging issues before the guest walks in — that's a pretty different pitch than 'we trust our vendors.' Especially when the homeowner's Googling reviews before they sign. Would it be worth looping in whoever runs the ops side so we can show you both what this looks like?",
        "note": "Reframe for BD value. 'Googling reviews before they sign' is pointed — she knows the Trustpilot situation. Don't say Trustpilot out loud. Let the implication land. This naturally sets up a referral to Liz or Layne.",
        "branches": [
          {
            "label": "Yeah that makes sense / who should I loop in",
            "to": "referral_ask_ops"
          },
          {
            "label": "Let me think about it / send info",
            "to": "send_email"
          },
          {
            "label": "Not a priority right now",
            "to": "not_interested_late"
          }
        ]
      },
      "not_my_department": {
        "label": "NOT MY DEPARTMENT — PIVOT TO REFERRAL",
        "say": "Totally get it — and I figured you might not be the one neck-deep in turnover workflows day to day. But honestly, you're the perfect person to talk to first because you see the owner side — what homeowners actually care about when they're choosing a PM company. Real quick before I let you go — who on your side would own something like inspection tools or turnover quality? Would that be Liz Bernthal, or someone else?",
        "note": "Dropping Liz's name (VP Vacation Rentals) shows you've done homework and makes it easy for Dee to confirm or redirect. If she mentions Layne Kipp (new COO) or Mark Malone or Fran Cote (area directors), even better. Don't push — just get a name.",
        "branches": [
          {
            "label": "Yes that'd be Liz",
            "to": "referral_get_details"
          },
          {
            "label": "Actually try Layne / the COO",
            "to": "referral_get_details"
          },
          {
            "label": "Try Mark or Fran (area directors)",
            "to": "referral_get_details"
          },
          {
            "label": "Not sure / just call the main line",
            "to": "referral_ask_general"
          }
        ]
      },
      "referral_ask_ops": {
        "label": "REFERRAL — SHE WANTS TO LOOP IN OPS",
        "say": "That'd be great actually. Who on your team would make sense to have on the call? I know Liz oversees vacation rentals — would it be her, or someone else?",
        "note": "She's essentially agreeing to a meeting but wants the right people. This is a win. Help her identify who. Dropping Liz's name shows preparation. If she says Layne Kipp, that's even better — COO has budget authority.",
        "branches": [
          {
            "label": "She confirms Liz or gives another name",
            "to": "book_meeting_with_ops"
          },
          {
            "label": "Let me check internally and get back to you",
            "to": "send_email"
          },
          {
            "label": "She mentions Layne Kipp / COO",
            "to": "book_meeting_with_ops"
          }
        ]
      },
      "book_meeting_with_ops": {
        "label": "BOOK MEETING — WITH OPS INCLUDED",
        "say": "Perfect. I've got next Tuesday and Thursday pulled up — does morning or afternoon work better for you and the team? Only need about 15 to 20 minutes.",
        "note": "She's bringing someone with authority to the meeting. Lock a specific day and time now. Once she picks, confirm the exact time and send the calendar invite while still on the phone. Ask for the other attendee's email so you can include them on the invite.",
        "branches": [
          {
            "label": "She picks a time",
            "to": "meeting_confirmed_ops"
          },
          {
            "label": "Let me coordinate and get back to you",
            "to": "send_email_confirm"
          },
          {
            "label": "Just set it up with them directly",
            "to": "referral_get_details"
          }
        ]
      },
      "meeting_confirmed_ops": {
        "label": "MEETING LOCKED — OPS INCLUDED",
        "say": "Awesome — I'll send that invite over right now. What's the best email for the ops person so I can include them? And Dee, really appreciate you taking a cold call and connecting the dots here. Talk soon.",
        "note": "Get the ops contact's email for the invite. This is gold — you now have a warm intro to a decision-maker. Send the invite immediately. Stop selling.",
        "branches": []
      },
      "referral_get_details": {
        "label": "REFERRAL — GET THE INTRO",
        "say": "Perfect — would you be open to shooting them a quick note letting them know I'll reach out? That way it doesn't land totally cold. I want to put something tailored together so it actually lands with them.",
        "note": "A warm intro from Dee is 10x more effective than another cold dial. If she agrees, ask for the person's direct email or phone. If she won't intro, you at least have a confirmed name to reference when you call.",
        "branches": [
          {
            "label": "Sure I can send an intro",
            "to": "referral_confirmed"
          },
          {
            "label": "Just reach out to them directly",
            "to": "referral_confirmed"
          },
          {
            "label": "I'd rather you just email me",
            "to": "send_email"
          }
        ]
      },
      "referral_ask_general": {
        "label": "REFERRAL — NO SPECIFIC NAME",
        "say": "No worries at all. Is there a general title I should ask for — like a VP of vacation rentals or a director of operations? Just want to make sure I'm not wasting anyone's time.",
        "note": "If she can't give a name, get a title. You already know the org chart — Liz Bernthal is VP Vacation Rentals, Layne Kipp is COO, Mark Malone and Fran Cote are area directors. This is about getting her to confirm the right entry point.",
        "branches": [
          {
            "label": "She gives a title or name",
            "to": "referral_confirmed"
          },
          {
            "label": "Just try the main office",
            "to": "end_graceful"
          }
        ]
      },
      "referral_confirmed": {
        "label": "REFERRAL LOCKED — WRAP UP",
        "say": "Really appreciate that, Dee. I'll put something together that's specific to how Dunes operates and reach out to them this week. And honestly, if this ends up being useful, it might give you something tangible to point to when you're pitching homeowners — like an automated inspection layer the other companies in the market don't have. Thanks for your time.",
        "note": "Tie it back to HER world — BD advantage, competitive differentiation. Then stop talking. You got what you needed. Note the referral name, send a tailored email to that person within 24 hours referencing Dee.",
        "branches": []
      },
      "not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "I totally get it — I should've assumed you'd be all set. Otherwise you probably would've reached out yourself.",
        "note": "Agree first. Don't push. Pause for two full seconds. Let the silence work. She'll often soften or explain why. Then move to the split.",
        "branches": [
          {
            "label": "She softens / 'well it's not that...'",
            "to": "not_interested_split"
          },
          {
            "label": "Right, we're good",
            "to": "not_interested_split"
          },
          {
            "label": "Hard no / not engaging",
            "to": "end_graceful"
          }
        ]
      },
      "not_interested_split": {
        "label": "OBJECTION — SPLIT THE NO",
        "say": "Just so nobody from my team cold calls you again — is it more that this isn't a problem you're focused on right now, or is it that you just hate cold calls? Because honestly I get both.",
        "note": "Two choices. 'Not a problem' means you can probe or pivot to referral — with 183 outsourced properties, inspections ARE a problem. 'Hate cold calls' means offer to connect differently. Either answer gives you something to work with.",
        "branches": [
          {
            "label": "Not really my area / ops handles it",
            "to": "not_my_department"
          },
          {
            "label": "Just hate cold calls / bad timing",
            "to": "sell_test_drive"
          },
          {
            "label": "We already have something in place",
            "to": "have_a_process"
          },
          {
            "label": "Done talking",
            "to": "end_graceful"
          }
        ]
      },
      "not_interested_late": {
        "label": "OBJECTION — NOT SURE WE NEED THIS (LATE STAGE)",
        "say": "Totally fair. And look — you're not buying anything off a cold call, I wouldn't expect you to. But if nothing else, I could walk you through what a couple other PM companies in the Charleston market are doing with their turnover photos right now. Worst case you steal some ideas for your owner pitch and we part as friends.",
        "note": "Offer of value play. Position the meeting as competitive intelligence, not a sales pitch. Mentioning Charleston competitors will trigger her BD instincts — she absolutely wants to know what Island Realty and Stay Duvet are doing.",
        "branches": [
          {
            "label": "Ok that could be useful",
            "to": "book_meeting"
          },
          {
            "label": "Just send me info",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "end_graceful"
          }
        ]
      },
      "have_a_process": {
        "label": "OBJECTION — WE HAVE SOMETHING",
        "say": "That makes total sense — with 180-plus properties you'd have to have something in place. You'd be in trouble if you didn't.",
        "note": "Agree and validate. Don't attack their current process. Pause — let her fill the silence. She'll often volunteer what they use or where the gaps are.",
        "branches": [
          {
            "label": "She describes what they do",
            "to": "have_a_process_split"
          },
          {
            "label": "Yeah we're good",
            "to": "have_a_process_split"
          },
          {
            "label": "She mentions a specific tool",
            "to": "have_a_process_split"
          }
        ]
      },
      "have_a_process_split": {
        "label": "OBJECTION — SPLIT THE PROCESS",
        "say": "Totally. Just so I know — is it that what you've got is catching everything and the team's happy with it, or is it more that switching or adding anything right now would be a headache, especially heading into the busy season?",
        "note": "Most PM companies will admit their process isn't perfect. 'Busy season' is Charleston-specific — summer is peak and turnovers are relentless. 'Happy with it' = respect it and exit or test drive. 'Headache to switch' = your opening because RapidEye requires zero workflow change.",
        "branches": [
          {
            "label": "Switching would be a headache",
            "to": "sell_test_drive"
          },
          {
            "label": "We're happy with what we have",
            "to": "sell_test_drive"
          },
          {
            "label": "She opens up about gaps",
            "to": "warm_response"
          },
          {
            "label": "We're all set, thanks",
            "to": "end_graceful"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "I hear you. And look — you're definitely not buying something off a cold call, and I wouldn't ask you to. But the people who end up pulling the trigger on something like this are usually the ones who already know what's on their list when budget opens up. Would you be open to just taking a look — not to buy anything, just so you know it's out there? Fifteen minutes, and if it's not relevant, we part as friends.",
        "note": "Low pressure. 'Not to buy anything' removes the threat. 'Fifteen minutes' is small. 'Part as friends' keeps it light. If she says yes, go to book_meeting. If email, that's still a win.",
        "branches": [
          {
            "label": "Ok sure",
            "to": "book_meeting"
          },
          {
            "label": "Send me an email first",
            "to": "send_email"
          },
          {
            "label": "No thanks, not right now",
            "to": "end_graceful"
          }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most relevant to include so it's not just another generic pitch sitting in your inbox? Like is it more about the owner-facing value for your conversations with homeowners, or the nuts and bolts of how it works with Track?",
        "note": "Accept the email request — don't fight it. The question does two things: tailors the email AND keeps the conversation going. Her answer reveals what she cares about. Send to dbruggeman@dunesproperties.com within 10 minutes of hanging up.",
        "branches": [
          {
            "label": "She gives you direction on what to include",
            "to": "send_email_confirm"
          },
          {
            "label": "Just send me whatever / general info",
            "to": "send_email_confirm"
          }
        ]
      },
      "send_email_confirm": {
        "label": "EMAIL — CONFIRM AND LOCK FOLLOW-UP",
        "say": "Got it — I'll put something together and have it in your inbox today. I'll drop in a couple time options for next week in case you want to take a quick look after you've read through it. dbruggeman at dunesproperties dot com — that right?",
        "note": "Confirming the email shows you're prepared and not guessing. Including time slots gives you a concrete reason to follow up. Send a short, specific email — not a marketing deck. Follow up by phone in 2-3 business days if no reply.",
        "branches": [
          {
            "label": "Confirms email / sounds good",
            "to": "end_email_sent"
          },
          {
            "label": "Corrects the email address",
            "to": "end_email_sent"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next Tuesday and Thursday pulled up — does morning or afternoon work better for you? I only need about 15 minutes.",
        "note": "Lock it NOW. Two day options, morning or afternoon. Don't say 'whenever works.' Once she picks, confirm exact time and send the calendar invite while still on the phone. If she's the only one on the call, suggest she invite someone from ops.",
        "branches": [
          {
            "label": "She picks a time",
            "to": "meeting_confirmed"
          },
          {
            "label": "Let me check my calendar / email me times",
            "to": "send_email_confirm"
          },
          {
            "label": "I'd want to include someone from ops",
            "to": "referral_ask_ops"
          }
        ]
      },
      "meeting_confirmed": {
        "label": "MEETING LOCKED — STOP SELLING",
        "say": "Perfect — I'll send that invite over right now. And Dee, really appreciate you taking a cold call and hearing me out. If there's anyone on the ops side you think should be on — like Liz or whoever runs your turnover workflow — feel free to loop them in. Talk soon.",
        "note": "STOP SELLING. Meeting is booked. Send the invite immediately. Suggesting she add Liz Bernthal or ops team could get a decision-maker on the call. Don't oversell it — just plant the seed and hang up.",
        "branches": []
      },
      "end_callback": {
        "label": "CALLBACK SCHEDULED",
        "say": "Perfect — I'll try you then. Thanks Dee.",
        "note": "Note the exact day and time she gave you. Set a reminder. When you call back, open with: 'Hey Dee, it's Sam Parks — we talked briefly on [day], you said to try you back.' That makes the next call warm, not cold.",
        "branches": []
      },
      "end_email_sent": {
        "label": "EMAIL FOLLOW-UP SET",
        "say": "Sounds good — keep an eye out for it. Thanks for your time, Dee.",
        "note": "Send the email within 10 minutes. Subject line: 'Sam Parks — following up from our call.' Keep it under 150 words. Include 2-3 specific time slots for next week. Follow up by phone in 2-3 business days if no reply. If she mentioned a name on the ops side, send a separate email to that person referencing Dee.",
        "branches": []
      },
      "end_graceful": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes, I'm easy to find. Appreciate your time, Dee.",
        "note": "Don't burn the bridge. Send a one-line follow-up email anyway: 'Was great chatting briefly — if the inspection topic ever comes up, I'm around.' She may circle back in 3-6 months, especially if Trustpilot pressure or owner churn picks up. Also consider calling Liz Bernthal or Layne Kipp directly as your next dial.",
        "branches": []
      }
    }
  }
}