{
  "name": "Demekia White",
  "title": "HR",
  "company": "Island Realty",
  "location": "Charleston, SC",
  "phone": "+1-843-242-1529",
  "company_phone": "800-707-6421",
  "alt_phones": [
    "+1-843-886-8144",
    "+1-844-347-5483"
  ],
  "flow": {
    "context": "Demekia White is the HR contact at Island Realty, a family-owned vacation rental company managing 300+ properties across Isle of Palms, Wild Dunes, and Sullivan's Island in Charleston, SC. She is NOT the operations decision-maker — the real targets are Collins Atkinson (Director of Property Management), Alex Lane (Housekeeping Dept Manager), Eric Stone (Director of Hospitality), or Alex Stone IV (CEO). Island Realty runs in-house housekeeping (Isle Clean It) and maintenance (Isle Fix It) on Escapia PMS with NAVIS and Key Data. No direct personal connection to Sam — lead with Charleston-area PM proximity and pivot to a referral fast.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Demekia — I work with a few vacation rental companies out in the Charleston area. It's Sam Parks with RapidEye. Have you heard my name tossed around the office at all?",
        "note": "Feet up on the desk energy. She's HR — be warm but expect to pivot to a referral fast. Don't pitch her on the product. You just need a name and a transfer.",
        "branches": [
          {
            "label": "No, I haven't",
            "to": "heard_name_no"
          },
          {
            "label": "Yes / maybe",
            "to": "heard_name_yes"
          },
          {
            "label": "Who is this? / What's this about?",
            "to": "who_is_this"
          },
          {
            "label": "Now's not a good time",
            "to": "bad_timing"
          }
        ]
      },
      "heard_name_no": {
        "label": "HASN'T HEARD — PIVOT TO RIGHT PERSON",
        "say": "Ha — guess I'm not as popular as I thought. Well honestly Demekia, I might have the wrong person on the line. We work with property management companies on their turnover and inspection workflows — I was trying to get in touch with whoever handles that side of things at Island Realty. Would you happen to know who that'd be?",
        "note": "You're not pitching Demekia. You're using her to navigate. Be genuinely friendly — HR people are connectors by nature. Let her think for a second.",
        "branches": [
          {
            "label": "She names someone (Collins, Eric, Alex, etc.)",
            "to": "she_gives_name"
          },
          {
            "label": "She's not sure / let me check",
            "to": "she_checks"
          },
          {
            "label": "What exactly do you do?",
            "to": "brief_explanation"
          },
          {
            "label": "We're not interested / don't take vendor calls",
            "to": "not_interested_early"
          }
        ]
      },
      "heard_name_yes": {
        "label": "HAS HEARD — DIG IN",
        "say": "Oh nice — well normally we'd be working with whoever runs your property management or housekeeping ops. What did you hear?",
        "note": "Unlikely she's actually heard of you. If she says yes, find out what she heard and who mentioned it. This could be a warm path to the real buyer.",
        "branches": [
          {
            "label": "She mentions someone or a conversation",
            "to": "she_gives_name"
          },
          {
            "label": "She's vague / just being polite",
            "to": "heard_name_no"
          }
        ]
      },
      "who_is_this": {
        "label": "CLARIFY WHO YOU ARE",
        "say": "Yeah totally — it's Sam Parks with RapidEye. We work with a few property management companies in the Charleston area on their inspection workflows. I was actually trying to get in touch with whoever handles turnover operations at Island Realty — would you happen to know who that'd be?",
        "note": "She's screening. Stay casual. You're not selling her anything — you just need a name and a warm handoff.",
        "branches": [
          {
            "label": "She names someone",
            "to": "she_gives_name"
          },
          {
            "label": "What do you mean by inspection workflows?",
            "to": "brief_explanation"
          },
          {
            "label": "We're not interested",
            "to": "not_interested_early"
          },
          {
            "label": "Let me transfer you",
            "to": "transfer_offer"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you back tomorrow? Or honestly, if there's someone on the ops side who handles turnovers and inspections, I can reach out to them directly and save you the trouble.",
        "note": "Give her an easy out by pointing you to the right person. That's less work for her than scheduling another call with you.",
        "branches": [
          {
            "label": "Try me back later",
            "to": "lock_callback"
          },
          {
            "label": "She gives a name to call instead",
            "to": "she_gives_name"
          },
          {
            "label": "Not interested at all",
            "to": "graceful_exit"
          }
        ]
      },
      "she_gives_name": {
        "label": "SHE NAMES SOMEONE",
        "say": "Perfect — and what's their title over there? ... Got it. And do you happen to have a direct number or email for them? I want to make sure I'm not just hitting the main line and bugging everyone.",
        "note": "Lock in the name, title, and contact info. Collins Atkinson, Alex Lane, Scott Hudson, Eric Stone, or Alex Stone IV are all great. Write everything down. Then ask if you can mention Demekia pointed you their way.",
        "branches": [
          {
            "label": "She gives contact info",
            "to": "ask_to_use_name"
          },
          {
            "label": "She doesn't have it / just call the main line",
            "to": "confirm_name_no_info"
          },
          {
            "label": "She offers to transfer you now",
            "to": "transfer_offer"
          }
        ]
      },
      "she_checks": {
        "label": "SHE'S CHECKING OR THINKING",
        "say": "No rush at all. It'd probably be someone like your Director of Property Management, or whoever runs the housekeeping team — Isle Clean It, right? Just trying to connect with whoever's closest to the day-to-day turnover process.",
        "note": "Drop specific titles and 'Isle Clean It' to show you know their org. This helps her place who you need. Collins Atkinson is Director of Property Management. Alex Lane runs housekeeping. Don't list all of them — let her connect the dots.",
        "branches": [
          {
            "label": "She identifies someone",
            "to": "she_gives_name"
          },
          {
            "label": "She offers to transfer",
            "to": "transfer_offer"
          },
          {
            "label": "She doesn't know / can't help",
            "to": "suggest_names"
          }
        ]
      },
      "brief_explanation": {
        "label": "BRIEF EXPLANATION",
        "say": "Yeah so basically we work with property management companies that are already doing turnover photos or walkthrough videos, and we use AI to analyze those automatically. Catches damage, missing items, staging issues — stuff that'd normally take someone an hour to review manually. A few other companies your size in the Charleston area have been looking at it. I was just trying to figure out who at Island Realty would own that kind of thing.",
        "note": "Keep it short. You're explaining just enough so she can route you. Don't oversell. End with the routing question — who owns this.",
        "branches": [
          {
            "label": "She names someone",
            "to": "she_gives_name"
          },
          {
            "label": "She offers to transfer",
            "to": "transfer_offer"
          },
          {
            "label": "She engages from an HR / staffing angle",
            "to": "hr_angle"
          },
          {
            "label": "We already have something / not interested",
            "to": "not_interested_early"
          }
        ]
      },
      "suggest_names": {
        "label": "SUGGEST SPECIFIC NAMES",
        "say": "Totally understand. I've seen a couple names come up — would Collins Atkinson or Eric Stone be the right person for something like this? Or is there someone else who handles the property operations side?",
        "note": "Drop the names you have from research. This shows you've done homework and makes it easier for her to confirm or redirect. Don't list more than two.",
        "branches": [
          {
            "label": "She confirms one of them",
            "to": "she_gives_name"
          },
          {
            "label": "She suggests someone else",
            "to": "she_gives_name"
          },
          {
            "label": "She offers to transfer",
            "to": "transfer_offer"
          },
          {
            "label": "She won't help",
            "to": "last_effort"
          }
        ]
      },
      "ask_to_use_name": {
        "label": "ASK TO USE HER NAME",
        "say": "Really appreciate that, Demekia. Would you mind if I mentioned you pointed me their way? Just so it doesn't come across totally out of the blue when I reach out.",
        "note": "Getting permission to use her name turns your next call from cold to warm. Even a casual 'sure' is gold. Don't push if she says no.",
        "branches": [
          {
            "label": "Sure, go ahead",
            "to": "confirm_and_close"
          },
          {
            "label": "I'd rather you didn't / just reach out directly",
            "to": "confirm_and_close"
          }
        ]
      },
      "confirm_name_no_info": {
        "label": "GOT NAME BUT NO DIRECT CONTACT",
        "say": "No worries at all — I'll track them down. Just to make sure I've got it right, that's [name] and they handle [role she described]? ... Perfect. Really appreciate your help, Demekia.",
        "note": "Confirm the name and role. You likely already have their direct number from the employee directory research (Collins: 843-242-1076, Alex Lane: 843-242-1070, Eric: 843-242-1082). Don't reveal that — just confirm and close warm.",
        "branches": [
          {
            "label": "She confirms",
            "to": "confirm_and_close"
          },
          {
            "label": "She offers more info or to transfer",
            "to": "transfer_offer"
          }
        ]
      },
      "transfer_offer": {
        "label": "SHE OFFERS TO TRANSFER",
        "say": "That'd be amazing — I really appreciate it. And who am I being transferred to, just so I know?",
        "note": "Always get the name before the transfer. If the transfer drops, you have a name to call back directly. Stay ready — you're about to be on with the real buyer. Shift gears mentally.",
        "branches": [
          {
            "label": "Transfer goes through",
            "to": "transferred_opener"
          },
          {
            "label": "Transfer drops / voicemail",
            "to": "transfer_failed"
          }
        ]
      },
      "transferred_opener": {
        "label": "TRANSFERRED — NEW PERSON PICKS UP",
        "say": "Hey [name] — Demekia just sent me your way. It's Sam Parks with RapidEye. I work with a few vacation rental companies in the Charleston area on their turnover inspection workflows. Have you heard my name tossed around at all?",
        "note": "Mentioning Demekia transferred you gives instant credibility. Same opener framework but now it's warm. Adjust your tone — this person is likely ops-focused and busy. If it's Collins, he's the property management director. If it's Alex Lane, she runs housekeeping. If it's Eric Stone, he's the hospitality executive.",
        "branches": [
          {
            "label": "No, what's this about?",
            "to": "ops_reason_for_call"
          },
          {
            "label": "Yeah / maybe",
            "to": "ops_warm_entry"
          },
          {
            "label": "I'm busy / bad timing",
            "to": "ops_bad_timing"
          }
        ]
      },
      "ops_reason_for_call": {
        "label": "OPS PERSON — PAIN TRIGGER",
        "say": "Ha — not as popular as I thought. Well the reason for the call — I work with another property manager who's in a pretty similar spot to you guys. About 300 properties, in-house housekeeping team, doing turnovers back to back during peak season. And the thing they kept running into was their cleaners were taking photos but nobody had time to actually review them all. So stuff would slip through — a broken coffee table here, a missing set of towels there — and they wouldn't find out until the next guest checked in or worse, when the owner called asking why their patio furniture was trashed. We built a tool that plugs into the photos your team's already taking and flags that stuff automatically — no workflow change. Would you be open to taking a look sometime when I'm not cold calling you out of the blue?",
        "note": "This is your money moment. Paint the picture: 300 properties, in-house housekeeping (Isle Clean It), back-to-back turnovers. PAUSE after 'patio furniture was trashed.' Let them react. If it's Collins, the owner call is the pain. If it's Alex Lane, the workload is the pain. If it's Eric, guest complaints and reviews are the pain.",
        "branches": [
          {
            "label": "That's actually something we deal with",
            "to": "ops_warm"
          },
          {
            "label": "How does it work exactly?",
            "to": "ops_explain"
          },
          {
            "label": "We already have a process for that",
            "to": "ops_have_process"
          },
          {
            "label": "Not interested / not a priority",
            "to": "ops_objection"
          }
        ]
      },
      "ops_warm_entry": {
        "label": "OPS PERSON HAS HEARD OF YOU",
        "say": "Oh nice — well we've been working with a few PM companies on their turnover inspection workflows. What did you hear?",
        "note": "Find out what they know and who mentioned it. If someone internally flagged RapidEye, that's a strong buying signal. Ask who brought it up.",
        "branches": [
          {
            "label": "They share some context",
            "to": "ops_warm"
          },
          {
            "label": "They're vague",
            "to": "ops_reason_for_call"
          }
        ]
      },
      "ops_warm": {
        "label": "OPS PERSON IS WARM — DISCOVERY",
        "say": "Yeah, it's a pretty common thing we hear. So what does your inspection process look like right now? Like after a turnover, is someone reviewing those photos or is it more of a spot-check situation?",
        "note": "STOP PITCHING. Ask questions. Let them talk. You want to understand: who takes photos, what tool (Escapia? manual?), who reviews them, what falls through the cracks. They run Isle Clean It in-house — find out if housekeepers photo-document or if owner reps do inspections.",
        "branches": [
          {
            "label": "They describe their process",
            "to": "ops_dig_deeper"
          },
          {
            "label": "They ask more about RapidEye first",
            "to": "ops_explain"
          }
        ]
      },
      "ops_explain": {
        "label": "EXPLAIN RAPIDEYE — OPS LEVEL",
        "say": "Yeah so in short — we plug into the photos and videos your team is already capturing during turnovers. The AI analyzes them automatically and spits out an inspection report — flags damage, missing items, staging issues, anything that changed since last time. No workflow change for your cleaners or your owner reps. A few other companies around your size are using it to catch stuff before the next guest walks in instead of after. Would it make sense to hop on a quick call where I can actually show you what the reports look like?",
        "note": "One clear explanation. Reference their scale (300+ properties) and mention both cleaners and owner reps — shows you know their org. If they mention Escapia, say we can work with it. End with the CTA.",
        "branches": [
          {
            "label": "Yeah, let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "Send me some info first",
            "to": "send_email_ops"
          },
          {
            "label": "We're pretty happy with our current process",
            "to": "ops_have_process"
          },
          {
            "label": "I'd need to loop someone else in",
            "to": "ops_loop_someone"
          }
        ]
      },
      "ops_dig_deeper": {
        "label": "DIG DEEPER — THEIR PROCESS",
        "say": "Got it. And when something does slip through — like damage gets missed between guests — how does that usually surface? Is it the next guest calling in, or does your team catch it on a re-inspect?",
        "note": "You're looking for where the pain hits hardest. Next guest complaint? Owner finds out? Emergency maintenance dispatch? The answer tells you exactly how to position RapidEye. Listen for specifics you can reference later.",
        "branches": [
          {
            "label": "They admit stuff slips through",
            "to": "ops_pain_confirmed"
          },
          {
            "label": "They say they catch most things",
            "to": "ops_have_process"
          }
        ]
      },
      "ops_pain_confirmed": {
        "label": "PAIN CONFIRMED — BRIDGE TO MEETING",
        "say": "Yeah — that's exactly what we keep hearing, especially from teams running in-house housekeeping at your scale. The photos are there but nobody has the bandwidth to catch everything across 300-plus units. What we've seen work really well is just doing a 20-minute walkthrough of the reports so you can see what it actually flags on real properties. Would next week work to take a look? I've got Tuesday and Thursday open.",
        "note": "Bridge directly to booking. They've admitted the pain — don't keep digging or you'll talk yourself out of the meeting. Offer specific days. Lock it in NOW.",
        "branches": [
          {
            "label": "Yeah, let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email_ops"
          },
          {
            "label": "I need to check with someone else",
            "to": "ops_loop_someone"
          }
        ]
      },
      "ops_have_process": {
        "label": "THEY HAVE A PROCESS — MIYAGI",
        "say": "That makes total sense — with 300-plus properties and your own in-house housekeeping team, you'd have to have something dialed in. And honestly I wouldn't expect you to change anything that's working. Just out of curiosity though — is it that you're fully covered and happy with how it's working, or is it more that switching anything right now heading into summer season would just be a headache?",
        "note": "Miyagi method. Agree first, then split the objection. 'Heading into summer season' is specific to their world — spring/summer is peak for Charleston beach rentals. You saw the shoulder-season promos and 2026 cancellation policy changes on their site. They're gearing up.",
        "branches": [
          {
            "label": "It's working fine / we're covered",
            "to": "offer_value_anyway"
          },
          {
            "label": "It's more a timing thing",
            "to": "timing_play"
          },
          {
            "label": "Actually there are some gaps...",
            "to": "ops_warm"
          }
        ]
      },
      "ops_objection": {
        "label": "OPS NOT INTERESTED — MIYAGI",
        "say": "Totally get it — I should've assumed you'd be all set, otherwise you probably would've reached out. Just so nobody from my team bugs you again — is it that this isn't something you're focused on right now, or is it more that you just hate cold calls? Because honestly, I get it either way.",
        "note": "Miyagi step 2. Split the objection. If it's 'not focused on it,' there's a timing play. If it's 'hate cold calls,' acknowledge it and offer to send something instead. Don't be defensive.",
        "branches": [
          {
            "label": "Not a priority right now",
            "to": "timing_play"
          },
          {
            "label": "Just hate cold calls",
            "to": "permission_fallback"
          },
          {
            "label": "Hard no",
            "to": "graceful_exit"
          }
        ]
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not a fit?",
        "note": "This is your last shot at earning time. If they say yes, go straight to a compressed version of the pain trigger. If they say no, don't push — go to graceful exit.",
        "branches": [
          {
            "label": "Alright, 30 seconds",
            "to": "ops_reason_for_call"
          },
          {
            "label": "No, I'm good",
            "to": "permission_denied"
          }
        ]
      },
      "permission_denied": {
        "label": "PERMISSION DENIED — SPLIT",
        "say": "Shoot, totally my bad. Just so nobody from my team cold calls you again — is it that I caught you at a horrible time, or is it that you already know what we do and it's just not interesting?",
        "note": "Last diagnostic. If it's timing, get a callback. If it's not interesting, exit gracefully. Either way you're learning something.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "lock_callback"
          },
          {
            "label": "Not interesting",
            "to": "graceful_exit"
          }
        ]
      },
      "timing_play": {
        "label": "TIMING — PLANT THE SEED",
        "say": "Totally fair. You're probably not buying anything right now, and I respect that. But what I've seen with a lot of PM companies is — when budget does free up or things slow down after summer, the people who already know what's on their shortlist move way faster. Would you be open to just taking a 20-minute look so it's on your radar? No commitment — worst case you steal some ideas from what other companies in Charleston are doing with their turnover photos.",
        "note": "Sell the test drive. The meeting has value even if they never buy. 'Other companies in Charleston' creates subtle competitive pressure — Stay Duvet, Sewee, Carolina One, Dunes Properties are all in their backyard.",
        "branches": [
          {
            "label": "Alright, sure",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email_ops"
          },
          {
            "label": "No, not right now",
            "to": "graceful_exit"
          }
        ]
      },
      "offer_value_anyway": {
        "label": "OFFER VALUE EVEN IF COVERED",
        "say": "Totally respect that. One thing I could do — I could send over a quick breakdown of what a few other PM companies in your market are doing with their turnover inspection data. Totally separate from us. Worst case you see what the competition's up to and we part as friends. Would that be useful?",
        "note": "The competitive intel angle. Charleston is a tight market — Island Realty competes directly with Stay Duvet (360+ properties), Sewee (230+), Dunes Properties (180+). Knowing what competitors do with inspection data is genuinely valuable.",
        "branches": [
          {
            "label": "Sure, send it over",
            "to": "send_email_ops"
          },
          {
            "label": "No thanks",
            "to": "graceful_exit"
          }
        ]
      },
      "ops_loop_someone": {
        "label": "THEY NEED TO LOOP SOMEONE IN",
        "say": "Makes total sense. Who would that be? Just so I can put something together that's actually relevant for them too.",
        "note": "Get the name of the decision-maker. If they say Alex Stone (CEO) or another exec, offer to include them on the call. This is a buying signal — they're thinking about how to move this forward internally.",
        "branches": [
          {
            "label": "They name someone — set up a joint call",
            "to": "book_meeting"
          },
          {
            "label": "They're vague / 'let me get back to you'",
            "to": "send_email_ops"
          }
        ]
      },
      "ops_bad_timing": {
        "label": "OPS PERSON — BAD TIMING",
        "say": "Totally hear you — I know I caught you in the middle of things. Would it be a terrible idea if I tried you back tomorrow afternoon? Demekia pointed me your way so I just need a couple minutes.",
        "note": "Re-mention Demekia to reinforce credibility. Suggest a specific time. If they push back, offer to send an email instead.",
        "branches": [
          {
            "label": "Sure, call me back",
            "to": "lock_callback"
          },
          {
            "label": "Just send me an email",
            "to": "send_email_ops"
          },
          {
            "label": "Not interested",
            "to": "ops_objection"
          }
        ]
      },
      "not_interested_early": {
        "label": "DEMEKIA NOT INTERESTED — REDIRECT",
        "say": "Yeah totally — and honestly this probably isn't even your department, so I'm sorry to bug you. I'm really just trying to find the right person on the operations side. Would you happen to know if that'd be Collins Atkinson or someone else?",
        "note": "Don't fight her objection. Redirect to the referral. Drop Collins' name specifically — it's way easier for her to confirm a name than to think of one from scratch.",
        "branches": [
          {
            "label": "She confirms Collins or gives a name",
            "to": "she_gives_name"
          },
          {
            "label": "She won't help at all",
            "to": "last_effort"
          }
        ]
      },
      "hr_angle": {
        "label": "DEMEKIA ENGAGES — HR ANGLE",
        "say": "Oh interesting — yeah we've actually heard from a few HR folks that turnover workload is a big driver of housekeeping burnout and churn. Is that something you're seeing on your end with the Isle Clean It team?",
        "note": "If she's engaging from a staffing perspective, ride that wave. Housekeeping retention is a massive pain in vacation rentals, especially with 300+ units and in-house teams. If she confirms it, bridge to the ops referral.",
        "branches": [
          {
            "label": "Yes, staffing is a challenge",
            "to": "hr_bridge_to_ops"
          },
          {
            "label": "Not really my area to speak to",
            "to": "suggest_names"
          }
        ]
      },
      "hr_bridge_to_ops": {
        "label": "BRIDGE FROM HR TO OPS REFERRAL",
        "say": "Yeah that's actually a big part of why we built this — it takes a chunk of the manual review work off the team's plate so you're not burning people out on stuff that can be automated. Would it make sense for me to connect with whoever runs Isle Clean It? I think that might be Alex Lane? Just to see if it'd actually help on their end.",
        "note": "Use the HR staffing pain as a bridge to the real buyer. Dropping Alex Lane's name shows you know their org. If Demekia confirms and offers to connect you, that's the best possible outcome from this call.",
        "branches": [
          {
            "label": "She confirms and helps connect you",
            "to": "she_gives_name"
          },
          {
            "label": "She suggests someone else",
            "to": "she_gives_name"
          },
          {
            "label": "She offers to transfer you",
            "to": "transfer_offer"
          }
        ]
      },
      "last_effort": {
        "label": "LAST EFFORT — GRACEFUL ASK",
        "say": "No worries at all, Demekia — I totally get it. If I shot an email over to Collins Atkinson or Eric Stone, is that at least in the right ballpark? Just want to make sure I'm not spamming the wrong person.",
        "note": "Last attempt to validate the names you already have from research. Even a casual 'yeah, that sounds right' is useful. You already have their emails (collins@islandrealty.com, eric@islandrealty.com) and direct numbers.",
        "branches": [
          {
            "label": "She confirms one of them",
            "to": "confirm_and_close"
          },
          {
            "label": "She can't or won't help",
            "to": "graceful_exit"
          }
        ]
      },
      "transfer_failed": {
        "label": "TRANSFER DROPPED OR VOICEMAIL",
        "say": "",
        "note": "Transfer didn't go through. You have the name from before the transfer. Call that person directly: Collins Atkinson (843) 242-1076, Alex Lane (843) 242-1070, Eric Stone (843) 242-1082, Scott Hudson (843) 242-1516. Open with: 'Hey [name] — I was just chatting with Demekia and she pointed me your way.' That's a warm intro now.",
        "branches": []
      },
      "lock_callback": {
        "label": "LOCK IN CALLBACK TIME",
        "say": "Perfect — how about I try you around 2 tomorrow? I won't take more than a couple minutes, promise.",
        "note": "Get a specific time. Set a reminder immediately after hanging up. If Demekia gave you a name during this call, call THAT person at the callback time instead — you have what you need.",
        "branches": [
          {
            "label": "Confirmed",
            "to": "confirm_and_close"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next Tuesday and Thursday open — which works better? ... And what time's good for you? ... Perfect, I'll shoot the invite right now so it's locked in. Really appreciate you taking my call, [name].",
        "note": "Lock it in NOW. Pick two days. Get a time. Send the calendar invite while still on the phone. Once it's booked, STOP SELLING. Say thanks and get off the phone. If they mentioned needing to loop someone in, ask for that person's email to add them to the invite.",
        "branches": []
      },
      "send_email_ops": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most relevant to include so it's not just another generic pitch sitting in your inbox? Like is it more the photo analysis side, or what other companies your size are doing with their turnover data?",
        "note": "Accept the email request but ask one qualifying question. This tells you what they care about AND keeps the conversation going for another 30 seconds. Include a specific meeting time suggestion in the email. Send within the hour.",
        "branches": [
          {
            "label": "They tell you what to include",
            "to": "confirm_email_close"
          },
          {
            "label": "Just send whatever",
            "to": "confirm_email_close"
          }
        ]
      },
      "confirm_email_close": {
        "label": "CONFIRM EMAIL AND CLOSE",
        "say": "Got it — I'll keep it short and relevant. What's the best email for you? ... Perfect. I'll send that over today and I'll throw in a couple time options in case you want to hop on a quick call after you've had a chance to look. Really appreciate your time.",
        "note": "Confirm the email address even if you think you have it. Mention you'll suggest times — plants the seed for a meeting in the follow-up. Send the email within one hour. Personalize it with something specific from this conversation.",
        "branches": []
      },
      "confirm_and_close": {
        "label": "CONFIRM REFERRAL AND CLOSE",
        "say": "Really appreciate your help, Demekia. I'll reach out to them directly. Thanks for taking a few minutes with me — have a great rest of your day.",
        "note": "Close warm. You got what you needed. Write down everything immediately: name, title, contact info, whether you can use Demekia's name. Call the referred person within the hour while this is fresh. Open with 'Demekia pointed me your way' if she gave permission.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything ever comes up on the inspection or operations side, I'm easy to find — Sam Parks at RapidEye. Appreciate your time, Demekia.",
        "note": "Don't burn the bridge. She's HR — she talks to everyone internally. A good impression today could turn into a warm intro down the road. After hanging up, call Collins Atkinson (843-242-1076) or Eric Stone (843-242-1082) directly.",
        "branches": []
      }
    }
  }
}