{
  "name": "Diana Castaneda",
  "title": "Property Inspector",
  "company": "Helios Vacation Rentals",
  "location": "Palm Springs, CA",
  "phone": "",
  "company_phone": "+1-760-501-2656",
  "alt_phones": [],
  "flow": {
    "context": "Diana Castaneda is a Property Inspector at Helios Vacation Rentals — she physically walks their 32 luxury short-term rental properties in the Greater Palm Springs / Coachella Valley area, checking condition between guest stays and documenting what she sees. She likely reports to Rosana Castro (Inspections Manager) and Marcela De Dios (Operations Manager). Helios runs in-house cleaning, uses Hostaway as their PMS, has smart locks and noise sensors, uses Safely.com for damage waivers, and has no public ops or photo platform — meaning Diana is probably managing inspections with manual photos and checklists. Sam's strongest angle is SoCal proximity — he grew up in the LA area, and Helios' Coachella/Stagecoach festival-season turnover pressure is a natural pain point for an inspector drowning in back-to-back walkthroughs.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Diana — I work with a few property management teams out in the desert, actually from the LA area myself. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Feet up energy. Sound like you know people in her world. Don't rush — let her process the question.",
        "branches": [
          {
            "label": "No, haven't heard of you",
            "to": "no_heard"
          },
          {
            "label": "Yes / maybe / sounds familiar",
            "to": "yes_heard"
          },
          {
            "label": "Who? / What company?",
            "to": "clarify_who"
          },
          {
            "label": "Bad timing / busy",
            "to": "bad_timing"
          }
        ]
      },
      "no_heard": {
        "label": "THEY HAVEN'T HEARD OF YOU",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call — I've been working with a couple other inspection teams at vacation rental companies pretty similar to Helios, and I wanted to get your take on something real quick.",
        "note": "Transition smoothly into the pain trigger. Don't pause too long here — keep momentum into the next beat.",
        "branches": [
          {
            "label": "Okay, go ahead / listening",
            "to": "pain_trigger"
          },
          {
            "label": "I'm busy / not a good time",
            "to": "bad_timing"
          },
          {
            "label": "What is this about?",
            "to": "pain_trigger"
          },
          {
            "label": "Not interested",
            "to": "permission_fallback"
          }
        ]
      },
      "yes_heard": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone like you or your inspections team. What did you hear?",
        "note": "Let her talk. Whatever she says, bridge to discovery. This is rare but golden if it happens.",
        "branches": [
          {
            "label": "Shares what they heard",
            "to": "warm_discovery"
          },
          {
            "label": "Not sure / vague",
            "to": "pain_trigger"
          }
        ]
      },
      "clarify_who": {
        "label": "CLARIFY WHO YOU ARE",
        "say": "Yeah — Sam Parks, I'm with a company called RapidEye. We work with property management companies on their inspection workflows. I actually wanted to pick your brain on something real quick since you're the one walking the properties.",
        "note": "Re-anchor on her role. She's the expert on what inspections actually look like day to day — make her feel that.",
        "branches": [
          {
            "label": "Okay, what's up?",
            "to": "pain_trigger"
          },
          {
            "label": "I'm busy",
            "to": "bad_timing"
          },
          {
            "label": "Not interested",
            "to": "permission_fallback"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — I'm sure you're between properties right now. Would it be a terrible idea if I tried you again tomorrow, maybe in the morning before your first walkthrough?",
        "note": "Inspectors are often literally in the field. Acknowledge that reality. Get a specific callback time.",
        "branches": [
          {
            "label": "Sure, call me back at a specific time",
            "to": "lock_callback"
          },
          {
            "label": "Just email me",
            "to": "send_email"
          },
          {
            "label": "No, don't call back",
            "to": "end_graceful"
          }
        ]
      },
      "lock_callback": {
        "label": "LOCK CALLBACK TIME",
        "say": "Perfect — I'll call you right at that time. Really appreciate it, Diana. Talk soon.",
        "note": "Write down the exact time immediately. Set a reminder. Call exactly when promised — reliability builds trust.",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not a fit?",
        "note": "Disarm with honesty. Most people will give 30 seconds if you own what this is upfront.",
        "branches": [
          {
            "label": "Fine, go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "No, not interested",
            "to": "rejection_split"
          },
          {
            "label": "Just email me",
            "to": "send_email"
          }
        ]
      },
      "rejection_split": {
        "label": "SPLIT THE REJECTION",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is this just not something that's on your plate at all?",
        "note": "You're splitting to find out if she's the wrong person or if it's just timing. If wrong person, pivot to referral.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not my area / not my decision",
            "to": "referral_ask"
          },
          {
            "label": "Just not interested at all",
            "to": "end_graceful"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "So I've been working with another inspector at a company pretty similar to yours — about 30 luxury properties, desert market, in-house cleaning team. And what she kept telling me was that during high season — like around Coachella, Stagecoach — she's walking six, seven properties a day, snapping hundreds of photos, and stuff still slips through. A stain on a couch cushion, a chipped countertop, a missing set of towels. And then when a guest files a complaint or an owner notices something, it's her name on the line even though she had twelve minutes per unit. We built something that actually analyzes all those turnover photos automatically — flags damage, missing items, staging issues — so nothing falls through the cracks. Would you be open to seeing what that looks like? I wouldn't take more than fifteen minutes of your time.",
        "note": "This is HER daily life. Pause after 'her name on the line.' Let her react. She's either going to feel seen or deflect. The Coachella reference is specific to Helios — they mention it in their terms.",
        "branches": [
          {
            "label": "That sounds interesting / tell me more",
            "to": "warm_discovery"
          },
          {
            "label": "Yeah that's a problem but... (hesitant)",
            "to": "warm_but_hesitant"
          },
          {
            "label": "I'm not the right person for that",
            "to": "referral_ask"
          },
          {
            "label": "We already have something for that",
            "to": "objection_have_vendor"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "warm_discovery": {
        "label": "DISCOVERY — SHE'S WARM",
        "say": "Nice — so let me ask you this. When you're doing a walkthrough right now, what does that actually look like? Are you going room by room with a checklist, snapping photos as you go, or is it more of a visual sweep?",
        "note": "STOP PITCHING. You're in discovery now. Ask about her current process. She's the subject matter expert — make her feel like it.",
        "branches": [
          {
            "label": "Describes process with checklist and photos",
            "to": "discovery_photos"
          },
          {
            "label": "It's pretty informal / visual sweep",
            "to": "discovery_informal"
          },
          {
            "label": "We use a system already",
            "to": "discovery_current_tool"
          }
        ]
      },
      "discovery_photos": {
        "label": "DIG INTO PHOTO PROCESS",
        "say": "Got it. And those photos — where do they end up? Are you uploading them into Hostaway, or is there a separate system your team uses for inspections?",
        "note": "You know they use Hostaway — dropping the name shows homework. You're probing for whether they have a dedicated ops platform. Publicly they don't appear to have one.",
        "branches": [
          {
            "label": "Hostaway / PMS directly",
            "to": "discovery_no_ops_tool"
          },
          {
            "label": "Separate tool / spreadsheet / shared drive",
            "to": "discovery_no_ops_tool"
          },
          {
            "label": "Mentions Breezeway or another ops platform",
            "to": "discovery_has_ops_tool"
          },
          {
            "label": "Not sure / asks why I'm asking",
            "to": "bridge_to_referral"
          }
        ]
      },
      "discovery_informal": {
        "label": "INFORMAL PROCESS — DIG DEEPER",
        "say": "Totally makes sense for 32 properties. So when something does come up — a guest reports damage, or an owner asks about a scratch — do you have photos to go back to, or is it kind of a he-said-she-said situation?",
        "note": "This is where the pain lives. No formal documentation means no proof means blame falls on the inspector. Let her talk.",
        "branches": [
          {
            "label": "Yeah, it's tough to prove things",
            "to": "validate_pain"
          },
          {
            "label": "We document everything pretty well",
            "to": "discovery_photos"
          },
          {
            "label": "That's more Rosana's area / my manager handles that",
            "to": "referral_ask"
          }
        ]
      },
      "discovery_current_tool": {
        "label": "THEY HAVE A SYSTEM",
        "say": "Oh nice — what are you guys using?",
        "note": "Listen carefully. If she names a tool, note it. If it's just checklists inside Hostaway, that's not a real ops platform — that's still a gap.",
        "branches": [
          {
            "label": "Basic tool / checklist / manual process",
            "to": "validate_pain"
          },
          {
            "label": "Real ops platform like Breezeway",
            "to": "discovery_has_ops_tool"
          }
        ]
      },
      "discovery_no_ops_tool": {
        "label": "NO DEDICATED OPS TOOL",
        "say": "Got it — so basically you're capturing everything but there's no system actually reviewing those photos for you. That's exactly what we keep hearing. One thing that might be worth seeing — I can show you what it looks like when those photos get analyzed automatically, so it's not all on you to catch everything in real time. Would it make sense to loop in Rosana or Marcela for a quick fifteen-minute look?",
        "note": "Pivot to include decision-makers. Diana validates pain but likely can't buy. Name-drop Rosana Castro and Marcela De Dios to show you know the org.",
        "branches": [
          {
            "label": "Yeah, I can connect you with Rosana or Marcela",
            "to": "get_referral_details"
          },
          {
            "label": "I'd want to see it myself first",
            "to": "book_meeting_diana"
          },
          {
            "label": "I'd have to ask them",
            "to": "bridge_to_referral"
          },
          {
            "label": "Not sure they'd be interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "discovery_has_ops_tool": {
        "label": "THEY HAVE AN OPS TOOL",
        "say": "Oh cool — are you guys happy with it? One thing we keep seeing is that even when companies have a solid ops platform, nobody's actually looking at the photos. They're collecting them, but no one's reviewing a hundred photos per property per turnover. We sit on top of whatever you're already using and flag the stuff a human would miss.",
        "note": "Position RapidEye as complementary, not competitive. It's an add-on layer, not a replacement for their existing tool.",
        "branches": [
          {
            "label": "That's interesting — tell me more",
            "to": "validate_pain"
          },
          {
            "label": "We're pretty happy with what we have",
            "to": "objection_have_vendor"
          },
          {
            "label": "I'd need to talk to my manager",
            "to": "bridge_to_referral"
          }
        ]
      },
      "validate_pain": {
        "label": "VALIDATE AND BRIDGE TO MEETING",
        "say": "Yeah, that's exactly what we keep hearing. And honestly, with Coachella season coming up and back-to-back turnovers on 32 properties, that's when stuff really falls through the cracks. Here's what I'm thinking — would it make sense to get fifteen minutes on the calendar, maybe loop in whoever manages the inspection side, and I'll show you exactly what this looks like with real property photos? Worst case you see what other PM companies in the desert are doing and steal some ideas.",
        "note": "Tie to seasonal urgency — Coachella and Stagecoach are known high-turnover pressure points for Helios. Push to include Rosana or Marcela in the meeting.",
        "branches": [
          {
            "label": "Yeah, let's do it",
            "to": "book_meeting"
          },
          {
            "label": "I'd need to check with my manager first",
            "to": "bridge_to_referral"
          },
          {
            "label": "Can you send me something first?",
            "to": "send_email"
          },
          {
            "label": "We don't have budget for that",
            "to": "objection_no_budget"
          }
        ]
      },
      "warm_but_hesitant": {
        "label": "WARM BUT HESITANT",
        "say": "Yeah — and look, I know you're probably not the one making decisions on new tools, and that's totally fine. Honestly I reached out to you because you're the one actually walking the properties — you know what the real problems are better than anyone in that office. I'm just curious, is that pain real for you guys, or does Helios already have a good handle on it?",
        "note": "Acknowledge she may not be the buyer. Elevate her as the expert on the actual problem. Get her to validate the pain — that's her value in this call.",
        "branches": [
          {
            "label": "Yeah, it's definitely a problem for us",
            "to": "validate_pain"
          },
          {
            "label": "We handle it okay / it's fine",
            "to": "probe_deeper"
          },
          {
            "label": "You should talk to Rosana / my manager",
            "to": "referral_ask"
          }
        ]
      },
      "probe_deeper": {
        "label": "PROBE DEEPER",
        "say": "Fair enough. Let me ask you this — during festival season, like Coachella or Stagecoach weekends, when you've got same-day turnovers stacking up, has there ever been a time where damage got missed between guests and it turned into a whole thing?",
        "note": "Get specific. Coachella equals high-damage, high-volume. Every inspector has a horror story. Draw it out of her.",
        "branches": [
          {
            "label": "Yeah, actually... (shares a story)",
            "to": "validate_pain"
          },
          {
            "label": "Not really / we're pretty good",
            "to": "bridge_to_referral"
          },
          {
            "label": "That's more of a management question",
            "to": "referral_ask"
          }
        ]
      },
      "objection_have_vendor": {
        "label": "OBJECTION — HAVE A VENDOR OR PROCESS",
        "say": "That makes total sense — with 32 properties you'd have to have something in place. Honestly, I'd be worried if you didn't. Just so I know — is it that you're fully covered and happy with how inspections work, or is it more that switching or adding anything right now would just be a headache?",
        "note": "Split the objection. Fully happy is rare. Headache to change is something you can work with by positioning the demo as zero-commitment.",
        "branches": [
          {
            "label": "We're happy with what we have",
            "to": "respect_and_referral"
          },
          {
            "label": "It's more of a hassle to change things",
            "to": "sell_test_drive"
          },
          {
            "label": "I don't really make those decisions",
            "to": "referral_ask"
          }
        ]
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "I totally get it — I should've assumed you'd be all set, otherwise you probably would've reached out to us. Just so nobody from my team cold calls you again — is it that inspections genuinely aren't a pain point for you guys, or is it more that you just hate cold calls?",
        "note": "Lighten the mood with the cold call line. Split to find the real objection underneath the surface reaction.",
        "branches": [
          {
            "label": "Laughs / it's the cold call thing",
            "to": "sell_test_drive"
          },
          {
            "label": "It's genuinely not a priority",
            "to": "respect_and_referral"
          },
          {
            "label": "I'm just not the right person",
            "to": "referral_ask"
          }
        ]
      },
      "objection_no_budget": {
        "label": "OBJECTION — NO BUDGET",
        "say": "Totally get it — nowadays it's hard enough to keep a tool, let alone bring something new in. And honestly, you're probably not buying this today, and I totally respect that. But when budget does free up — especially heading into high season — the people who move fast are the ones who already know what's on their list. Would you be open to just seeing it so you know it's out there? Fifteen minutes, no pressure.",
        "note": "Reframe: this isn't about buying today. It's about being informed for when budget opens up, likely around festival season revenue.",
        "branches": [
          {
            "label": "Alright, sure",
            "to": "book_meeting"
          },
          {
            "label": "You'd need to talk to Pablo or Erin about budget",
            "to": "referral_ask"
          },
          {
            "label": "Just send me info",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "end_graceful"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally fair. Here's what I'd suggest — you're not buying anything today, and I get that. But if nothing else, I can walk you and whoever runs your inspection process through what other PM companies in the desert are doing with their turnover photos. Worst case you steal some ideas and we part as friends. Would you be open to fifteen minutes?",
        "note": "Low-commitment ask. She gets value even if they never buy. Push to include her manager in the meeting.",
        "branches": [
          {
            "label": "Alright, let's do it",
            "to": "book_meeting"
          },
          {
            "label": "I'd need to check with Rosana / my manager",
            "to": "bridge_to_referral"
          },
          {
            "label": "Just send me something",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "end_graceful"
          }
        ]
      },
      "referral_ask": {
        "label": "REFERRAL — ASK FOR THE RIGHT PERSON",
        "say": "Totally hear you — and I appreciate you being straight with me. Who on your team typically owns the inspection workflow and would be the one to look at something like this? Would that be Rosana, or does it go through Marcela on the ops side?",
        "note": "Name-drop Rosana Castro (Inspections Manager) and Marcela De Dios (Operations Manager). You know the org chart — sound informed, not creepy.",
        "branches": [
          {
            "label": "Yeah, talk to Rosana",
            "to": "get_referral_details"
          },
          {
            "label": "Marcela would be the one",
            "to": "get_referral_details"
          },
          {
            "label": "You'd want to talk to Pablo or Erin",
            "to": "get_referral_details"
          },
          {
            "label": "Not sure / doesn't give a name",
            "to": "referral_push"
          }
        ]
      },
      "bridge_to_referral": {
        "label": "BRIDGE TO REFERRAL",
        "say": "Totally makes sense — you know what, I don't want to put you in a weird spot. If you could point me to whoever manages the inspection process or the ops side, I'll put something together specifically for them so it actually lands. Would that be Rosana or Marcela?",
        "note": "Make it easy for her. She doesn't have to sell internally — just connect you. Give her the names so she just has to confirm.",
        "branches": [
          {
            "label": "Gives a name / confirms Rosana or Marcela",
            "to": "get_referral_details"
          },
          {
            "label": "I can pass your info along",
            "to": "leave_info"
          },
          {
            "label": "Doesn't want to refer",
            "to": "end_graceful"
          }
        ]
      },
      "referral_push": {
        "label": "PUSH GENTLY FOR A NAME",
        "say": "No worries at all. Would it be cool if I just reached out to Rosana on the inspections side? I don't want to blindside anyone — if I can mention you pointed me her way, that'd help a ton.",
        "note": "Give her an easy yes. You already have the name — you just want her permission to use it as a warm intro.",
        "branches": [
          {
            "label": "Yeah, go ahead",
            "to": "get_referral_details"
          },
          {
            "label": "I'd rather you didn't use my name",
            "to": "leave_info"
          },
          {
            "label": "I don't know the best person",
            "to": "leave_info"
          }
        ]
      },
      "get_referral_details": {
        "label": "GET REFERRAL DETAILS",
        "say": "Perfect — do you have a direct number or email for them? The main support line can be a maze. I'll put something tailored together so it's actually relevant when I reach out.",
        "note": "Get a direct line if possible. Helios only has the general support email publicly — a direct number or personal email from Diana is gold.",
        "branches": [
          {
            "label": "Gives direct contact info",
            "to": "thank_and_close_referral"
          },
          {
            "label": "Just try the main number or support email",
            "to": "thank_and_close_referral"
          },
          {
            "label": "I'll have them call you",
            "to": "leave_info"
          }
        ]
      },
      "thank_and_close_referral": {
        "label": "CLOSE WITH REFERRAL",
        "say": "Really appreciate that, Diana. I'll reach out to them and mention you pointed me their way. And honestly, if you ever want to see what we're building — even just out of curiosity — I'm easy to find. Thanks for taking my call.",
        "note": "Leave the door open with Diana too. She's the end user — her buy-in matters even if she's not the decision-maker. Send the referral outreach within 24 hours.",
        "branches": []
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next week pulled up — how does Tuesday or Wednesday look? I can do morning or afternoon, whatever works around your walkthrough schedule.",
        "note": "Pick specific days. Lock it now. Inspectors have unpredictable field schedules — be flexible on time but firm on getting a day.",
        "branches": [
          {
            "label": "Picks a day and time",
            "to": "confirm_meeting"
          },
          {
            "label": "Let me check and get back to you",
            "to": "pin_down_meeting"
          },
          {
            "label": "I need to check with my manager first",
            "to": "bridge_to_referral"
          }
        ]
      },
      "book_meeting_diana": {
        "label": "BOOK MEETING WITH DIANA FIRST",
        "say": "Love it. Let's do that — I can show you what it looks like with real property photos, and if it clicks, you'd know exactly what to tell your team. How's next week look for fifteen minutes?",
        "note": "A meeting with Diana alone still has value. She can become an internal champion. Get her excited, then she brings it to Rosana and Marcela.",
        "branches": [
          {
            "label": "Picks a day and time",
            "to": "confirm_meeting"
          },
          {
            "label": "Let me check my schedule",
            "to": "pin_down_meeting"
          }
        ]
      },
      "confirm_meeting": {
        "label": "CONFIRM MEETING",
        "say": "Perfect — I'll send over a calendar invite right now so it's locked in. And if you want to loop in Rosana or anyone else from the team, totally up to you. Really appreciate you taking my call, Diana.",
        "note": "Send the invite WHILE on the phone. Suggest she adds her manager but don't force it. Stop selling — you got the meeting.",
        "branches": []
      },
      "pin_down_meeting": {
        "label": "PIN DOWN THE MEETING",
        "say": "Totally. How about I shoot you a quick email with a couple time slots and you just pick one? What's the best email to send that to?",
        "note": "Don't let it float. Get her email and send time options immediately after hanging up.",
        "branches": [
          {
            "label": "Gives email",
            "to": "confirm_meeting"
          },
          {
            "label": "Use the support email",
            "to": "confirm_meeting"
          },
          {
            "label": "I'll reach out to you",
            "to": "leave_info"
          }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most useful to include so it's not just another generic pitch sitting in your inbox? Like, is it more about what it looks like with your current setup, or more about what other vacation rental companies in the desert are doing?",
        "note": "Get intel on what matters to her so you can tailor the email. Always include a specific time suggestion in the follow-up.",
        "branches": [
          {
            "label": "Tells you what to include",
            "to": "confirm_email_address"
          },
          {
            "label": "Just send whatever",
            "to": "confirm_email_address"
          }
        ]
      },
      "confirm_email_address": {
        "label": "CONFIRM EMAIL ADDRESS",
        "say": "Got it — is there a direct email I should use, or should I go through the support address? Just want to make sure it doesn't get buried.",
        "note": "Try to get a personal email. If she only gives support@heliosvacations.com, that's okay — at least you have permission to send.",
        "branches": [
          {
            "label": "Gives personal or direct email",
            "to": "close_email"
          },
          {
            "label": "Use the support email",
            "to": "close_email"
          }
        ]
      },
      "close_email": {
        "label": "CLOSE — SENDING EMAIL",
        "say": "Perfect — I'll get that over to you today. I'll include a couple times to chat in case you want to take a look after reading it. Really appreciate your time, Diana.",
        "note": "Send the email within 30 minutes. Reference something specific from this conversation to prove it's personalized. Include two concrete time slots.",
        "branches": []
      },
      "leave_info": {
        "label": "LEAVE YOUR INFO",
        "say": "Totally fair — I'll shoot a quick note to the support email and mention we chatted. If it makes sense, great. If not, no hard feelings at all. It's Sam Parks at RapidEye — R-A-P-I-D-E-Y-E. Appreciate your time, Diana.",
        "note": "Spell it out clearly. Don't be bitter — she may still mention you to Rosana or Marcela internally.",
        "branches": []
      },
      "respect_and_referral": {
        "label": "RESPECT + SOFT REFERRAL",
        "say": "Hey, I really respect that. Last thing — if you ever hear anyone on the team mention inspection stuff being a pain, especially heading into festival season, would you keep me in mind? Sam Parks at RapidEye. I'm easy to find.",
        "note": "Plant the seed. Coachella season is coming and turnovers will get chaotic. When inspections become a headache she'll remember this call.",
        "branches": [
          {
            "label": "Sure / okay",
            "to": "end_graceful"
          },
          {
            "label": "Actually, you should just talk to Rosana or Marcela",
            "to": "get_referral_details"
          }
        ]
      },
      "end_graceful": {
        "label": "END GRACEFULLY",
        "say": "Totally understand. If anything changes, I'm easy to find. Appreciate your time, Diana.",
        "note": "Don't burn the bridge. She talks to Rosana and Marcela every single day. A good impression here can turn into a warm intro later.",
        "branches": []
      }
    }
  }
}