{
  "name": "Dustin Frandsen",
  "title": "General Manager / Partner",
  "company": "Moab Lodging & Property Management",
  "location": "Moab, UT",
  "phone": "+1-435-633-7033",
  "company_phone": "+1-800-505-5343",
  "alt_phones": [],
  "flow": {
    "context": "Dustin Frandsen is GM and Partner at Moab Lodging, managing 230+ vacation rentals in Moab, UT. He led their LMPM migration in 2022 and controls the tech stack. They run LMPM plus AppFolio backend with no dedicated inspection platform. Strong prospect given portfolio size and tech-forward approach.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENING",
        "say": "Hey Dustin, it's Sam Parks with RapidEye. I work with a few other property managers out in the Moab area on their inspection workflows. Have you heard my name tossed around?",
        "note": "Sound like a referral, not a cold call. Feet up on the desk energy.",
        "branches": [
          { "label": "No, I haven't", "to": "no_heard" },
          { "label": "Yeah / maybe", "to": "yes_heard" },
          { "label": "Bad time / can't talk", "to": "callback" },
          { "label": "Who is this? / confused", "to": "permission" }
        ]
      },
      "no_heard": {
        "label": "THEY HAVEN'T HEARD",
        "say": "Ha, I guess I'm not as popular as I thought. Well the reason for my call is — I work with another property manager in a pretty similar situation to you, about 200 units in a resort market running LMPM. Their big thing was after every turnover, someone's reviewing photos trying to spot a stain on the couch or a missing remote, and stuff was just slipping through. Guest checks in, finds a cracked shower door, now you're eating that cost because nobody caught it in the photos. We built something that plugs into the photos your team is already taking and flags the damage automatically. Would you be open to taking a look when I'm not cold calling you out of the blue?",
        "note": "PAUSE after this. Let the silence work. He'll either relate to the pain or push back — both are good.",
        "branches": [
          { "label": "That's interesting / yeah we deal with that", "to": "warm_discovery" },
          { "label": "Not interested", "to": "obj_not_interested" },
          { "label": "We already have something", "to": "obj_have_vendor" },
          { "label": "Send me an email", "to": "send_email" }
        ]
      },
      "yes_heard": {
        "label": "THEY'VE HEARD",
        "say": "Oh nice, well normally we'd be working with someone like you. What did you hear?",
        "note": "Let them talk. Whatever they say, use it to transition into discovery. Don't correct or pitch yet.",
        "branches": [
          { "label": "They share what they know", "to": "warm_discovery" },
          { "label": "They're vague / redirect", "to": "no_heard" }
        ]
      },
      "callback": {
        "label": "CALLBACK",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow or later this week?",
        "note": "Lock in a specific day. Don't say 'I'll try again sometime.'",
        "branches": [
          { "label": "Sure, try me [day]", "to": "end_callback" },
          { "label": "Just send me an email", "to": "send_email" },
          { "label": "No thanks", "to": "graceful_exit" }
        ]
      },
      "permission": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not a fit?",
        "note": "Own the interruption with honesty. This earns permission.",
        "branches": [
          { "label": "Sure, go ahead", "to": "no_heard" },
          { "label": "No / not interested", "to": "permission_reject" }
        ]
      },
      "permission_reject": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and this just isn't interesting?",
        "note": "Split the objection. Make it easy to answer.",
        "branches": [
          { "label": "Bad time", "to": "callback" },
          { "label": "Not interested / know what you do", "to": "obj_not_interested" }
        ]
      },
      "warm_discovery": {
        "label": "DISCOVERY",
        "say": "That's great to hear. So what does your inspection process look like right now across the 230 properties? Are your cleaners taking photos after every turn?",
        "note": "STOP PITCHING. Ask questions. The more they talk, the more invested they are.",
        "branches": [
          { "label": "They describe their process", "to": "discovery_deeper" },
          { "label": "We use Breezeway / similar", "to": "obj_have_vendor" },
          { "label": "We don't really have one", "to": "discovery_no_process" }
        ]
      },
      "discovery_deeper": {
        "label": "DIG DEEPER",
        "say": "Interesting. And when something does get missed — a stain, a broken fixture, something that wasn't there before the guest — how are you handling that? Are you eating the cost or going after the deposit?",
        "note": "Keep them talking. Learn their pain. This is where you get ammo for the close.",
        "branches": [
          { "label": "They share pain / frustration", "to": "book_meeting" },
          { "label": "It's not a big problem for us", "to": "offer_value" }
        ]
      },
      "discovery_no_process": {
        "label": "NO PROCESS",
        "say": "Yeah that's actually super common. A lot of the managers I talk to are in that same spot — photos are getting taken but nobody's really reviewing them systematically. That's exactly what we help with. Would you be open to taking a look?",
        "note": "Light close. Don't oversell.",
        "branches": [
          { "label": "Sure", "to": "book_meeting" },
          { "label": "Maybe / not sure", "to": "offer_value" },
          { "label": "Not right now", "to": "obj_not_interested" }
        ]
      },
      "obj_not_interested": {
        "label": "NOT INTERESTED",
        "say": "I totally get it. I should have assumed you'd be all set — otherwise you probably would have reached out to me.",
        "note": "AGREE first. Pull the chair out. Then incentivize.",
        "branches": [
          { "label": "(pause) — continue", "to": "obj_ni_split" }
        ]
      },
      "obj_ni_split": {
        "label": "SPLIT THE OBJECTION",
        "say": "Just so no one from my team cold calls you again — is it that this isn't a problem you're focused on right now, or is it more that you just hate getting cold calls?",
        "note": "Multiple choice makes it easy to answer. Either path gives you info.",
        "branches": [
          { "label": "Not focused on it", "to": "offer_value" },
          { "label": "Hate cold calls", "to": "offer_value" },
          { "label": "Genuinely not a fit", "to": "referral" }
        ]
      },
      "obj_have_vendor": {
        "label": "ALREADY HAVE SOMETHING",
        "say": "That makes total sense — with 230 properties you'd have to have something in place.",
        "note": "AGREE. Don't compete with their vendor yet.",
        "branches": [
          { "label": "(pause) — continue", "to": "obj_vendor_split" }
        ]
      },
      "obj_vendor_split": {
        "label": "SPLIT THE OBJECTION",
        "say": "Just so nobody bugs you again — is it that you're fully covered and happy with what you have, or is it more that switching anything right now would be a headache?",
        "note": "If they're 'happy' — push on specifics. If 'switching is hard' — that's your in.",
        "branches": [
          { "label": "Happy with current tool", "to": "offer_value" },
          { "label": "Switching is a pain", "to": "offer_value" },
          { "label": "Genuinely covered", "to": "referral" }
        ]
      },
      "offer_value": {
        "label": "OFFER OF VALUE",
        "say": "Totally fair. You're probably not buying anything right now, and I respect that. But if nothing else, I could walk you through what a couple other PM companies in the Moab area are doing with their turnover photos right now. Worst case you steal a few ideas and we part as friends.",
        "note": "Sell the meeting, not the product. The meeting is worth their time even if they never buy.",
        "branches": [
          { "label": "Sure, I'd be open to that", "to": "book_meeting" },
          { "label": "Not right now", "to": "referral" },
          { "label": "Send me an email", "to": "send_email" }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next Tuesday pulled up — how does 2pm Mountain look for a quick 15 minutes?",
        "note": "Pick a SPECIFIC day and time. Send the invite while on the phone. Once booked, STOP SELLING.",
        "branches": [
          { "label": "That works", "to": "end_booked" },
          { "label": "Different time", "to": "end_booked" },
          { "label": "Let me check and get back", "to": "send_email" }
        ]
      },
      "referral": {
        "label": "REFERRAL",
        "say": "Totally understand. Quick question — at what level does someone on your team own the inspection workflow? Like is that an ops director thing or more of a property manager thing?",
        "note": "Don't ask 'who should I talk to' directly. Learn the title first, then ask for a name.",
        "branches": [
          { "label": "They give a title / name", "to": "end_referral" },
          { "label": "That's me / nobody", "to": "graceful_exit" }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One question before I do — what would be most relevant to include so it's not just another generic pitch in your inbox?",
        "note": "Accept the email, then qualify it. Your follow-up is now tailored instead of ignored.",
        "branches": [
          { "label": "They tell you what to include", "to": "end_email" },
          { "label": "Just send whatever", "to": "end_email" }
        ]
      },
      "end_booked": {
        "label": "MEETING BOOKED",
        "say": "Perfect, I'll get that invite over to you right now. Really appreciate you taking my call, Dustin. Looking forward to it.",
        "note": "STOP SELLING. Send the invite immediately. Keep it warm and short.",
        "branches": []
      },
      "end_callback": {
        "label": "CALLBACK SET",
        "say": "Perfect, I'll give you a ring then. Appreciate your time, Dustin.",
        "note": "Log the callback time immediately after hanging up.",
        "branches": []
      },
      "end_referral": {
        "label": "GOT REFERRAL",
        "say": "That's super helpful. If I can get a name, I'll put something tailored together so it actually lands instead of getting lost in the noise.",
        "note": "This person is now your warmest next call. Use '[Dustin] on your team suggested I reach out.'",
        "branches": []
      },
      "end_email": {
        "label": "EMAIL FOLLOW-UP",
        "say": "Got it, I'll send that over today. And I'll include a specific time suggestion in case you want to hop on a quick call after you've had a chance to look. Appreciate it, Dustin.",
        "note": "Send the email within the hour. Include a specific day/time for a follow-up call.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes, I'm easy to find. Appreciate your time, Dustin.",
        "note": "Don't burn bridges. You might call again in 3 months.",
        "branches": []
      },
      "gatekeeper": {
        "label": "GATEKEEPER",
        "say": "Could you get me through to Dustin? It's Sam.",
        "note": "Keep it short. No extra detail. Sound like you belong.",
        "branches": [
          { "label": "Putting you through", "to": "opener" },
          { "label": "What's this about?", "to": "gatekeeper_2" },
          { "label": "He's not available", "to": "callback" }
        ]
      },
      "gatekeeper_2": {
        "label": "GATEKEEPER — CONTEXT",
        "say": "Yeah, I work with a few other property managers in the Moab area. Would you mind letting him know it's Sam Parks?",
        "note": "End with a redirect question. You control the conversation.",
        "branches": [
          { "label": "Putting you through", "to": "opener" },
          { "label": "Can you tell me more?", "to": "gatekeeper_3" },
          { "label": "He's not available", "to": "callback" }
        ]
      },
      "gatekeeper_3": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "Sure — we help a couple other property management companies with their inspection workflows. I sent Dustin a note the other day. Would you mind giving him a heads up?",
        "note": "Last attempt. If they still block, ask for a callback time or voicemail.",
        "branches": [
          { "label": "Putting you through", "to": "opener" },
          { "label": "Still blocked", "to": "callback" }
        ]
      }
    }
  }
}
