{
  "name": "Dustin Frandsen",
  "title": "General Manager / Partner",
  "company": "Moab Lodging & Property Management",
  "location": "Moab, UT",
  "phone": "+1-435-633-7033",
  "company_phone": "+1-800-505-5343",
  "alt_phones": [],
  "flow": {
    "context": "Calling Dustin Frandsen — GM and Partner at Moab Lodging & Property Management, the oldest and largest PM company in Moab, UT, managing 230+ units. He merged his own company into MPM in 2012 and personally led their migration to LMPM software in January 2022 — tech-forward, values easy onboarding and responsive support. Runs lean with roughly 10 staff for 230-plus units, and a recent October 2024 guest review praises maintenance guy Carlos but flags inventory issues like worn cookware slipping past turnovers. He is an owner-partner with equity in the business, not just a hired manager. Strongest angle: Sam works with similar-sized PM companies in high-turnover vacation markets and both operate in the outdoor adventure economy.",
    "start": "call_start",
    "nodes": {
      "call_start": {
        "label": "DIAL",
        "say": "Calling Dustin Frandsen — 435-633-7033.",
        "note": "This is his cell. If using the office line (435-259-5955) and someone else answers, use the gatekeeper branch. Read context above. Take a breath.",
        "branches": [
          {
            "label": "Dustin answers",
            "to": "opener"
          },
          {
            "label": "Voicemail",
            "to": "voicemail"
          },
          {
            "label": "Someone else answers",
            "to": "gatekeeper"
          }
        ]
      },
      "opener": {
        "label": "OPENER",
        "say": "Hey Dustin — I've been working with a few other vacation rental managers in high-turnover markets like Moab. This is Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Feet up on the desk. Relaxed. You are a peer in his industry, not a telemarketer. Smile while you say it. Let the question hang.",
        "branches": [
          {
            "label": "\"Yeah\" / \"I think so\"",
            "to": "heard_yes"
          },
          {
            "label": "\"No\" / \"Can't say I have\"",
            "to": "heard_no"
          },
          {
            "label": "\"I'm busy\" / bad timing",
            "to": "bad_timing"
          },
          {
            "label": "\"What is this?\" / suspicious",
            "to": "permission_fallback"
          }
        ]
      },
      "heard_yes": {
        "label": "HEARD YES",
        "say": "Oh nice — well typically we'd be working with someone in your shoes on the inspection side. What'd you hear?",
        "note": "Rare on a cold call but great if it happens. Let him talk. Whatever he says, bridge naturally into the pain trigger.",
        "branches": [
          {
            "label": "Shares something / curious",
            "to": "pain_trigger"
          },
          {
            "label": "Confused / thinking of someone else",
            "to": "pain_trigger"
          }
        ]
      },
      "heard_no": {
        "label": "HEARD NO",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call —",
        "note": "Keep the energy light. No pause here — transition straight into the pain trigger without waiting for permission.",
        "branches": [
          {
            "label": "Listening / quiet",
            "to": "pain_trigger"
          },
          {
            "label": "Pushback / \"is this a sales call?\"",
            "to": "permission_fallback"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow morning? Or is later this week better?",
        "note": "Be respectful. Offer two specific windows. Do not pitch. Just lock a callback time.",
        "branches": [
          {
            "label": "Gives a time",
            "to": "bad_timing_locked"
          },
          {
            "label": "\"Don't call back\"",
            "to": "graceful_exit"
          },
          {
            "label": "\"What's this about first?\"",
            "to": "permission_fallback"
          }
        ]
      },
      "bad_timing_locked": {
        "label": "CALLBACK LOCKED",
        "say": "Perfect — I'll try you then. Appreciate it, Dustin.",
        "note": "Log the callback time in your CRM immediately. Do not add anything else. Hang up clean.",
        "branches": []
      },
      "voicemail": {
        "label": "VOICEMAIL",
        "say": "Hey Dustin — it's Sam Parks. I work with a few vacation rental managers in markets like Moab on their inspection workflows. Was hoping to run something by you real quick. Gonna try you again in a day or two — but if you want to grab me first, it's [your number]. Again, Sam Parks with RapidEye.",
        "note": "Under 20 seconds. Casual, not rehearsed. Do not explain the product. Just enough curiosity for a possible callback. Call again in 48 hours.",
        "branches": []
      },
      "gatekeeper": {
        "label": "GATEKEEPER",
        "say": "Hey — could you get me through to Dustin? It's Sam.",
        "note": "First name only. Do not volunteer anything. Sound like you are expected. If they probe, move to the next step.",
        "branches": [
          {
            "label": "Transfers you",
            "to": "opener"
          },
          {
            "label": "\"Who's calling?\" / \"What's this about?\"",
            "to": "gatekeeper_context"
          },
          {
            "label": "\"He's not available\"",
            "to": "gatekeeper_social_proof"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — CONTEXT",
        "say": "Yeah — I work with a few other property managers in the area. Would you mind letting him know it's Sam Parks?",
        "note": "Dose info slowly. Do not pitch. If they still block, escalate to social proof.",
        "branches": [
          {
            "label": "Transfers you",
            "to": "opener"
          },
          {
            "label": "Still blocking",
            "to": "gatekeeper_social_proof"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "We help a couple other vacation rental companies with their inspection workflows — I sent him a note and just wanted to follow up. Would you mind passing along that Sam Parks called?",
        "note": "Last attempt. If they offer voicemail, take it. If hard no, exit and try the cell next time.",
        "branches": [
          {
            "label": "Transfers you",
            "to": "opener"
          },
          {
            "label": "Offers voicemail",
            "to": "voicemail"
          },
          {
            "label": "Hard no",
            "to": "graceful_exit"
          }
        ]
      },
      "permission_fallback": {
        "label": "PERMISSION ASK",
        "say": "Yeah totally — I mean it is a cold call. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not a fit?",
        "note": "Disarm with honesty. The 30-seconds-plus-permission-to-hang-up frame makes it feel low risk. If he grants it, go straight to pain.",
        "branches": [
          {
            "label": "\"Sure\" / \"Go ahead\"",
            "to": "pain_trigger"
          },
          {
            "label": "\"No\" / \"I'm good\"",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and it's just not interesting?",
        "note": "Split the objection into timing versus topic. If timing, you get a callback window. If topic, exit clean and do not push.",
        "branches": [
          {
            "label": "\"It's the timing\"",
            "to": "bad_timing"
          },
          {
            "label": "\"Not interested\" / topic",
            "to": "graceful_exit"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "I was talking to another vacation rental manager running a couple hundred units in a resort town — pretty similar setup to yours. He was saying that even after modernizing their PMS — bookings, trust accounting, all dialed in — the one thing they still couldn't crack was visual quality control on turnovers. Their cleaning team's doing their best, but when a big group checks out and the next guest's arriving that same afternoon — worn-out cookware stays in the kitchen, a scuff on the wall doesn't get flagged, and it ends up in a guest review instead of a maintenance ticket.",
        "note": "STOP TALKING after maintenance ticket. Count to three in your head. The trust-accounting line mirrors his LMPM migration. The worn-out cookware mirrors the October 2024 guest review about his properties. Let the silence work. Wait for him to react.",
        "branches": [
          {
            "label": "Engages / \"Yeah that sounds familiar\"",
            "to": "discovery_warm"
          },
          {
            "label": "\"We already have a process for that\"",
            "to": "objection_have_process"
          },
          {
            "label": "\"Not really interested\"",
            "to": "objection_not_interested"
          },
          {
            "label": "\"Just send me something\"",
            "to": "send_email"
          }
        ]
      },
      "discovery_warm": {
        "label": "DISCOVERY — PROCESS",
        "say": "Yeah — so with 230-plus units turning over, how are you guys handling the quality control side right now? Is that mostly on your cleaning crew, or do you have a separate inspection step?",
        "note": "STOP PITCHING. Ask and listen. If he mentions LMPM, say Oh you are on LMPM? That is solid. If he mentions a maintenance person or Carlos, lean in and ask how big that team is. Take notes on everything.",
        "branches": [
          {
            "label": "Describes process / shares details",
            "to": "discovery_deep"
          },
          {
            "label": "\"What exactly do you guys do?\"",
            "to": "solution_and_cta"
          },
          {
            "label": "Short answers / getting cold",
            "to": "solution_and_cta"
          }
        ]
      },
      "discovery_deep": {
        "label": "DISCOVERY — PAIN DIG",
        "say": "Got it. And when something does slip through — like a guest flags an issue in a review that should've been caught before check-in — how does that usually play out? Does that land on your plate directly, or does your maintenance team just handle it?",
        "note": "You know from research this happens — worn cookware in the Oct 2024 review, Carlos getting called for avoidable issues. If he shares frustration, mirror his exact language back. If he mentions guest reviews hurting their reputation, that connects to their local-authority brand positioning. Do not reveal you read the review.",
        "branches": [
          {
            "label": "Shares real frustration",
            "to": "solution_and_cta"
          },
          {
            "label": "Downplays / \"it's manageable\"",
            "to": "solution_and_cta"
          },
          {
            "label": "Clearly ready to see more",
            "to": "book_meeting"
          }
        ]
      },
      "solution_and_cta": {
        "label": "SOLUTION + CTA",
        "say": "That makes sense. So what we built — RapidEye plugs into the turnover photos your team's already taking and uses AI to automatically flag damage, missing items, cleaning misses — before the next guest checks in. No workflow change for your crew. Would you be open to taking a look sometime when I'm not cold calling you out of the blue?",
        "note": "Two sentences on the product. One sentence CTA. That is it. Do not demo on the phone. If he asks how it integrates with LMPM, say we can walk through the technical side on a proper call — that is a buying signal, so book the meeting.",
        "branches": [
          {
            "label": "\"Sure\" / open to meeting",
            "to": "book_meeting"
          },
          {
            "label": "Asks questions / wants details",
            "to": "discovery_warm"
          },
          {
            "label": "Pushes back / \"not right now\"",
            "to": "objection_reopened"
          },
          {
            "label": "\"Send me an email\"",
            "to": "send_email"
          }
        ]
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "Totally get it. I should've assumed you'd be all set — otherwise you probably would've reached out to us already. Just so no one from my team cold calls you again — is it that inspections just aren't a focus right now, or is it more that you hate getting cold calls?",
        "note": "Agree first — it surprises them. The split question separates the interruption reaction from actual disinterest. Most people on a cold call are reacting to the interruption, not the topic.",
        "branches": [
          {
            "label": "\"Hate cold calls\" / softens",
            "to": "objection_reopened"
          },
          {
            "label": "\"Not a focus\" / gives a reason",
            "to": "objection_reopened"
          },
          {
            "label": "Hard no / wants off phone",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_have_process": {
        "label": "OBJECTION — HAVE A PROCESS",
        "say": "That makes total sense — with 230-plus units you'd have to have something dialed in by now. Just curious — is it that you're fully covered and happy with how it's working, or is it more that changing anything up right now would be a headache?",
        "note": "He has run this for 12-plus years and invested in LMPM — he has earned the right to feel covered. Respect that. If he says happy, go to value offer. If he says switching is hard, that is your opening — RapidEye layers on top with no rip-and-replace.",
        "branches": [
          {
            "label": "\"We're happy\" / fully covered",
            "to": "value_offer"
          },
          {
            "label": "\"Switching is a pain\" / process concern",
            "to": "objection_reopened"
          },
          {
            "label": "Opens up about gaps",
            "to": "discovery_warm"
          }
        ]
      },
      "objection_no_budget": {
        "label": "OBJECTION — NO BUDGET",
        "say": "Totally get it. Running 230 units in a seasonal market like Moab — nowadays it's harder to keep a tool, let alone bring on something new. Is it that budget this cycle is completely locked, or is it more that anything new has to justify itself right out of the gate?",
        "note": "He is an owner-partner so he likely controls the budget. This might be real or a brush-off. The split tells you which. If budget is truly locked, pivot to value offer and plant the seed for next cycle — spring prep season or post-summer.",
        "branches": [
          {
            "label": "\"Budget is locked\" / firm",
            "to": "value_offer"
          },
          {
            "label": "\"Has to justify itself\" / softens",
            "to": "objection_reopened"
          },
          {
            "label": "Hard no",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_reopened": {
        "label": "SELL THE TEST DRIVE",
        "say": "That's totally fair. Look — you're probably not buying anything off a cold call today, and I completely respect that. But the managers who move fastest on this stuff are the ones who already know what's on their list before budget opens up. Would you be open to a 15-minute look — no pitch, no pressure — just so it's on your radar?",
        "note": "Low-commitment test-drive close. If he still says no, go to value offer for one more shot reframed as stealing ideas. After that, accept the no gracefully.",
        "branches": [
          {
            "label": "\"Sure\" / agrees",
            "to": "book_meeting"
          },
          {
            "label": "\"Just send me something\"",
            "to": "send_email"
          },
          {
            "label": "Still no",
            "to": "value_offer"
          }
        ]
      },
      "value_offer": {
        "label": "VALUE OFFER",
        "say": "Totally hear you. If nothing else — I could walk you through what a few other PM companies in markets like Moab are doing with their turnover photos and inspection workflows right now. Worst case you steal a few ideas and we part as friends. Would that be worth 15 minutes?",
        "note": "This reframes the meeting as valuable to him whether he buys or not. Consultative, not salesy. This is your last real swing before send-email or graceful exit. Do not push again after this.",
        "branches": [
          {
            "label": "\"Sure\" / \"That could be useful\"",
            "to": "book_meeting"
          },
          {
            "label": "\"Send me something first\"",
            "to": "send_email"
          },
          {
            "label": "No",
            "to": "graceful_exit"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next Tuesday and Thursday pulled up — which one's better for you? Thinking 15 minutes, late morning your time?",
        "note": "Two specific days. Specific duration. Specific time of day. Lock it NOW. Do not say sometime next week. Send the calendar invite while still on the phone if possible. He is Mountain Time.",
        "branches": [
          {
            "label": "Picks a time",
            "to": "meeting_booked"
          },
          {
            "label": "\"Neither works\" / suggests different time",
            "to": "book_meeting_alt"
          },
          {
            "label": "\"Talk to someone on my team\"",
            "to": "referral"
          },
          {
            "label": "\"No budget right now\" / hesitates",
            "to": "objection_no_budget"
          }
        ]
      },
      "book_meeting_alt": {
        "label": "MEETING — ALT TIME",
        "say": "No problem — what does your week after next look like? I'm flexible.",
        "note": "Let him pick. Whatever he says, confirm immediately and move to meeting booked. Do not negotiate — just lock it in.",
        "branches": [
          {
            "label": "Gives a time",
            "to": "meeting_booked"
          },
          {
            "label": "\"Just email me\" / noncommittal",
            "to": "send_email"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING BOOKED",
        "say": "Perfect — I'll send you a calendar invite right now. It'll come from sam@rapideye.ai. Really appreciate you taking my call, Dustin. Talk to you then.",
        "note": "STOP SELLING. Send the invite immediately. Confirm his email — use dustin@moabpg.com unless he gives a different one. Keep it warm and brief. You are done.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. Quick question before I do — what would be most useful to include so it doesn't just end up in the pile? Would it be more helpful to see what it looks like with actual turnover photos, or more the time-and-cost savings side?",
        "note": "Accept the email request gracefully, then get intel so the email actually gets opened. Whatever he says, confirm and close. Use dustin@moabpg.com unless he gives another address.",
        "branches": [
          {
            "label": "Gives guidance",
            "to": "send_email_close"
          },
          {
            "label": "\"Just send whatever\" / vague",
            "to": "send_email_close"
          }
        ]
      },
      "send_email_close": {
        "label": "EMAIL CONFIRMED",
        "say": "Got it — I'll get that over to you today and include a couple times to connect next week in case anything catches your eye. Appreciate your time, Dustin.",
        "note": "Send within 30 minutes. Reference something specific from this conversation. Include two specific follow-up time options. Subject line should reference Moab or his unit count — not a generic pitch. Follow up by phone in 3 to 5 days if no reply.",
        "branches": []
      },
      "referral": {
        "label": "REFERRAL",
        "say": "Totally makes sense. Who on your team is closest to the day-to-day turnover and inspection workflow? Just want to make sure I'm reaching the right person so it actually lands.",
        "note": "Dustin may delegate to an ops manager or head of housekeeping. If he gives a name, get their contact info. If he says that is me, loop back to booking. Do not bring up Andrea Martin — she likely left the company years ago.",
        "branches": [
          {
            "label": "Gives a name",
            "to": "referral_close"
          },
          {
            "label": "\"That's me\" / \"I handle it\"",
            "to": "book_meeting"
          },
          {
            "label": "Doesn't know / vague",
            "to": "graceful_exit"
          }
        ]
      },
      "referral_close": {
        "label": "REFERRAL CLOSE",
        "say": "Perfect — what's the best way to reach them? I'll put something tailored together so it's not just a random cold call for them. Really appreciate the help, Dustin.",
        "note": "Get name, title, phone or email. Log immediately. When you call the referral, open with Dustin Frandsen suggested I reach out — that turns this into a warm intro.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes, I'm easy to find — Sam Parks at RapidEye. Appreciate your time, Dustin.",
        "note": "Do not burn the bridge. Stay warm. Log the outcome and set a follow-up reminder for 60 to 90 days. Spring prep season in Moab starts around February — that may be a better window.",
        "branches": []
      }
    }
  }
}