{
  "name": "Eileen Dela Llana",
  "title": "Real Estate / Leasing Contact",
  "company": "Mission Sands",
  "location": "San Diego, CA",
  "phone": "+1-858-488-3980",
  "company_phone": "(858) 488-2550",
  "alt_phones": [
    "+1-800-779-7263",
    "+1-858-566-3410"
  ],
  "flow": {
    "context": "Eileen Dela Llana is a real estate and leasing contact at Mission Sands, a family-owned vacation rental company managing 75+ properties across Mission Beach, Pacific Beach, and La Jolla in San Diego. She handles showings and inquiries for their corporate and monthly rental program (30-day to 6-month stays) and is listed as a buyer's agent — so she touches move-in condition documentation but likely does NOT own the inspection workflow or tooling decisions. Those sit with George You (President), Jennifer Ringle (GM), or the assistant property managers (Edgar Quinonez, Evan Osunabaez). Mission Sands uses Streamline as their PMS and SafetyCulture (iAuditor) for their 40-point iPad inspections after every departure — they already have structured, photo-heavy inspection artifacts. Sam's angle: grew up in LA, surfs regularly (Mission Beach market), and works with other San Diego-area vacation rental operators. Primary goal on this call is to engage Eileen, probe whether she influences condition documentation for longer-term placements, and back into a warm referral to George or Jennifer.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Eileen — I work with a few vacation rental managers down in the San Diego beach market. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Relaxed tone. Sound like a peer calling a peer, not a salesperson. Pause and let her answer. Feet up on the desk energy.",
        "branches": [
          {
            "label": "Yes / Maybe / Sounds familiar",
            "to": "opener_yes"
          },
          {
            "label": "No / Who? / I haven't",
            "to": "opener_no"
          },
          {
            "label": "Bad timing / I'm busy / In a showing",
            "to": "bad_timing"
          },
          {
            "label": "What is this about? / Are you selling something?",
            "to": "permission_fallback"
          }
        ]
      },
      "opener_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone in your world. What did you hear?",
        "note": "Let her talk. Whatever she says, use it to steer into the pain trigger or discovery. Don't rush to pitch.",
        "branches": [
          {
            "label": "Describes something vague or asks what you do",
            "to": "pain_trigger"
          },
          {
            "label": "Mentions inspections or property condition",
            "to": "warm_response"
          },
          {
            "label": "Says she's not the right person for this",
            "to": "not_right_person"
          }
        ]
      },
      "opener_no": {
        "label": "HAVEN'T HEARD OF YOU",
        "say": "Oh, I guess I'm not as popular as I thought. Well the reason for my call — I've been talking to a few property managers who handle longer-term and corporate rentals in San Diego, and there's this issue that keeps coming up around move-in condition documentation. Figured it'd make sense to reach out since you handle a lot of Mission Sands' leasing and corporate placements. You got a quick second?",
        "note": "Transition smoothly. Mention her specific role to show you did homework. Don't pitch yet — just earn the next 30 seconds.",
        "branches": [
          {
            "label": "Sure / Go ahead / What's the issue?",
            "to": "pain_trigger"
          },
          {
            "label": "I'm really busy right now",
            "to": "bad_timing"
          },
          {
            "label": "What are you selling?",
            "to": "permission_fallback"
          },
          {
            "label": "I don't handle that / Wrong person",
            "to": "not_right_person"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow, maybe around this same time?",
        "note": "Don't push. Get a callback window. If she gives a time, lock it in and move on.",
        "branches": [
          {
            "label": "Sure, try me tomorrow / Gives a time",
            "to": "callback_confirmed"
          },
          {
            "label": "Just email me",
            "to": "email_question"
          },
          {
            "label": "Not interested / Don't call back",
            "to": "graceful_exit"
          }
        ]
      },
      "callback_confirmed": {
        "label": "CALLBACK LOCKED",
        "say": "Perfect — I'll give you a ring then. Appreciate it, Eileen.",
        "note": "Log the callback time immediately. Don't try to squeeze in a pitch. Keep it short and warm.",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION ASK",
        "say": "Yeah totally — I mean it is a cold call, I'll be honest. Can I get 30 seconds to tell you why I reached out? And you can totally hang up on me if it's not a fit.",
        "note": "Disarm with honesty. Asking for 30 seconds is low commitment. Most people will grant it out of curiosity.",
        "branches": [
          {
            "label": "Fine / Go ahead / 30 seconds",
            "to": "pain_trigger"
          },
          {
            "label": "No thanks / Not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "REJECTED — SPLIT THE OBJECTION",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it more that you already know what we do and it's just not interesting?",
        "note": "Give her two doors. If it's timing, you get a callback. If it's disinterest or wrong person, you can still back into a referral.",
        "branches": [
          {
            "label": "It's just bad timing",
            "to": "bad_timing"
          },
          {
            "label": "I'm not the right person for this",
            "to": "not_right_person"
          },
          {
            "label": "Just not interested / Please don't call",
            "to": "graceful_exit"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "So here's what I keep hearing — I was talking to another manager who does a mix of short-term vacation stays and longer corporate placements, kind of similar to what you guys do at Mission Sands. And they were saying — the short stays are tough enough with turnover inspections, but the corporate and monthly tenants are where the real headaches hit. Someone moves in for three months, something gets damaged six weeks in, and when they move out it's this whole argument about what was already there versus what they did. And even with photos at move-in, it's like — who's reviewing all of those closely enough to actually catch what changed? Stuff slips through, and then you're eating the cost or fighting with a tenant over it.",
        "note": "Tailored to Eileen's world — longer-term corporate placements, not just vacation turnovers. PAUSE after delivering this. Let her react. Do not rush to the solution.",
        "branches": [
          {
            "label": "Yeah / That's real / We deal with that",
            "to": "warm_response"
          },
          {
            "label": "We actually have a pretty good process for that",
            "to": "objection_have_process"
          },
          {
            "label": "I don't really handle that side of things",
            "to": "not_right_person"
          },
          {
            "label": "Not really a problem for us",
            "to": "objection_not_interested"
          }
        ]
      },
      "warm_response": {
        "label": "THEY'RE WARM — STOP PITCHING",
        "say": "Yeah, that's exactly what I keep hearing. So I'm curious — on your end, when you've got a corporate tenant moving into one of the Mission Sands properties, what does the condition documentation look like going in? Are you guys using your iPad inspection process for those too, or is it more of a separate thing?",
        "note": "She might not know about the SafetyCulture process in detail. That's fine — you're probing to learn what SHE touches. If she defers to ops, that's your referral opening.",
        "branches": [
          {
            "label": "Describes their process / We do photos at move-in",
            "to": "discovery_deeper"
          },
          {
            "label": "That's more on the property management side / Jennifer or the APMs handle that",
            "to": "referral_from_warm"
          },
          {
            "label": "I'm not sure exactly how they do it",
            "to": "referral_from_warm"
          },
          {
            "label": "We use SafetyCulture / The iPad checklists",
            "to": "they_mention_safetyculture"
          }
        ]
      },
      "discovery_deeper": {
        "label": "DISCOVERY — DIG IN",
        "say": "Got it. And when something does come back damaged after a longer stay — who's typically the one going back through those move-in photos and trying to figure out if it was pre-existing? Is that falling on you, or someone else on the team?",
        "note": "You're mapping the workflow and figuring out who owns condition disputes. This tells you whether Eileen is a user or a referral path.",
        "branches": [
          {
            "label": "That's usually me / I deal with some of it",
            "to": "solution_pitch"
          },
          {
            "label": "That's more Jennifer / George / The property managers",
            "to": "referral_from_warm"
          },
          {
            "label": "We haven't had major issues with that honestly",
            "to": "soft_pivot_to_referral"
          }
        ]
      },
      "they_mention_safetyculture": {
        "label": "THEY MENTION SAFETYCULTURE OR IPAD INSPECTIONS",
        "say": "Yeah, I actually saw you guys have that 40-point iPad inspection setup — which is more than most companies do, honestly. The thing I keep hearing from teams that already have a structured checklist is that the photos are getting taken, the data's there, but nobody has time to actually review every single photo closely enough to catch what changed between stays. Especially across 75-plus units. That's actually the specific thing we built RapidEye for — it takes the photos you're already capturing and uses AI to flag what's different. No workflow change, it just plugs in. Would it make sense for me to show that to whoever runs your inspection process day-to-day?",
        "note": "Acknowledge their existing process is strong. Position RapidEye as the layer on top — not a replacement for SafetyCulture. Then pivot toward a referral since Eileen likely doesn't own this decision.",
        "branches": [
          {
            "label": "That's interesting / Tell me more",
            "to": "solution_detail"
          },
          {
            "label": "You'd want to talk to Jennifer or George about that",
            "to": "referral_from_warm"
          },
          {
            "label": "I think we're pretty covered with what we have",
            "to": "objection_have_process"
          },
          {
            "label": "Send me some info on it",
            "to": "email_question"
          }
        ]
      },
      "not_right_person": {
        "label": "NOT THE RIGHT PERSON",
        "say": "That makes total sense — I appreciate you telling me that. I figured since you handle a lot of the leasing and corporate placements, you might touch some of the condition documentation stuff. Who on your team would be the one running the inspection process? Would that be Jennifer, or does it go straight to George?",
        "note": "Name-drop Jennifer Ringle (GM) and George You (President) naturally. You know who they are from research. This shows you're not fishing blindly and makes her more comfortable referring.",
        "branches": [
          {
            "label": "That'd be Jennifer",
            "to": "referral_jennifer"
          },
          {
            "label": "You'd want to talk to George",
            "to": "referral_george"
          },
          {
            "label": "Mentions Edgar or Evan or another name",
            "to": "referral_apm"
          },
          {
            "label": "I'm not sure / Doesn't give a name",
            "to": "referral_push"
          }
        ]
      },
      "referral_from_warm": {
        "label": "WARM REFERRAL TRANSITION",
        "say": "That's super helpful. So who would be the best person for me to reach out to about the inspection side of things? I want to make sure I'm not wasting your time with the wrong conversation. Would that be Jennifer Ringle, or does George handle that directly?",
        "note": "She was engaged but it's not her domain. Pivot cleanly to a referral. Drop the names you already know to make it easy for her.",
        "branches": [
          {
            "label": "Talk to Jennifer",
            "to": "referral_jennifer"
          },
          {
            "label": "Talk to George",
            "to": "referral_george"
          },
          {
            "label": "Mentions Edgar or Evan or another name",
            "to": "referral_apm"
          },
          {
            "label": "Not sure / Try the main line",
            "to": "referral_push"
          }
        ]
      },
      "soft_pivot_to_referral": {
        "label": "SOFT PIVOT — NO PAIN FELT",
        "say": "That's great — honestly, having a clean process is half the battle. I'd still love to show your team what we're doing with some of the other San Diego managers, even if it's just to trade notes. Who would be the best person to loop in on the inspection and turnover side — Jennifer or George?",
        "note": "No pain from Eileen doesn't mean no pain at the company. Pivot to getting the right name. Keep it light.",
        "branches": [
          {
            "label": "Talk to Jennifer",
            "to": "referral_jennifer"
          },
          {
            "label": "Talk to George",
            "to": "referral_george"
          },
          {
            "label": "Mentions someone else",
            "to": "referral_apm"
          },
          {
            "label": "I don't know / Try the office",
            "to": "referral_push"
          }
        ]
      },
      "solution_pitch": {
        "label": "ONE-SENTENCE SOLUTION",
        "say": "So what we built is basically an AI layer that sits on top of whatever photos your team's already taking — whether it's through SafetyCulture, Streamline, or just phone photos — and it automatically flags damage, missing items, stuff that changed between stays. No extra steps for your team. It just catches what humans miss when they're reviewing 75 properties worth of photos. Would you be open to taking a look sometime this week when I'm not cold calling you out of the blue?",
        "note": "Reference their actual tools — SafetyCulture and Streamline. One sentence on the solution, then straight to the CTA. Don't oversell.",
        "branches": [
          {
            "label": "Yeah, I'd take a look",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "email_question"
          },
          {
            "label": "I'd need to loop in Jennifer or George",
            "to": "referral_from_warm"
          },
          {
            "label": "We're pretty set with our current process",
            "to": "objection_have_process"
          }
        ]
      },
      "solution_detail": {
        "label": "MORE DETAIL ON RAPIDEYE",
        "say": "Yeah — so in simple terms, it plugs into the photos your team's already collecting during turnovers. The AI compares what the property looked like last time to what it looks like now and flags anything that changed — new stains, damage, missing items, staging that's off. Your inspectors don't do anything different. But now you've got a second set of eyes catching things before a guest does or before a move-out dispute turns into a he-said-she-said. We're already doing this for a few PM companies across hundreds of properties. Would it make sense to loop in whoever runs your inspections and I can show you both how it actually works?",
        "note": "Keep it concrete and visual. Don't go into technical architecture unless asked. Pivot toward booking with the right decision-maker.",
        "branches": [
          {
            "label": "Yeah let me connect you with Jennifer or George",
            "to": "referral_from_warm"
          },
          {
            "label": "That's interesting — I'd want to see it myself",
            "to": "book_meeting"
          },
          {
            "label": "Send me info and I'll pass it along",
            "to": "email_question"
          },
          {
            "label": "I think our SafetyCulture setup already covers that",
            "to": "objection_have_process"
          }
        ]
      },
      "referral_jennifer": {
        "label": "REFERRAL — JENNIFER RINGLE",
        "say": "Jennifer — perfect. What's the best way to reach her — does she have a direct line, or should I try her through the main office? And I'd love to mention you pointed me her way if that's alright.",
        "note": "Get direct contact info if possible. Use Eileen's name as social proof when reaching Jennifer. You already know the email pattern is likely firstname@missionsands.com or lastnamefirstname@calbeaches.com from research.",
        "branches": [
          {
            "label": "Gives a direct number or email",
            "to": "referral_got_info"
          },
          {
            "label": "Just try the main office number",
            "to": "referral_got_info"
          },
          {
            "label": "I can pass your info along to her",
            "to": "referral_leave_info"
          }
        ]
      },
      "referral_george": {
        "label": "REFERRAL — GEORGE YOU",
        "say": "George — got it. Would it be alright if I mentioned you pointed me his way? And what's the best way to catch him — is he usually in the office, or is there a direct line?",
        "note": "You already have George's direct number (858-583-9990) and email (george@missionsands.com) from research. But getting Eileen's endorsement to use her name is the real win here.",
        "branches": [
          {
            "label": "Gives contact info or says try the office",
            "to": "referral_got_info"
          },
          {
            "label": "I can mention it to him for you",
            "to": "referral_leave_info"
          },
          {
            "label": "He's pretty busy / Hard to reach",
            "to": "referral_push_alt"
          }
        ]
      },
      "referral_apm": {
        "label": "REFERRAL — ASSISTANT PROPERTY MANAGER",
        "say": "Oh perfect — and what's their name? I want to make sure I reach the right person and can mention you connected us.",
        "note": "This might be Edgar Quinonez or Evan Osunabaez. Get the name and any contact info. These are the people who execute inspections day-to-day and would be strong champions.",
        "branches": [
          {
            "label": "Gives a name and/or contact info",
            "to": "referral_got_info"
          },
          {
            "label": "Try the main office and ask for them",
            "to": "referral_got_info"
          }
        ]
      },
      "referral_push": {
        "label": "PUSH FOR A NAME",
        "say": "Totally get it. Would it work if I just tried the main office line and asked for whoever manages the inspection process? Or if you had to guess — who would that land with?",
        "note": "Don't pressure too hard. If she truly can't help, you still have George's direct line and Jennifer's likely email from research. Any name or direction is a win.",
        "branches": [
          {
            "label": "Gives a suggestion or name",
            "to": "referral_got_info"
          },
          {
            "label": "Just try the main number at 858-488-2550",
            "to": "referral_got_info"
          },
          {
            "label": "I really don't know / Can't help",
            "to": "referral_got_info"
          }
        ]
      },
      "referral_push_alt": {
        "label": "GEORGE IS HARD TO REACH",
        "say": "Yeah, I'm sure he's got a lot going on running everything across the different markets. What about Jennifer on the operations side — would she be easier to catch? Or is there someone else who handles the day-to-day inspections and turnovers?",
        "note": "Mentioning 'different markets' hints you know about the sister brands (Baja Sur, Village Reservations) without being creepy. Pivot to Jennifer or the APMs.",
        "branches": [
          {
            "label": "Try Jennifer",
            "to": "referral_jennifer"
          },
          {
            "label": "Mentions someone else",
            "to": "referral_apm"
          },
          {
            "label": "I'll pass your info along",
            "to": "referral_leave_info"
          }
        ]
      },
      "referral_got_info": {
        "label": "GOT REFERRAL INFO",
        "say": "That's super helpful — I really appreciate it, Eileen. I'll reach out to them and mention you pointed me their way. If I put together something tailored, would it help to copy you on the email too, just so you have context?",
        "note": "Offering to copy Eileen keeps her in the loop and builds goodwill. She becomes an internal champion even if she's not the decision-maker. Then wrap up warmly.",
        "branches": [
          {
            "label": "Sure, copy me on it",
            "to": "referral_close"
          },
          {
            "label": "No need, just reach out to them directly",
            "to": "referral_close"
          }
        ]
      },
      "referral_leave_info": {
        "label": "SHE'LL PASS IT ALONG",
        "say": "That'd be awesome. My name's Sam Parks — S-A-M, Parks like the parks — and my email is sam@rapideye.ai. If it helps, I can also shoot you a quick note with a one-liner on what we do so it's easy to forward. Would that be useful?",
        "note": "Make it dead simple for her to forward. Send the email within 30 minutes of hanging up. Include specifics about Mission Sands' 40-point inspections and SafetyCulture setup so it doesn't read as generic.",
        "branches": [
          {
            "label": "Sure, send it over",
            "to": "referral_close"
          },
          {
            "label": "I'll just let them know you called",
            "to": "referral_close"
          }
        ]
      },
      "referral_close": {
        "label": "REFERRAL WRAP-UP",
        "say": "Really appreciate you taking my call, Eileen. Hope the leasing side stays busy for you guys heading into summer. Take care.",
        "note": "End warm and quick. Don't try to squeeze in more. Log the referral name and info immediately and prep follow-up outreach to the referred contact within the hour.",
        "branches": []
      },
      "objection_not_interested": {
        "label": "NOT INTERESTED",
        "say": "I totally get it. I should've assumed you'd be all set — otherwise you probably would've reached out to us. Just so nobody from my team cold calls you again — is it that inspections aren't really in your world, or is it more that you guys already feel covered and this just isn't a priority?",
        "note": "Agree first, then split the objection. If it's not her world, pivot to referral. If they feel covered, probe on their SafetyCulture process.",
        "branches": [
          {
            "label": "It's not really my area",
            "to": "not_right_person"
          },
          {
            "label": "We're already covered / Have a process",
            "to": "objection_have_process"
          },
          {
            "label": "Just not interested / Please stop",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_have_process": {
        "label": "ALREADY HAVE A PROCESS",
        "say": "That makes total sense — with 75-plus properties and that whole iPad inspection setup, you guys would have to have something solid in place. I'm not trying to replace any of that. The thing we keep hearing from teams that already have structured inspections is that the bottleneck isn't capturing the photos — it's that nobody has bandwidth to actually review all of them closely enough to catch what changed. We just sit on top of whatever you're already doing and flag the differences. Would it make sense for whoever runs that process to take a quick look — even just to see what other San Diego managers are doing with it?",
        "note": "Validate their process hard. Reference their specific setup — 75+ units, iPad inspections. Position RapidEye as additive, not a competitor to SafetyCulture. Then steer toward the referral.",
        "branches": [
          {
            "label": "That's fair / Maybe worth a look",
            "to": "referral_from_warm"
          },
          {
            "label": "I'd have to check with Jennifer or George",
            "to": "referral_from_warm"
          },
          {
            "label": "Send me something and I'll pass it along",
            "to": "email_question"
          },
          {
            "label": "We're really set / No thanks",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_no_budget": {
        "label": "NO BUDGET",
        "say": "Totally get it. Nowadays it's harder to keep a tool, let alone buy something new. This honestly isn't a buy-today kind of call — I just wanted to get on your team's radar. The people who end up getting the most out of this are the ones who already know what it does before budget opens up. Would whoever runs your inspections be open to taking a quick look, just so it's on the list?",
        "note": "Agree and de-escalate. Reframe as future-proofing. Then redirect to the actual decision-maker since budget decisions go through George or Jennifer anyway.",
        "branches": [
          {
            "label": "Maybe / I'd want to loop in George on anything budget-related",
            "to": "referral_from_warm"
          },
          {
            "label": "Send me info first",
            "to": "email_question"
          },
          {
            "label": "Not right now",
            "to": "graceful_exit"
          }
        ]
      },
      "email_question": {
        "label": "SEND ME AN EMAIL — ROUTE AND TAILOR",
        "say": "Totally — I'll send something over. Quick question though — should I send it to you at your Mission Sands email, or would it make more sense to send it directly to whoever manages the inspection workflow? I want to make sure it actually lands with the right person and doesn't just sit in an inbox.",
        "note": "Use this to either confirm her email (eileen@missionsands.com) or pivot to getting the right person's email. Routing to the decision-maker is the better outcome.",
        "branches": [
          {
            "label": "Send it to me / eileen@missionsands.com",
            "to": "email_confirm"
          },
          {
            "label": "Send it to Jennifer or George instead",
            "to": "referral_from_warm"
          },
          {
            "label": "Send it to both of us",
            "to": "email_confirm"
          }
        ]
      },
      "email_confirm": {
        "label": "EMAIL CONFIRMED",
        "say": "Perfect — I'll get that over to you today. And just so it doesn't get buried — would next Tuesday or Wednesday work for a quick five-minute follow-up call? Just to make sure you got it and answer any questions.",
        "note": "Always suggest a specific follow-up time. If she agrees, you've got a soft meeting locked. Send the email within 30 minutes — reference their 40-point iPad inspections, SafetyCulture, Streamline, and the 75-unit portfolio.",
        "branches": [
          {
            "label": "Sure / Gives a day or time",
            "to": "meeting_confirmed"
          },
          {
            "label": "Just send it and I'll reach out if interested",
            "to": "email_close"
          }
        ]
      },
      "email_close": {
        "label": "EMAIL WRAP-UP",
        "say": "Sounds good — I'll make sure it's worth opening. Appreciate your time, Eileen. Have a good one.",
        "note": "Send a highly tailored email referencing Mission Sands' 40-point inspections, SafetyCulture setup, Streamline PMS, and 75+ unit portfolio. Include a suggested follow-up day and time. Also consider sending a separate outreach to George or Jennifer directly.",
        "branches": []
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next week pulled up — how does Tuesday afternoon look? I'm thinking like 2 PM Pacific? It'd be 20 minutes tops.",
        "note": "Pick a specific day and time. Don't leave it open-ended. If she needs to include someone else, offer to send the invite to both.",
        "branches": [
          {
            "label": "Tuesday works / Gives a time",
            "to": "meeting_confirmed"
          },
          {
            "label": "Different day or time",
            "to": "meeting_confirmed"
          },
          {
            "label": "I need to check and get back to you",
            "to": "email_confirm"
          },
          {
            "label": "I'd want Jennifer or George on the call too",
            "to": "meeting_with_referral"
          }
        ]
      },
      "meeting_with_referral": {
        "label": "MEETING WITH DECISION-MAKER",
        "say": "Even better — I'd love to have them on. What's the best way to get the invite to them? I can send it to both of you so it's all set.",
        "note": "This is the best possible outcome — a meeting with the decision-maker through Eileen's warm introduction. Get names and emails. Send the invite immediately while on the phone.",
        "branches": [
          {
            "label": "Gives Jennifer's or George's email or contact info",
            "to": "meeting_confirmed"
          },
          {
            "label": "Let me check with them first and get back to you",
            "to": "email_confirm"
          }
        ]
      },
      "meeting_confirmed": {
        "label": "MEETING LOCKED",
        "say": "Perfect — I'll send the invite over right now so it's on your calendar. Really appreciate you taking my call, Eileen. Looking forward to it.",
        "note": "Send the calendar invite while still on the phone if possible. Stop selling immediately. Don't add anything else. End warm and confident.",
        "branches": []
      },
      "gatekeeper": {
        "label": "GATEKEEPER",
        "say": "Hey — could you get me through to Eileen? It's Sam.",
        "note": "Say it like you're expected. Short and casual. Don't explain what you do or say your company name unless asked. If calling the main Mission Sands line (858-488-2550), they may route you.",
        "branches": [
          {
            "label": "Puts you through / She's available",
            "to": "opener"
          },
          {
            "label": "Who's calling? / What's this about?",
            "to": "gatekeeper_context"
          },
          {
            "label": "She's not available right now",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER WANTS CONTEXT",
        "say": "Yeah — I work with a few other property managers in San Diego on their inspection workflows. Would you mind letting her know it's Sam Parks?",
        "note": "Give just enough context to sound legitimate, not enough to trigger a pitch filter. End with a redirect question so you stay in control.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "She's busy / Can I take a message?",
            "to": "gatekeeper_unavailable"
          },
          {
            "label": "More pushback / What company are you with?",
            "to": "gatekeeper_social_proof"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "It's RapidEye — we help a couple other property management companies with their turnover inspections. I sent her a note but wanted to follow up. Would you mind giving her a heads up that I called?",
        "note": "Third level of the triple bypass. If this doesn't work, leave a message and try again later or try Eileen's direct line at 858-488-3980. Don't argue with the gatekeeper.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "I'll let her know / Leave a message",
            "to": "gatekeeper_leave_message"
          }
        ]
      },
      "gatekeeper_unavailable": {
        "label": "GATEKEEPER — SHE'S OUT",
        "say": "No worries — when's a good time to catch her? I don't want to keep calling at the wrong time.",
        "note": "Get a callback window. If they offer voicemail, take it but don't rely on it. Try Eileen's direct line (858-488-3980) at a different time.",
        "branches": [
          {
            "label": "Gives a time or says try back later",
            "to": "gatekeeper_leave_message"
          },
          {
            "label": "I can transfer you to voicemail",
            "to": "gatekeeper_leave_message"
          }
        ]
      },
      "gatekeeper_leave_message": {
        "label": "LEAVE MESSAGE",
        "say": "Perfect — just let her know Sam Parks called. She can reach me at my direct line. Appreciate your help.",
        "note": "Keep the voicemail short — just your name and that you called. Don't pitch. Try Eileen's direct line (858-488-3980) at a different time of day. Also consider going directly to George (858-583-9990) or Jennifer as an alternate path into Mission Sands.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything ever comes up on the inspection side, I'm easy to find — Sam Parks, RapidEye. Appreciate your time, Eileen.",
        "note": "Don't burn the bridge. Log the disposition. Next step: reach out directly to George You (858-583-9990 / george@missionsands.com) or Jennifer Ringle. Eileen wasn't the right entry point but you now have confirmation of the org structure.",
        "branches": []
      }
    }
  }
}