{
  "name": "Genevieve Murphy",
  "title": "Director of Business Development",
  "company": "Simply Steamboat (Resort Group)",
  "location": "Steamboat Springs, CO",
  "phone": "+1-970-875-2845",
  "company_phone": "(970) 870-3397",
  "alt_phones": [
    "+1-888-870-3397",
    "+1-970-879-8700"
  ],
  "flow": {
    "context": "Genevieve Murphy is Director of Business Development at Resort Group — she's the named intake point for all vendor and partner inquiries and routes to the right department across their brands (Simply Steamboat, Mountain Resorts, HOA management). Resort Group manages 600+ nightly rentals and 5,000+ units in Steamboat Springs, runs TrackHS as their PMS, employs ~240 at peak season with structured in-house housekeeping teams and H-2B seasonal workers. They just went through a CEO succession in 2024 (Steve Frasier replacing Dan Dean) and are refocusing exclusively on Steamboat in 2025. Genevieve probably won't own the inspection decision herself — the real ops targets are Alan Koermer (SVP Ops), Joseph Pierce (Exec Dir Housekeeping), and Daniel Infante (Dir Front Office). Best outcome is a warm intro to one of them. Sam's skiing connection (Jackson Hole trip Jan 2026) is the natural bridge into her resort world.",
    "start": "gatekeeper_slide",
    "nodes": {
      "gatekeeper_slide": {
        "label": "GATEKEEPER — SLIDE BY",
        "say": "Hey — could you get me through to Genevieve? It's Sam.",
        "note": "Say it like you know her. Don't volunteer your last name or company. Pause and wait.",
        "branches": [
          {
            "label": "Put through / transferred",
            "to": "opener"
          },
          {
            "label": "Who's calling / what company?",
            "to": "gatekeeper_context"
          },
          {
            "label": "She's not available",
            "to": "gatekeeper_voicemail"
          },
          {
            "label": "What's this regarding?",
            "to": "gatekeeper_context"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — CONTEXT",
        "say": "Yeah — I work with a few other property management companies in the Steamboat market. Would you mind letting her know it's Sam Parks?",
        "note": "Still casual. Don't pitch. Don't explain RapidEye. Let them fill in the blanks.",
        "branches": [
          {
            "label": "Put through / transferred",
            "to": "opener"
          },
          {
            "label": "Can you tell me more?",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "She's not available / take a message",
            "to": "gatekeeper_voicemail"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "Sure — we help a couple property management companies with their inspection workflows. I sent Genevieve a note and was just following up. Would you mind giving her a heads up that I called?",
        "note": "Implies prior contact. Don't oversell. If they still block, get a callback time and move on.",
        "branches": [
          {
            "label": "Put through",
            "to": "opener"
          },
          {
            "label": "I'll pass along the message",
            "to": "gatekeeper_voicemail"
          },
          {
            "label": "She's not the right person for that",
            "to": "gatekeeper_redirect"
          }
        ]
      },
      "gatekeeper_voicemail": {
        "label": "GATEKEEPER — NOT AVAILABLE",
        "say": "No worries at all. When's usually a good time to catch her? I'll try back then.",
        "note": "Get a callback window. Don't leave a voicemail if you can avoid it — callbacks are rare. Try back at the exact time they suggest.",
        "branches": [
          {
            "label": "They give a time",
            "to": "graceful_exit"
          },
          {
            "label": "Want to leave a voicemail?",
            "to": "graceful_exit"
          }
        ]
      },
      "gatekeeper_redirect": {
        "label": "GATEKEEPER — REDIRECT",
        "say": "Oh good to know — who on the team would typically handle anything related to housekeeping operations or property inspections?",
        "note": "This is a gift. They're telling you who the right person is. Listen for Alan Koermer (SVP Ops), Joseph Pierce (Exec Dir Housekeeping), or Daniel Infante (Dir Front Office).",
        "branches": [
          {
            "label": "They give a name / transfer",
            "to": "opener"
          },
          {
            "label": "They don't know / can't help",
            "to": "graceful_exit"
          }
        ]
      },
      "opener": {
        "label": "OPENER",
        "say": "Hey Genevieve — I work with a few property management companies in resort markets, been spending more time in mountain towns lately. Actually just got back from a ski trip to Jackson Hole. It's Sam Parks with RapidEye — have you heard my name tossed around?",
        "note": "Casual. The skiing mention plants the seed that you're in her world, not some random SaaS vendor. Pause after the question and let her answer.",
        "branches": [
          {
            "label": "No, I haven't",
            "to": "heard_no"
          },
          {
            "label": "Yes / maybe / sounds familiar",
            "to": "heard_yes"
          },
          {
            "label": "Now's not a good time",
            "to": "bad_timing"
          },
          {
            "label": "What is this about? / Are you selling something?",
            "to": "permission_ask"
          }
        ]
      },
      "heard_no": {
        "label": "HEARD NO — TRANSITION TO PAIN",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call is — I work with a few other resort property managers in a pretty similar spot to you guys. One thing I keep hearing is they're out there telling owners they've got this airtight turnover process — seven-day-a-week housekeeping, structured inspections, the whole pitch — and then a guest checks into a unit, finds something the cleaning crew missed, and suddenly it's a front-desk fire drill and a one-star review. And the business development team is the one who has to explain that to the next prospective owner. We built something that catches those issues automatically from the photos your cleaners are already taking — plugs right into Track. Would you be open to taking a look when I'm not cold calling you out of the blue?",
        "note": "Pain is tailored to her biz dev role — she sells the management promise to owners, and missed inspections undermine that promise. Mentioning Track shows you know their stack. PAUSE after the CTA. Let her react.",
        "branches": [
          {
            "label": "Interested / tell me more",
            "to": "warm_response"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          },
          {
            "label": "We already have a process for that",
            "to": "objection_have_process"
          },
          {
            "label": "I'm not the right person for this",
            "to": "not_my_area"
          }
        ]
      },
      "heard_yes": {
        "label": "HEARD YES",
        "say": "Oh nice — well normally we'd be working with someone in your shoes. What'd you hear?",
        "note": "Let them talk. Whatever they say, validate it, then steer toward the pain trigger or discovery.",
        "branches": [
          {
            "label": "They describe what they heard",
            "to": "warm_response"
          },
          {
            "label": "They're vague / not really sure",
            "to": "heard_no"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again later this week? Maybe Thursday or Friday afternoon?",
        "note": "Lock in a specific callback window. Don't just say 'I'll try again sometime.' Get a day.",
        "branches": [
          {
            "label": "Sure, try me then",
            "to": "confirm_callback"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          },
          {
            "label": "Not interested at all",
            "to": "objection_not_interested"
          }
        ]
      },
      "confirm_callback": {
        "label": "CONFIRM CALLBACK",
        "say": "Perfect — I'll try you Thursday afternoon. Appreciate it, Genevieve.",
        "note": "Lock the day. Keep it short. Don't pitch anything. Call back exactly when you said you would.",
        "branches": []
      },
      "permission_ask": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call, I'll be honest. Can I get 30 seconds to tell you why I reached out? And you can totally hang up on me if it's not a fit.",
        "note": "Disarming honesty. Most people give you the 30 seconds. If they do, go straight to the pain trigger.",
        "branches": [
          {
            "label": "Sure / go ahead",
            "to": "heard_no"
          },
          {
            "label": "No / not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is this just not something that's on your radar?",
        "note": "Split the objection. You're giving her two doors — one reopens the conversation (bad timing), one tells you she's not the right person. Either way you learn something.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not on my radar / not my area",
            "to": "not_my_area"
          },
          {
            "label": "Just not interested",
            "to": "graceful_exit"
          }
        ]
      },
      "warm_response": {
        "label": "THEY'RE WARM — STOP PITCHING",
        "say": "Awesome — I don't want to just talk at you. Let me ask you this: when it comes to the turnover and inspection side of things across Simply Steamboat and Mountain Resorts — is that something you're involved with, or does that sit more with the ops team?",
        "note": "STOP SELLING. She's biz dev — figure out if she touches ops decisions or if she's going to route you. Either outcome is fine. Listen carefully for names.",
        "branches": [
          {
            "label": "That's more the ops team / not my area",
            "to": "not_my_area"
          },
          {
            "label": "I'm somewhat involved / I can loop people in",
            "to": "discovery_process"
          },
          {
            "label": "I handle vendor relationships / new partnerships",
            "to": "discovery_biz_dev"
          }
        ]
      },
      "discovery_process": {
        "label": "DISCOVERY — CURRENT PROCESS",
        "say": "Got it. So just so I'm not wasting your time with stuff you already have locked down — how does the inspection piece work right now after a cleaner finishes a unit? Is there a separate inspector, or are your housekeeping supervisors handling QA?",
        "note": "You know from research they run supervised cleaning teams with daily task lists. You suspect supervisor spot-checks, not dedicated inspectors. Let her confirm or correct. If she doesn't know details, that's a signal to ask for the ops contact.",
        "branches": [
          {
            "label": "Describes their process",
            "to": "discovery_pain_deep"
          },
          {
            "label": "I'm not sure on the details",
            "to": "referral_transition"
          },
          {
            "label": "We use Breezeway / another tool",
            "to": "objection_have_process"
          }
        ]
      },
      "discovery_biz_dev": {
        "label": "DISCOVERY — BIZ DEV ANGLE",
        "say": "That's actually perfect. When you're talking to prospective owners about coming on board with Resort Group — how much does the quality assurance piece come up? Like do owners ask about how you protect their property between guests?",
        "note": "Frame RapidEye as a biz dev asset — something she can sell to owners. If inspection quality is part of her pitch to owners, this lands hard.",
        "branches": [
          {
            "label": "Yes, owners care about that",
            "to": "discovery_owner_pitch"
          },
          {
            "label": "Not really / it's more about revenue",
            "to": "referral_transition"
          },
          {
            "label": "Good question — I'd need to loop in ops",
            "to": "referral_transition"
          }
        ]
      },
      "discovery_owner_pitch": {
        "label": "DISCOVERY — OWNER ACQUISITION ANGLE",
        "say": "That makes sense — especially with you guys positioning as the premium option in Steamboat. A couple of our customers actually use the inspection reports we generate as an owner-facing feature — like here's photographic proof your unit was checked after every single turnover. It becomes a differentiator in the owner pitch. Would it make sense to get whoever runs the ops side in a room with us to see if there's a fit?",
        "note": "You're pitching RapidEye as a business development tool, not just an ops tool. This reframes the conversation in her language. Push for the meeting with ops included.",
        "branches": [
          {
            "label": "Yeah, let me connect you with someone",
            "to": "referral_name_given"
          },
          {
            "label": "That's interesting — tell me more",
            "to": "pitch_brief"
          },
          {
            "label": "Send me something and I'll share it",
            "to": "send_email"
          }
        ]
      },
      "discovery_pain_deep": {
        "label": "DISCOVERY — DIG INTO PAIN",
        "say": "Got it. And when something does slip through — like a guest checks in and finds damage from the previous guest, or a unit wasn't staged right — what does that look like internally? Who catches it and how fast does it get resolved?",
        "note": "You're looking for the cost of a miss. Guest relocations, refund requests, owner complaints, review damage. Let her paint the picture.",
        "branches": [
          {
            "label": "Describes the fallout / acknowledges it's painful",
            "to": "pitch_brief"
          },
          {
            "label": "It doesn't happen that often",
            "to": "reframe_frequency"
          },
          {
            "label": "I'd need to check with ops on that",
            "to": "referral_transition"
          }
        ]
      },
      "reframe_frequency": {
        "label": "REFRAME — IT HAPPENS MORE THAN YOU THINK",
        "say": "Yeah, that's actually what most managers say at first — and it might be true at your scale. The thing we keep finding is it's not the big stuff that gets missed, it's the small stuff that adds up. A stain on a couch nobody logged, a missing remote, a cracked tile that was there three turnovers ago and now nobody knows which guest caused it. Over 600 rental units, even a one percent miss rate is six issues a week nobody documented. Would it be worth looping in whoever runs housekeeping or ops to see if there's something here?",
        "note": "Use their actual scale (600+ rentals) to make the math concrete. Don't argue — reframe with specifics. Then pivot to the referral.",
        "branches": [
          {
            "label": "That's a fair point / let me connect you",
            "to": "referral_transition"
          },
          {
            "label": "Still not convinced",
            "to": "sell_test_drive"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          }
        ]
      },
      "pitch_brief": {
        "label": "BRIEF PITCH — ONE SENTENCE",
        "say": "So in a nutshell — we plug into Track, which I know you guys are already on, and we analyze the photos your cleaners are already taking after every turnover. AI flags damage, missing items, staging issues — stuff a human eye would catch maybe sixty percent of the time when they're reviewing hundreds of photos. No workflow change for your team. The output is an inspection report for every single unit, every single turn.",
        "note": "ONE pass through the pitch. Don't repeat yourself. Don't oversell. Mentioning Track shows homework. Now pivot to booking.",
        "branches": [
          {
            "label": "That sounds useful / interesting",
            "to": "book_meeting"
          },
          {
            "label": "How much does it cost?",
            "to": "deflect_price"
          },
          {
            "label": "We'd need to involve ops / names someone",
            "to": "referral_name_given"
          },
          {
            "label": "I'm not sure we need that",
            "to": "sell_test_drive"
          }
        ]
      },
      "deflect_price": {
        "label": "DEFLECT PRICE QUESTION",
        "say": "Honestly it depends on the setup — number of units, how you're using Track, whether you want it across all the Resort Group brands or just one. That's part of why I'd love to get 20 minutes on a Zoom where I can show you exactly what it looks like with your properties instead of me throwing numbers over the phone. Would next week work?",
        "note": "Never quote price on a cold call. Redirect to the meeting. The meeting is the product you're selling right now.",
        "branches": [
          {
            "label": "Sure, let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "Send me info first",
            "to": "send_email"
          },
          {
            "label": "I need to check with the team",
            "to": "referral_transition"
          }
        ]
      },
      "not_my_area": {
        "label": "NOT HER AREA — PIVOT TO REFERRAL",
        "say": "Totally makes sense — I figured this might sit more on the operations side. You'd honestly be doing me a huge favor if you could point me in the right direction. Who on the team would own anything related to housekeeping quality or turnover inspections?",
        "note": "This is the most likely path. She's biz dev — she routes inquiries. Your targets are Alan Koermer (SVP Ops), Joseph Pierce (Exec Dir Housekeeping), Daniel Infante (Dir Front Office). If she names one, act like you've heard the name.",
        "branches": [
          {
            "label": "She gives a name",
            "to": "referral_name_given"
          },
          {
            "label": "She's not sure / try the main line",
            "to": "referral_nudge"
          },
          {
            "label": "She offers to forward your info",
            "to": "referral_warm_intro"
          }
        ]
      },
      "referral_transition": {
        "label": "TRANSITION TO REFERRAL",
        "say": "That makes total sense. Listen — I don't want to put you on the spot with stuff that's not your day-to-day. Who would be the best person to talk to about the inspection and turnover workflow? Is that more of an ops leader, or does housekeeping have its own director?",
        "note": "Guide her toward the right title level. You know Joseph Pierce is Exec Dir of Housekeeping and Alan Koermer is SVP Ops. If she names either, you've got your next call.",
        "branches": [
          {
            "label": "She gives a name",
            "to": "referral_name_given"
          },
          {
            "label": "She offers to pass info along",
            "to": "referral_warm_intro"
          },
          {
            "label": "She's not sure who handles that",
            "to": "referral_nudge"
          }
        ]
      },
      "referral_nudge": {
        "label": "REFERRAL — NUDGE FOR NAME",
        "say": "No worries. Would it be Alan Koermer on the ops side? Or is there someone else who runs the housekeeping piece day-to-day?",
        "note": "Drop Alan's name casually — you know he's SVP Ops. This shows you've done research and makes it easy for her to confirm or redirect. Don't name all three — just one to anchor.",
        "branches": [
          {
            "label": "Yes, Alan / confirms",
            "to": "referral_name_given"
          },
          {
            "label": "Gives a different name",
            "to": "referral_name_given"
          },
          {
            "label": "I'm not sure / just call the main line",
            "to": "referral_last_try"
          }
        ]
      },
      "referral_last_try": {
        "label": "REFERRAL — LAST ATTEMPT",
        "say": "Totally fair. Would you be open to me sending you a quick email with a one-pager? That way if you do run into the right person, you can just forward it along. I'll keep it super short.",
        "note": "Don't push further. Get permission to send something forwardable. This keeps the door open and gives you a reason to follow up.",
        "branches": [
          {
            "label": "Sure, send it over",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "graceful_exit"
          }
        ]
      },
      "referral_name_given": {
        "label": "REFERRAL — GOT A NAME",
        "say": "Perfect — that's super helpful. Would it be crazy if I mentioned you pointed me their way? Sometimes that helps it not feel like a total cold call on their end.",
        "note": "Lock in the warm intro angle. If she says yes, your next call opens with 'Genevieve pointed me your way.' That changes everything.",
        "branches": [
          {
            "label": "Sure, mention my name",
            "to": "referral_book_or_close"
          },
          {
            "label": "I'd rather you just reach out directly",
            "to": "referral_book_or_close"
          },
          {
            "label": "Let me intro you via email instead",
            "to": "referral_warm_intro"
          }
        ]
      },
      "referral_warm_intro": {
        "label": "REFERRAL — WARM INTRO OFFER",
        "say": "That would be amazing. I'll send you a quick email right now with a couple bullets — you can literally just forward it with a one-liner. I'll keep it super easy for you. What's the best email — is it gmurphy at resortgroup?",
        "note": "Confirm the email. Make it effortless for her. Send something short and forwardable. Follow up in 48 hours if no intro.",
        "branches": [
          {
            "label": "Confirms email",
            "to": "confirm_email_referral"
          },
          {
            "label": "Gives different email",
            "to": "confirm_email_referral"
          }
        ]
      },
      "confirm_email_referral": {
        "label": "CONFIRM EMAIL — REFERRAL PATH",
        "say": "Got it. I'll have that in your inbox in the next ten minutes. Really appreciate you taking my call, Genevieve — this was super helpful.",
        "note": "Send the email IMMEDIATELY. Short, forwardable, clear one-sentence ask. Follow up in 48 hours. Log the referral name for your next call.",
        "branches": []
      },
      "referral_book_or_close": {
        "label": "REFERRAL — LOCK NEXT STEP",
        "say": "Awesome. Do you happen to have their direct line or extension, or should I go through the main Resort Group number? And honestly — any chance you'd be open to a quick three-way intro if I get them on the phone?",
        "note": "Push for the direct line or extension. A three-way intro is the gold standard but rare. At minimum get the direct number or email.",
        "branches": [
          {
            "label": "Gives direct line / email",
            "to": "close_referral"
          },
          {
            "label": "Just try the main line",
            "to": "close_referral"
          },
          {
            "label": "I'll intro you via email",
            "to": "referral_warm_intro"
          }
        ]
      },
      "close_referral": {
        "label": "CLOSE — REFERRAL OBTAINED",
        "say": "This is really helpful. I'll reach out to them and mention we spoke. Appreciate you taking a couple minutes, Genevieve. Enjoy the rest of your day.",
        "note": "You got what you came for. End clean. Call the referral contact within the hour while it's fresh. Open with 'I was just talking to Genevieve Murphy on your team — she pointed me your way.'",
        "branches": []
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "I totally get it. I should've assumed you'd be all set — otherwise you probably would've reached out to us. Just so nobody from my team cold calls you again — is it that turnover quality just isn't a problem you're focused on, or is it more that you just hate cold calls? Because honestly I get it either way.",
        "note": "Agree first. Then split. Most people will admit it's the cold call they hate, not the topic. That reopens the door.",
        "branches": [
          {
            "label": "I just hate cold calls / bad timing",
            "to": "sell_test_drive"
          },
          {
            "label": "It's really not a priority",
            "to": "last_resort_value"
          },
          {
            "label": "This isn't my area",
            "to": "not_my_area"
          }
        ]
      },
      "objection_have_process": {
        "label": "OBJECTION — ALREADY HAVE A PROCESS",
        "say": "That makes total sense — with 600-plus rental units you'd have to have something dialed in. Just out of curiosity — is it that you've got a dedicated inspection tool running alongside Track, or is it more that your housekeeping supervisors handle QA as part of the turnover?",
        "note": "Validate, then split. You're trying to learn if they have a real tool (Breezeway, etc.) or manual supervisor checks. If it's manual, that's your opening.",
        "branches": [
          {
            "label": "It's supervisor-based / manual",
            "to": "reframe_manual"
          },
          {
            "label": "We use a specific tool",
            "to": "probe_tool"
          },
          {
            "label": "I'm not sure on the details",
            "to": "referral_transition"
          }
        ]
      },
      "reframe_manual": {
        "label": "REFRAME — MANUAL PROCESS",
        "say": "Yeah, that's actually the most common setup I see. And honestly it works — until you're trying to scale it across 600 units with seasonal staff turning over every year. The thing our customers kept telling us is it's not that their supervisors aren't good — it's that there's no way one person catches everything across 15 units on a Saturday turnover. That's exactly the gap we fill. Would you be open to a quick look?",
        "note": "Don't trash their process. Validate it and show the gap. Saturday turnovers with seasonal H-2B staff is their real world — use it.",
        "branches": [
          {
            "label": "Interested / maybe",
            "to": "book_meeting"
          },
          {
            "label": "I'd need to involve ops",
            "to": "referral_transition"
          },
          {
            "label": "Not right now",
            "to": "sell_test_drive"
          }
        ]
      },
      "probe_tool": {
        "label": "PROBE — EXISTING TOOL",
        "say": "Oh nice — which one are you using? Just so I'm not pitching you something redundant.",
        "note": "If they name Breezeway, you complement it (you analyze the photos Breezeway collects). If something else, ask how they like it. You're gathering intel either way.",
        "branches": [
          {
            "label": "Names Breezeway",
            "to": "breezeway_complement"
          },
          {
            "label": "Names something else",
            "to": "other_tool_response"
          },
          {
            "label": "Not sure what it's called",
            "to": "referral_transition"
          }
        ]
      },
      "breezeway_complement": {
        "label": "BREEZEWAY — COMPLEMENT PITCH",
        "say": "Oh perfect — we actually work alongside Breezeway at a few of our customers. Breezeway's great for the workflow — scheduling, task lists, checklists. What we do is analyze the actual photos that get uploaded during those tasks. So Breezeway tells your cleaner to photograph the living room — we look at that photo and flag that there's a stain on the couch that wasn't there last turnover. It's an add-on, not a replacement. Would that be worth a quick look?",
        "note": "Moving Mountains, a competitor in Steamboat, uses Breezeway. Position as complementary, not competitive. Don't name the competitor.",
        "branches": [
          {
            "label": "That's interesting",
            "to": "book_meeting"
          },
          {
            "label": "Send me more info",
            "to": "send_email"
          },
          {
            "label": "I'd need to involve the ops team",
            "to": "referral_transition"
          }
        ]
      },
      "other_tool_response": {
        "label": "OTHER TOOL — RESPOND",
        "say": "Got it. And are you happy with how it handles the photo analysis side — like actually catching damage or missing items from the images? Or is it more of a checklist and workflow tool?",
        "note": "Most ops tools handle scheduling and checklists, not AI photo analysis. If they confirm it's checklist-based, that's your differentiator.",
        "branches": [
          {
            "label": "It's more checklist-based",
            "to": "reframe_manual"
          },
          {
            "label": "It does everything we need",
            "to": "sell_test_drive"
          },
          {
            "label": "Not sure on the details",
            "to": "referral_transition"
          }
        ]
      },
      "objection_no_budget": {
        "label": "OBJECTION — NO BUDGET",
        "say": "Totally get it. Especially with the leadership transition you guys just went through — I'm sure any new spend is going through extra scrutiny right now. Just so I know — is it that budget for this cycle is completely locked, or is it more that anything new has to go through a whole approval process?",
        "note": "Reference the 2024 CEO succession (Steve Frasier). Shows you know their world. Split the objection — locked budget vs. approval pain are different problems with different solutions.",
        "branches": [
          {
            "label": "Budget is locked",
            "to": "sell_test_drive"
          },
          {
            "label": "Everything needs approval / long process",
            "to": "sell_test_drive"
          },
          {
            "label": "It's just not a priority",
            "to": "last_resort_value"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally fair — and you're probably not buying anything from a cold call anyway, I respect that. But here's what I've seen work: the managers who eventually pull the trigger are the ones who already saw it and know what's on their list. If nothing else, I could walk you through what a couple other resort PMs in your market are doing with their turnover photos — worst case you steal some ideas and we part as friends. Would 20 minutes next week be worth it?",
        "note": "Low pressure. You're selling the meeting, not the product. 'Other resort PMs in your market' = you have intel on Moving Mountains, Retreatia, and others in Steamboat you can share as value.",
        "branches": [
          {
            "label": "Sure / okay",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "last_resort_value"
          }
        ]
      },
      "last_resort_value": {
        "label": "LAST RESORT — PLANT THE SEED",
        "say": "Totally understand. Last thing and I'll let you go — if anything changes heading into peak season, I'm easy to find. And if you ever want to see what other Steamboat managers are doing on the inspection side, the offer stands. No strings. Appreciate your time, Genevieve.",
        "note": "Plant the seed and leave clean. Don't burn the bridge. Log this for a follow-up in 6-8 weeks or right before their next peak season ramp.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most useful to include so it's not just another generic pitch in your inbox? Like are you more curious about the Track integration, or more about what the actual inspection reports look like?",
        "note": "Don't just say 'sure.' Ask what matters so you can tailor the email. This also reveals what she cares about.",
        "branches": [
          {
            "label": "She gives guidance on what to include",
            "to": "confirm_email_send"
          },
          {
            "label": "Just send whatever / keep it short",
            "to": "confirm_email_send"
          }
        ]
      },
      "confirm_email_send": {
        "label": "CONFIRM EMAIL DETAILS",
        "say": "Got it — I'll keep it short and relevant. Is gmurphy at resortgroup dot com the best one? And I'll throw a time suggestion in there for next week in case you want to hop on a quick call after you've had a chance to look.",
        "note": "Confirm the email address. Include a specific meeting time in the email — Tuesday or Wednesday, 10am MT. Follow up if no response in 48 hours.",
        "branches": [
          {
            "label": "Confirms email",
            "to": "close_email"
          },
          {
            "label": "Gives different email",
            "to": "close_email"
          }
        ]
      },
      "close_email": {
        "label": "CLOSE — EMAIL PATH",
        "say": "Perfect. You'll have it in the next ten minutes. Thanks for taking my call, Genevieve — talk soon.",
        "note": "Send immediately. Personalized subject line. 4-5 sentences max. Include one insight about their operation. Suggest Tuesday or Wednesday 10am MT.",
        "branches": []
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next week pulled up — how does Tuesday or Wednesday look? I'm thinking 20 minutes, maybe 10 your time so it's not too early.",
        "note": "Pick the day. Pick the time. They're Mountain Time. Lock it NOW. Don't say 'whenever works' — give a specific option.",
        "branches": [
          {
            "label": "One of those works",
            "to": "confirm_meeting"
          },
          {
            "label": "Different day/time",
            "to": "confirm_meeting"
          },
          {
            "label": "I need to check and get back to you",
            "to": "send_email"
          },
          {
            "label": "Should we include someone from ops?",
            "to": "meeting_with_ops"
          }
        ]
      },
      "meeting_with_ops": {
        "label": "MEETING — INCLUDE OPS",
        "say": "Even better. Who should I include on the invite? I'll send it over right now so it's locked in.",
        "note": "This is the best outcome — she's pulling ops into the meeting. Get names and emails. If she names Alan Koermer, Joseph Pierce, or Daniel Infante, you've hit the jackpot.",
        "branches": [
          {
            "label": "Gives name(s) and email(s)",
            "to": "confirm_meeting"
          },
          {
            "label": "Let me check with them first",
            "to": "confirm_meeting_pending"
          }
        ]
      },
      "confirm_meeting_pending": {
        "label": "CONFIRM — PENDING OPS CHECK",
        "say": "Totally — I'll send you the invite for the time we picked, and you can add them once you've confirmed. If it doesn't work, just let me know and we'll shift it. Sound good?",
        "note": "Send the invite now with just her. She'll add ops. Follow up day-of to confirm attendance.",
        "branches": [
          {
            "label": "Sounds good",
            "to": "close_meeting"
          },
          {
            "label": "Just email me and I'll coordinate",
            "to": "close_email"
          }
        ]
      },
      "confirm_meeting": {
        "label": "CONFIRM MEETING",
        "say": "Perfect — I'm sending the invite right now. It'll come from sam at rapideye dot ai. I'll keep it tight, 20 minutes. Really appreciate you taking my call, Genevieve.",
        "note": "Send the calendar invite WHILE ON THE PHONE. One-line agenda: 'Quick look at how RapidEye works with Track for turnover inspections.' Stop selling. End the call.",
        "branches": []
      },
      "close_meeting": {
        "label": "CLOSE — MEETING BOOKED",
        "say": "Awesome. Invite's on its way. Talk to you then — appreciate it, Genevieve.",
        "note": "Done. Send invite immediately. Stop talking. Don't add anything.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes, I'm easy to find — Sam Parks, RapidEye. Appreciate your time, Genevieve.",
        "note": "Don't burn the bridge. Log the call, note the outcome, set a follow-up reminder for 6-8 weeks or before peak season.",
        "branches": []
      }
    }
  }
}