{
  "name": "Grayson Graham",
  "title": "New Business Team",
  "company": "Elliott Beach Rentals",
  "location": "Myrtle Beach, SC",
  "phone": "+1-843-249-1406 ext. 374",
  "company_phone": "+1-843-273-1223",
  "alt_phones": [],
  "flow": {
    "context": "Grayson Graham is on the New Business team at Elliott Beach Rentals — his job is convincing property owners to join EBR's rental program. He's listed on the 'Join EBR' page with Ext. 374 off the owner line (843-249-1406). Elliott Beach Rentals is a legacy brand (since 1959) in North Myrtle Beach / Myrtle Beach with in-house cleaning, maintenance, and housekeeping — no known inspection tech stack. Grayson is NOT the ops decision-maker — Brandon Cox (COO, long-tenured since 2008, promoted to COO Jan 2024) owns operations, and Kyle Thomas is Guest Services Manager. Best play: hook Grayson on the owner-acquisition angle (tech-forward inspection as a competitive differentiator when pitching owners against Vacasa and Thomas Beach), then get a warm intro to Brandon Cox.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Grayson — I work with a few other vacation rental companies along the Grand Strand. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Feet up on the desk energy. Sound like a peer, not a vendor. Pause and let him respond. You're calling his direct extension so he should pick up expecting an owner lead.",
        "branches": [
          {
            "label": "No, I haven't heard of you",
            "to": "heard_no"
          },
          {
            "label": "Yeah / maybe / sounds familiar",
            "to": "heard_yes"
          },
          {
            "label": "Who? / What is this about?",
            "to": "permission_fallback"
          },
          {
            "label": "Now's not a good time",
            "to": "bad_timing"
          }
        ]
      },
      "heard_no": {
        "label": "HAVEN'T HEARD OF YOU",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason I'm reaching out — I've been talking to a few PM companies down in the Myrtle Beach market about how they're handling turnover inspections, and your name came up on Elliott's new business side. Figured you'd have an interesting perspective since you're the one actually pitching owners on the program.",
        "note": "Transition naturally into the pain trigger. The compliment about his perspective is intentional — makes him feel like a resource, not a target. Don't rush past this.",
        "branches": [
          {
            "label": "Okay... what do you mean?",
            "to": "pain_trigger"
          },
          {
            "label": "I'm not really the person for that",
            "to": "wrong_person_early"
          },
          {
            "label": "We're good / not interested",
            "to": "objection_not_interested"
          },
          {
            "label": "I'm busy right now",
            "to": "bad_timing"
          }
        ]
      },
      "heard_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone in your world. What'd you hear?",
        "note": "Let him talk. Whatever he says, use it to transition into pain or discovery. Don't correct anything — just flow with it.",
        "branches": [
          {
            "label": "Shares what they know",
            "to": "warm_response"
          },
          {
            "label": "Not much / can't remember",
            "to": "pain_trigger"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow or later this week?",
        "note": "Don't apologize. Stay relaxed. Lock a specific callback time if possible.",
        "branches": [
          {
            "label": "Sure, try me at a specific time",
            "to": "lock_callback"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          },
          {
            "label": "Don't call back / not interested",
            "to": "graceful_exit"
          }
        ]
      },
      "lock_callback": {
        "label": "LOCK CALLBACK TIME",
        "say": "Perfect — I've got Thursday morning pulled up. Does 10 AM work, or is the afternoon better?",
        "note": "Give two specific options. Don't leave it open-ended. Confirm and get off the phone quickly.",
        "branches": [
          {
            "label": "Picks a time",
            "to": "callback_confirmed"
          },
          {
            "label": "Just call whenever",
            "to": "callback_confirmed"
          }
        ]
      },
      "callback_confirmed": {
        "label": "CALLBACK CONFIRMED",
        "say": "Done. I'll hit you up then. Appreciate it, Grayson.",
        "note": "Stop talking. Get off the phone. Add the callback to your calendar immediately with notes from this interaction.",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — it is a cold call, I'll be straight with you. Can I get 30 seconds to tell you why I reached out? You can totally hang up on me if it's not relevant.",
        "note": "Disarming honesty. Most people will give you the 30 seconds if you own it. Don't sound apologetic — sound confident.",
        "branches": [
          {
            "label": "Sure, go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "No / not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it more that you already know what we do and it's just not a fit?",
        "note": "Split the objection into two paths. Either answer gives you something to work with. Stay relaxed.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / don't call again",
            "to": "graceful_exit"
          },
          {
            "label": "Wait — what do you actually do?",
            "to": "pain_trigger"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "So I work with another vacation rental company in a pretty similar spot to Elliott — big portfolio, been around forever, full-service management. And one thing that kept coming up on their new business side was owners asking how their property was actually being taken care of between guests. The pitch was great, but then a couple months in an owner finds out about a broken screen door or a stain on the couch — from a guest review, not from the management team. And that kills trust fast, especially when you're competing against Vacasa and every other company in the market for those same owners.",
        "note": "PAUSE HERE. Do not jump to the solution. Let silence do the work. The Vacasa mention is intentional — Elliott directly competes with them for owner acquisition in this market. Watch for his reaction before you say another word.",
        "branches": [
          {
            "label": "Yeah, that happens / resonates",
            "to": "solution_bridge"
          },
          {
            "label": "We actually have a solid process for that",
            "to": "objection_have_process"
          },
          {
            "label": "That's really more of an ops thing, not my department",
            "to": "wrong_person_acknowledge"
          },
          {
            "label": "Not really our problem / not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "solution_bridge": {
        "label": "BRIDGE TO SOLUTION",
        "say": "Yeah — so what we built is pretty simple. We plug into the photos your turnover team is already taking, and our AI automatically flags damage, missing items, staging issues — before anyone checks in. No workflow change, nothing new for your cleaners to learn. It just catches the stuff that would otherwise slip through.",
        "note": "One breath on the solution, then pause again. Don't demo on the phone. Don't list features. Let him respond.",
        "branches": [
          {
            "label": "That's interesting / tell me more",
            "to": "warm_response"
          },
          {
            "label": "How does that actually work?",
            "to": "warm_response"
          },
          {
            "label": "We'd need to talk to our ops team about that",
            "to": "referral_natural"
          },
          {
            "label": "I don't think we need that",
            "to": "objection_not_interested"
          }
        ]
      },
      "warm_response": {
        "label": "THEY'RE WARM — STOP PITCHING",
        "say": "Nice — so I'm curious, when you're pitching owners on the EBR program, how does the property care piece usually come up? Do owners ask about inspections specifically, or is it more about cleaning and maintenance?",
        "note": "STOP SELLING. You are in discovery mode now. Ask about HIS world — owner acquisition. This makes him feel like an expert, not a prospect. Listen carefully for pain signals.",
        "branches": [
          {
            "label": "Owners ask about property care and protection",
            "to": "discovery_owner_concerns"
          },
          {
            "label": "It's mostly about revenue and bookings",
            "to": "discovery_revenue_angle"
          },
          {
            "label": "I don't really know the ops side well",
            "to": "referral_natural"
          }
        ]
      },
      "discovery_owner_concerns": {
        "label": "DISCOVERY — OWNER CONCERNS",
        "say": "That makes sense. And when something does get missed — like damage between turnovers — does that ever come back to bite the new business side? Like an owner who signed up six months ago calling in frustrated?",
        "note": "You're connecting his world (owner retention) to the ops problem (missed damage). If he confirms this is a pain point, you have your angle. Listen.",
        "branches": [
          {
            "label": "Yeah, it happens / that's a problem",
            "to": "discovery_who_owns_ops"
          },
          {
            "label": "Not really my area to deal with",
            "to": "referral_natural"
          },
          {
            "label": "Our team actually handles it well",
            "to": "objection_have_process"
          }
        ]
      },
      "discovery_revenue_angle": {
        "label": "DISCOVERY — REVENUE ANGLE",
        "say": "Totally — bookings are king. One thing we've been seeing is that the companies using us are actually putting it in their owner pitch. Like 'we have AI that catches every issue before a guest does.' It's a differentiator when everyone else in the market is saying the exact same things. Has Elliott looked at anything like that?",
        "note": "Reframe to competitive advantage in owner acquisition — that's his world. If he bites, pivot to referral for ops buy-in.",
        "branches": [
          {
            "label": "That's actually a cool angle / we haven't thought of that",
            "to": "discovery_who_owns_ops"
          },
          {
            "label": "We differentiate in other ways",
            "to": "referral_natural"
          },
          {
            "label": "I'd need to run that by someone else",
            "to": "referral_natural"
          }
        ]
      },
      "discovery_who_owns_ops": {
        "label": "DISCOVERY — WHO OWNS OPS",
        "say": "That's really helpful. So on your side — who on the team typically owns the turnover and inspection process? Is that Brandon Cox's world, or is there someone else running that piece?",
        "note": "You already know Brandon Cox is COO. Dropping his name shows you've done homework and makes it easy for Grayson to just confirm. Don't explain how you know Brandon — just use the name casually.",
        "branches": [
          {
            "label": "Yeah that's Brandon / confirms Brandon Cox",
            "to": "referral_ask_brandon"
          },
          {
            "label": "It's someone else (names a different person)",
            "to": "referral_ask_other"
          },
          {
            "label": "I'm not totally sure who handles that",
            "to": "referral_ask_general"
          }
        ]
      },
      "wrong_person_early": {
        "label": "WRONG PERSON — EARLY",
        "say": "No worries at all — I figured since you're on the new business side you might have a pulse on this. Who on your team typically handles the operations and inspection piece?",
        "note": "Pivot to referral immediately. Don't try to sell him on something he doesn't own. Get a name and move on.",
        "branches": [
          {
            "label": "Names someone (Brandon, Kyle, etc.)",
            "to": "referral_ask_other"
          },
          {
            "label": "Not sure / try the main line",
            "to": "referral_ask_general"
          },
          {
            "label": "Can't help / shuts down",
            "to": "graceful_exit"
          }
        ]
      },
      "wrong_person_acknowledge": {
        "label": "ACKNOWLEDGE — OPS TERRITORY",
        "say": "Totally — that makes sense, it'd sit on the ops side. The reason I wanted to run it by you first is a lot of the new business teams I talk to actually use this as part of their owner pitch — like a differentiator. But either way, who's the best person on the ops side? Is that Brandon Cox?",
        "note": "Validate why you called him, then pivot to referral. Drop Brandon's name to make it easy.",
        "branches": [
          {
            "label": "Yeah, Brandon's the one",
            "to": "referral_ask_brandon"
          },
          {
            "label": "Names someone else",
            "to": "referral_ask_other"
          },
          {
            "label": "I'd rather not connect you / tries to end call",
            "to": "sell_test_drive"
          }
        ]
      },
      "referral_natural": {
        "label": "NATURAL REFERRAL PIVOT",
        "say": "Totally makes sense — I wouldn't expect you to own that piece. Who on your team would be the best person to talk to about inspection and turnover workflows? Is that Brandon Cox on the ops side?",
        "note": "This is the most likely path for this call. Grayson is the gateway to Brandon. Dropping the name makes it a yes/no instead of asking him to think. Easy for him.",
        "branches": [
          {
            "label": "Yeah, that's Brandon / confirms",
            "to": "referral_ask_brandon"
          },
          {
            "label": "Names a different person",
            "to": "referral_ask_other"
          },
          {
            "label": "I don't know / try the main office",
            "to": "referral_ask_general"
          },
          {
            "label": "Not going to connect you / shuts down",
            "to": "sell_test_drive"
          }
        ]
      },
      "referral_ask_brandon": {
        "label": "REFERRAL — BRANDON COX",
        "say": "Perfect. Would you mind if I mentioned your name when I reach out to Brandon? Just so it's not totally cold on his end. And if you've got his direct line or extension handy, that'd save me a runaround with the front desk.",
        "note": "Ask permission to name-drop Grayson. This makes the Brandon call significantly warmer. Try to get a direct number or extension. Even a 'yeah go ahead' is gold.",
        "branches": [
          {
            "label": "Sure, go ahead / gives contact info",
            "to": "book_or_close_referral"
          },
          {
            "label": "You can try him but don't use my name",
            "to": "book_or_close_referral"
          },
          {
            "label": "Just call the main office number",
            "to": "book_or_close_referral"
          }
        ]
      },
      "referral_ask_other": {
        "label": "REFERRAL — OTHER PERSON",
        "say": "Got it — and what's their role over there? If I can get a direct line or email I'll put something tailored together so it actually lands and doesn't look like spam.",
        "note": "Get the name, title, and any contact info. If they name Kyle Thomas (Guest Services Manager), that's also a strong contact. Write everything down.",
        "branches": [
          {
            "label": "Gives name and contact info",
            "to": "book_or_close_referral"
          },
          {
            "label": "Just try the main line",
            "to": "book_or_close_referral"
          }
        ]
      },
      "referral_ask_general": {
        "label": "REFERRAL — GENERAL",
        "say": "No worries. Would it be someone on the operations side, or more the guest services side? Just trying to make sure I'm not calling around blind.",
        "note": "Narrow it down. If he says operations, you're targeting Brandon Cox. If he says guest services, try Kyle Thomas. Any direction is better than none.",
        "branches": [
          {
            "label": "Operations / gives a direction",
            "to": "book_or_close_referral"
          },
          {
            "label": "Guest services / names Kyle Thomas",
            "to": "book_or_close_referral"
          },
          {
            "label": "Can't help / doesn't know",
            "to": "book_or_close_referral"
          }
        ]
      },
      "book_or_close_referral": {
        "label": "CLOSE THE REFERRAL",
        "say": "Really appreciate that, Grayson. I'll reach out to them directly. And honestly — if the owner-pitch angle ever comes up where you want to show owners you've got tech backing up your inspections, I'm easy to find. Thanks for your time.",
        "note": "Leave the door open. Grayson may mention this to Brandon before you call, which makes the next call warmer. Send Grayson a quick thank-you email within the hour. Immediately queue Brandon Cox for a call at 843-273-1223.",
        "branches": []
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "Totally get it. I should've assumed you guys would be all set — otherwise you probably would've reached out to us. Just so nobody from my team cold calls you again — is it that this isn't something Elliott's focused on right now, or is it more that you just hate cold calls?",
        "note": "Agree first — surprise him by not pushing back. Then split the objection. The multiple choice disarms and gives you a path either way.",
        "branches": [
          {
            "label": "Not focused on this / not a priority right now",
            "to": "sell_test_drive"
          },
          {
            "label": "I just hate cold calls / really not interested",
            "to": "sell_test_drive_light"
          },
          {
            "label": "Actually opens up / shares more context",
            "to": "warm_response"
          }
        ]
      },
      "objection_have_process": {
        "label": "OBJECTION — HAVE A PROCESS",
        "say": "That makes total sense — with a company that's been around since '59 you'd have to have something dialed in. Is it that your team's fully covered and happy with how inspections are going, or is it more that changing anything right now would just be a headache?",
        "note": "Acknowledge the longevity — it's genuine and flattering. The split separates 'we're happy' from 'switching is painful.' Different answers need different responses.",
        "branches": [
          {
            "label": "We're happy / it works fine",
            "to": "sell_test_drive_light"
          },
          {
            "label": "Switching would be a headache / bad timing",
            "to": "sell_test_drive"
          },
          {
            "label": "Honestly it's not perfect...",
            "to": "warm_response"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally respect that. You're probably not buying anything off a cold call — I wouldn't either. But if nothing else, I could walk you and whoever runs ops through what other PM companies in the Myrtle Beach market are doing with their turnover photos right now. Worst case you steal some ideas and we part as friends. Would you be open to that?",
        "note": "Low pressure. You're selling a conversation, not a contract. 'Steal some ideas' is intentionally disarming. If he says yes, move to booking immediately. If no, pivot to referral or email.",
        "branches": [
          {
            "label": "Sure / could be interesting",
            "to": "booking"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Not right now / maybe later",
            "to": "referral_natural"
          },
          {
            "label": "No thanks",
            "to": "graceful_exit"
          }
        ]
      },
      "sell_test_drive_light": {
        "label": "LIGHTER TEST DRIVE OFFER",
        "say": "Totally fair. Tell you what — I'll shoot you a two-line email with what we're seeing other companies along the Grand Strand doing with their turnover workflows. No pitch, just context. And if it ever becomes relevant, you'll know where to find me. But quick question — who on the ops side would be the best person for me to reach out to directly?",
        "note": "Softest possible close. Offer the email as a given, then pivot to the referral. Even if Grayson won't meet, getting Brandon's name out of this call is a win.",
        "branches": [
          {
            "label": "Names someone / gives referral info",
            "to": "referral_ask_brandon"
          },
          {
            "label": "Just send me the email",
            "to": "send_email"
          },
          {
            "label": "Can't help / shuts down",
            "to": "graceful_exit"
          }
        ]
      },
      "booking": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next Tuesday and Thursday pulled up — does morning or afternoon work better for you?",
        "note": "Pick two specific days. Get the time locked NOW. If he says the ops team should be on it, that's the best possible outcome — ask for Brandon's email to include on the invite.",
        "branches": [
          {
            "label": "Picks a time",
            "to": "meeting_confirmed"
          },
          {
            "label": "Need to check my schedule / get back to me",
            "to": "send_email"
          },
          {
            "label": "Should include our ops team too",
            "to": "booking_with_ops"
          }
        ]
      },
      "booking_with_ops": {
        "label": "BOOK WITH OPS INCLUDED",
        "say": "Love it — that'd be way more productive with the ops person on too. What's their name and email? I'll send the invite to both of you so it's easy.",
        "note": "This is the BEST outcome of this entire call — a meeting with both Grayson and Brandon (or whoever runs ops). Get the email, send the invite on the spot, and lock it.",
        "branches": [
          {
            "label": "Gives name and email (likely Brandon Cox)",
            "to": "meeting_confirmed"
          },
          {
            "label": "I'll forward the invite to them",
            "to": "meeting_confirmed"
          }
        ]
      },
      "meeting_confirmed": {
        "label": "MEETING LOCKED",
        "say": "Done — I'll get that invite over right now. Really appreciate you taking my call, Grayson. Talk soon.",
        "note": "STOP SELLING. The meeting is booked. Send the calendar invite immediately. Add all contacts to CRM. Prep Brandon Cox research and tailor the demo to Elliott's market and competitive landscape before the meeting.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question so I don't just send you generic junk — would the owner-acquisition angle be most interesting to you, or more the operational side of catching damage during turnovers?",
        "note": "Accept the request, but qualify. His answer tells you what to lead with in the email. Also try to get an ops referral before hanging up.",
        "branches": [
          {
            "label": "Owner acquisition / competitive angle",
            "to": "email_ask_ops_copy"
          },
          {
            "label": "Operational side / turnover stuff",
            "to": "email_ask_ops_copy"
          },
          {
            "label": "Just send whatever / doesn't matter",
            "to": "email_ask_ops_copy"
          }
        ]
      },
      "email_ask_ops_copy": {
        "label": "ASK TO COPY OPS",
        "say": "Got it — I'll keep it short. Should I copy anyone on the ops side so they see it too? This kind of sits between your team and operations, and I want to make sure the right person sees it.",
        "note": "Last shot at getting a referral contact. If he gives you Brandon's email, you now have two warm touchpoints. If not, you still send a good email to Grayson.",
        "branches": [
          {
            "label": "Sure, copy [gives name/email]",
            "to": "email_close"
          },
          {
            "label": "No, just send it to me",
            "to": "email_close"
          },
          {
            "label": "Names Brandon Cox specifically",
            "to": "email_close"
          }
        ]
      },
      "email_close": {
        "label": "EMAIL CLOSE",
        "say": "Perfect. I'll get that over today. Appreciate your time, Grayson.",
        "note": "Send the email within 30 minutes. Include: (1) a one-liner referencing this conversation, (2) the angle he picked, (3) a specific time suggestion for a 15-min call. If you got an ops contact name, send them a separate tailored email and queue a direct call to Brandon.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything ever changes, I'm easy to find. Appreciate your time, Grayson.",
        "note": "Don't burn the bridge. Add detailed notes to CRM. Grayson saying no does NOT mean Brandon Cox will — queue Brandon for a direct call at 843-273-1223 immediately. Also consider reaching out to Kyle Thomas (Guest Services Manager) or another New Business team member like Stephanie Ives (Ext. 344) or Weston Parker (Ext. 702).",
        "branches": []
      }
    }
  }
}