{
  "name": "Herb Aust",
  "title": "Partner & Operations Manager",
  "company": "Maui Lodging Properties",
  "location": "Scottsdale, AZ is already on the list. Let me provide the next best option:\\n\\nMaui, HI",
  "phone": "+1-808-344-6400",
  "company_phone": "+1-800-487-6002",
  "alt_phones": [],
  "flow": {
    "context": "Herb Aust is Partner & Operations Manager at Maui Lodging Properties, a family-run vacation rental company in Lahaina, Maui — he runs day-to-day ops, maintenance coordination, and guest services, and his personal cell is literally the published emergency contact number. Company uses Escapia for bookings, does monthly full-property inspections with detailed reports, but has no detected ops or photo platform like Breezeway — about 25 staff, founded 2010 by Darlene Ford who now oversees things remotely from Oregon. Bill 9 is creating serious regulatory pressure in Maui, phasing out thousands of STRs by 2029. Strongest connection: Herb went to Indiana University of Pennsylvania for Business Management — Sam is at Carnegie Mellon in Pittsburgh, fellow PA people.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Herb — kinda random, but I'm at Carnegie Mellon out in Pittsburgh right now and saw you went to IUP. Fellow Pennsylvania guy. It's Sam Parks with RapidEye — have you heard my name tossed around at all?",
        "note": "Smile. Relaxed energy. Don't rush the PA connection — let it land. If he reacts to the PA thing, roll with it for a beat before moving on.",
        "branches": [
          {
            "label": "Yes / Maybe",
            "to": "heard_yes"
          },
          {
            "label": "No / Don't think so",
            "to": "heard_no"
          },
          {
            "label": "Bad timing / Busy",
            "to": "bad_timing"
          },
          {
            "label": "Who is this? / Skeptical",
            "to": "confused_guarded"
          },
          {
            "label": "Goes to voicemail",
            "to": "voicemail"
          }
        ]
      },
      "heard_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone on the ops side like you. What'd you hear?",
        "note": "Let them talk. Whatever they say, use it as a bridge into discovery. Don't correct anything they got wrong.",
        "branches": [
          {
            "label": "They share what they heard",
            "to": "pain_resonates"
          },
          {
            "label": "Vague / Not sure",
            "to": "pain_trigger"
          }
        ]
      },
      "heard_no": {
        "label": "HAVEN'T HEARD OF YOU",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call — I work with a few other vacation rental operators and your name came up because you run the ops side at Maui Lodging. Mind if I take 30 seconds to tell you why I reached out?",
        "note": "Self-deprecating joke, then quick transition. Don't linger on the joke.",
        "branches": [
          {
            "label": "Sure / Go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Pushes back / Not interested",
            "to": "confused_guarded"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again later this week? What day works better?",
        "note": "Don't apologize. Offer a specific window, not an open-ended 'when works for you.'",
        "branches": [
          {
            "label": "Gives a day or time",
            "to": "reschedule_lock"
          },
          {
            "label": "Declines entirely",
            "to": "end_graceful"
          }
        ]
      },
      "reschedule_lock": {
        "label": "LOCK CALLBACK",
        "say": "Perfect — I'll try you then. I'll keep it real quick. Thanks Herb, talk soon.",
        "note": "Calendar it immediately after hanging up. Set a reminder 5 minutes before. Note the Hawaii time zone.",
        "branches": []
      },
      "confused_guarded": {
        "label": "GUARDED — PERMISSION ASK",
        "say": "Yeah totally fair — it is a cold call, I'll own that. Can I get 30 seconds to tell you why I reached out? You can totally hang up on me if it's not relevant.",
        "note": "Owning the cold call disarms people fast. Stay calm, don't speed up, don't get defensive.",
        "branches": [
          {
            "label": "Fine, go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "No / Still pushing back",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot, totally on me. Just so nobody from my team cold calls you again — is it that I caught you at a terrible time, or is it that you already know what we do and this just isn't interesting?",
        "note": "Diagnostic, not persuasive. You're splitting the objection into bad timing vs. genuine no. Listen for which one they pick.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not interested at all",
            "to": "end_graceful"
          },
          {
            "label": "Curious now — what do you do?",
            "to": "pain_trigger"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "So here's why I called — I work with another ops manager at a vacation rental company pretty similar to yours. Maybe twenty-five, thirty properties. And the thing he kept telling me was, look, they've got inspections, they've got checklists, the cleaners take photos after every turnover — but nobody actually has time to sit there and go through every photo from every unit. So stuff slips through. Guest checks in, there's a stain on the couch or a missing remote, and now he's the one getting the call at nine o'clock at night because his number's the emergency line. Does any of that sound familiar?",
        "note": "PAUSE after 'sound familiar.' Most important silence of the call. Herb's personal cell IS the published emergency number — this should hit close to home. Let the silence do the work.",
        "branches": [
          {
            "label": "Yes / That's exactly what happens",
            "to": "pain_resonates"
          },
          {
            "label": "Lukewarm / Quiet / Sort of",
            "to": "pain_lukewarm"
          },
          {
            "label": "We already have a process for that",
            "to": "objection_have_process"
          },
          {
            "label": "Not really our problem / Not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "pain_resonates": {
        "label": "PAIN RESONATES — DISCOVERY",
        "say": "Yeah, I figured that'd hit close to home. So tell me — what does your inspection process actually look like right now? Like after a cleaner finishes a turnover, what happens next?",
        "note": "STOP PITCHING. They're warm. Ask questions and listen. You want to learn: Do cleaners take photos? Who reviews them? What tool? What falls through cracks? Take notes.",
        "branches": [
          {
            "label": "Describes their process",
            "to": "discovery_tools"
          },
          {
            "label": "Shares a specific frustration or story",
            "to": "discovery_volume"
          },
          {
            "label": "Asks what you do first",
            "to": "solution_drop"
          }
        ]
      },
      "pain_lukewarm": {
        "label": "LUKEWARM — QUICK SOLUTION + CTA",
        "say": "Totally get it. The short version is we built something that looks at the photos your team's already taking during turnovers and automatically flags damage, missing items, staging issues — no workflow change, no new app for your cleaners. We just plug into what you're already doing. Would you be open to taking a quick look sometime when I'm not cold calling you out of the blue?",
        "note": "Don't force the pain harder — they're not biting on emotion, so go straight to a compact solution plus a soft CTA. If they bite, great.",
        "branches": [
          {
            "label": "Sure / Could be interesting",
            "to": "meeting_yes"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          },
          {
            "label": "No budget / Tight right now",
            "to": "objection_no_budget"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "discovery_tools": {
        "label": "DISCOVERY — TOOLS",
        "say": "Got it. And are your guys logging that stuff in Escapia, or do you have something separate for the inspection side — like a Breezeway or anything like that?",
        "note": "We know they use Escapia for bookings. No Breezeway detected. If they have no dedicated inspection tool — huge opening. If they name something, ask what's working and what's not.",
        "branches": [
          {
            "label": "No dedicated inspection tool",
            "to": "solution_drop"
          },
          {
            "label": "Names a specific tool",
            "to": "discovery_volume"
          },
          {
            "label": "Conversation shifts to regulations / market",
            "to": "bill9_angle"
          }
        ]
      },
      "discovery_volume": {
        "label": "DISCOVERY — VOLUME",
        "say": "Makes sense. How many turnovers are you guys doing in a typical week? I'm just trying to get a sense of the photo volume your team's dealing with.",
        "note": "More turnovers = more photos = more stuff missed = stronger case. This also sets up 'imagine AI reviewing all of those automatically.'",
        "branches": [
          {
            "label": "Shares volume — ready for solution",
            "to": "solution_drop"
          },
          {
            "label": "Shares frustration about volume",
            "to": "bill9_angle"
          },
          {
            "label": "Asks what you do",
            "to": "solution_drop"
          }
        ]
      },
      "bill9_angle": {
        "label": "BILL 9 — REGULATORY PRESSURE",
        "say": "And I gotta ask — with Bill 9 coming down and all the uncertainty around the vacation rental phaseout, how's that affecting how you guys think about ops? I imagine every unit you've still got, you want airtight records on.",
        "note": "Bill 9 phases out ~6,200 Maui STRs. West Maui deadline is Jan 2029. Fewer units = each one matters more. Airtight inspection records help with disputes and regulatory defense.",
        "branches": [
          {
            "label": "Engages — shares concerns",
            "to": "solution_drop"
          },
          {
            "label": "Pivots / Doesn't want to discuss",
            "to": "solution_drop"
          },
          {
            "label": "Shuts down",
            "to": "end_graceful"
          }
        ]
      },
      "solution_drop": {
        "label": "SOLUTION DROP + CTA",
        "say": "So here's the quick version — we built an AI layer that plugs into the photos your team's already taking and automatically catches damage, missing items, staging issues, anything that's off. No new workflow, no new app. It just reviews everything your team doesn't have time to look at. If nothing else, I could show you what a few other PM companies are doing with their turnover photos — worst case you steal some ideas and we part as friends. Would you be open to a quick look?",
        "note": "One breath on the solution, then CTA. The 'steal some ideas' line lowers the stakes. Then STOP TALKING. Let silence do the work.",
        "branches": [
          {
            "label": "Sure / Let's do it",
            "to": "meeting_yes"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Budget's tight",
            "to": "objection_no_budget"
          },
          {
            "label": "Not interested / We're fine",
            "to": "objection_not_interested"
          },
          {
            "label": "I'm not the right person",
            "to": "referral_not_me"
          }
        ]
      },
      "meeting_yes": {
        "label": "THEY'RE INTERESTED",
        "say": "Awesome — I appreciate that. I've got next Tuesday and Thursday open. What works better on your end? I'll keep it tight, twenty minutes tops.",
        "note": "Offer two specific days. Hawaii is 2-3 hours behind Pacific, 5-6 behind Eastern — plan accordingly. Don't leave scheduling open-ended.",
        "branches": [
          {
            "label": "Picks a day",
            "to": "book_meeting"
          },
          {
            "label": "Needs to check calendar / Send me an invite",
            "to": "send_email"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK IT — LOCK IN",
        "say": "Perfect — I'll send a calendar invite right now. What's the best email for you? I've got the info-at-mauilodging one — do you have a direct address?",
        "note": "Get direct email. Email patterns suggest aust@mauilodging.com or herb@mauilodging.com. Once booked, STOP SELLING. Don't add one more thing.",
        "branches": [
          {
            "label": "Gives email / Confirms",
            "to": "end_booked"
          }
        ]
      },
      "end_booked": {
        "label": "MEETING BOOKED — WRAP",
        "say": "Sending it now. Really appreciate you taking my call, Herb — looking forward to it. Talk soon.",
        "note": "Shut up and hang up. Send the invite within 60 seconds of hanging up.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. Quick question before I do — what would be most useful to include so it's not just another generic pitch sitting in your inbox?",
        "note": "This keeps the conversation alive and gives you intel for a tailored email. Whatever they say, use it.",
        "branches": [
          {
            "label": "Tells you what to include",
            "to": "email_wrapup"
          },
          {
            "label": "Just send whatever",
            "to": "email_wrapup"
          }
        ]
      },
      "email_wrapup": {
        "label": "EMAIL FOLLOW-UP — PLANT A TIME",
        "say": "Got it — I'll put something together around that and keep it short. Would sometime next week work to hop on a quick call after you've had a chance to look at it? Maybe Tuesday or Wednesday?",
        "note": "Plant a specific follow-up window. Send the email within the hour. Include a relevant example for their size and market. Put the follow-up time in the email too.",
        "branches": [
          {
            "label": "Agrees to follow-up time",
            "to": "end_booked"
          },
          {
            "label": "Noncommittal / We'll see",
            "to": "end_graceful"
          }
        ]
      },
      "objection_no_budget": {
        "label": "OBJECTION — NO BUDGET",
        "say": "Totally get it. Nowadays it's harder to keep a tool than to buy something new, especially with everything going on in the Maui market right now.",
        "note": "AGREE first. Don't push back. Pause a beat, then move to the split.",
        "branches": [
          {
            "label": "Pause — then split the objection",
            "to": "budget_split"
          }
        ]
      },
      "budget_split": {
        "label": "BUDGET — SPLIT",
        "say": "Just so nobody from my team cold calls you about this again — is it that budget this cycle is completely locked, or is it more that anything you try to buy right now puts you through the ringer with the partners?",
        "note": "Darlene Ford (founder) oversees from Oregon and is still involved daily. If approval chain is the issue, offer to loop her in or make her life easier. If budget is truly locked, sell the test drive.",
        "branches": [
          {
            "label": "Budget fully locked",
            "to": "sell_test_drive"
          },
          {
            "label": "Approval chain is the headache",
            "to": "sell_test_drive"
          },
          {
            "label": "Opens up — tells you more",
            "to": "solution_drop"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally respect that. You're probably not buying anything this second, and that's fine. But the folks who move fastest when budget does open up are the ones who already know what's on their shortlist. Would you be open to just taking a look — not a commitment, just so it's on your radar? Twenty minutes, and if it's not a fit we part as friends.",
        "note": "Reframe the meeting as low-risk, future-oriented. You're not asking them to buy — you're asking them to be informed.",
        "branches": [
          {
            "label": "Okay, sure",
            "to": "meeting_yes"
          },
          {
            "label": "Still no",
            "to": "end_graceful"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          }
        ]
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "Totally get it — I should've assumed you'd be all set. Otherwise you probably would've reached out to us, right?",
        "note": "AGREE. Surprise them by not pushing. Pause, then split the objection.",
        "branches": [
          {
            "label": "Pause — then split",
            "to": "interest_split"
          }
        ]
      },
      "interest_split": {
        "label": "NOT INTERESTED — SPLIT",
        "say": "Just so I'm not bugging you — is it that this genuinely isn't a problem you're dealing with, or is it more that you hate cold calls and I caught you at the wrong time?",
        "note": "Most people will admit they hate cold calls, which opens the door back up. If it's genuinely not their problem, pivot to a referral.",
        "branches": [
          {
            "label": "Hates cold calls / bad timing",
            "to": "sell_test_drive"
          },
          {
            "label": "Not a problem we have",
            "to": "referral_not_me"
          },
          {
            "label": "Truly done — goodbye",
            "to": "end_graceful"
          }
        ]
      },
      "objection_have_process": {
        "label": "OBJECTION — HAVE A PROCESS",
        "say": "That makes total sense — with the number of properties you guys manage, you'd have to have something in place. I'd be surprised if you didn't.",
        "note": "Validate them. Don't trash their process. Pause a beat, then split to find the gap.",
        "branches": [
          {
            "label": "Pause — then split",
            "to": "process_split"
          }
        ]
      },
      "process_split": {
        "label": "PROCESS — SPLIT",
        "say": "Is it that you're totally covered and happy with how everything's working, or is it more that switching anything right now would just be a headache on top of everything else?",
        "note": "If they say 'happy' — compliment them and ask what's working (they'll naturally reveal gaps). If switching is the headache — emphasize zero workflow change, plugs into what they already do.",
        "branches": [
          {
            "label": "Happy with current process",
            "to": "process_happy"
          },
          {
            "label": "Switching would be a pain",
            "to": "sell_test_drive"
          },
          {
            "label": "Opens up about gaps",
            "to": "pain_resonates"
          }
        ]
      },
      "process_happy": {
        "label": "PROCESS HAPPY — FIND THE GAP",
        "say": "Love that — honestly most people I talk to don't have it fully dialed in, so that's impressive. Out of curiosity, what's working best for you guys? I'm always trying to learn what the good operators are doing.",
        "note": "Flattery plus genuine curiosity. When people explain what works, they naturally reveal what doesn't. Listen for the gap. If they mention the monthly inspections or detailed reports, ask how many hours those take.",
        "branches": [
          {
            "label": "Reveals a gap or frustration",
            "to": "solution_drop"
          },
          {
            "label": "Truly locked in — no gap",
            "to": "referral_not_me"
          },
          {
            "label": "Warms up from the flattery",
            "to": "discovery_tools"
          }
        ]
      },
      "referral_not_me": {
        "label": "NOT THE RIGHT PERSON — REFERRAL",
        "say": "Totally hear you. Out of curiosity — who on your team typically owns the inspection workflow day-to-day? Or would something like this need to go through Bree or one of the other partners?",
        "note": "We know Bree Lewis handles new clients and digital platforms — she's the next best path. Darlene Ford is the founder but remote in Oregon. Name-drop Bree naturally to signal you've done homework.",
        "branches": [
          {
            "label": "Points to Bree Lewis",
            "to": "referral_get_name"
          },
          {
            "label": "Points to Darlene Ford",
            "to": "referral_get_name"
          },
          {
            "label": "Points to someone else",
            "to": "referral_get_name"
          },
          {
            "label": "Won't refer / Just email info@",
            "to": "end_graceful"
          }
        ]
      },
      "referral_get_name": {
        "label": "GET THE REFERRAL",
        "say": "Perfect — would you mind pointing me to the best way to reach them? If I can get a direct line or email, I'll put something tailored together so it actually lands instead of being another random cold pitch.",
        "note": "If Bree: her emergency number is 808-868-6558. If Darlene: she's remote in Oregon, no direct number found. Ask if you can mention Herb's name when reaching out.",
        "branches": [
          {
            "label": "Gives contact info",
            "to": "referral_confirm"
          },
          {
            "label": "Says to just call the office",
            "to": "referral_confirm"
          }
        ]
      },
      "referral_confirm": {
        "label": "CONFIRM REFERRAL — USE HERB'S NAME",
        "say": "Appreciate that. And would it be cool if I mention your name when I reach out — just so they know it's not totally out of nowhere?",
        "note": "Even a soft yes here turns your next call from cold to warm. Thank Herb genuinely regardless of the answer.",
        "branches": [
          {
            "label": "Sure, go ahead",
            "to": "end_graceful"
          },
          {
            "label": "Rather you didn't",
            "to": "end_graceful"
          }
        ]
      },
      "voicemail": {
        "label": "VOICEMAIL",
        "say": "Hey Herb — it's Sam Parks. I'm at Carnegie Mellon out in Pittsburgh, fellow PA guy. I work with a few vacation rental operators on their inspection workflows and wanted to run something quick by you. Shoot me a text or call back when you get a sec — it's [YOUR NUMBER]. Thanks man.",
        "note": "Under 20 seconds. Sound casual, not rehearsed. The PA hook and 'inspection workflows' give him just enough to be curious. Follow up with a text right after: 'Hey Herb, Sam Parks here — just left you a VM. Work with a few VR operators on their turnover inspections. Worth a quick chat?'",
        "branches": []
      },
      "end_graceful": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand, Herb. If anything changes, I'm easy to find — Sam Parks, RapidEye. Appreciate your time. Take care.",
        "note": "Don't burn the bridge. Stay warm. You may circle back in 3-4 weeks. Log the outcome and any intel in CRM immediately.",
        "branches": []
      }
    }
  }
}