{
  "name": "Hope Johnston",
  "title": "Director of Mid-Atlantic Sales (formerly Director of Rental Management)",
  "company": "Kiawah Island Golf Resort",
  "location": "Kiawah Island, SC",
  "phone": "+1-843-768-6012",
  "company_phone": "+1-800-654-2924",
  "alt_phones": [],
  "flow": {
    "context": "Hope Johnston is Director of Mid-Atlantic Sales at Kiawah Island Golf Resort but previously served as Director of Rental Management — she knows turnover and inspection operations firsthand. Kiawah runs 500-plus luxury villas and homes in a rental program that has been operating for over 42 years. No individual property management leaders are named publicly — Hope is the strongest entry point with a direct line at (843) 768-6012. The property management department phone is (843) 768-6087 if she refers you. Goal: connect through her rental management background, then either book a meeting or get a warm referral to whoever currently owns property operations and turnover quality.",
    "start": "dial_hope",
    "nodes": {
      "dial_hope": {
        "label": "DIAL HOPE JOHNSTON",
        "say": "Dialing Hope Johnston — Director of Mid-Atlantic Sales, formerly Director of Rental Management. Direct line: (843) 768-6012.",
        "note": "Read the context above before you dial. Remember: she is in SALES now, not rental management. But she ran it before and knows the pain. You may be playing for a referral. Feet up, relaxed energy.",
        "branches": [
          {
            "label": "Hope answers",
            "to": "opener"
          },
          {
            "label": "Voicemail / No answer",
            "to": "voicemail"
          },
          {
            "label": "Someone else answers",
            "to": "gatekeeper"
          }
        ]
      },
      "opener": {
        "label": "OPENER",
        "say": "Hey Hope — I've been working with a few resort rental programs on their turnover inspection process and your name came up given your background at Kiawah. It's Sam Parks with RapidEye. Have you heard my name tossed around?",
        "note": "Relaxed, like you are calling someone you were told to call. Do not rush. Pause after the question and let her respond. If she sounds confused, that is fine — confused is better than defensive.",
        "branches": [
          {
            "label": "No / Who? / I haven't",
            "to": "heard_name_no"
          },
          {
            "label": "Yes / Maybe / Sounds familiar",
            "to": "heard_name_yes"
          },
          {
            "label": "Can't talk / Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "I'm in sales now, not rental management",
            "to": "role_shift_early"
          }
        ]
      },
      "heard_name_no": {
        "label": "HAVEN'T HEARD — FULL PAIN TRIGGER",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call — I work with another resort rental program, about 400 homes, luxury stuff pretty similar to what Kiawah runs. Their ops team was buried in turnover photos. Cleaners were snapping pictures after every checkout, but nobody actually had time to review them all before the next guest walked in. They'd find out about a cracked countertop or a stained sofa from a guest complaint — not their own process. And with owners paying premium management fees, that kind of miss was turning into real trust issues.",
        "note": "PAUSE HERE. Let the pain land. Do not jump to the solution yet. Wait for her to react — even a 'yeah' or 'mmhmm' is enough. Then continue with the solution.",
        "branches": [
          {
            "label": "Engaged — 'yeah' / 'mmhmm' / listening",
            "to": "solution_and_cta"
          },
          {
            "label": "I'm in sales now, not rental ops",
            "to": "role_shift"
          },
          {
            "label": "Not interested / We're good",
            "to": "not_interested"
          },
          {
            "label": "Cuts you off / hostile",
            "to": "permission_fallback"
          }
        ]
      },
      "solution_and_cta": {
        "label": "SOLUTION AND CTA",
        "say": "So we built an AI that plugs into whatever system they're already using for turnovers and automatically flags damage, missing items, staging problems — no workflow change for the team. They just get a report instead of a photo dump. I know you moved to the sales side, but given you used to run rental management — would you be open to taking a quick look, or pointing me to whoever owns that program now?",
        "note": "One sentence on the solution, then CTA. Give her two easy options: look at it herself, or refer you. Either is a win. Do not oversell the product.",
        "branches": [
          {
            "label": "Interested / Tell me more",
            "to": "warm_response"
          },
          {
            "label": "Talk to the PM team / Here's who to call",
            "to": "referral_ask"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          },
          {
            "label": "Not interested / We have something",
            "to": "not_interested"
          }
        ]
      },
      "heard_name_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone like you. What'd you hear?",
        "note": "Rare but golden. Let her talk. Whatever she says, bridge to discovery or the pain trigger. Do not pitch — she is already warm.",
        "branches": [
          {
            "label": "Shares what she heard",
            "to": "warm_response"
          },
          {
            "label": "Vague / Not sure / Just the name",
            "to": "heard_name_no"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again later this week? Maybe Thursday or Friday afternoon?",
        "note": "Do not pitch. Respect the timing. Get a specific callback day. If she asks what it is about, transition to the pain trigger.",
        "branches": [
          {
            "label": "Sure, try me later",
            "to": "callback_locked"
          },
          {
            "label": "What's this about?",
            "to": "heard_name_no"
          },
          {
            "label": "No, don't call back",
            "to": "graceful_end"
          }
        ]
      },
      "role_shift_early": {
        "label": "ROLE SHIFT — EARLY",
        "say": "Yeah, I saw that — you moved over to the sales side. Honestly that's partly why I called you. You ran rental management, so you know exactly what it's like managing turnover quality across hundreds of homes. I figured you'd either still have a pulse on that world or know exactly who's running it now. Can I get 30 seconds to tell you what we do? If it doesn't click, totally hang up on me.",
        "note": "She is telling you she is not the buyer. Do not fight it. Validate her experience and ask for either her attention or a referral. The 30-second ask lowers the stakes.",
        "branches": [
          {
            "label": "Sure, go ahead",
            "to": "pain_trigger_short"
          },
          {
            "label": "You should talk to someone in PM",
            "to": "referral_given"
          },
          {
            "label": "Can't help / Not interested",
            "to": "referral_ask_gentle"
          }
        ]
      },
      "pain_trigger_short": {
        "label": "SHORT PAIN TRIGGER",
        "say": "So I work with a few luxury rental programs — the common thing I keep hearing is their teams collect turnover photos after every checkout but nobody's actually reviewing them all. Stuff slips through, guest complains, owner gets upset. We built an AI that automatically analyzes those photos and flags damage, missing items, staging issues before the next guest walks in. No workflow change — plugs into whatever system they already use. With 500-plus homes in Kiawah's program, I figured this would land. Does that sound like a real problem on the rental side?",
        "note": "You are asking her to validate the problem from experience. She does not need to be the buyer. If she confirms the pain exists, you have ammunition for the referral call.",
        "branches": [
          {
            "label": "Yeah, that's definitely a thing",
            "to": "discovery_via_hope"
          },
          {
            "label": "Not sure what they do now",
            "to": "referral_ask"
          },
          {
            "label": "We have something for that",
            "to": "have_vendor"
          },
          {
            "label": "Not interested",
            "to": "not_interested"
          }
        ]
      },
      "warm_response": {
        "label": "WARM — STOP PITCHING",
        "say": "Oh nice — so when you were running rental management, what did the inspection process actually look like? Were cleaners taking photos, or was there a separate QA step?",
        "note": "She is warm. STOP SELLING. Ask questions. She has deep institutional knowledge even if she is not the current buyer. Learn the process, learn the pain, learn the org chart.",
        "branches": [
          {
            "label": "Describes their process",
            "to": "discovery_deep"
          },
          {
            "label": "It's changed since I left",
            "to": "referral_ask"
          },
          {
            "label": "We had a system that worked well",
            "to": "reframe_scale"
          }
        ]
      },
      "discovery_via_hope": {
        "label": "DISCOVERY — HOPE'S EXPERIENCE",
        "say": "That's really helpful. When you were running it, how were you handling damage disputes with owners? Was it mostly reactive — like the owner finds something and calls you — or did your team catch it first?",
        "note": "She is validating pain from experience. Go deeper. Whatever she shares becomes your talking point when you call the referral.",
        "branches": [
          {
            "label": "Shares detail / It was mostly reactive",
            "to": "discovery_deep"
          },
          {
            "label": "Talk to the current team",
            "to": "referral_ask"
          },
          {
            "label": "It wasn't a big issue",
            "to": "reframe_scale"
          }
        ]
      },
      "discovery_deep": {
        "label": "DEEP DISCOVERY",
        "say": "Got it. And with 500-plus homes in the program — was there ever a point where the sheer volume just made it impossible to catch everything? Like, you know things are slipping through but there's just not enough bandwidth to review every photo set?",
        "note": "Connect her lived experience to the scale problem. 500-plus homes is a LOT of turnovers per week. Let her feel the weight of it. If she opens up, you are building your case for the referral.",
        "branches": [
          {
            "label": "Yeah, that was always the challenge",
            "to": "bridge_to_meeting_or_referral"
          },
          {
            "label": "We handled it well",
            "to": "reframe_scale"
          },
          {
            "label": "You should talk to PM team",
            "to": "referral_ask"
          }
        ]
      },
      "reframe_scale": {
        "label": "REFRAME AROUND SCALE",
        "say": "Totally makes sense. The thing I keep hearing from the bigger programs is that their process works — until it doesn't. Like, 95 percent of the time everything's fine, but that 5 percent generates the owner complaints, the deposit disputes, the bad reviews. And at 500 homes, 5 percent is still 25 properties a month where something got missed. That's the gap we fill. Would it make sense for me to connect with whoever's running the rental program now? I could put something specific together so it actually lands with them.",
        "note": "Do not argue their process is bad. Agree it works, then reframe around the tail risk at their scale. Then pivot to referral.",
        "branches": [
          {
            "label": "Yeah, let me give you a name",
            "to": "referral_given"
          },
          {
            "label": "I can pass your info along",
            "to": "send_email_referral"
          },
          {
            "label": "Not sure who to send you to",
            "to": "referral_ask_dept"
          }
        ]
      },
      "role_shift": {
        "label": "ROLE SHIFT — MID-CALL",
        "say": "Yeah, totally — I saw you're on the sales side now. Honestly you're probably the best person to tell me if this is even a real problem at Kiawah. When you were running rental management, were your teams dealing with that photo overload after turnovers? Cleaners taking pics but nobody actually reviewing them all?",
        "note": "She deflected to her current role. Pivot by asking her to validate the problem from experience. Not to buy — just to confirm. Lower the stakes.",
        "branches": [
          {
            "label": "Yeah, that was a challenge",
            "to": "discovery_via_hope"
          },
          {
            "label": "Talk to the PM team",
            "to": "referral_ask"
          },
          {
            "label": "Not really involved in that",
            "to": "referral_ask_gentle"
          }
        ]
      },
      "referral_ask": {
        "label": "ASK FOR REFERRAL",
        "say": "That makes total sense. Do you know who's running the rental management or property ops side now? If I can get a name, I'll put something tailored together so it's not just another random cold call for them.",
        "note": "This is the money ask. Be direct but casual. If she gives a name, get the title and any contact info. Write it down immediately.",
        "branches": [
          {
            "label": "Gives a name",
            "to": "referral_given"
          },
          {
            "label": "Try the Property Management line",
            "to": "referral_dept_only"
          },
          {
            "label": "Not sure who",
            "to": "referral_ask_dept"
          },
          {
            "label": "I'd rather not",
            "to": "referral_refused"
          }
        ]
      },
      "referral_ask_gentle": {
        "label": "GENTLE REFERRAL ASK",
        "say": "No worries at all. I don't want to waste your time on something that's not your world anymore. Is there someone on the property management side I should reach out to? Even just a department or title would help — I'll do the legwork.",
        "note": "She is not engaging on the substance. Make the referral ask as easy as possible. Even a department name is a win — you already have the PM line at (843) 768-6087.",
        "branches": [
          {
            "label": "Gives a name or department",
            "to": "referral_given"
          },
          {
            "label": "Try the PM line",
            "to": "referral_dept_only"
          },
          {
            "label": "Can't help",
            "to": "graceful_end"
          }
        ]
      },
      "referral_ask_dept": {
        "label": "ASK ABOUT DEPARTMENT OR TITLE",
        "say": "No problem. Would Property Management be the right department? I've got their main line but wasn't sure who specifically oversees the rental inspections or turnover quality. Any idea what title that person holds?",
        "note": "You know the PM dept phone is (843) 768-6087. You are trying to get a name or at least a title to ask for when you call that line. Even 'Director of Property Management' gives you something to ask the gatekeeper for.",
        "branches": [
          {
            "label": "Gives a name or title",
            "to": "referral_given"
          },
          {
            "label": "Yeah, try Property Management",
            "to": "referral_dept_only"
          },
          {
            "label": "Not sure",
            "to": "graceful_end_with_email"
          }
        ]
      },
      "referral_given": {
        "label": "REFERRAL — NAME RECEIVED",
        "say": "That's incredibly helpful. Would it be okay if I mentioned your name when I reach out? Just so it doesn't feel like a totally random call for them. And would you be open to me sending you a quick email too — just so you have it if it ever comes up on your end?",
        "note": "Lock in the referral. Get permission to name-drop. Offer to email her too — she may forward it internally. Write down the name, title, phone, and any detail she shares.",
        "branches": [
          {
            "label": "Sure, mention my name",
            "to": "book_or_close_referral"
          },
          {
            "label": "Don't mention me, just reach out directly",
            "to": "book_or_close_referral"
          }
        ]
      },
      "referral_dept_only": {
        "label": "REFERRAL — DEPARTMENT ONLY",
        "say": "Got it — I'll try the Property Management line. If I call over there, is there a specific person or title I should ask for? Like a Director of Operations or whoever runs the day-to-day on the rental side?",
        "note": "Push gently for a name. Even a title helps you navigate the gatekeeper when you call (843) 768-6087. If she gives nothing, you will use the triple bypass on the PM line.",
        "branches": [
          {
            "label": "Gives a name or title",
            "to": "referral_given"
          },
          {
            "label": "Just call the PM line",
            "to": "graceful_end_with_email"
          }
        ]
      },
      "referral_refused": {
        "label": "REFERRAL REFUSED",
        "say": "Totally understand — I don't want to put you in a weird spot. Would it be alright if I just sent you a quick email with what we do? If it ever comes up in conversation on the property side, you'd have it. No pressure at all.",
        "note": "Do not push. Offer the email as a low-friction exit. She may forward it internally later on her own.",
        "branches": [
          {
            "label": "Sure, send it over",
            "to": "graceful_end_with_email"
          },
          {
            "label": "No thanks",
            "to": "graceful_end"
          }
        ]
      },
      "not_interested": {
        "label": "NOT INTERESTED — AGREE FIRST",
        "say": "Totally get it — I should've assumed you'd be all set, otherwise you probably would've reached out to us. Just so nobody from my team cold calls you again — is it that this isn't really your world anymore since you moved to sales, or is it more that Kiawah's rental team already has this stuff handled?",
        "note": "Miyagi method. Agree first — surprise her by not pushing back. Then split the objection. You are trying to figure out if it is a role issue or a product issue. Both paths lead somewhere useful.",
        "branches": [
          {
            "label": "Not my area / I'm in sales",
            "to": "referral_ask"
          },
          {
            "label": "We already have something",
            "to": "have_vendor"
          },
          {
            "label": "Just not interested / Stop calling",
            "to": "graceful_end"
          }
        ]
      },
      "have_vendor": {
        "label": "HAVE A VENDOR — AGREE",
        "say": "That makes total sense — with 500-plus homes you'd have to have something in place. Totally respect that. Is it that you're fully happy with it and it catches everything, or is it more that switching anything right now would just be a headache?",
        "note": "Split between satisfaction and switching cost. If they are happy, respect it and offer value. If it is switching cost, sell the test drive.",
        "branches": [
          {
            "label": "Happy with it",
            "to": "vendor_happy"
          },
          {
            "label": "Switching would be a pain",
            "to": "sell_test_drive"
          },
          {
            "label": "Not sure what they use now",
            "to": "referral_ask"
          }
        ]
      },
      "vendor_happy": {
        "label": "VENDOR HAPPY — OFFER VALUE",
        "say": "Love to hear that — honestly most programs I talk to are struggling with it so that's great. If nothing else, would you be open to me sending over a quick breakdown of what other resort programs are doing with AI on their turnover photos? Worst case you steal some ideas and we part as friends.",
        "note": "Do not fight a happy-customer objection. Offer value. The email gets you in the door and gives you a reason to follow up later.",
        "branches": [
          {
            "label": "Sure, send it",
            "to": "graceful_end_with_email"
          },
          {
            "label": "No thanks",
            "to": "graceful_end"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally get it — nobody wants to rip and replace something that's working well enough. Here's what I'd say though — you're probably not buying anything right now and I respect that. But when the time does come to evaluate, the people who move fastest are the ones who already know what's out there. Would you be open to a 15-minute look? Not a sales pitch — just a walkthrough of what a couple other resort programs are doing. If it's not a fit, at least you know.",
        "note": "Lower the stakes. 'Not buying now' removes pressure. '15 minutes' is specific and short. If she is not the buyer, she will redirect you to PM — which is still a win.",
        "branches": [
          {
            "label": "Sure, I could take a look",
            "to": "book_meeting"
          },
          {
            "label": "Show it to the PM team instead",
            "to": "referral_ask"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "graceful_end"
          }
        ]
      },
      "bridge_to_meeting_or_referral": {
        "label": "BRIDGE — MEETING OR REFERRAL",
        "say": "That's exactly what we're solving. So here's my question — would it make more sense for me to show this to whoever's running the rental program now, or would you want to take a quick look yourself first? I'm happy to do either.",
        "note": "Give her the choice. She might want to be involved since she has institutional knowledge, or she might just hand you off. Either is a win.",
        "branches": [
          {
            "label": "Show it to me / I'd look",
            "to": "book_meeting"
          },
          {
            "label": "Talk to the PM team",
            "to": "referral_ask"
          },
          {
            "label": "Both / I'll connect you",
            "to": "referral_given"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next week pulled up — would Tuesday or Wednesday work better? Morning or afternoon, whatever's easier.",
        "note": "Lock it in NOW. Two days, let her pick. Once she picks a day, narrow to a time. Send the calendar invite while still on the phone.",
        "branches": [
          {
            "label": "Picks a day or time",
            "to": "meeting_booked"
          },
          {
            "label": "Let me check my calendar",
            "to": "book_meeting_push"
          },
          {
            "label": "Just send me an email first",
            "to": "send_email"
          }
        ]
      },
      "book_meeting_push": {
        "label": "PUSH FOR SPECIFIC TIME",
        "say": "No rush — how about I throw something on for Wednesday at 2? If it doesn't work we'll move it. At least it's on the books.",
        "note": "Suggest a specific time. Make it easy to say yes. 'We'll move it' lowers the commitment level.",
        "branches": [
          {
            "label": "Sure, that works",
            "to": "meeting_booked"
          },
          {
            "label": "Different time",
            "to": "meeting_booked"
          },
          {
            "label": "Just email me and I'll find a time",
            "to": "send_email"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING BOOKED",
        "say": "Perfect — I'll shoot you a calendar invite right now at hope_johnston@kiawahresort.com. Really appreciate you taking my call, Hope. Talk soon.",
        "note": "Stop selling immediately. Send the invite NOW while still on the line if possible. Confirm the email address. Keep the close short and warm.",
        "branches": []
      },
      "book_or_close_referral": {
        "label": "CLOSE — REFERRAL RECEIVED",
        "say": "Really appreciate it, Hope. I'll send you a quick email too — nothing heavy, just a one-pager so you have it. If anything ever comes up on the rental side, you'll know where to find me. Thanks again.",
        "note": "She gave you a referral. That is a huge win. Send her an email within 30 minutes. Then call the referral ASAP and lead with Hope's name if she gave permission.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Absolutely — I'll send something over today. One quick question so it's actually useful and not just another generic pitch — would it be more helpful to see what other resort rental programs are doing with AI on inspections, or more of a quick overview of how it plugs into existing turnover workflows?",
        "note": "Accept the email ask. Ask ONE tailoring question. Her answer also tells you what she cares about, which helps you frame the follow-up.",
        "branches": [
          {
            "label": "Picks one or gives direction",
            "to": "send_email_close"
          },
          {
            "label": "Just send whatever / Keep it short",
            "to": "send_email_close"
          }
        ]
      },
      "send_email_close": {
        "label": "EMAIL CLOSE",
        "say": "Got it — I'll keep it tight. I'll include a couple times to connect next week too in case it sparks anything. Really appreciate your time, Hope.",
        "note": "Confirm you will send it. Plant the seed for a follow-up call. Send the email within 30 minutes. Include a specific time suggestion in the email and a reason to reply.",
        "branches": []
      },
      "send_email_referral": {
        "label": "SHE'LL FORWARD IT",
        "say": "That'd be great. I'll send you something short and specific — easy to forward. Should I send it to hope_johnston@kiawahresort.com?",
        "note": "Confirm the email. Keep whatever you send short, clear, and obviously relevant to property ops so it is easy for her to forward without explanation.",
        "branches": [
          {
            "label": "Confirms email",
            "to": "graceful_end_with_email"
          },
          {
            "label": "Gives a different email",
            "to": "graceful_end_with_email"
          }
        ]
      },
      "graceful_end_with_email": {
        "label": "CLOSE — WITH EMAIL",
        "say": "Perfect. I'll get that over to you today. Really appreciate your time, Hope — if anything comes up on the rental side, I'm easy to find.",
        "note": "Send the email within 30 minutes. Reference the call. Include a clear CTA and a specific time suggestion.",
        "branches": []
      },
      "graceful_end": {
        "label": "CLOSE — GRACEFUL EXIT",
        "say": "Totally understand. If anything changes, I'm easy to find. Appreciate your time, Hope.",
        "note": "Do not burn the bridge. She may circle back if she hears about inspection issues from the PM team. Leave warm. Log the call and next steps.",
        "branches": []
      },
      "callback_locked": {
        "label": "CALLBACK CONFIRMED",
        "say": "Perfect — I'll try you Thursday afternoon. Appreciate it, Hope. Talk then.",
        "note": "Lock in the specific day. Set a calendar reminder immediately. When you call back open with: 'Hey Hope, it's Sam Parks — we chatted briefly earlier this week, you told me to try you back today.'",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION — 30 SECONDS",
        "say": "Yeah totally — I mean it is a cold call. Can I get 30 seconds to tell you why I reached out? You can totally hang up on me if it's not a fit.",
        "note": "This is your safety net when the opener did not land. Most people will give 30 seconds. If she says yes, go to the short pain trigger. Stay relaxed.",
        "branches": [
          {
            "label": "Sure / Go ahead",
            "to": "pain_trigger_short"
          },
          {
            "label": "No / Not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot — totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a terrible time, or is it that you already know what we do and it's just not interesting?",
        "note": "Last chance. Split between timing and interest. If timing, get a callback. If interest, exit gracefully. Do not push harder than this.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / Stop calling",
            "to": "graceful_end"
          },
          {
            "label": "What do you actually do?",
            "to": "pain_trigger_short"
          }
        ]
      },
      "voicemail": {
        "label": "VOICEMAIL",
        "say": "Hey Hope, it's Sam Parks — I work with a few resort rental programs on their turnover inspection process and your name came up given your background running rental management at Kiawah. Would love to connect for a couple minutes. My cell is [your number]. I'll shoot you a quick email too. Talk soon.",
        "note": "Keep it under 20 seconds. Sound like someone she should know, not someone selling something. Send a follow-up email to hope_johnston@kiawahresort.com within 10 minutes referencing the voicemail. Try calling again in 2 days.",
        "branches": []
      },
      "gatekeeper": {
        "label": "GATEKEEPER",
        "say": "Hey — could you get me through to Hope? It's Sam.",
        "note": "First name only. Do not pitch. Do not explain. Sound like you belong. If they push, give context one layer at a time. Never volunteer information they did not ask for.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "She's not available",
            "to": "gatekeeper_context"
          },
          {
            "label": "What's this regarding?",
            "to": "gatekeeper_context"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — MORE CONTEXT",
        "say": "Yeah, I work with a few resort property management teams in the area. Would you mind letting her know it's Sam Parks with RapidEye? I can also try her another time if that's easier.",
        "note": "Give one more layer of context but still do not pitch. Offer to call back — this shows respect and lowers the gatekeeper's guard. If they take a message, leave your name and number only.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Takes a message / I'll let her know",
            "to": "gatekeeper_leave_message"
          },
          {
            "label": "She's out / Try another time",
            "to": "gatekeeper_leave_message"
          }
        ]
      },
      "gatekeeper_leave_message": {
        "label": "GATEKEEPER — LEAVE MESSAGE",
        "say": "Appreciate it — it's Sam Parks, S-A-M P-A-R-K-S, with RapidEye. Best number is [your cell]. I'll shoot her an email too. Thanks so much.",
        "note": "Spell your name. Give one number only. Send a follow-up email to hope_johnston@kiawahresort.com immediately. Try calling again in 1-2 days at a different time of day.",
        "branches": []
      }
    }
  }
}