{
  "name": "Isidra Santos",
  "title": "Housekeeping Manager",
  "company": "Frias Properties of Aspen Snowmass",
  "location": "Aspen, CO",
  "phone": "+1-970-429-2425",
  "company_phone": "+1-970-920-2000",
  "alt_phones": [],
  "flow": {
    "context": "Isidra Santos is the Housekeeping Manager at Frias Properties of Aspen Snowmass — 130+ luxury vacation rentals across Aspen and Snowmass Village. She's been with Frias for nearly 25 years and is known for setting high housekeeping standards. Frias runs on Streamline for PMS and work orders, expanded into Snowmass in 2023 adding several properties to her team's workload. If she's not the buyer, referral targets are Manuel Nava (fellow Housekeeping Manager), Chris Longden or Zane Strickland (Directors of Ops), or Ben Wolff (Managing Partner & GM). No strong personal connection to Sam — lead with industry proximity and her role.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Isidra — I work with a few housekeeping teams at vacation rental companies in ski markets, and your name kept coming up as someone who really runs the show over at Frias. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Feet-up energy. Don't rush. Sound like you're calling someone you were told to call. Pause after the question and let her respond.",
        "branches": [
          {
            "label": "No / Who? / Haven't heard of you",
            "to": "no_heard"
          },
          {
            "label": "Yes / Maybe / Sounds familiar",
            "to": "yes_heard"
          },
          {
            "label": "Bad timing / busy / can't talk",
            "to": "bad_timing"
          },
          {
            "label": "Someone else answers the line",
            "to": "someone_else"
          }
        ]
      },
      "no_heard": {
        "label": "NOT HEARD OF ME",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call — I've been working with another housekeeping manager at a property management company pretty similar to yours, about a hundred-thirty units, and she was telling me that even with solid cleaners and solid checklists, stuff still slips through the photos. Like a stain on a couch gets buried in photo forty-seven of eighty, nobody catches it, guest checks in, and now it's a whole thing — damage dispute, owner's upset, and her team takes the heat even though the photos technically showed it. Sound familiar at all?",
        "note": "This is the pain trigger. PAUSE after 'sound familiar at all.' Let her react. Don't keep talking. The specificity of 'photo forty-seven of eighty' is intentional — it should feel like you've heard this story before from someone exactly like her.",
        "branches": [
          {
            "label": "Yes / That happens / Relatable",
            "to": "pain_acknowledged"
          },
          {
            "label": "Not really / We have a good process",
            "to": "have_process"
          },
          {
            "label": "What do you do? / What is this?",
            "to": "explain_briefly"
          },
          {
            "label": "Not interested / I'm busy",
            "to": "permission_fallback"
          }
        ]
      },
      "yes_heard": {
        "label": "HEARD OF ME",
        "say": "Oh no kidding — well normally we'd be working with someone in your position. What'd you hear?",
        "note": "Let her talk. Whatever she says, use it to bridge into discovery. Don't correct anything — just learn and follow her lead.",
        "branches": [
          {
            "label": "Heard something positive or vague",
            "to": "warm_discovery"
          },
          {
            "label": "Not sure / confused what it is",
            "to": "explain_briefly"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow or later this week?",
        "note": "Don't push. Be easy about it. Get a specific callback time if you can.",
        "branches": [
          {
            "label": "Gives a time / Sure try me later",
            "to": "lock_callback"
          },
          {
            "label": "Just email me",
            "to": "send_email"
          },
          {
            "label": "Don't call back / Not interested",
            "to": "graceful_exit"
          }
        ]
      },
      "someone_else": {
        "label": "SOMEONE ELSE ANSWERS",
        "say": "Hey — could you get me through to Isidra? It's Sam.",
        "note": "Don't volunteer more info unless asked. Keep it short — sound like you belong on this call.",
        "branches": [
          {
            "label": "Puts you through / Hold on",
            "to": "opener"
          },
          {
            "label": "She's not available / Who's calling?",
            "to": "gatekeeper_context"
          },
          {
            "label": "Can I take a message?",
            "to": "gatekeeper_message"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER WANTS CONTEXT",
        "say": "Yeah — I work with a few other property managers in the Aspen area on their turnover inspection workflows. Would you mind letting her know it's Sam Parks?",
        "note": "Still casual. Don't pitch the gatekeeper. If they push more, offer social proof.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "She's unavailable / Out today",
            "to": "gatekeeper_message"
          },
          {
            "label": "What company? / More questions",
            "to": "gatekeeper_social_proof"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER STILL PUSHING",
        "say": "Totally — it's RapidEye. We help a couple other vacation rental companies with their housekeeping photo workflows. I sent her a note — would you mind giving her a heads up that I called?",
        "note": "Last gatekeeper move. If you can't get through, leave a short message and plan to call back.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Will pass the message along",
            "to": "gatekeeper_message"
          }
        ]
      },
      "gatekeeper_message": {
        "label": "LEAVE MESSAGE",
        "say": "That'd be great — just let her know Sam Parks called, RapidEye, and that I work with a few housekeeping teams at similar-sized property managers. She can reach me anytime. Appreciate your help.",
        "note": "Keep it short and easy to relay. Plan to call back in 1-2 days.",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call. Can I get thirty seconds to tell you why I reached out, and you can totally hang up on me if it's not a fit?",
        "note": "Say it with a smile. The self-awareness disarms people. This is your safety net when the opener doesn't land.",
        "branches": [
          {
            "label": "Okay / Go ahead / Fine",
            "to": "pain_trigger_short"
          },
          {
            "label": "No / Not interested / Hang up",
            "to": "last_chance_split"
          }
        ]
      },
      "last_chance_split": {
        "label": "LAST CHANCE SPLIT",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and this just isn't interesting?",
        "note": "This is the last play. The multiple choice forces a real answer. Bad timing gives you a callback. Disinterest gives you a clean exit.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / Don't need it",
            "to": "graceful_exit"
          },
          {
            "label": "What do you do exactly?",
            "to": "explain_briefly"
          }
        ]
      },
      "pain_trigger_short": {
        "label": "PAIN TRIGGER — SHORT",
        "say": "So I've been working with a few housekeeping teams at vacation rental companies your size — a hundred-plus units. And the thing that keeps coming up is this: cleaners take photos every turnover, but nobody actually has time to review all of them. So damage gets buried, stuff gets missed, and the housekeeping team takes the blame when a guest or an owner finds it first. We built something that automatically reviews those turnover photos and flags the problems before anybody checks in. Would you be open to taking a look sometime when I'm not cold calling you out of the blue?",
        "note": "Condensed version. One pain, one solution, one CTA. PAUSE after the question.",
        "branches": [
          {
            "label": "Sure / Could be interesting",
            "to": "warm_discovery"
          },
          {
            "label": "We already have something for that",
            "to": "have_process"
          },
          {
            "label": "No budget for that",
            "to": "no_budget"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          }
        ]
      },
      "pain_acknowledged": {
        "label": "PAIN ACKNOWLEDGED",
        "say": "Yeah — that's exactly what I keep hearing. So we built something that plugs into the photos your cleaners are already taking — it reviews every single one automatically and flags damage, missing items, staging issues, anything that's off. No extra steps for your team. Would you be open to taking a look at it?",
        "note": "She resonated with the pain. Keep it tight — one sentence on the solution, then CTA. Don't oversell. Pause and let her respond.",
        "branches": [
          {
            "label": "Sure / Interested / Tell me more",
            "to": "warm_discovery"
          },
          {
            "label": "How does it work exactly?",
            "to": "explain_briefly"
          },
          {
            "label": "We already have something for that",
            "to": "have_process"
          },
          {
            "label": "I'd have to talk to my boss / Not my call",
            "to": "referral_path"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          }
        ]
      },
      "explain_briefly": {
        "label": "BRIEF EXPLANATION",
        "say": "So you know how your cleaners are already taking photos every turnover? We plug into that — it connects to Streamline or whatever system you're running — and our AI reviews every photo automatically. Flags damage, stains, missing items, staging that's off. Instead of someone having to eyeball hundreds of photos, you just get a report of what needs attention. The whole point is catching stuff before a guest or an owner finds it first.",
        "note": "Drop 'Streamline' naturally — you know they use it. Don't say 'artificial intelligence,' just 'AI.' Keep it conversational, not a pitch deck.",
        "branches": [
          {
            "label": "That's interesting / Tell me more",
            "to": "warm_discovery"
          },
          {
            "label": "We have a good process already",
            "to": "have_process"
          },
          {
            "label": "How much does it cost?",
            "to": "deflect_price"
          },
          {
            "label": "I'd need to loop in someone else",
            "to": "referral_path"
          }
        ]
      },
      "warm_discovery": {
        "label": "DISCOVERY — WARM",
        "say": "Awesome — so I don't want to just pitch you blindly. What does the turnover process actually look like for your team right now? Like when a guest checks out, are your cleaners taking photos during the clean, or is there a separate inspection step?",
        "note": "STOP PITCHING. You're warm — now ask questions and listen. Let her talk about her world. Take notes on what she says for the demo.",
        "branches": [
          {
            "label": "Describes their process",
            "to": "discovery_dig_deeper"
          },
          {
            "label": "It varies / It depends",
            "to": "discovery_dig_deeper"
          },
          {
            "label": "Why do you need to know that?",
            "to": "discovery_justify"
          }
        ]
      },
      "discovery_dig_deeper": {
        "label": "DIG DEEPER",
        "say": "Got it — and when photos do come in, who's actually reviewing them? Is that you, or does that fall on the ops side? And honestly, with a hundred-thirty-plus units turning over, how many of those photos are actually getting looked at?",
        "note": "You're uncovering the photo review gap and who owns it. Also planting the seed that nobody reviews all of them — which is the core problem RapidEye solves.",
        "branches": [
          {
            "label": "I review them / My team does",
            "to": "discovery_pain_confirm"
          },
          {
            "label": "Ops team reviews / Someone else handles it",
            "to": "discovery_who_else"
          },
          {
            "label": "Honestly not many get reviewed",
            "to": "discovery_pain_confirm"
          }
        ]
      },
      "discovery_pain_confirm": {
        "label": "CONFIRM THE PAIN",
        "say": "That makes sense. And when something does get missed — like a stain or damage that didn't get caught — how does that usually surface? Is it the next guest complaining, or an owner noticing on their own?",
        "note": "Her answer tells you how to frame the demo value: guest experience, owner relations, or team accountability. Whatever she says, mirror it back.",
        "branches": [
          {
            "label": "Guest complaints",
            "to": "bridge_to_meeting"
          },
          {
            "label": "Owner notices / Owner gets upset",
            "to": "bridge_to_meeting"
          },
          {
            "label": "Both / It depends",
            "to": "bridge_to_meeting"
          },
          {
            "label": "We catch most things honestly",
            "to": "challenge_gently"
          }
        ]
      },
      "discovery_who_else": {
        "label": "SOMEONE ELSE REVIEWS",
        "say": "Got it — so is that Chris or Zane on the ops side, or is it more of a property-by-property thing?",
        "note": "Drop the names naturally. You know their org chart. This shows you've done homework and makes her more likely to connect you.",
        "branches": [
          {
            "label": "Yes / Mentions one of them",
            "to": "referral_with_context"
          },
          {
            "label": "Different structure / Someone else",
            "to": "referral_with_context"
          },
          {
            "label": "It's really more my team",
            "to": "discovery_pain_confirm"
          }
        ]
      },
      "discovery_justify": {
        "label": "JUSTIFY DISCOVERY",
        "say": "Totally fair — I just don't want to waste your time showing you something that doesn't fit how you actually work. Every company does turnovers differently, and the last thing I want is to send you some generic pitch. What I'm trying to figure out is whether this would actually save your team time or if you've already got it dialed in.",
        "note": "Reframe the questions as being FOR her benefit, then circle back.",
        "branches": [
          {
            "label": "Okay / Fair enough / Describes process",
            "to": "discovery_dig_deeper"
          },
          {
            "label": "Just send me info",
            "to": "send_email"
          }
        ]
      },
      "bridge_to_meeting": {
        "label": "BRIDGE TO MEETING",
        "say": "Yeah — that's exactly the pattern. And that's the whole reason we built this. I could actually show you what this would look like with your setup — Streamline, your photo workflow, your unit types. It'd be like fifteen minutes and you'd know right away if it's useful or not. Would you be open to that?",
        "note": "Mirror whatever pain she just described. Reference Streamline to make it feel tailored. Transition to booking.",
        "branches": [
          {
            "label": "Sure / Yeah let's do it",
            "to": "book_meeting"
          },
          {
            "label": "I'd need to loop someone else in",
            "to": "referral_path"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          }
        ]
      },
      "challenge_gently": {
        "label": "GENTLE CHALLENGE",
        "say": "I believe it — especially with someone who's been doing this as long as you have. The thing I keep hearing though is it's not the stuff that gets caught that hurts — it's the one thing that slips through on a busy Saturday turnover that turns into a two-thousand-dollar damage claim nobody can prove. Would it be worth seeing how other housekeeping teams are using this as a safety net — even just to confirm you've already got it covered?",
        "note": "Respect her tenure — nearly 25 years. But reframe: even great teams miss things at volume. Position as validation, not replacement.",
        "branches": [
          {
            "label": "Sure / That's fair",
            "to": "book_meeting"
          },
          {
            "label": "We really are fine / Not needed",
            "to": "graceful_exit_warm"
          },
          {
            "label": "I'd have to check with someone",
            "to": "referral_path"
          }
        ]
      },
      "have_process": {
        "label": "OBJECTION — HAVE A PROCESS",
        "say": "That makes total sense — with a hundred-thirty-plus units you'd have to have something solid in place. I'd be shocked if you didn't.",
        "note": "Agree first. Don't argue. Pause for a beat, then split the objection.",
        "branches": [
          {
            "label": "She elaborates on their process",
            "to": "have_process_split"
          },
          {
            "label": "Silence / Waiting",
            "to": "have_process_split"
          }
        ]
      },
      "have_process_split": {
        "label": "SPLIT — HAVE A PROCESS",
        "say": "Just so I'm not wasting anyone's time — is it that you're fully covered and happy with how turnover photos get reviewed, or is it more that adding anything new right now would just be a headache?",
        "note": "The split forces a real answer. 'Happy with it' means probe for cracks. 'Headache to add' means sell the no-workflow-change angle.",
        "branches": [
          {
            "label": "We're happy with it / It works fine",
            "to": "test_drive_happy"
          },
          {
            "label": "More about adding something new / Bad timing",
            "to": "test_drive_timing"
          },
          {
            "label": "Bit of both",
            "to": "test_drive_timing"
          }
        ]
      },
      "test_drive_happy": {
        "label": "TEST DRIVE — HAPPY WITH PROCESS",
        "say": "Honestly, that's great to hear. Most housekeeping teams I talk to are drowning. Here's my only thought — you're probably not buying anything right now, and I totally respect that. But would it be worth fifteen minutes just to see what other companies in ski markets are doing with their turnover photos? Worst case you steal some ideas and we part as friends.",
        "note": "Position as peer intel, not a sales pitch. The meeting has value even if she never buys.",
        "branches": [
          {
            "label": "Sure / Could be worth it",
            "to": "book_meeting"
          },
          {
            "label": "Not right now / No thanks",
            "to": "graceful_exit_warm"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          }
        ]
      },
      "test_drive_timing": {
        "label": "TEST DRIVE — TIMING ISSUE",
        "say": "Totally get it. And honestly, the nice thing about this is it plugs into what your cleaners are already doing — photos they're already taking, Streamline which you're already running. No new app for anyone to download, no workflow change. But I get it, timing is timing. Would it make sense to take a quick look now so that when the timing is right you already know what's on your list? Even just fifteen minutes.",
        "note": "Counter the 'headache to add' objection with RapidEye's biggest selling point: no workflow change. Reference Streamline specifically.",
        "branches": [
          {
            "label": "Okay / Sure why not",
            "to": "book_meeting"
          },
          {
            "label": "Not now / Maybe later",
            "to": "bad_timing"
          },
          {
            "label": "I'd need to talk to someone else first",
            "to": "referral_path"
          }
        ]
      },
      "no_budget": {
        "label": "OBJECTION — NO BUDGET",
        "say": "Totally get it. Nowadays it's harder to keep a tool, let alone buy something new — especially heading into busy season.",
        "note": "Agree. Pause for a beat. Then split.",
        "branches": [
          {
            "label": "She elaborates / Silence",
            "to": "no_budget_split"
          }
        ]
      },
      "no_budget_split": {
        "label": "SPLIT — NO BUDGET",
        "say": "Just so nobody on my team bugs you again — is it that budget for something like this is completely off the table right now, or is it more that anything you try to bring in has to go through Ben or the ops team and that's a whole process?",
        "note": "Drop Ben Wolff's name naturally — shows you know the org. If budget goes through leadership, pivot to referral.",
        "branches": [
          {
            "label": "Budget is off the table entirely",
            "to": "test_drive_happy"
          },
          {
            "label": "Would need approval from someone else",
            "to": "referral_path"
          },
          {
            "label": "It's both honestly",
            "to": "referral_path"
          }
        ]
      },
      "referral_path": {
        "label": "REFERRAL PATH",
        "say": "That makes total sense. So when it comes to bringing in new tools on the operations side — is that something Ben would sign off on, or does that typically go through Chris or Zane first?",
        "note": "Use names you know from the org chart. You're mapping the decision chain. Goal: get a specific name and ideally an intro or permission to name-drop.",
        "branches": [
          {
            "label": "Ben / Managing Partner decides",
            "to": "ask_for_intro"
          },
          {
            "label": "Chris or Zane / Ops directors",
            "to": "ask_for_intro"
          },
          {
            "label": "Manuel / Fellow housekeeping manager",
            "to": "ask_for_intro"
          },
          {
            "label": "Not sure who handles that",
            "to": "ask_for_intro_general"
          }
        ]
      },
      "referral_with_context": {
        "label": "REFERRAL WITH CONTEXT",
        "say": "Got it — so it sounds like they might be the right person to see this. Would you be open to a quick call where I show both of you at the same time? That way you don't have to relay anything, and they can see whether it actually fits your workflow.",
        "note": "Try to get Isidra on the demo too — she's the daily user and internal champion even if she's not the buyer. A joint call is ideal.",
        "branches": [
          {
            "label": "Sure / Let me check with them",
            "to": "book_meeting"
          },
          {
            "label": "I'll pass your info along",
            "to": "send_email"
          },
          {
            "label": "Just reach out to them directly",
            "to": "ask_for_intro"
          }
        ]
      },
      "ask_for_intro": {
        "label": "ASK FOR INTRO",
        "say": "Got it — would you mind if I reached out to them and mentioned we spoke? If I can use your name, I can put something tailored together so it actually lands instead of being another random cold call.",
        "note": "Get permission to name-drop Isidra. This turns your next call from cold to warm. Huge advantage.",
        "branches": [
          {
            "label": "Sure / Go ahead",
            "to": "confirm_referral_close"
          },
          {
            "label": "I'll pass it along myself",
            "to": "send_email"
          },
          {
            "label": "Rather not / Don't use my name",
            "to": "graceful_exit_warm"
          }
        ]
      },
      "ask_for_intro_general": {
        "label": "GENERAL REFERRAL ASK",
        "say": "No worries — who on your team would typically be the one to look at something like this? Like who owns the decision on tools and workflows for turnovers?",
        "note": "You're fishing for a name. If she gives one, get permission to use hers.",
        "branches": [
          {
            "label": "Gives a name",
            "to": "ask_for_intro"
          },
          {
            "label": "Not sure / I can ask around",
            "to": "send_email"
          }
        ]
      },
      "confirm_referral_close": {
        "label": "CONFIRM REFERRAL & CLOSE",
        "say": "Perfect — I really appreciate that. I'll reach out to them this week and mention you and I connected. And hey, if it makes sense, I'd love to loop you in on the call too since you'd be the one actually using it day to day. Thanks for your time, Isidra — really appreciate it.",
        "note": "Lock the referral. Try to include Isidra on the next call — she's the champion even if not the signer. Send email to the referral today.",
        "branches": []
      },
      "deflect_price": {
        "label": "DEFLECT PRICE QUESTION",
        "say": "Honestly it depends on how many units and how it's set up — I don't want to throw out a number that doesn't mean anything. But what I can tell you is most companies we work with are paying way more in missed damage claims than what this costs. Would it make sense to do a quick call where I can actually look at your setup and give you a real answer?",
        "note": "Never quote price on a cold call. Redirect to meeting. The 'missed damage claims' framing makes price feel small by comparison.",
        "branches": [
          {
            "label": "Sure / That makes sense",
            "to": "book_meeting"
          },
          {
            "label": "Just give me a ballpark",
            "to": "deflect_price_again"
          },
          {
            "label": "Not right now",
            "to": "send_email"
          }
        ]
      },
      "deflect_price_again": {
        "label": "DEFLECT PRICE — SECOND ASK",
        "say": "I hear you — ballpark, most companies your size are spending less than what a single missed damage claim costs them. But it really depends on how your turnovers work and how many photos we're processing. Honestly fifteen minutes on a call and I can give you an exact number. Fair enough?",
        "note": "Give a relative anchor, not a dollar figure. Push to the meeting one more time.",
        "branches": [
          {
            "label": "Okay / Let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Just email me the info",
            "to": "send_email"
          }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most useful to include so it's not just another generic email sitting in your inbox? Like are you more curious about how it works with Streamline, or more about what other housekeeping teams are actually seeing from it?",
        "note": "Dropping 'Streamline' shows you know their stack. Her answer tells you what to put in the email. Always get a follow-up time.",
        "branches": [
          {
            "label": "Tells you what to include",
            "to": "confirm_email_followup"
          },
          {
            "label": "Just send whatever / General info",
            "to": "confirm_email_followup"
          }
        ]
      },
      "confirm_email_followup": {
        "label": "CONFIRM EMAIL + FOLLOW-UP",
        "say": "Done — I'll send that over to your Frias email this afternoon. And just so it doesn't get buried — would it be crazy if I gave you a quick ring Thursday to make sure it landed? Even just five minutes.",
        "note": "Lock in a follow-up call. If she pushes back, respect it. Send the email within the hour with a specific time suggestion for a call.",
        "branches": [
          {
            "label": "Sure / That works",
            "to": "close_friendly"
          },
          {
            "label": "Don't call, I'll read it",
            "to": "close_friendly"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome — let's lock it in so it doesn't fall through the cracks. I'm looking at next week — how does Tuesday or Wednesday afternoon look for fifteen minutes?",
        "note": "Pick specific days. Don't say 'sometime next week.' If she pushes back, offer two more days. Send the invite while still on the phone.",
        "branches": [
          {
            "label": "Gives a day/time that works",
            "to": "confirm_meeting"
          },
          {
            "label": "Can't next week / Need to check calendar",
            "to": "book_meeting_push"
          },
          {
            "label": "Actually let me think about it first",
            "to": "send_email"
          }
        ]
      },
      "book_meeting_push": {
        "label": "PUSH FOR MEETING TIME",
        "say": "No rush — how about the week after? I've got pretty open availability. What day usually works best for you?",
        "note": "Stay flexible but get a specific day. Don't let it turn into 'I'll get back to you.'",
        "branches": [
          {
            "label": "Gives a time",
            "to": "confirm_meeting"
          },
          {
            "label": "Just email me and I'll find a time",
            "to": "send_email"
          }
        ]
      },
      "confirm_meeting": {
        "label": "CONFIRM & CLOSE MEETING",
        "say": "Perfect — I'll shoot you a calendar invite at your Frias email right now. It'll be quick, fifteen minutes — I'll show you what we're doing with a couple other housekeeping teams and you can tell me if it even makes sense for your setup. Really appreciate you taking my call, Isidra.",
        "note": "STOP SELLING. The meeting is booked. Send the invite immediately after hanging up. Be warm, be grateful, and get off the phone before you talk yourself out of the meeting.",
        "branches": []
      },
      "lock_callback": {
        "label": "LOCK CALLBACK TIME",
        "say": "Perfect — I'll try you then. Is this the best number to reach you at?",
        "note": "Confirm the number. Put it in your calendar with a reminder. Treat the callback like a real appointment.",
        "branches": [
          {
            "label": "Yes / Confirms number",
            "to": "close_friendly"
          },
          {
            "label": "Gives a different number or time",
            "to": "close_friendly"
          }
        ]
      },
      "close_friendly": {
        "label": "FRIENDLY CLOSE",
        "say": "Awesome — appreciate your time, Isidra. Talk soon.",
        "note": "Short and warm. Don't linger. Hang up and send whatever you promised immediately.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes, I'm easy to find — Sam Parks, RapidEye. Appreciate your time, Isidra.",
        "note": "Don't burn the bridge. Exit clean. Log the outcome and plan a follow-up attempt in 60-90 days.",
        "branches": []
      },
      "graceful_exit_warm": {
        "label": "WARM EXIT",
        "say": "Totally fair. Hey — if you ever do run into a situation where something slips through and you think there's gotta be a better way, just shoot me an email. Sam at RapidEye. Appreciate you giving me a few minutes, Isidra.",
        "note": "Leave the door open. She's been there nearly 25 years — she's not going anywhere, and neither is the problem. You can try again next quarter.",
        "branches": []
      }
    }
  }
}