{
  "name": "Jayson Yoss",
  "title": "President / Designated Broker / Founder",
  "company": "Sunset Home Rentals",
  "location": "San Diego, CA",
  "phone": "+1-602-765-4750",
  "company_phone": "(858) 351-0067",
  "alt_phones": [
    "+1-858-779-0577",
    "+1-866-545-5303",
    "+1-866-201-4022",
    "+1-602-765-4750",
    "+1-866-545-5303",
    "+1-858-779-0577"
  ],
  "flow": {
    "context": "Jayson Yoss is the founder, president, and designated broker of both GoldenWest Management and Sunset Home Rentals — a multi-market residential PM operation (San Diego, Las Vegas, Phoenix, 1500+ properties) with a vacation-rental division running on LMPM and actively expanding into Cabo San Lucas. They use AppFolio for long-term PM, employ remote teams in Central America, run 24/7 maintenance dispatch with a deep vendor bench, and promise detailed move-in/move-out inspections and professional pre-arrival cleans — but have no visible ops-layer photo QA tool like Breezeway. Jayson is a Marine Infantry vet (two tours), University of Arizona grad, surfer, and snowboarder — direct overlap with Sam's surfing (Indonesia, El Salvador) and skiing (Jackson Hole).",
    "start": "gatekeeper",
    "nodes": {
      "gatekeeper": {
        "label": "GATEKEEPER",
        "say": "Hey — could you get me through to Jayson? It's Sam.",
        "note": "First name only. Casual. Sound like you're expected. Don't explain why you're calling unless pushed.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Who's calling? / What's this about?",
            "to": "gatekeeper_context"
          },
          {
            "label": "He's not available",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — CONTEXT",
        "say": "Yeah — I work with a few other property managers in San Diego. Would you mind letting him know it's Sam Parks?",
        "note": "Dose info slowly. Don't pitch the gatekeeper. Stay casual. Redirect with a question.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Pushes back more / what company?",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "He's not available",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "It's RapidEye — we help a couple other property management companies in the area with their inspection workflows. I sent him a note and just wanted to follow up. Would you mind giving him a heads up?",
        "note": "Third dose. If still blocked, ask for voicemail or best callback time. Don't argue.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Still won't / take a message",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_unavailable": {
        "label": "GATEKEEPER — UNAVAILABLE",
        "say": "No worries — when's the best time to catch him? And would it help if I sent him a quick email first so he knows who I am?",
        "note": "Get callback window. If they offer email, take it and ask for Jayson's direct address. If they mention Roy True, pivot to him — he's the ops owner.",
        "branches": [
          {
            "label": "Gives callback time",
            "to": "book_callback"
          },
          {
            "label": "Gives email / says send an email",
            "to": "email_confirmed_end"
          },
          {
            "label": "Try Roy True / someone else instead?",
            "to": "gatekeeper_to_roy"
          }
        ]
      },
      "gatekeeper_to_roy": {
        "label": "GATEKEEPER ROUTES TO ROY",
        "say": "Actually yeah — Roy would be great too. Could you put me through to him?",
        "note": "Roy True is Director of Ops and actually the better day-to-day contact. If they offer him, take it happily. Adjust your opener to mention Jayson's name.",
        "branches": [
          {
            "label": "Puts you through to Roy",
            "to": "opener"
          },
          {
            "label": "Roy also unavailable",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "opener": {
        "label": "OPENER",
        "say": "Hey Jayson — this might be a little out of left field, but I saw you're a surfer out in San Diego. I actually just got back from a surf trip in Indonesia — I'm kind of obsessed. Anyway, it's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Tone: relaxed, like calling someone a friend told you about. Feet up on the desk. The surfing connection is real — Sam surfs regularly (Indonesia, El Salvador). Don't rush past it. Let it breathe.",
        "branches": [
          {
            "label": "No, haven't heard of you",
            "to": "heard_no"
          },
          {
            "label": "Yeah / maybe / sounds familiar",
            "to": "heard_yes"
          },
          {
            "label": "Who is this? / What's this about?",
            "to": "who_is_this"
          },
          {
            "label": "Bad timing / I'm busy",
            "to": "bad_timing"
          }
        ]
      },
      "heard_no": {
        "label": "HEARD NO — TRANSITION TO PAIN",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call — I work with a few other vacation rental operators in San Diego, and honestly one of the things that keeps coming up is the turnover photo problem. Their cleaners are taking hundreds of photos after every stay, uploading them into LMPM or wherever — and nobody actually has time to review them all. So stuff slips through. A stain on a couch, a missing throw pillow, a scuff on the wall — and then it shows up as a guest complaint or a deposit dispute with an owner who wants to know why nobody caught it. We built an AI that plugs into the photos your team's already taking and flags damage and missing items automatically — no workflow change. Would you be open to taking a look when I'm not cold calling you out of the blue?",
        "note": "Pause after 'stuff slips through' — let it land. He runs 40+ vacation units on LMPM plus the broader GoldenWest portfolio. This is his world. Then one-sentence solution, then soft CTA. Don't rush the ending.",
        "branches": [
          {
            "label": "Yeah / sure / tell me more",
            "to": "warm_response"
          },
          {
            "label": "Not interested / we're good",
            "to": "not_interested_objection"
          },
          {
            "label": "We already have a process for that",
            "to": "have_a_process_objection"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          },
          {
            "label": "No budget / not right now",
            "to": "no_budget_objection"
          }
        ]
      },
      "heard_yes": {
        "label": "HEARD YES",
        "say": "Oh nice — well normally we'd be working with someone like you. What'd you hear?",
        "note": "Let them talk. Whatever they say, use it to bridge into discovery or pain. If vague, transition to the pain trigger.",
        "branches": [
          {
            "label": "They share what they heard",
            "to": "warm_response"
          },
          {
            "label": "Vague / 'not sure' / 'just the name'",
            "to": "heard_no"
          }
        ]
      },
      "who_is_this": {
        "label": "WHO IS THIS",
        "say": "Yeah totally fair — Sam Parks, I run a company called RapidEye. We work with a few vacation rental operators in San Diego on their turnover inspection workflows. I came across Sunset Home Rentals and figured it'd be worth reaching out. Have you heard my name tossed around?",
        "note": "Re-anchor with name and relevance. Keep it short. Get back to the framework.",
        "branches": [
          {
            "label": "No, haven't heard of you",
            "to": "heard_no"
          },
          {
            "label": "Yeah / sounds familiar",
            "to": "heard_yes"
          },
          {
            "label": "I'm busy / not interested",
            "to": "permission_ask"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow or later this week?",
        "note": "Don't push. Respect the timing. Lock a callback if possible.",
        "branches": [
          {
            "label": "Gives a time / says call back",
            "to": "book_callback"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          },
          {
            "label": "Don't call back / not interested",
            "to": "permission_denied_split"
          }
        ]
      },
      "book_callback": {
        "label": "BOOK CALLBACK",
        "say": "Perfect — I've got tomorrow pulled up. What time works best for you? I'll keep it super quick.",
        "note": "Lock the day and time. Put it in your calendar immediately. Treat it like a real commitment.",
        "branches": [
          {
            "label": "Gives a time",
            "to": "callback_confirmed"
          },
          {
            "label": "Just try me whenever",
            "to": "callback_confirmed"
          }
        ]
      },
      "callback_confirmed": {
        "label": "CALLBACK CONFIRMED",
        "say": "Done — I'll hit you up then. Appreciate it, Jayson. Oh, and if you find any good surf spots in Cabo when you guys expand down there, let me know.",
        "note": "Light close. The Cabo surfing comment ties the personal connection to their business expansion. Memorable. Leave on a high note.",
        "branches": []
      },
      "permission_ask": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not a fit?",
        "note": "Disarming honesty. Most people will give you 30 seconds if you own the interruption.",
        "branches": [
          {
            "label": "Fine / go ahead / 30 seconds",
            "to": "heard_no"
          },
          {
            "label": "No / not interested / don't have time",
            "to": "permission_denied_split"
          }
        ]
      },
      "permission_denied_split": {
        "label": "PERMISSION DENIED — SPLIT",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and this just isn't interesting?",
        "note": "Split the objection into two doors. One reopens the conversation (bad timing), one is a real no. Either way you learn something.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not interesting / we're set",
            "to": "last_ditch_value"
          },
          {
            "label": "Hangs up",
            "to": "graceful_end"
          }
        ]
      },
      "last_ditch_value": {
        "label": "LAST DITCH — OFFER VALUE",
        "say": "Totally respect that. One thing I'll mention — we're working with a few PM companies in San Diego right now, and I put together a quick breakdown of what they're doing with their turnover photos that's actually catching stuff their teams were missing. If I shoot that over, worst case you steal some ideas. Want me to send it?",
        "note": "Not selling anymore. Offering genuine value. If they bite, you get the email and a warm follow-up path. If not, exit gracefully.",
        "branches": [
          {
            "label": "Sure, send it over",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "graceful_end"
          }
        ]
      },
      "warm_response": {
        "label": "WARM — STOP PITCHING, START ASKING",
        "say": "Cool — before I ramble, let me ask you this: with the vacation rental side under Sunset, what does your turnover inspection process actually look like right now? Like, are your cleaners taking photos after every stay, or is someone going behind them?",
        "note": "STOP SELLING. He's warm. Ask questions. You know they use LMPM and have housekeeping teams doing pre-arrival and post-departure cleans. Let him describe his world so you can tailor everything from here.",
        "branches": [
          {
            "label": "Describes their process",
            "to": "discovery_dig_deeper"
          },
          {
            "label": "We use a specific tool or process",
            "to": "have_a_process_objection"
          },
          {
            "label": "Roy handles that / someone else does",
            "to": "referral_to_roy"
          },
          {
            "label": "Why do you ask?",
            "to": "discovery_why"
          }
        ]
      },
      "discovery_why": {
        "label": "EXPLAIN WHY YOU ASK",
        "say": "Honestly — the other vacation rental operators I work with, the ones doing 40, 50, 100-plus units, they all hit the same wall. The cleaners take the photos, they upload them, but nobody has time to actually look at every single one. And then something gets missed — a broken drawer handle, a stain on a duvet, whatever — and it either becomes a guest complaint or an owner asking why nobody caught it. That's what we solve. We analyze the photos automatically so your team doesn't have to eyeball every one.",
        "note": "This is the pain restated in context of his question. Pause after 'nobody caught it.' Let him connect it to his own experience before you keep going.",
        "branches": [
          {
            "label": "That's interesting / we do have that issue",
            "to": "discovery_dig_deeper"
          },
          {
            "label": "We're pretty on top of it",
            "to": "have_a_process_objection"
          },
          {
            "label": "What does that actually look like?",
            "to": "pitch_brief"
          }
        ]
      },
      "discovery_dig_deeper": {
        "label": "DIG DEEPER — DISCOVERY",
        "say": "That makes sense. And with the Cabo expansion coming — are you planning to replicate the same process down there, or is that still being figured out?",
        "note": "Cabo is their live expansion — marked Coming Soon on the site. This signals you've done your homework and positions RapidEye as something that scales with them. If he bites, lean into: new market, new vendors, new cleaners, how do you maintain quality remotely?",
        "branches": [
          {
            "label": "Talks about Cabo plans or challenges",
            "to": "cabo_expansion"
          },
          {
            "label": "Still early / not sure yet",
            "to": "cabo_expansion"
          },
          {
            "label": "Wants to know more about RapidEye",
            "to": "pitch_brief"
          },
          {
            "label": "Roy or someone else handles ops",
            "to": "referral_to_roy"
          }
        ]
      },
      "cabo_expansion": {
        "label": "CABO EXPANSION THREAD",
        "say": "Yeah — that's actually exactly what I hear from operators scaling into new markets. The hardest part isn't finding the cleaners or the vendors, it's maintaining the same quality standard when you can't personally be there checking everything. Especially internationally. That's where having AI review every set of turnover photos — automatically, same standard every time, doesn't matter if it's San Diego or Cabo — actually changes things. Would it make sense to hop on a quick call next week where I can show you what that looks like? I could walk you through how another multi-market operator set it up.",
        "note": "Cabo = new vendors, new cleaners, no established trust, different country. RapidEye becomes the QA layer that travels with them. Tie to the meeting CTA. He already has remote teams in Central America so the 'remote quality control' angle hits home.",
        "branches": [
          {
            "label": "Yeah let's do it / sounds good",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Loop in Roy / someone else",
            "to": "referral_to_roy"
          },
          {
            "label": "Not sure about timing",
            "to": "no_budget_objection"
          }
        ]
      },
      "pitch_brief": {
        "label": "BRIEF PITCH",
        "say": "So in a nutshell — your cleaners or inspectors take photos after a turnover, right? Those photos go into LMPM or get uploaded somewhere. We plug into that flow and our AI scans every photo — flags damage, missing items, staging issues, anything that changed since the last inspection. You get a report without anyone having to manually review hundreds of photos. No workflow change for your team.",
        "note": "Keep it to 20 seconds. One breath. Then transition to CTA or deeper discovery depending on his energy.",
        "branches": [
          {
            "label": "How does it integrate with LMPM?",
            "to": "tech_integration"
          },
          {
            "label": "Sounds interesting / let's talk more",
            "to": "book_meeting"
          },
          {
            "label": "What does it cost?",
            "to": "cost_deflect"
          },
          {
            "label": "We already have something for that",
            "to": "have_a_process_objection"
          }
        ]
      },
      "tech_integration": {
        "label": "TECH INTEGRATION QUESTION",
        "say": "Good question — we integrate with the major PMS and ops platforms. Honestly, the best way to show you is a quick screen share where I can walk through exactly how it'd fit with your stack — LMPM on the vacation side, AppFolio on the long-term side. We could knock it out in fifteen minutes. Would next Tuesday or Wednesday work?",
        "note": "Don't get pulled into a technical deep-dive on a cold call. Acknowledge the question, show you know their stack (LMPM + AppFolio), then bridge to a meeting where you can demo it properly.",
        "branches": [
          {
            "label": "Gives availability",
            "to": "book_meeting"
          },
          {
            "label": "Send me info first",
            "to": "send_email"
          },
          {
            "label": "Roy would need to be on that call",
            "to": "referral_to_roy"
          }
        ]
      },
      "cost_deflect": {
        "label": "COST QUESTION — DEFLECT TO MEETING",
        "say": "It depends on portfolio size and how many turnovers you're running, but honestly it's a fraction of what one missed damage claim costs you. The fastest way to get a real number is a quick call where I can scope it out — would you be open to fifteen minutes next week?",
        "note": "Never quote price on a cold call. Anchor to the cost of the problem, not the cost of the solution. Bridge to meeting.",
        "branches": [
          {
            "label": "Yeah let's set it up",
            "to": "book_meeting"
          },
          {
            "label": "Just ballpark me",
            "to": "cost_insist"
          },
          {
            "label": "Send me info",
            "to": "send_email"
          }
        ]
      },
      "cost_insist": {
        "label": "COST INSIST",
        "say": "I hear you — I don't want to throw out a number that's meaningless without knowing your setup. It's usually a few bucks per inspection, not a big line item. But the real ROI is catching the stuff that would have cost you way more — one missed damage that turns into an owner dispute pays for a year of the tool. Let me put something specific together for your portfolio and shoot it over — sound fair?",
        "note": "Give a vague anchor so he doesn't feel stonewalled. Then bridge to email or meeting.",
        "branches": [
          {
            "label": "Sure, send it",
            "to": "send_email"
          },
          {
            "label": "Let's just do the call",
            "to": "book_meeting"
          }
        ]
      },
      "not_interested_objection": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "I totally get it. I should've assumed you'd be all set — otherwise you probably would've reached out to us. Just so nobody from my team cold calls you again — is it that inspection quality isn't really a pain point for you guys right now, or is it more just that you hate cold calls?",
        "note": "Agree first — surprise him. Then split the objection. Most founders will admit they hate cold calls, which reopens the door.",
        "branches": [
          {
            "label": "Hate cold calls / bad timing",
            "to": "hate_cold_calls"
          },
          {
            "label": "Not a priority / we're covered",
            "to": "covered_probe"
          },
          {
            "label": "Still not interested",
            "to": "last_ditch_value"
          }
        ]
      },
      "hate_cold_calls": {
        "label": "HATES COLD CALLS — RE-ENGAGE",
        "say": "Ha — honestly, fair enough. I wouldn't want me calling me either. Look, I'll keep this super quick — we're working with a few PM companies your size in San Diego, and the thing that caught my attention about Sunset is the Cabo expansion. Scaling turnovers into a new country with new vendors is exactly where our stuff shines. Would you be open to a fifteen-minute call on your terms — you pick the time, no pressure?",
        "note": "Acknowledge the annoyance, then re-engage with the most compelling hook: Cabo expansion plus new-market quality control. Let him pick the time so he feels in control.",
        "branches": [
          {
            "label": "Fine / give me a time",
            "to": "book_meeting"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          },
          {
            "label": "No",
            "to": "graceful_end"
          }
        ]
      },
      "covered_probe": {
        "label": "THEY FEEL COVERED — PROBE",
        "say": "That makes total sense — with the number of units you're running across three markets, you'd have to have something in place. Out of curiosity, are your cleaners documenting turnovers with photos right now, or is it more of a checklist-based process?",
        "note": "They said they're covered but you're not challenging it — you're learning. Reference their multi-market scale (San Diego, Vegas, Phoenix) to show you've done homework. Whatever they describe, position RapidEye as a layer on top.",
        "branches": [
          {
            "label": "Describes their process",
            "to": "covered_reposition"
          },
          {
            "label": "Roy handles that",
            "to": "referral_to_roy"
          },
          {
            "label": "Doesn't want to engage",
            "to": "last_ditch_value"
          }
        ]
      },
      "covered_reposition": {
        "label": "REPOSITION AS ENHANCEMENT",
        "say": "Got it — that's solid. The thing we do differently is we're not replacing any of that. We just analyze the photos that are already being taken and flag stuff a human eye would miss — especially at volume. Think of it as a QA layer on top of what's already working. Would it be worth fifteen minutes to see if it'd actually add anything? If it doesn't, I'll tell you straight up.",
        "note": "Position as additive, not competitive. 'I'll tell you straight up' builds trust with a founder. Low-pressure CTA.",
        "branches": [
          {
            "label": "Sure / why not",
            "to": "book_meeting"
          },
          {
            "label": "Send me info",
            "to": "send_email"
          },
          {
            "label": "Not now",
            "to": "graceful_end"
          }
        ]
      },
      "have_a_process_objection": {
        "label": "OBJECTION — HAVE A PROCESS",
        "say": "That makes total sense — with your portfolio you'd have to have something dialed in. Is it that you're fully covered and happy with how it's working, or is it more that switching or adding anything right now would just be a headache?",
        "note": "Split: happy vs. headache. Most people aren't 100% happy — they just don't want the hassle. If 'headache,' position as zero workflow change. If 'happy,' probe gently.",
        "branches": [
          {
            "label": "We're happy with it",
            "to": "covered_probe"
          },
          {
            "label": "It's more the hassle / timing",
            "to": "test_drive_sell"
          },
          {
            "label": "What would be different about yours?",
            "to": "pitch_brief"
          }
        ]
      },
      "test_drive_sell": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally get it — you're probably not buying anything new right now, and I respect that. But when you do look at this down the road — especially as Cabo comes online and you're standing up new operations — the people who get it are the ones who already know what's on their shortlist. Would you be open to a quick look? Not a sales pitch — just so you know what's out there. Worst case you steal some ideas for your current process.",
        "note": "Future-frame it. Cabo is the trigger — new market equals new pain. 'Steal some ideas' lowers the commitment bar. He's a systems-oriented founder — appeal to preparation.",
        "branches": [
          {
            "label": "Fine / let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "graceful_end"
          }
        ]
      },
      "no_budget_objection": {
        "label": "OBJECTION — NO BUDGET",
        "say": "Totally get it. Nowadays it's harder to keep a tool, let alone buy something new. Just so nobody from my team bugs you again — is it that budget for this year is completely locked, or is it more that anything you try to buy puts you through the ringer?",
        "note": "Split: locked budget vs. painful approval. If locked, future-frame with test drive. If approval pain, position as low-cost pilot that doesn't need a committee.",
        "branches": [
          {
            "label": "Budget is locked",
            "to": "test_drive_sell"
          },
          {
            "label": "Approval process is painful",
            "to": "test_drive_sell"
          },
          {
            "label": "Just not a priority right now",
            "to": "not_interested_objection"
          }
        ]
      },
      "referral_to_roy": {
        "label": "REFERRAL TO ROY TRUE",
        "say": "That makes sense — Roy True is your Director of Ops, right? Would it make sense for me to reach out to him directly? If I can get a warm intro, I can put something specific together so it actually lands with him.",
        "note": "You know Roy True is Director of Operations from their About page. Using his name shows homework and makes Jayson more likely to connect you. Roy is actually the stronger operational contact.",
        "branches": [
          {
            "label": "Yeah, talk to Roy",
            "to": "get_roy_contact"
          },
          {
            "label": "Let me check with him first",
            "to": "referral_follow_up"
          },
          {
            "label": "Actually, I handle this stuff",
            "to": "warm_response"
          },
          {
            "label": "Names someone else",
            "to": "referral_other"
          }
        ]
      },
      "get_roy_contact": {
        "label": "GET ROY'S CONTACT",
        "say": "Perfect — what's the best way to reach Roy? Is email or phone better for him? And would you mind giving him a heads up that I'll be reaching out? Makes a huge difference coming from you versus a random cold call.",
        "note": "Get the direct email or phone. The warm intro request is critical — a founder telling his ops director to take this call changes everything. If he gives sdpm@goldenwestmanagement.com or the main line, take it and ask for Roy's direct.",
        "branches": [
          {
            "label": "Gives contact info",
            "to": "referral_close"
          },
          {
            "label": "Just call the main line / use the general email",
            "to": "referral_close"
          }
        ]
      },
      "referral_other": {
        "label": "REFERRAL — OTHER PERSON",
        "say": "Got it — and what's their name and role? I'll put something tailored together so it's actually relevant to them, not just a generic pitch.",
        "note": "Get name, title, and ideally direct email or phone. Could be Donald Chamorro (Maintenance Manager), Massiel Lazo (Remote Team Manager), or Bianca Barrios (Property Manager) — all are in the org.",
        "branches": [
          {
            "label": "Gives name and info",
            "to": "referral_close"
          },
          {
            "label": "Vague / won't give details",
            "to": "referral_follow_up"
          }
        ]
      },
      "referral_follow_up": {
        "label": "REFERRAL FOLLOW-UP PLAN",
        "say": "No worries at all — I'll shoot you an email with a quick summary, and if you think it makes sense to pass along, that'd be awesome. What's the best email for you — is jyoss at goldenwest the right one?",
        "note": "Suggest jyoss@goldenwestmanagement.com to show you've done homework. If he corrects it, even better — you get the right address. Send a tight follow-up he can forward to Roy.",
        "branches": [
          {
            "label": "Confirms or gives email",
            "to": "referral_close"
          },
          {
            "label": "Use the website / general inbox",
            "to": "referral_close"
          }
        ]
      },
      "referral_close": {
        "label": "REFERRAL — CLOSE",
        "say": "Really appreciate that, Jayson. I'll make sure whatever I send is tight and relevant — not some generic deck. And seriously, if you ever need surf recs for Cabo when you guys get set up down there, I've got friends who've surfed that coast. Thanks for your time.",
        "note": "Warm close. The Cabo surf comment ties back to both the personal connection and their business expansion. Leave the door wide open. Send the tailored email within 30 minutes.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most useful to include so it's not just another generic pitch? Like, is it more the vacation rental turnover side you'd want to see, or the long-term inspection side, or both?",
        "note": "Two purposes: (1) learn what he cares about, (2) re-engage the conversation. He runs both vacation (Sunset/LMPM) and long-term (GoldenWest/AppFolio). Whatever he says, tailor the email. Always include specific meeting time options.",
        "branches": [
          {
            "label": "Tells you what to include",
            "to": "email_close"
          },
          {
            "label": "Just send whatever / general info",
            "to": "email_close"
          }
        ]
      },
      "email_close": {
        "label": "EMAIL — CLOSE",
        "say": "Done — I'll get that over to you today. What's the best email — is jyoss at goldenwest the right one? And I'll throw a couple time options in there in case you want to hop on a quick call after you've looked at it.",
        "note": "Suggest jyoss@goldenwestmanagement.com. If he corrects it, great. Confirm you'll include meeting time options. Send within 30 minutes while you're fresh in his mind.",
        "branches": [
          {
            "label": "Confirms or gives email",
            "to": "email_confirmed_end"
          },
          {
            "label": "Use the website email",
            "to": "email_confirmed_end"
          }
        ]
      },
      "email_confirmed_end": {
        "label": "EMAIL CONFIRMED — END",
        "say": "Perfect — you'll have it today. Appreciate you taking my call, Jayson. Talk soon.",
        "note": "Send the email within 30 minutes. Subject line should reference the call and something specific (Cabo, turnover photos, San Diego). Include two specific time slots for a follow-up. Keep it short — three to four paragraphs max.",
        "branches": []
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome — let me lock this in. I've got next Tuesday and Wednesday pulled up. What works better for you — morning or afternoon?",
        "note": "Pick specific days. Give two options. Don't say 'whenever works.' Send the calendar invite while still on the phone if possible.",
        "branches": [
          {
            "label": "Gives a day and time",
            "to": "confirm_meeting"
          },
          {
            "label": "Let me check my calendar and get back to you",
            "to": "meeting_fallback_email"
          }
        ]
      },
      "meeting_fallback_email": {
        "label": "MEETING FALLBACK — PIN IT DOWN",
        "say": "Totally — how about I send over an invite for Wednesday at 10 and you can move it if that doesn't work? That way it's on both our calendars and we don't play email tag.",
        "note": "Don't let it float. Propose a specific time and let them adjust. This converts way better than 'let me know.'",
        "branches": [
          {
            "label": "Sure, send it",
            "to": "confirm_meeting"
          },
          {
            "label": "Just email me and I'll reply",
            "to": "email_close"
          }
        ]
      },
      "confirm_meeting": {
        "label": "CONFIRM MEETING",
        "say": "Perfect — I've got it. I'll send you an invite right now. It'll just be a quick fifteen minutes — I'll show you exactly how it'd work with your setup. And if Roy should be on the call too, feel free to loop him in. Really appreciate it, Jayson.",
        "note": "Repeat the time back. Suggest including Roy True — gets the ops owner on the demo. Send the invite immediately. STOP SELLING. The meeting is booked.",
        "branches": [
          {
            "label": "Sounds good",
            "to": "meeting_booked_end"
          }
        ]
      },
      "meeting_booked_end": {
        "label": "MEETING BOOKED — END",
        "say": "Talk to you then. And seriously — if you ever want to trade surf spots, I'm always down. Have a good one, Jayson.",
        "note": "Keep it light and human. The surf callback reinforces the personal connection. Don't add anything — you won. Hang up before you talk yourself out of the meeting.",
        "branches": []
      },
      "voicemail": {
        "label": "VOICEMAIL",
        "say": "Hey Jayson — Sam Parks, RapidEye. I work with a few vacation rental operators in San Diego on their turnover inspection process. Came across Sunset Home Rentals and figured it'd be worth a quick conversation — especially with the Cabo expansion coming. My number is [your number]. Also shooting you a quick email. Talk soon.",
        "note": "Under 20 seconds. Name, company, one hook (Cabo expansion), phone number, mention the email. Don't pitch on voicemail. Send the follow-up email immediately after hanging up.",
        "branches": []
      },
      "graceful_end": {
        "label": "GRACEFUL END",
        "say": "Totally understand. If anything changes, I'm easy to find. Appreciate your time, Jayson.",
        "note": "Don't burn the bridge. Log the objection reason so the next touch in 3-6 months is smarter. He's a founder — circumstances change. Cabo alone could reopen this.",
        "branches": []
      }
    }
  }
}