{
  "name": "Jennifer J. Highfill",
  "title": "Owner / Broker / Founder",
  "company": "OceanfrontVac.com",
  "location": "Myrtle Beach, SC",
  "phone": "+1-843-457-8139",
  "company_phone": "+1-800-247-5459",
  "alt_phones": [],
  "flow": {
    "context": "Calling Jenny Highfill — founder, sole owner, and broker of OceanfrontVac.com, a ~100-property vacation rental company in Myrtle Beach she started in 1986. She IS the decision-maker: no board, no partners, no corporate layer. She outsources housekeeping, runs annual inspections and inventory, and her brand promise is built on catching 'EVERY detail' for guests. They use Streamline VRS as their PMS. Sam's angle is working with other East Coast vacation rental managers (600-property client), and the shared coastal/fishing lifestyle is a natural icebreaker — Sam founded a fishing club and surfs regularly, Jenny's entire business is oceanfront Myrtle Beach. January timing is ideal: off-season, she has bandwidth, and summer prep is top of mind.",
    "start": "call_start",
    "nodes": {
      "call_start": {
        "label": "CALL CONNECTS",
        "say": "Wait to hear who answers. If it's Jenny, go. If it's someone else, switch to gatekeeper mode.",
        "note": "This is her cell — she'll likely answer directly. Listen for 'Hello?' or her name. If a receptionist or assistant answers, go to gatekeeper.",
        "branches": [
          {
            "label": "Jenny answers",
            "to": "opener"
          },
          {
            "label": "Someone else answers",
            "to": "gatekeeper"
          },
          {
            "label": "Voicemail",
            "to": "voicemail"
          }
        ]
      },
      "opener": {
        "label": "OPENER",
        "say": "Hey Jenny — I work with a few other vacation rental managers along the coast on their inspection workflows. It's Sam Parks with RapidEye. Have you heard my name tossed around?",
        "note": "Feet up on the desk. Say her name warmly — she's a founder, used to being addressed directly. Don't rush 'RapidEye' — let it land. The East Coast angle is your strongest play: you actually work with a 600-property PM company on the East Coast.",
        "branches": [
          {
            "label": "No / Who? / I haven't heard of you",
            "to": "heard_name_no"
          },
          {
            "label": "Yes / Maybe / Sounds familiar",
            "to": "heard_name_yes"
          },
          {
            "label": "I'm busy / Can't talk right now",
            "to": "bad_timing"
          },
          {
            "label": "What is this about? / Is this a sales call?",
            "to": "permission_fallback"
          }
        ]
      },
      "heard_name_no": {
        "label": "HASN'T HEARD OF SAM — PAIN TRIGGER",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call — I was actually just talking to another vacation rental manager, pretty similar setup to yours. About a hundred properties, outsourced housekeeping, the whole thing. And she was telling me that no matter how tight her process was, stuff would still slip through between turnovers. A stain on a couch, a missing set of towels — and it wouldn't surface until the guest checked in and left a review about it. Worst part? Her cleaners were actually taking photos every single time. She just didn't have the hours to go through a thousand photos a week across all her units.",
        "note": "This is the pain trigger. Paint the picture, then STOP TALKING. Let the silence sit. She needs to feel this in her gut before you offer anything. Watch for a sigh, a 'yeah,' an 'mm-hmm,' or 'that sounds familiar.' Those are green lights.",
        "branches": [
          {
            "label": "Yeah, that sounds familiar / We deal with that",
            "to": "pain_positive"
          },
          {
            "label": "Okay... / Listening but quiet",
            "to": "pain_neutral_cta"
          },
          {
            "label": "We already have a process for that",
            "to": "objection_have_process"
          },
          {
            "label": "I'm not really interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "heard_name_yes": {
        "label": "HAS HEARD OF SAM",
        "say": "Oh nice — well normally we'd be working with someone like you. What'd you hear?",
        "note": "Rare on a cold call but great. Let her talk. Whatever she says, use it to bridge into discovery. Don't correct anything she gets wrong — just build on it.",
        "branches": [
          {
            "label": "Mentions inspections / AI / photos",
            "to": "warm_discovery"
          },
          {
            "label": "Vague / Not sure where I heard it",
            "to": "pain_trigger_bridge"
          },
          {
            "label": "Actually, I haven't — what is this?",
            "to": "heard_name_no"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you back tomorrow afternoon? Or is later this week better?",
        "note": "Give two options, not an open-ended 'when works?' She's busy — make it easy. If she pushes back harder, go to permission fallback.",
        "branches": [
          {
            "label": "Sure, try me tomorrow / gives a time",
            "to": "schedule_callback"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          },
          {
            "label": "No, I'm not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "schedule_callback": {
        "label": "CALLBACK SCHEDULED",
        "say": "Perfect — I'll try you tomorrow around the same time. Really appreciate it, Jenny. Talk soon.",
        "note": "Log the callback time IMMEDIATELY after hanging up. Set a reminder. When you call back, open with: 'Hey Jenny, it's Sam Parks — you told me to try you back today.'",
        "branches": []
      },
      "voicemail": {
        "label": "VOICEMAIL",
        "say": "Hey Jenny, it's Sam Parks — I work with a few vacation rental managers along the coast on their inspection workflows. Had a quick question for you. My number's area code 8-1-8 ... — try me back when you get a sec. Thanks.",
        "note": "Keep it under 20 seconds. Sound like a peer, not a pitch. Leave your number slowly. Do NOT explain RapidEye. The curiosity gap — 'had a quick question' — is what gets callbacks. Call again in 2 days if no response.",
        "branches": []
      },
      "gatekeeper": {
        "label": "SOMEONE ELSE ANSWERS",
        "say": "Hey — could you get me over to Jenny? It's Sam.",
        "note": "Her cell, so this is unlikely. But if someone answers — assistant, family member, office staff — keep it casual and short. First names only. Don't explain what you do or say 'company.'",
        "branches": [
          {
            "label": "Who's calling? / What's this about?",
            "to": "gatekeeper_context"
          },
          {
            "label": "She's not available right now",
            "to": "gatekeeper_unavailable"
          },
          {
            "label": "Puts you through to Jenny",
            "to": "opener"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER WANTS CONTEXT",
        "say": "Yeah — I work with a few other vacation rental managers along the coast. Would you mind letting her know it's Sam Parks?",
        "note": "Still no pitch. If they push further, add: 'We help a couple other property management companies with their inspection workflows. I sent her a note — would you mind giving her a heads up?' Always end with a redirect question.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "She's not available / take a message",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_unavailable": {
        "label": "GATEKEEPER — JENNY UNAVAILABLE",
        "say": "No worries at all. When's usually the best time to catch her? I'll try back then.",
        "note": "Get a time, log it, and call back. Don't leave a voicemail through a gatekeeper. If they insist on a message: 'Just let her know Sam Parks called — she'll know what it's about.'",
        "branches": [
          {
            "label": "Gives a time / Try mornings",
            "to": "schedule_callback"
          },
          {
            "label": "Just email her",
            "to": "send_email"
          }
        ]
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean, it is a cold call. Can I get thirty seconds to tell you why I reached out? And you can totally hang up on me if it's not a fit.",
        "note": "If the opener didn't land and she's bristly, own the cold call. The 'you can hang up on me' line disarms because it gives her control back. Most people say 'okay, go ahead.'",
        "branches": [
          {
            "label": "Okay, go ahead / You've got 30 seconds",
            "to": "heard_name_no"
          },
          {
            "label": "No, I'm really not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot — totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know about us and this just isn't interesting?",
        "note": "Last chance before exit. The 'so nobody bugs you again' line gives her a reason to answer honestly. If she says bad timing, get a callback. If she says not interested, exit gracefully. If she asks what you do, you're back in.",
        "branches": [
          {
            "label": "Bad timing honestly",
            "to": "bad_timing"
          },
          {
            "label": "Not interested at all",
            "to": "end_graceful"
          },
          {
            "label": "What do you guys actually do?",
            "to": "heard_name_no"
          }
        ]
      },
      "pain_trigger_bridge": {
        "label": "BRIDGE TO PAIN TRIGGER",
        "say": "Yeah so basically — I've been working with a few vacation rental companies on the East Coast, and the thing that keeps coming up is the gap between turnovers. Cleaners take photos, but nobody has time to actually review them all. And things slip through — damage, missing items, staging issues — and it doesn't surface until there's a guest complaint or a bad review. With about a hundred properties and outsourced housekeeping, I figured that might ring a bell for you guys too.",
        "note": "Same pain trigger, just reframed as a bridge from the 'heard your name' path. Pause at the end. Let her respond before you say another word.",
        "branches": [
          {
            "label": "Yeah, that's definitely a challenge",
            "to": "pain_positive"
          },
          {
            "label": "Okay, tell me more",
            "to": "pain_neutral_cta"
          },
          {
            "label": "We handle that pretty well actually",
            "to": "objection_have_process"
          },
          {
            "label": "Not really our problem",
            "to": "objection_not_interested"
          }
        ]
      },
      "pain_positive": {
        "label": "PAIN RESONATES",
        "say": "Yeah — that's exactly what we keep hearing. So we built something that plugs into the photos your cleaning team's already taking and automatically flags damage, missing items, staging issues — before the next guest walks in. No workflow change on your end. Would you be open to seeing how it works when I'm not cold calling you out of the blue?",
        "note": "She felt the pain — deliver the one-sentence solution and the soft CTA. Don't stack features. Don't oversell. If she says yes, move to booking immediately. If she asks questions, shift to discovery.",
        "branches": [
          {
            "label": "Yeah, I'd be open to that",
            "to": "book_meeting"
          },
          {
            "label": "How does it actually work?",
            "to": "warm_discovery"
          },
          {
            "label": "We're pretty small — not sure it makes sense for us",
            "to": "objection_too_small"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          }
        ]
      },
      "pain_neutral_cta": {
        "label": "NEUTRAL — SOLUTION + CTA",
        "say": "So in a nutshell — we built something that automatically reviews the turnover photos your team's already taking and flags anything that's off. Damage, missing items, a couch that got moved — before the next guest checks in. No extra work for your cleaners. Would you be open to taking a look?",
        "note": "She's listening but hasn't committed emotionally. Keep it tight. One sentence on the solution, one sentence CTA. Then be quiet and let her decide.",
        "branches": [
          {
            "label": "Sure, I'd take a look",
            "to": "book_meeting"
          },
          {
            "label": "How would that work with our setup?",
            "to": "warm_discovery"
          },
          {
            "label": "I don't think we need that",
            "to": "objection_not_interested"
          },
          {
            "label": "What does it cost?",
            "to": "handle_cost_question"
          }
        ]
      },
      "warm_discovery": {
        "label": "DISCOVERY — SHE'S ENGAGED",
        "say": "Good question — actually, before I go too deep into the weeds, what does your turnover process look like right now? Like when a guest checks out, are your cleaners taking photos every time, or is it more of a spot-check thing?",
        "note": "STOP PITCHING. She's warm — now learn. Her answers tell you how to position the demo. Listen for: photo volume, who reviews them, what falls through, pain with outsourced housekeeping. She outsources cleaning, so there's likely a trust gap.",
        "branches": [
          {
            "label": "Describes their photo/inspection process",
            "to": "discovery_photo_detail"
          },
          {
            "label": "We don't really take photos consistently",
            "to": "discovery_no_photos"
          },
          {
            "label": "We use Streamline for most of that",
            "to": "discovery_streamline"
          }
        ]
      },
      "discovery_photo_detail": {
        "label": "DISCOVERY — PHOTO PROCESS",
        "say": "Got it. And who's actually reviewing those? Is that you, or do you have someone on the team going through them?",
        "note": "You're mapping the workflow. If Jenny reviews them herself, the pain is personal — she's drowning in photos. If nobody reviews them, they're collecting data nobody uses. If it's delegated, there's a quality-control gap. All roads lead to RapidEye.",
        "branches": [
          {
            "label": "I do it myself / I try but can't keep up",
            "to": "discovery_seasonal_pain"
          },
          {
            "label": "Housekeeping handles it / We have someone",
            "to": "discovery_delegation_pain"
          },
          {
            "label": "Honestly, nobody really reviews them all",
            "to": "discovery_nobody_reviews"
          }
        ]
      },
      "discovery_no_photos": {
        "label": "DISCOVERY — NO CONSISTENT PHOTOS",
        "say": "That's actually super common. A lot of the managers I talk to are in the same spot — they know they should be documenting every turnover but it's hard to enforce, especially with outsourced crews. How do you guys catch damage right now? Is it mostly guest complaints, or does your team flag stuff during cleaning?",
        "note": "No consistent photos = an even bigger gap. RapidEye could be the reason they start a photo process. Pivot to understanding how damage surfaces today. Her outsourced housekeeping teams are the key bottleneck here.",
        "branches": [
          {
            "label": "Mostly guest complaints / reviews",
            "to": "discovery_seasonal_pain"
          },
          {
            "label": "Our housekeeping team flags it when they see it",
            "to": "discovery_delegation_pain"
          },
          {
            "label": "We rely on the annual inspections",
            "to": "discovery_annual_inspection"
          }
        ]
      },
      "discovery_streamline": {
        "label": "DISCOVERY — STREAMLINE VRS",
        "say": "Oh nice, you're on Streamline — we're actually familiar with that setup. A few of the companies we work with run Streamline too. How are you using it on the turnover side? Like are your cleaners logging anything in there after each clean, or is it mostly for reservations and the owner portal?",
        "note": "She mentioned Streamline — great sign she's tech-aware. Learn how deep their Streamline usage goes. We can position RapidEye as a layer that works alongside Streamline. Don't bash Streamline — she chose it.",
        "branches": [
          {
            "label": "Mostly reservations and the owner portal",
            "to": "discovery_seasonal_pain"
          },
          {
            "label": "We log work orders / some maintenance stuff",
            "to": "discovery_photo_detail"
          },
          {
            "label": "It does everything we need",
            "to": "objection_have_process"
          }
        ]
      },
      "discovery_seasonal_pain": {
        "label": "DISCOVERY — SEASONAL VOLUME",
        "say": "Yeah, that makes sense. And heading into the summer season — I imagine turnover volume gets pretty intense across a hundred oceanfront units. Is that when most of the stuff slips through, or is it more of a year-round thing?",
        "note": "It's January — off-season, pre-planning window. She's probably already thinking about getting ready for the summer rush. Tie RapidEye to seasonal prep: 'get this dialed in before things ramp up.' Myrtle Beach peaks May through September.",
        "branches": [
          {
            "label": "Summer is brutal / That's when things fall apart",
            "to": "seasonal_bridge_to_meeting"
          },
          {
            "label": "It's pretty consistent year-round",
            "to": "bridge_to_meeting"
          },
          {
            "label": "We manage it okay honestly",
            "to": "objection_have_process"
          }
        ]
      },
      "discovery_delegation_pain": {
        "label": "DISCOVERY — OUTSOURCED CLEANING GAP",
        "say": "That makes sense. And when something does get missed — a stain, a scuff, something that the cleaning crew didn't catch — how does that usually surface? Is it the guest calling you, or does it show up as a review?",
        "note": "She outsources housekeeping — this is her known operational model. You're building the pain case from her own words. When she describes how missed items surface, that IS the cost of the status quo. Let her talk through it.",
        "branches": [
          {
            "label": "Usually guest complaints or reviews",
            "to": "bridge_to_meeting"
          },
          {
            "label": "We catch most of it before guests arrive",
            "to": "objection_have_process"
          },
          {
            "label": "Talk to my [person] — they handle turnovers",
            "to": "referral_ask"
          }
        ]
      },
      "discovery_nobody_reviews": {
        "label": "DISCOVERY — NOBODY REVIEWS PHOTOS",
        "say": "Yeah — honestly that's the most common thing I hear. The photos exist, but who has time to go through all of them. That's literally what we built RapidEye for. It looks at every photo automatically and flags anything that's off — so you're not relying on someone manually scrolling through hundreds of images every week. Would it make sense to show you what that looks like with your actual properties?",
        "note": "This is a strong buying signal — she admitted the gap exists. Go straight to booking. Don't keep discovering when you've already found the pain.",
        "branches": [
          {
            "label": "Yeah, that'd be interesting to see",
            "to": "book_meeting"
          },
          {
            "label": "What would that involve?",
            "to": "bridge_to_meeting"
          },
          {
            "label": "I'm not sure we're ready for something like that",
            "to": "sell_test_drive"
          }
        ]
      },
      "discovery_annual_inspection": {
        "label": "DISCOVERY — ANNUAL INSPECTIONS",
        "say": "Right — I saw you guys do annual inspections and inventory. That's solid. The thing I keep hearing from other managers though is what happens between those annual checks. Like a guest damages a countertop in June and it doesn't get caught until the next inspection. By then you've lost the deposit window, and who knows how many guests have seen it and dinged you in reviews without saying anything.",
        "note": "Their annual inspection process is from the research — use it to show the gap between yearly reviews and real-time monitoring. Don't insult the process; show what it misses. This is tailored specifically to her operation.",
        "branches": [
          {
            "label": "Yeah, that's a real gap for us",
            "to": "bridge_to_meeting"
          },
          {
            "label": "We do more frequent checks than just annually",
            "to": "discovery_photo_detail"
          },
          {
            "label": "It works okay — we catch the big stuff",
            "to": "objection_have_process"
          }
        ]
      },
      "seasonal_bridge_to_meeting": {
        "label": "BRIDGE — SEASONAL URGENCY",
        "say": "That's exactly what I figured. So here's what I was thinking — right now, before things get crazy, is the perfect time to take a quick look. Even if it's just to see what other vacation rental companies along the coast are doing with their turnover photos. Worst case you steal some ideas and we part as friends. Would you be open to a quick fifteen minutes this week or next?",
        "note": "Use the January timing as leverage — she has bandwidth NOW and a reason to prepare before peak season. Specific ask: 15 minutes, this week or next. Don't leave it open-ended.",
        "branches": [
          {
            "label": "Sure, let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "I don't think we need it",
            "to": "sell_test_drive"
          }
        ]
      },
      "bridge_to_meeting": {
        "label": "BRIDGE TO MEETING",
        "say": "Yeah — so what a lot of the managers I work with are doing now is running every turnover photo through our system automatically. It catches stuff that's easy to miss when you're moving fast — a scratch on a countertop, a missing remote, furniture that got shifted. No workflow change for your cleaners. Would you be open to a quick fifteen minutes so I can show you what it looks like? I can use your actual property photos if you want.",
        "note": "Offer to use HER property photos — makes the demo feel relevant, not generic. She's been engaged through discovery, so push for a concrete time. 'Your actual property photos' is a strong hook for an owner who knows every unit personally.",
        "branches": [
          {
            "label": "Yeah, let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "What does it cost?",
            "to": "handle_cost_question"
          },
          {
            "label": "Send me an email first",
            "to": "send_email"
          },
          {
            "label": "I need to think about it",
            "to": "sell_test_drive"
          }
        ]
      },
      "handle_cost_question": {
        "label": "COST QUESTION",
        "say": "Yeah, totally fair question. It depends on the setup — number of units, turnover volume, that kind of thing. For a portfolio like yours it'd be pretty straightforward. But honestly the best way to answer that is to show you what you'd actually be getting — then the pricing makes way more sense in context. Would you be open to a quick look this week?",
        "note": "Don't quote pricing on a cold call. Deflect to the demo. If she pushes hard, move to ballpark. The goal is still the meeting, not a pricing negotiation.",
        "branches": [
          {
            "label": "Okay, let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "Just give me a ballpark",
            "to": "handle_cost_ballpark"
          },
          {
            "label": "Send me pricing in an email",
            "to": "send_email"
          }
        ]
      },
      "handle_cost_ballpark": {
        "label": "COST — BALLPARK",
        "say": "Yeah for sure — for about a hundred units, most of our clients land in the range of a few hundred bucks a month. Way less than what one damage dispute or a one-star review ends up costing. But it really depends on how you'd use it, which is why fifteen minutes is worth it — I can tailor it to your actual setup instead of throwing out a generic number. How does Thursday look?",
        "note": "Keep it vague but credible. Anchor the cost against the alternative (one bad review, one missed damage claim). Then pivot immediately back to the meeting with a specific day.",
        "branches": [
          {
            "label": "Okay, that's reasonable — let's talk",
            "to": "book_meeting"
          },
          {
            "label": "Let me think about it",
            "to": "sell_test_drive"
          },
          {
            "label": "That's probably not in our budget right now",
            "to": "objection_no_budget"
          }
        ]
      },
      "objection_not_interested": {
        "label": "NOT INTERESTED",
        "say": "Totally get it — honestly I should've assumed you'd be all set. Otherwise you probably would've reached out to us. Just so nobody from my team cold calls you again — is it that this isn't really a problem you're focused on right now, or is it more that I just caught you at a bad time?",
        "note": "Agree FIRST — surprise her by not pushing back. Then split the objection into two choices. You're giving her an easy out while also creating space for her to re-engage. The 'nobody bugs you again' line gives her a reason to answer honestly.",
        "branches": [
          {
            "label": "It's not really a problem for us",
            "to": "not_interested_reframe"
          },
          {
            "label": "It's more the timing / caught me at a bad time",
            "to": "bad_timing"
          },
          {
            "label": "Both — I'm just not interested",
            "to": "end_graceful"
          }
        ]
      },
      "not_interested_reframe": {
        "label": "REFRAME — NOT A PROBLEM",
        "say": "That makes sense. And honestly, with a hundred properties and almost forty years doing this, I'd be shocked if you didn't have a solid process. The thing that keeps surprising the managers I work with is what the AI catches that their best people miss — subtle stuff. Furniture that shifted two inches, a lampshade that's crooked, a small stain that blends into the carpet. It's not that their process is bad — it's that human eyes miss things at volume. If nothing else, would it be worth fifteen minutes just to see what it picks up?",
        "note": "Acknowledge her experience — she's been doing this since 1986. Do NOT insult her process. Position RapidEye as a layer on top of a good process, not a replacement. The '40 years' reference shows you did your homework.",
        "branches": [
          {
            "label": "Okay, maybe a quick look wouldn't hurt",
            "to": "book_meeting"
          },
          {
            "label": "I really am all set, thanks",
            "to": "end_graceful"
          },
          {
            "label": "Send me something I can look at",
            "to": "send_email"
          },
          {
            "label": "You should talk to my [person] about that",
            "to": "referral_ask"
          }
        ]
      },
      "objection_have_process": {
        "label": "ALREADY HAVE A PROCESS",
        "say": "That makes total sense — with a hundred properties you'd have to have something in place. Just so I'm not wasting your time — is it that you're fully covered and nothing's slipping through, or is it more that changing anything right now would just be a headache?",
        "note": "Agree, then split. If she says 'fully covered,' respect it but offer the test drive. If she says 'switching is a pain,' that's an opening — RapidEye doesn't replace anything, it layers on top with zero workflow change. This is your strongest rebuttal for this company.",
        "branches": [
          {
            "label": "We're pretty well covered honestly",
            "to": "have_process_covered"
          },
          {
            "label": "It's more about not wanting to change things",
            "to": "have_process_no_change"
          },
          {
            "label": "A bit of both to be honest",
            "to": "have_process_no_change"
          }
        ]
      },
      "have_process_covered": {
        "label": "SAYS FULLY COVERED",
        "say": "I respect that. Honestly, the companies that get the most out of what we do are the ones who already have a good process — because they actually care about quality. We don't replace anything. We just sit on top of whatever you're already doing and catch the stuff that even good processes miss. If nothing else, I could show you what other vacation rental managers along the Grand Strand are doing with their turnover documentation. Worst case you pick up a couple ideas. Would that be worth fifteen minutes?",
        "note": "She's proud of her process — rightfully so. Don't fight it. 'Other managers along the Grand Strand' creates curiosity and subtle competitive pressure. Dunes Realty, Thomas Beach, Elliott — she knows all of them. She doesn't want to fall behind.",
        "branches": [
          {
            "label": "Okay, I could do fifteen minutes",
            "to": "book_meeting"
          },
          {
            "label": "I'm really not interested right now",
            "to": "end_graceful"
          },
          {
            "label": "Email me some info first",
            "to": "send_email"
          }
        ]
      },
      "have_process_no_change": {
        "label": "DOESN'T WANT TO CHANGE ANYTHING",
        "say": "Yeah — that's actually the best part. We don't change anything about your workflow. Your cleaners keep doing exactly what they're already doing. We just look at the photos after the fact and flag anything that's off. It's like having an extra set of eyes that never gets tired and never misses a turn. Would you be open to seeing how it works? Fifteen minutes, super low-key.",
        "note": "This is your strongest card for the 'don't want to change' objection. RapidEye literally requires ZERO workflow change. She outsources housekeeping — her cleaners don't need to do anything different. Drive that home and go for the meeting.",
        "branches": [
          {
            "label": "Okay, that's actually interesting — let's talk",
            "to": "book_meeting"
          },
          {
            "label": "I still want to think about it",
            "to": "sell_test_drive"
          },
          {
            "label": "Just send me an email about it",
            "to": "send_email"
          }
        ]
      },
      "objection_no_budget": {
        "label": "NO BUDGET",
        "say": "Totally get it. Nowadays it's harder to keep a tool than it is to buy a new one. Just so nobody from my team bugs you — is it that budget this year is completely locked, or is it more that anything new has to really prove itself before you'd spend on it?",
        "note": "Agree, then split. If budget is locked, sell the test drive as prep for next cycle. If it needs to prove itself, the demo IS the proof. She's a small independent operator — there's no CFO or budget committee. It's her money, and she's careful with it. Respect that.",
        "branches": [
          {
            "label": "Budget is tight / locked right now",
            "to": "sell_test_drive"
          },
          {
            "label": "It'd have to prove itself / I need to see value first",
            "to": "bridge_to_meeting"
          },
          {
            "label": "I just don't want to spend money on this",
            "to": "end_graceful"
          }
        ]
      },
      "objection_too_small": {
        "label": "WE'RE TOO SMALL FOR THIS",
        "say": "Actually, the companies that get the most out of this are right in your range — fifty to a couple hundred units. Big enough that you can't eyeball every photo yourself, but small enough that every single guest review really matters. One bad review on one of your oceanfront condos probably stings a lot more than it does for a Vacasa, right? That's exactly why the smaller, quality-focused operators tend to love this the most.",
        "note": "She might compare herself to the bigger Myrtle Beach players — Vacasa has 1,000+ units there, Thomas Beach has 500+. Flip the script: smaller operators have MORE to lose per bad review and more to gain from catching issues early. Name-dropping Vacasa creates subtle competitive urgency.",
        "branches": [
          {
            "label": "That's a good point actually",
            "to": "bridge_to_meeting"
          },
          {
            "label": "I guess, but we handle it fine ourselves",
            "to": "objection_have_process"
          },
          {
            "label": "I don't know...",
            "to": "sell_test_drive"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Look — you're probably not buying anything today, and I totally respect that. But the managers who end up getting the most value are the ones who've already seen what's out there, so when the time is right they're not starting from scratch. Would you be open to just taking a look? Fifteen minutes, no pressure, no commitment. Worst case you learn what other coastal vacation rental companies are doing with their turnover photos and we part as friends.",
        "note": "This is the last real attempt before a graceful exit. Low pressure, high value framing. 'Part as friends' resonates with founders who value relationships over transactions. She's been building her reputation in Myrtle Beach for 40 years — she respects people who respect her time.",
        "branches": [
          {
            "label": "Alright, let's do fifteen minutes",
            "to": "book_meeting"
          },
          {
            "label": "Send me an email and I'll look at it",
            "to": "send_email"
          },
          {
            "label": "Maybe down the road but not now",
            "to": "end_graceful"
          },
          {
            "label": "Who else in Myrtle Beach is using this?",
            "to": "social_proof"
          }
        ]
      },
      "social_proof": {
        "label": "SOCIAL PROOF",
        "say": "We're working with a few property management companies on the East Coast right now — one of them runs about six hundred properties. Also got clients in New York doing luxury short-term rentals and a group out in Dubai. Myrtle Beach specifically, we're still pretty early — which honestly is part of why I'm calling you. I'd love to get your take on how this would work in your market. Nobody knows Myrtle Beach vacation rentals like someone who's been at it since '86.",
        "note": "Be honest about Myrtle Beach traction — don't fake it. Then flip it: she'd be an early voice in her market, and her 40 years of experience makes her the ideal person to evaluate this. Founders LOVE being asked for their expertise. It's flattering and it's genuine — you actually do want her perspective.",
        "branches": [
          {
            "label": "That's flattering / Okay, I'll take a look",
            "to": "book_meeting"
          },
          {
            "label": "I appreciate that, but still not sure",
            "to": "send_email"
          },
          {
            "label": "I'm good for now, thanks",
            "to": "end_graceful"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got my calendar pulled up — how does Thursday look for you? I can do morning or afternoon, whatever's easier on your end.",
        "note": "Lock it in NOW. Pick a specific day — don't say 'sometime next week.' If Thursday doesn't work, offer Friday. If this week is bad, pick Tuesday or Wednesday next week. Send the calendar invite WHILE still on the phone. Do not hang up without a confirmed day and time.",
        "branches": [
          {
            "label": "Gives a day and time",
            "to": "meeting_booked"
          },
          {
            "label": "Next week is better for me",
            "to": "meeting_next_week"
          },
          {
            "label": "Actually just email me and we'll figure it out",
            "to": "send_email"
          }
        ]
      },
      "meeting_next_week": {
        "label": "MEETING — NEXT WEEK",
        "say": "Next week works great. How about Tuesday or Wednesday? I can do morning or afternoon — whatever fits your schedule best.",
        "note": "Still picking specific days. Don't say 'whenever works' or it'll never happen. Two options is the sweet spot. If she's vague, pick for her: 'How about Wednesday at ten?'",
        "branches": [
          {
            "label": "Gives a day and time",
            "to": "meeting_booked"
          },
          {
            "label": "Let me check and get back to you",
            "to": "send_email"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING CONFIRMED",
        "say": "Perfect — I'll send a calendar invite right now to jenny at oceanfrontvac dot com. Really appreciate you taking my call, Jenny. Looking forward to showing you what we've been working on. Talk soon.",
        "note": "STOP SELLING. The meeting is booked — do not add features, do not recap the pitch, do not mention pricing. Confirm the email, say thanks, and hang up. Send the invite within 60 seconds of ending the call. Log everything in CRM immediately.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most useful to include? Like would you want to see how it works on a property like yours, or more the business side — what it saves in damage disputes, guest complaints, that kind of thing?",
        "note": "Don't just agree and hang up. The question does two things: tells you what she actually cares about, and keeps the conversation alive for 30 more seconds. Whatever she says, include it in the email. Always include 2 specific time suggestions in the email for a follow-up call.",
        "branches": [
          {
            "label": "Show me how it works / the product side",
            "to": "send_email_confirm"
          },
          {
            "label": "The business case / what it saves",
            "to": "send_email_confirm"
          },
          {
            "label": "Just send whatever you've got",
            "to": "send_email_confirm"
          }
        ]
      },
      "send_email_confirm": {
        "label": "EMAIL CONFIRMED",
        "say": "Got it — I'll put something tailored together and have it in your inbox by end of day. Jenny at oceanfrontvac dot com, right? I'll drop in a couple times in case you want to hop on a quick call after you've had a chance to look. Really appreciate your time, Jenny.",
        "note": "Confirm the email address out loud. Send a PERSONALIZED email within 2 hours — not a generic deck. Reference something specific from this conversation. Include 2 specific time options for a follow-up call. Set a follow-up reminder for 3 days if no response.",
        "branches": []
      },
      "referral_ask": {
        "label": "REFERRAL — FIND THE RIGHT PERSON",
        "say": "Totally makes sense. Out of curiosity — who on your team handles the day-to-day turnover coordination? Like who's the person dealing with your housekeeping crews and making sure properties are guest-ready between stays?",
        "note": "Jenny is the owner so she won't refer you UP, but she might delegate you to whoever manages the cleaning crews day-to-day. If she says 'that's me,' she's the right person — pivot back to the meeting. If she gives a name, get permission to mention her and follow up within 24 hours.",
        "branches": [
          {
            "label": "Gives a name or role",
            "to": "referral_bridge"
          },
          {
            "label": "That's me — I handle everything",
            "to": "referral_is_jenny"
          },
          {
            "label": "We're too small, it's just me",
            "to": "objection_too_small"
          }
        ]
      },
      "referral_is_jenny": {
        "label": "REFERRAL — IT'S JENNY",
        "say": "Ha — yeah, that's the founder life, right? Wearing every hat. Well look, since you're the one in the weeds on this, it'd actually be really worth showing you what we built. Even just fifteen minutes to see if it makes your life any easier heading into the busy season. You've got enough on your plate without manually reviewing photos on top of everything else.",
        "note": "She just confirmed she IS the right person. Pivot back to booking. The 'founder life — wearing every hat' line shows empathy and shared understanding. Sam is also a founder. Lean into that peer energy.",
        "branches": [
          {
            "label": "Okay fine, fifteen minutes",
            "to": "book_meeting"
          },
          {
            "label": "Send me an email about it",
            "to": "send_email"
          },
          {
            "label": "I really can't right now",
            "to": "end_graceful"
          }
        ]
      },
      "referral_bridge": {
        "label": "REFERRAL — GOT A NAME",
        "say": "Perfect — would you mind if I reached out to them and mentioned we spoke? That way it doesn't come totally out of nowhere. I'll make sure whatever I send is relevant to what they're actually dealing with day to day.",
        "note": "Get the name, get permission to use Jenny's name, and follow up within 24 hours. Open the next call with 'Jenny Highfill suggested I reach out.' That turns a cold call into a warm one instantly.",
        "branches": [
          {
            "label": "Sure, go ahead and reach out",
            "to": "referral_confirmed"
          },
          {
            "label": "Just email me and I'll forward it to them",
            "to": "send_email"
          }
        ]
      },
      "referral_confirmed": {
        "label": "REFERRAL CONFIRMED",
        "say": "Awesome — really appreciate that, Jenny. I'll reach out to them this week and keep it super relevant. Thanks for your time — enjoy the rest of your day.",
        "note": "Log the referral name and any contact info she shared. Follow up within 24 hours. Open with 'Jenny Highfill suggested I reach out to you — she thought it'd make sense for us to connect about your turnover process.' Also add Jenny to a nurture sequence — she may come back around later.",
        "branches": []
      },
      "end_graceful": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything ever changes, I'm easy to find — Sam Parks, RapidEye. Appreciate your time, Jenny. Enjoy the rest of your day.",
        "note": "Don't burn this bridge. She's been in the Myrtle Beach vacation rental community since 1986 — she knows EVERYONE in that market. A respectful exit now could mean a referral or a callback six months from now. Log the outcome and set a 90-day follow-up reminder.",
        "branches": []
      }
    }
  }
}