{
  "name": "Jenny Perry",
  "title": "Realtor / Property Manager",
  "company": "Preferred Properties Key West (RealKeyWest.com)",
  "location": "Key West, FL",
  "phone": "305-747-0369",
  "company_phone": "305-294-3040",
  "alt_phones": [],
  "flow": {
    "context": "Daniel Skahen is Broker Associate and Property Manager at Preferred Properties Key West. He started as their first property manager and personally grew the rental division from 3 homes to 150+ — he is the operational backbone of their vacation rental business. They run on Escapia for their PMS (owner portal confirmed), site built by Bluetent, and their rental policy gives guests a choice between a $100 damage waiver or a $5,000 refundable security deposit — meaning damage documentation and attribution is a daily operational concern. No Breezeway or Matterport usage detected. Strongest angle for Sam: Dan is a long-tenured operator who has lived the exact scaling pain RapidEye solves — the process that worked at 30 homes breaks down at 150. Lead with industry proximity and the Keys market.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Dan — I work with a few other vacation rental managers running portfolios similar to yours down in the Keys. It's Sam Parks with RapidEye. Have you heard my name tossed around?",
        "note": "Feet-up energy. Sound like you belong. Pause after the question and let him answer. Do not rush to fill silence.",
        "branches": [
          {
            "label": "No / Who? / Haven't heard of you",
            "to": "no_heard"
          },
          {
            "label": "Yeah / Maybe / Sounds familiar",
            "to": "yes_heard"
          },
          {
            "label": "Not a good time / I'm busy",
            "to": "bad_timing"
          },
          {
            "label": "Is this a sales call? / What's this about?",
            "to": "who_is_this"
          }
        ]
      },
      "no_heard": {
        "label": "THEY HAVEN'T HEARD OF YOU",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call — I work with another property manager in a pretty similar spot to you. They've got about 150 homes, all vacation rentals, and their team's snapping photos every single turnover. Hundreds of photos a week. The problem is nobody actually has time to review them all. A guest checks out, the cleaner takes the pics, but a scuffed wall or a busted screen door doesn't get caught until the next guest is already walking in. And at that point, good luck figuring out who caused it — especially when the last guest took the damage waiver instead of the security deposit. We built a tool that plugs right into your existing workflow and uses AI to automatically flag damage, missing items, staging issues in those turnover photos. No workflow change on your end. Would you be open to seeing what that looks like when I'm not cold-calling you out of the blue?",
        "note": "PAUSE after 'who caused it' — let that line land. The damage waiver reference mirrors their actual policy ($100 waiver vs $5K deposit). If he reacts to any part of the pain, STOP and let him talk. Do not barrel through the whole script.",
        "branches": [
          {
            "label": "Yeah / Sure / Tell me more",
            "to": "warm_response"
          },
          {
            "label": "We're not interested",
            "to": "objection_not_interested"
          },
          {
            "label": "We already have a process for that",
            "to": "objection_have_process"
          },
          {
            "label": "We don't have budget for that",
            "to": "objection_no_budget"
          }
        ]
      },
      "yes_heard": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone in your shoes. What'd you hear?",
        "note": "Genuinely curious. Let him talk. Whatever he says, bridge into discovery. Do not correct or re-pitch.",
        "branches": [
          {
            "label": "They share something positive or specific",
            "to": "yes_heard_positive"
          },
          {
            "label": "They're vague / Not much / Can't remember",
            "to": "no_heard"
          }
        ]
      },
      "yes_heard_positive": {
        "label": "THEY KNOW SOMETHING — LEAN IN",
        "say": "That's awesome. Yeah — so we've been working with a few PM companies running a hundred-plus homes, and the big thing we keep hearing is that the turnover photos are there but nobody has bandwidth to actually go through them all. Curious — what does your inspection process look like right now across your properties?",
        "note": "Transition straight to discovery. Don't re-pitch what they already know. Let him describe his world.",
        "branches": [
          {
            "label": "They describe their process",
            "to": "discovery_photos"
          },
          {
            "label": "They push back or lose interest",
            "to": "objection_not_interested"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow, maybe around this same time?",
        "note": "Don't grovel. Quick and casual. If he gives you a different time, take it. Get specific.",
        "branches": [
          {
            "label": "Sure / Give me a call back",
            "to": "bad_timing_lock"
          },
          {
            "label": "No don't call back / Not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "bad_timing_lock": {
        "label": "LOCK CALLBACK TIME",
        "say": "Perfect. I'll try you tomorrow around the same time. Appreciate it, Dan.",
        "note": "Write down the exact callback time immediately. Do not push further. End warm.",
        "branches": []
      },
      "who_is_this": {
        "label": "WHAT'S THIS ABOUT",
        "say": "Yeah totally fair — it is a cold call. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not a fit?",
        "note": "Disarming honesty. The 'hang up on me' line gives him power, which paradoxically makes him more likely to listen.",
        "branches": [
          {
            "label": "Fine / Go ahead / 30 seconds",
            "to": "pain_trigger_short"
          },
          {
            "label": "No / Not interested / Take me off your list",
            "to": "permission_rejected"
          }
        ]
      },
      "pain_trigger_short": {
        "label": "30-SECOND PAIN TRIGGER",
        "say": "So I work with a few property managers running 100-plus vacation rentals — and the thing we keep hearing is their teams take turnover photos every single day, but nobody has time to actually look through them all. Damage gets missed, stuff goes unreported, and then the next guest walks in and it's a fire drill. We built a tool that plugs into Escapia and automatically catches damage, missing items, staging issues in those photos — no workflow change. Would you be open to taking a quick look sometime this week?",
        "note": "Mention Escapia by name — they use it and it shows homework without being creepy. You promised 30 seconds so keep it tight. Pause at the end.",
        "branches": [
          {
            "label": "Yeah / That's interesting / Tell me more",
            "to": "warm_response"
          },
          {
            "label": "We're not interested",
            "to": "objection_not_interested"
          },
          {
            "label": "We already have something for that",
            "to": "objection_have_process"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot — totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and it's just not interesting?",
        "note": "This is genuine triage, not a Hail Mary. If timing, you get a callback. If disinterest, you learn why.",
        "branches": [
          {
            "label": "Bad timing actually",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / Don't call again",
            "to": "end_graceful"
          },
          {
            "label": "What do you do exactly?",
            "to": "pain_trigger_short"
          }
        ]
      },
      "warm_response": {
        "label": "THEY'RE WARM — STOP PITCHING",
        "say": "Awesome. So I can make sure I'm not wasting your time — what does your inspection process actually look like right now? Like when a guest checks out and the cleaner goes in, how are they documenting everything?",
        "note": "STOP SELLING. You are in discovery mode. Ask questions, listen, take notes. Match what he says back to RapidEye value.",
        "branches": [
          {
            "label": "They describe their photo or checklist process",
            "to": "discovery_photos"
          },
          {
            "label": "We just use Escapia / Our PMS handles it",
            "to": "discovery_escapia"
          },
          {
            "label": "Honestly we don't have a great process",
            "to": "discovery_no_process"
          }
        ]
      },
      "discovery_photos": {
        "label": "DIG INTO PHOTO WORKFLOW",
        "say": "Got it. And those photos — are you guys reviewing every set after every turnover, or is it more like they're there if you need to go back and look?",
        "note": "Most PMs admit the photos pile up unreviewed. That is the exact gap RapidEye fills. Let him tell you the pain in his own words.",
        "branches": [
          {
            "label": "We review them / We try to",
            "to": "discovery_scale_challenge"
          },
          {
            "label": "They just sit there / Only if there's a complaint",
            "to": "discovery_pain_confirm"
          },
          {
            "label": "We don't take photos consistently",
            "to": "discovery_no_photos"
          }
        ]
      },
      "discovery_escapia": {
        "label": "ESCAPIA ANGLE",
        "say": "Yeah — so we actually plug directly into Escapia. The photos your team's already uploading, we run them through AI and flag anything that looks off — damage, missing items, furniture that's been moved. Builds an inspection report automatically. What I'm curious about though — with 150-plus homes, how are you guys staying on top of damage claims? Especially with guests who take the damage waiver instead of posting the deposit?",
        "note": "Escapia integration is a real differentiator for them. The damage waiver question ties to their published policy. This is where Dan lives operationally every day.",
        "branches": [
          {
            "label": "He talks about damage challenges",
            "to": "discovery_pain_confirm"
          },
          {
            "label": "We handle it fine / Not a big issue",
            "to": "objection_have_process"
          },
          {
            "label": "That's interesting — tell me more",
            "to": "book_meeting"
          }
        ]
      },
      "discovery_no_process": {
        "label": "NO FORMAL PROCESS — VALIDATE",
        "say": "Yeah honestly that's super common. Most of the PM companies I talk to in the hundred-plus range — they started with a process that worked at 20 or 30 homes and then things just got too fast. What's the thing that burns you the most when something slips through?",
        "note": "He grew from 3 to 150+ homes. He has literally lived this scaling pain. Mirror it back and let him vent.",
        "branches": [
          {
            "label": "He shares a specific pain point",
            "to": "discovery_pain_confirm"
          },
          {
            "label": "It's not that bad / We manage",
            "to": "book_meeting"
          }
        ]
      },
      "discovery_scale_challenge": {
        "label": "SCALE CHALLENGE",
        "say": "That's impressive honestly. At 150-plus homes that's a lot of eyes on a lot of photos. How big is the team actually doing those reviews?",
        "note": "You're looking for the math gap — too many homes, not enough reviewers. It never works at scale. Let him do the math out loud.",
        "branches": [
          {
            "label": "Small team / Just a few of us / It's a lot",
            "to": "discovery_pain_confirm"
          },
          {
            "label": "We've got it covered",
            "to": "book_meeting"
          }
        ]
      },
      "discovery_pain_confirm": {
        "label": "PAIN CONFIRMED — BRIDGE TO MEETING",
        "say": "Yeah — that's exactly what we keep hearing. And that's really what we built RapidEye around. It just runs in the background on the photos your team's already taking and catches the stuff that's easy to miss when you're moving fast between turnovers. I don't want to take up your whole afternoon on a cold call though — would you be open to a quick 15 minutes this week so I can show you what it actually looks like on real properties?",
        "note": "Pain is confirmed. Bridge to the meeting NOW. Do not keep digging. Sell the meeting, not the product.",
        "branches": [
          {
            "label": "Yeah / Sure / When works?",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "I'd need to loop in Laurie / My broker",
            "to": "referral_loop_in"
          },
          {
            "label": "Not right now / Maybe later",
            "to": "sell_test_drive"
          }
        ]
      },
      "discovery_no_photos": {
        "label": "NO CONSISTENT PHOTOS",
        "say": "Interesting — so when damage does come up, what are you guys using as documentation? Is it more reactive — like somebody notices it and then you go take a photo?",
        "note": "If they don't take photos consistently, RapidEye's video walkthrough workflow might be the better angle. Keep discovering before pivoting.",
        "branches": [
          {
            "label": "Yeah mostly reactive",
            "to": "discovery_pain_confirm"
          },
          {
            "label": "We use checklists / Breezeway / Something else",
            "to": "objection_have_process"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Perfect. I've got Thursday and Friday this week pulled up — what works better for you? I'm thinking 15 minutes, super quick.",
        "note": "Give two specific day options, not open-ended. Lock the time NOW. Send the calendar invite while still on the phone if possible.",
        "branches": [
          {
            "label": "They pick a time",
            "to": "book_confirm"
          },
          {
            "label": "Send me an email first",
            "to": "send_email"
          },
          {
            "label": "Next week is better",
            "to": "book_next_week"
          }
        ]
      },
      "book_next_week": {
        "label": "PUSH TO NEXT WEEK",
        "say": "Totally — how about Tuesday or Wednesday next week? I can do morning or afternoon, whatever's easier.",
        "note": "Stay flexible but get a SPECIFIC day and time. Do not leave it as 'sometime next week.'",
        "branches": [
          {
            "label": "They pick a time",
            "to": "book_confirm"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          }
        ]
      },
      "book_confirm": {
        "label": "CONFIRM AND CLOSE",
        "say": "Awesome — I'll shoot you a calendar invite right now. What's the best email for that? And really appreciate you taking my call, Dan. Talk soon.",
        "note": "Get the email. Send the invite IMMEDIATELY after hanging up. Stop selling. End warm. Do not add anything else.",
        "branches": []
      },
      "objection_not_interested": {
        "label": "NOT INTERESTED",
        "say": "Totally get it. I should've assumed you'd be all set — otherwise you probably would've reached out to us. Just so no one from my team cold calls you again — is it that this isn't really a problem you're focused on right now, or is it more that you just hate cold calls? Because honestly I get it either way.",
        "note": "Agree first. Never fight. The split question reopens the conversation. Most people pick 'hate cold calls' which gives you an opening.",
        "branches": [
          {
            "label": "Not focused on this / Other priorities",
            "to": "sell_test_drive"
          },
          {
            "label": "I just hate cold calls",
            "to": "sell_test_drive"
          },
          {
            "label": "Both / Truly not interested",
            "to": "end_graceful"
          }
        ]
      },
      "objection_have_process": {
        "label": "ALREADY HAVE A PROCESS",
        "say": "That makes total sense — with 150-plus homes you'd have to have something in place or you'd lose your mind. Just out of curiosity — is it that you're fully covered and happy with how it's working, or is it more that switching anything right now would just be a headache?",
        "note": "Validate first. The split exposes whether this is genuine satisfaction or just inertia. Inertia you can absolutely work with.",
        "branches": [
          {
            "label": "Happy with what we have",
            "to": "happy_with_process"
          },
          {
            "label": "Switching would be a pain / Too much going on",
            "to": "sell_test_drive"
          },
          {
            "label": "What would be different about yours?",
            "to": "differentiation"
          }
        ]
      },
      "happy_with_process": {
        "label": "HAPPY WITH CURRENT PROCESS",
        "say": "Respect that. Out of curiosity — are you guys using a specific platform for the inspection side, or is it more of a manual process your team's built out over the years?",
        "note": "Fish for what tool or method they use. If manual or spreadsheet-based, there's an opening. If they name a tool, acknowledge it and pivot to complementary positioning.",
        "branches": [
          {
            "label": "They name a tool (Breezeway, etc.)",
            "to": "known_tool"
          },
          {
            "label": "It's manual / In-house / Checklists",
            "to": "manual_process_opening"
          },
          {
            "label": "I don't want to get into it / We're good",
            "to": "end_graceful"
          }
        ]
      },
      "known_tool": {
        "label": "THEY NAME A TOOL",
        "say": "Oh nice — yeah I know those guys. Totally different thing from what we do actually. We're not replacing your inspection workflow — we sit on top of it. Whatever photos are already being taken through that system, we analyze them automatically and flag stuff the human eye misses at speed. A lot of our customers actually use us alongside their existing tools. Would you be open to a quick look just to see the difference?",
        "note": "Position RapidEye as complementary, not competitive. This drops the switching-cost objection to zero.",
        "branches": [
          {
            "label": "Yeah / Maybe",
            "to": "book_meeting"
          },
          {
            "label": "Nah we're good",
            "to": "end_graceful"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          }
        ]
      },
      "manual_process_opening": {
        "label": "MANUAL PROCESS — OPENING",
        "say": "Yeah — that's actually where most of the companies I work with started. And honestly it works great until you hit a certain number of homes. The thing I keep hearing from guys who grew their portfolios the way you did — from just a handful of homes up to 150-plus — is that the process that worked at 30 just doesn't hold at 150. Would you be open to seeing how some of the other PM companies at your scale are handling it? Worst case you steal some ideas and we part as friends.",
        "note": "The 'handful of homes up to 150-plus' mirrors his exact growth story (3 to 150+). The 'steal some ideas' close is low pressure and high value.",
        "branches": [
          {
            "label": "Yeah sure",
            "to": "book_meeting"
          },
          {
            "label": "Not right now",
            "to": "sell_test_drive"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          }
        ]
      },
      "objection_no_budget": {
        "label": "NO BUDGET",
        "say": "Totally get it. Nowadays it's harder to keep a tool, let alone buy something new. Just so I'm not wasting anyone's time — is it that budget for this year is completely locked up, or is it more that anything new you try to bring in has to go through a whole approval process?",
        "note": "Agree and split. If budget is locked, pivot to test drive for future planning. If approval process, that's a path to Laurie McChesney the founder.",
        "branches": [
          {
            "label": "Budget is locked / Not spending right now",
            "to": "sell_test_drive"
          },
          {
            "label": "Anything new has to go through approval / Laurie / Ownership",
            "to": "referral_loop_in"
          },
          {
            "label": "It's both honestly",
            "to": "sell_test_drive"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally fair — and you're probably not buying anything off a cold call anyway. I wouldn't either. But here's what I've seen — when budget does open up or priorities shift, the people who already know what's out there are the ones who move fast. Would you be open to a quick 15 minutes just so it's on your radar? If nothing else I can walk you through what some of the other PM companies in the Keys are doing with their turnover photos. Worst case you steal some ideas and we part as friends.",
        "note": "Low pressure. The 'other PM companies in the Keys' angle is competitive intel — that's the value offer. Key West is a small market; operators are curious what others are doing.",
        "branches": [
          {
            "label": "Yeah / Fine / Sure why not",
            "to": "book_meeting"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          },
          {
            "label": "No thanks / Not right now",
            "to": "end_graceful"
          }
        ]
      },
      "differentiation": {
        "label": "WHAT'S DIFFERENT",
        "say": "Good question. So most inspection tools are workflow tools — they tell your cleaner what to do and where to take a photo. We're different. We look at the photos after they're taken and use AI to actually analyze what's in them. So we're catching a cracked tile, a missing throw pillow, a stain on the couch — stuff a checklist can't flag. And we plug into Escapia so there's nothing new your team has to learn. The whole point is zero workflow change on your side.",
        "note": "Keep it tight. Escapia integration is the hook for this company. Zero workflow change is the closer. Then bridge to the meeting.",
        "branches": [
          {
            "label": "That's interesting / Makes sense",
            "to": "book_meeting"
          },
          {
            "label": "That's overkill for us / We don't need that",
            "to": "sell_test_drive"
          },
          {
            "label": "How much does it cost?",
            "to": "redirect_to_meeting"
          }
        ]
      },
      "redirect_to_meeting": {
        "label": "PRICE QUESTION — REDIRECT",
        "say": "Honestly it depends on the portfolio size and what you're already running, so I don't want to throw out a number that doesn't mean anything. That's actually part of why a quick call makes sense — I can look at your setup and give you a real answer. Would Thursday or Friday work this week?",
        "note": "Never quote price on a cold call. Redirect to meeting. Always offer two specific days.",
        "branches": [
          {
            "label": "They pick a time",
            "to": "book_confirm"
          },
          {
            "label": "Send me an email with pricing",
            "to": "send_email"
          },
          {
            "label": "Not this week",
            "to": "book_next_week"
          }
        ]
      },
      "referral_loop_in": {
        "label": "NEED TO LOOP SOMEONE IN",
        "say": "Yeah that makes total sense. Would it make sense to get Laurie on the call too? That way you're not playing telephone. I could set something up with both of you — 15 minutes, super quick.",
        "note": "Laurie McChesney is the founder and principal broker. Using her first name shows you know the org. If he names someone else instead, roll with it naturally.",
        "branches": [
          {
            "label": "Yeah that could work / Let me check with her",
            "to": "referral_book"
          },
          {
            "label": "I'll talk to her first and get back to you",
            "to": "send_email"
          },
          {
            "label": "She's not the right person / Names someone else",
            "to": "referral_other"
          }
        ]
      },
      "referral_book": {
        "label": "BOOK WITH BOTH",
        "say": "Perfect. What day works best for both of you? I'm flexible — could do any day next week. And I'll keep it tight, 15 minutes tops.",
        "note": "Let him pick the day since he needs to coordinate. Ask for Laurie's email too so you can cc her on the invite.",
        "branches": [
          {
            "label": "They suggest a day",
            "to": "book_confirm"
          },
          {
            "label": "Let me get back to you on that",
            "to": "send_email"
          }
        ]
      },
      "referral_other": {
        "label": "DIFFERENT REFERRAL",
        "say": "Got it — who would be the best person to loop in? If I can get a name I'll put something tailored together so it actually lands with them.",
        "note": "Get name AND title. Then ask for email or direct number. Other possible contacts at this company: Jose Wenzel, Jenny Perry, Angela McChesney — all property managers.",
        "branches": [
          {
            "label": "They give a name",
            "to": "referral_confirm"
          },
          {
            "label": "I'm not sure / I'll figure it out",
            "to": "send_email"
          }
        ]
      },
      "referral_confirm": {
        "label": "CONFIRM REFERRAL",
        "say": "Awesome — do you have their email or direct line? I want to make sure I reach out the right way and mention that you and I connected.",
        "note": "Always say you'll name-drop Dan. Makes the referral warmer and makes him feel like a connector, not a gatekeeper.",
        "branches": [
          {
            "label": "They give contact info",
            "to": "book_confirm"
          },
          {
            "label": "Just call the main office",
            "to": "end_graceful"
          }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most helpful to include so it's not just another generic pitch sitting in your inbox? Like are you more curious about the damage detection side, or is it more the cleaner accountability piece?",
        "note": "Get him to tell you what he cares about. Then send a tailored email within 10 minutes of hanging up. Always include a specific meeting time suggestion in the email.",
        "branches": [
          {
            "label": "They tell you what to focus on",
            "to": "send_email_close"
          },
          {
            "label": "Just send me an overview / Whatever",
            "to": "send_email_close"
          }
        ]
      },
      "send_email_close": {
        "label": "CLOSE EMAIL REQUEST",
        "say": "Got it — I'll send that over today. What's the best email for you? And I'll throw a couple of times on there in case you want to hop on a quick call after you've had a chance to look through it. Appreciate your time, Dan.",
        "note": "Confirm the email address. Send within 10 minutes. Include two specific time suggestions. Set a follow-up reminder for 2 business days if no reply.",
        "branches": []
      },
      "end_graceful": {
        "label": "END GRACEFULLY",
        "say": "Totally understand. If anything changes I'm easy to find — just look up RapidEye. Appreciate your time, Dan.",
        "note": "Do not burn this bridge. He manages 150+ homes in a small Key West market and knows every other operator. Log the call, note what happened, and set a 30-day follow-up reminder.",
        "branches": []
      }
    }
  }
}