{
  "name": "Jodi Church",
  "title": "Director of Sales",
  "company": "Montaneros in Vail",
  "location": "Vail, CO",
  "phone": "+1-970-618-8073",
  "company_phone": "+1-970-476-2491",
  "alt_phones": [],
  "flow": {
    "context": "Jodi Church is Director of Sales at Montaneros in Vail, a boutique condo property managing 35+ condominiums in Lionshead Village under CoralTree Residence Collection. She also covers The Landmark, another Vail-area CoralTree property, making her a multi-property sales lead. She is NOT the ops or QC person — no GM, ops director, or housekeeping manager name is publicly listed for Montaneros, making Jodi the best internal router to the real buyer. Montaneros participates in the Vail Valley Lodging Quality Assurance program, signaling they care about standards. Sam skied Jackson Hole in January 2026 — the mountain/ski market connection is the natural opener.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Jodi — I actually just got back from a ski trip out to Jackson Hole a few weeks ago, and I've been working with a few property managers in mountain resort markets. It's Sam Parks with RapidEye. Have you heard my name tossed around?",
        "note": "Feet up on the desk energy. You're a skier calling someone who lives in Vail — that's a shared world. Don't rush. Pause after the question and let her respond.",
        "branches": [
          {
            "label": "Yes / Maybe / Sounds familiar",
            "to": "heard_name_yes"
          },
          {
            "label": "No, I haven't",
            "to": "heard_name_no"
          },
          {
            "label": "Bad timing / I'm busy",
            "to": "bad_timing"
          },
          {
            "label": "Who is this? / What's this about?",
            "to": "whos_this"
          }
        ]
      },
      "heard_name_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone like you or someone on your ops team over there. What'd you hear?",
        "note": "Rare on a cold call but ride it. Let her talk. Whatever she says, bridge to warm_response or pain_trigger.",
        "branches": [
          {
            "label": "She shares what she heard",
            "to": "warm_response"
          },
          {
            "label": "She's vague or deflects",
            "to": "pain_trigger"
          }
        ]
      },
      "heard_name_no": {
        "label": "HAVEN'T HEARD — TRANSITION",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call is —",
        "note": "Self-deprecating, quick, then move directly into the pain trigger. No pause here — flow straight through.",
        "branches": [
          {
            "label": "Continue to pain trigger",
            "to": "pain_trigger"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow or later this week?",
        "note": "Respect it immediately. Get a callback window. Don't pitch anything.",
        "branches": [
          {
            "label": "She gives a better time",
            "to": "reschedule_confirmed"
          },
          {
            "label": "Just email me",
            "to": "send_email"
          },
          {
            "label": "Not interested at all",
            "to": "not_interested"
          }
        ]
      },
      "whos_this": {
        "label": "GUARD UP — PERMISSION ASK",
        "say": "Yeah totally — I mean it is a cold call, I'll be honest. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not relevant?",
        "note": "Disarm with honesty. The 30 seconds and hang up on me line lowers the stakes. Smile through it.",
        "branches": [
          {
            "label": "Sure, go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "No / Not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED — LAST CHANCE",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it more that you already know what we do and it's just not a fit?",
        "note": "This isn't begging — it's splitting the objection. You're doing HER a favor by making sure no one calls again. Zero pressure tone.",
        "branches": [
          {
            "label": "It's just bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / don't call again",
            "to": "graceful_exit"
          },
          {
            "label": "Wait — what do you do?",
            "to": "pain_trigger"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER — SALES LENS",
        "say": "So I work with a few other property managers in mountain resort markets — boutique operations, similar size to Montaneros. And one thing I keep hearing from the sales side is that when something slips through on a turnover — a stain on a couch, a missing set of towels, something broken nobody caught — it doesn't show up as an ops problem. It shows up as a one-star review or a guest calling mid-stay, and that's a way harder problem to fix after the fact. Especially when you're selling a luxury experience in Vail and you've got the Lodging Quality Assurance standards to uphold. We built a tool that catches that stuff automatically from the photos your team's already taking during turnovers — before the guest ever walks in. Would you be open to taking a look at some point when I'm not cold calling you out of the blue?",
        "note": "PAUSE after 'before the guest ever walks in.' Let her react. The QA program reference shows you did your homework. You're framing this as HER problem — reviews and guest experience — not just an ops thing.",
        "branches": [
          {
            "label": "That's interesting / Tell me more",
            "to": "warm_response"
          },
          {
            "label": "That's not really my area",
            "to": "not_my_area"
          },
          {
            "label": "We're pretty set on that",
            "to": "have_process"
          },
          {
            "label": "Not interested",
            "to": "not_interested"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          }
        ]
      },
      "warm_response": {
        "label": "THEY'RE WARM — STOP PITCHING",
        "say": "Yeah — honestly I'd love to learn a bit more about how things work over at Montaneros before I go any further. On the sales side, how do you guys typically hear about quality issues — is it mostly from guest feedback after the fact, or does your ops team flag stuff before check-in?",
        "note": "She's interested. STOP selling. Ask questions. You're learning about their process AND figuring out who the ops decision-maker is. Listen more than you talk.",
        "branches": [
          {
            "label": "She describes their process",
            "to": "discovery_process"
          },
          {
            "label": "She mentions an ops person or GM",
            "to": "discovery_ops_name"
          },
          {
            "label": "She's not sure about the ops side",
            "to": "referral_pivot"
          }
        ]
      },
      "discovery_process": {
        "label": "DISCOVERY — DIG INTO PROCESS",
        "say": "That makes sense. And with 35-plus units turning over — especially in peak ski season — who on your team is actually reviewing the inspection photos or doing the walkthrough after a clean? Is that a dedicated person or does it kind of fall on whoever's available?",
        "note": "You're hunting for the name of the ops/QC person AND surfacing pain. If she names someone, that's your next call. If she says 'whoever's available,' that IS the pain.",
        "branches": [
          {
            "label": "She names a specific person or role",
            "to": "discovery_ops_name"
          },
          {
            "label": "It's ad hoc / whoever's available",
            "to": "quality_hook"
          },
          {
            "label": "She doesn't know the details",
            "to": "referral_pivot"
          }
        ]
      },
      "discovery_ops_name": {
        "label": "SHE NAMES AN OPS PERSON",
        "say": "Oh that's super helpful. Yeah, they'd probably be the best person to walk through this with — they'd see the value way faster than me trying to explain it over the phone. Would you be open to connecting me, or would it be easier if I just reached out to them directly?",
        "note": "You got a name. Now get the warm intro or at least permission to name-drop Jodi. Either path works. Be grateful, not pushy.",
        "branches": [
          {
            "label": "She'll connect you / make an intro",
            "to": "referral_got_name"
          },
          {
            "label": "Just reach out to them directly",
            "to": "referral_direct_outreach"
          },
          {
            "label": "She wants to learn more herself first",
            "to": "quality_hook"
          }
        ]
      },
      "not_my_area": {
        "label": "NOT HER AREA — PIVOT TO REFERRAL",
        "say": "Totally makes sense — yeah, this would probably sit more with whoever's running ops or overseeing housekeeping quality on-property. I know you cover Montaneros and The Landmark — is there a GM or an operations lead at Montaneros who'd be the right person to talk to about this kind of thing?",
        "note": "She's telling you she's not the buyer. That's fine — she's the router. Mentioning The Landmark shows you know her scope and builds credibility.",
        "branches": [
          {
            "label": "She gives a name",
            "to": "referral_got_name"
          },
          {
            "label": "She's not sure / doesn't want to share",
            "to": "referral_ask_softer"
          },
          {
            "label": "Try the front desk",
            "to": "front_desk_fallback"
          }
        ]
      },
      "referral_pivot": {
        "label": "REFERRAL PIVOT",
        "say": "Yeah, that's totally fair — this is really more of an operations and housekeeping thing. Who on the Montaneros side would own something like unit inspections or quality checks between stays? Is there a GM or a director of ops on-property?",
        "note": "Ask for a role first, then a name. Don't ask 'who's your boss' — ask about the function. She's at CoralTree covering multiple properties so she likely knows the org chart.",
        "branches": [
          {
            "label": "She gives a name or title",
            "to": "referral_got_name"
          },
          {
            "label": "She's not sure",
            "to": "referral_ask_softer"
          },
          {
            "label": "She says to try the front desk",
            "to": "front_desk_fallback"
          }
        ]
      },
      "referral_ask_softer": {
        "label": "SOFTER REFERRAL ASK",
        "say": "No worries at all. If I can get a name, I'll put something tailored together so it actually lands and doesn't just sound like a generic cold pitch. Even a first name or a title would be super helpful — I can figure out the rest.",
        "note": "Lower the ask. A first name or title is enough. You can call the front desk to verify. Don't push hard — she's doing you a favor.",
        "branches": [
          {
            "label": "She gives something — name, title, hint",
            "to": "referral_got_name"
          },
          {
            "label": "She really doesn't know",
            "to": "front_desk_fallback"
          },
          {
            "label": "She offers to find out and get back",
            "to": "referral_followup"
          }
        ]
      },
      "referral_got_name": {
        "label": "GOT A NAME — LOCK IT IN",
        "say": "That's awesome, really appreciate that. And just so I'm not going in totally cold with them — would you mind if I mentioned you pointed me their way? That way it doesn't feel like a random sales call.",
        "note": "Get permission to name-drop. This turns your next call from cold to warm. If she says yes, you've just built a referral chain. Send Jodi a thank-you email within 5 minutes.",
        "branches": [
          {
            "label": "Sure, mention my name",
            "to": "book_followup_with_referral"
          },
          {
            "label": "I'd rather you didn't",
            "to": "book_followup_without_referral"
          },
          {
            "label": "Let me check with them first",
            "to": "referral_followup"
          }
        ]
      },
      "referral_direct_outreach": {
        "label": "DIRECT OUTREACH PERMISSION",
        "say": "Perfect — do you have their direct number or email by chance? And would it be cool if I mentioned that you and I chatted?",
        "note": "Get contact info AND permission to name-drop in one ask. If she gives you a number, you've just unlocked the real target.",
        "branches": [
          {
            "label": "She gives contact info",
            "to": "book_followup_with_referral"
          },
          {
            "label": "She doesn't have it handy",
            "to": "front_desk_fallback"
          }
        ]
      },
      "referral_followup": {
        "label": "SHE'LL GET BACK TO YOU",
        "say": "That'd be amazing. I'll shoot you a quick email right after this so you've got my info — that way you can just forward it along whenever's easy. What's the best email for you — is it the CoralTree one?",
        "note": "Confirm her email. You already know it's likely jodi.church@coraltreeresidences.com but let her confirm. Send a clean short follow-up within 5 minutes of hanging up.",
        "branches": [
          {
            "label": "She confirms email",
            "to": "graceful_exit_warm"
          },
          {
            "label": "She gives a different email",
            "to": "graceful_exit_warm"
          }
        ]
      },
      "front_desk_fallback": {
        "label": "FRONT DESK ROUTE",
        "say": "Totally get it. I'll try the front desk and see if they can point me in the right direction. Hey Jodi — I really appreciate you taking a couple minutes. If anything ever comes up on the sales side where you think this could help with guest experience or reviews, I'm easy to find. Thanks again.",
        "note": "Don't burn the bridge. She's been helpful even if she doesn't have the name. Your next step is calling the front desk at 970-476-2491 during business hours.",
        "branches": [
          {
            "label": "Call ends",
            "to": "graceful_exit"
          }
        ]
      },
      "have_process": {
        "label": "OBJECTION — HAVE A PROCESS",
        "say": "That makes total sense — with 35-plus condos and the quality standards you guys hold, you'd have to have something in place. Totally get it.",
        "note": "Agree first. Don't argue. Pause briefly. Then move to split the objection.",
        "branches": [
          {
            "label": "Continue to split",
            "to": "split_have_process"
          }
        ]
      },
      "split_have_process": {
        "label": "SPLIT — HAVE A PROCESS",
        "say": "Just so no one from my team cold calls you again — is it more that your team's really happy with how inspections are working right now, or is it that switching or adding anything new would just be a headache with CoralTree's setup?",
        "note": "The CoralTree reference is strategic — it acknowledges corporate complexity and gives her an easy out that still tells you something useful. Listen to which option she picks.",
        "branches": [
          {
            "label": "We're happy with what we have",
            "to": "test_drive"
          },
          {
            "label": "It's more of a corporate / process thing",
            "to": "corporate_complexity"
          },
          {
            "label": "She opens up about problems",
            "to": "warm_response"
          }
        ]
      },
      "corporate_complexity": {
        "label": "CORPORATE COMPLEXITY — CORALTREE",
        "say": "Yeah, I figured — when you're under a bigger hospitality group, anything new has to go through a whole chain. Is that something that'd be decided at the CoralTree level, or does each property have some autonomy on the ops tooling side?",
        "note": "You're learning the decision-making structure. This info is gold for your next approach — whether to go corporate or property-level.",
        "branches": [
          {
            "label": "Each property decides",
            "to": "referral_pivot"
          },
          {
            "label": "CoralTree decides",
            "to": "corporate_route"
          },
          {
            "label": "She's not sure",
            "to": "referral_pivot"
          }
        ]
      },
      "corporate_route": {
        "label": "CORALTREE CORPORATE PATH",
        "say": "Got it — that's really helpful to know. Is there someone on the CoralTree corporate side who handles operations technology or vendor decisions across properties? Even a department name would help me figure out the right door to knock on.",
        "note": "You're pivoting from property-level to corporate. CoralTree corporate is at 303-799-3830. Get a name if possible, then decide whether to approach top-down.",
        "branches": [
          {
            "label": "She gives a corporate contact",
            "to": "referral_got_name"
          },
          {
            "label": "She doesn't know",
            "to": "graceful_exit_warm"
          },
          {
            "label": "She suggests trying the property GM instead",
            "to": "referral_pivot"
          }
        ]
      },
      "not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "I totally get it. I should've assumed you'd be all set — otherwise you probably would've reached out to us.",
        "note": "Agree fully. Surprise her by not pushing back. Pause a beat. Then split.",
        "branches": [
          {
            "label": "Continue to split",
            "to": "split_not_interested"
          }
        ]
      },
      "split_not_interested": {
        "label": "SPLIT — NOT INTERESTED",
        "say": "Just so nobody from my team bugs you again — is it that this isn't really a problem you're focused on from the sales side, or is it more that you just hate cold calls? Honestly either one's fair.",
        "note": "The 'from the sales side' qualifier is key — it opens the door for her to say 'this is more of an ops thing' which is your referral opening.",
        "branches": [
          {
            "label": "Not my area / more of an ops thing",
            "to": "not_my_area"
          },
          {
            "label": "Just not interested / hate cold calls",
            "to": "test_drive"
          },
          {
            "label": "She softens or asks a question",
            "to": "warm_response"
          }
        ]
      },
      "no_budget": {
        "label": "OBJECTION — NO BUDGET",
        "say": "Totally get it. Nowadays it's harder to keep a tool, let alone buy something new — especially heading into what I'm sure is a crazy busy ski season.",
        "note": "Agree, validate, reference their seasonal reality. Then split.",
        "branches": [
          {
            "label": "Continue to split",
            "to": "split_no_budget"
          }
        ]
      },
      "split_no_budget": {
        "label": "SPLIT — NO BUDGET",
        "say": "Is it that budget this cycle is completely locked down, or is it more that anything new has to go through CoralTree and that process is just a bear?",
        "note": "You're learning whether this is a timing issue or a structural issue. Both answers help you plan your next move.",
        "branches": [
          {
            "label": "Budget is locked",
            "to": "test_drive"
          },
          {
            "label": "It's a CoralTree approval thing",
            "to": "corporate_complexity"
          },
          {
            "label": "She opens up",
            "to": "warm_response"
          }
        ]
      },
      "test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Look, you're probably not buying anything right now, and I totally respect that. But if nothing else, I could walk you through what a couple other mountain resort property managers are doing with their turnover photos — how they're catching stuff before guests walk in. Worst case you steal some ideas and we part as friends. Would you be open to that?",
        "note": "You're selling the meeting, not the product. The value is the insight, not the demo. If she's not the buyer, this can also become a meeting with her AND the ops person.",
        "branches": [
          {
            "label": "Sure, let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "That's more of an ops conversation",
            "to": "not_my_area"
          },
          {
            "label": "Just send me something",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "graceful_exit"
          }
        ]
      },
      "quality_hook": {
        "label": "QUALITY ASSURANCE HOOK",
        "say": "Yeah — and that's actually exactly the kind of situation where this helps most. I noticed you guys are rated through the Vail Valley Lodging Quality Assurance program, so clearly standards matter. The challenge is when you've got 35-plus units turning and the inspection is basically one person trying to catch everything by eye. We just automate that second set of eyes. Would it make sense for me to show this to whoever runs that QC process?",
        "note": "The QA program reference is a credibility builder — it shows you know their world. You're also naturally bridging to the referral by asking 'whoever runs that QC process.'",
        "branches": [
          {
            "label": "Yeah, let me connect you to them",
            "to": "discovery_ops_name"
          },
          {
            "label": "I'd want to see it myself first",
            "to": "book_meeting"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next week pulled up — would Tuesday or Thursday work better for a quick 20 minutes? I can do morning or afternoon, whatever's easier with the ski season schedule.",
        "note": "Give two options, not an open-ended question. Lock in day first, then time. Send the calendar invite WHILE on the phone.",
        "branches": [
          {
            "label": "She picks a time",
            "to": "meeting_booked"
          },
          {
            "label": "Let me check my calendar and get back",
            "to": "send_email"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING BOOKED — WRAP UP",
        "say": "Perfect, I'll send that invite right over. And hey — if there's anyone on the ops side who should be on the call too, feel free to loop them in. Really appreciate you taking my call, Jodi. Talk soon.",
        "note": "Stop selling immediately. Confirm the invite. The 'loop in ops' suggestion is intentional — you want the decision-maker on the call. Send the invite within 60 seconds.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most relevant to include so it's not just another generic pitch sitting in your inbox? Is it more about the guest experience side or the operational efficiency side?",
        "note": "Her answer tells you how to frame the email AND who to target. If she says ops, that's your cue to ask for the ops person's email too.",
        "branches": [
          {
            "label": "She gives direction on what to include",
            "to": "email_confirm"
          },
          {
            "label": "Just send whatever",
            "to": "email_confirm"
          }
        ]
      },
      "email_confirm": {
        "label": "CONFIRM EMAIL AND CLOSE",
        "say": "Got it — I'll keep it short and relevant. Is the best email for you the CoralTree one, or is there a different one you check more? I'll drop in a couple times to chat in case anything catches your eye.",
        "note": "You know her email is likely jodi.church@coraltreeresidences.com. Let her confirm. Include a specific time suggestion in the email. Follow up within the hour.",
        "branches": [
          {
            "label": "She confirms email",
            "to": "graceful_exit_warm"
          }
        ]
      },
      "book_followup_with_referral": {
        "label": "GOT REFERRAL — NAME DROP OK",
        "say": "That's huge — I really appreciate it. I'll reach out to them this week and mention you pointed me their way. And hey, if anything ever comes up on the sales side — guest experience stuff, review issues — I'm always around. Thanks again, Jodi.",
        "note": "You won. You have a name and permission to name-drop. Send Jodi a thank-you email within 5 minutes. Call the referral within 24 hours while it's warm.",
        "branches": []
      },
      "book_followup_without_referral": {
        "label": "GOT REFERRAL — NO NAME DROP",
        "say": "Totally understand. I'll reach out to them separately — won't mention our conversation. Really appreciate the help though, Jodi. If you ever want to chat about what we're seeing in the mountain resort space, I'm easy to find.",
        "note": "Respect the boundary. You still have the name — call them as a fresh cold call. Don't burn Jodi's trust by name-dropping against her wishes.",
        "branches": []
      },
      "graceful_exit_warm": {
        "label": "WARM GOODBYE",
        "say": "Awesome. Really appreciate your time, Jodi. Enjoy the rest of ski season — I'm jealous you get to be up there every day. Talk soon.",
        "note": "End on the ski connection you opened with. Warm, human, memorable. Follow through on anything you promised within the hour.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes, I'm easy to find. Appreciate your time, Jodi.",
        "note": "Don't burn the bridge. Short, clean, respectful. Your next move is calling the front desk at 970-476-2491 to get the ops person's name independently.",
        "branches": []
      },
      "reschedule_confirmed": {
        "label": "RESCHEDULE LOCKED",
        "say": "Perfect, I'll try you then. Appreciate it, Jodi — talk soon.",
        "note": "Mark the callback time in your CRM immediately. When you call back, open with 'Hey Jodi, it's Sam — you told me to try you back today.' That turns the next call warm.",
        "branches": []
      }
    }
  }
}