{
  "name": "Jody Corey",
  "title": "Founder / President",
  "company": "Simply Steamboat (Resort Group)",
  "location": "Steamboat Springs, CO",
  "phone": "+1-970-846-9449",
  "company_phone": "(970) 870-3397",
  "alt_phones": [
    "+1-888-870-3397",
    "+1-970-879-8700"
  ],
  "flow": {
    "context": "Calling Jody Corey — she founded Simply Steamboat in 2008 as a boutique luxury vacation rental manager in Steamboat Springs, then sold to Resort Group in 2016-17 but stayed on as president. Resort Group is the big local operator: 600+ nightly rentals, 5,000+ HOA units, ~240 peak-season staff, heavy H-2B seasonal labor, TrackHS as PMS, in-house housekeeping 7 days a week. They just promoted Steve Frasier to CEO (2024 succession) and are refocusing exclusively on Steamboat. Try her cell first: (970) 846-9449. If calling the office (970-870-3397), expect a front desk. Sam's angle: you skied Jackson Hole last month — Jody lives and breathes mountain resort country, and Simply Steamboat's luxury positioning makes turnover quality existential for her brand.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Jody — I work with a few property managers in mountain resort towns, actually was just out skiing in Jackson Hole last month. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Feet-up-on-desk energy. The Jackson Hole mention is your warmth — you live in her world. Don't rush past it. Sound like a peer, not a pitch.",
        "branches": [
          {
            "label": "Yes / maybe",
            "to": "heard_name_yes"
          },
          {
            "label": "No, I haven't",
            "to": "heard_name_no"
          },
          {
            "label": "I'm busy / bad time",
            "to": "bad_timing"
          },
          {
            "label": "Skeptical / who is this?",
            "to": "permission_fallback"
          }
        ]
      },
      "heard_name_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well we'd normally be working with someone like you. What'd you hear?",
        "note": "Let her talk. Whatever she says, bridge to discovery or the pain trigger. Don't correct or over-explain.",
        "branches": [
          {
            "label": "Describes something specific",
            "to": "discovery_process"
          },
          {
            "label": "Vague / not really sure",
            "to": "pain_trigger"
          }
        ]
      },
      "heard_name_no": {
        "label": "HAVEN'T HEARD — BRIDGE TO REASON",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call — I work with a few other vacation rental managers in resort markets, and something keeps coming up that I figured you'd get. Can I take thirty seconds?",
        "note": "Self-deprecating, light, then pivot to asking for time. Don't launch into the pitch without permission.",
        "branches": [
          {
            "label": "Sure, go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "I'm not really involved with Simply Steamboat anymore",
            "to": "no_longer_involved"
          },
          {
            "label": "Not really / I'm busy",
            "to": "bad_timing"
          },
          {
            "label": "What's this about? (skeptical)",
            "to": "permission_fallback"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow or later this week?",
        "note": "Don't push. Get a callback window and get off the phone cleanly.",
        "branches": [
          {
            "label": "Sure, try me again",
            "to": "reschedule_set"
          },
          {
            "label": "Don't call me back",
            "to": "graceful_exit"
          },
          {
            "label": "What's this about though? (curious)",
            "to": "pain_trigger"
          }
        ]
      },
      "reschedule_set": {
        "label": "RESCHEDULE LOCKED",
        "say": "Perfect — I'll try you then. Appreciate it, Jody.",
        "note": "Write down the exact day and time immediately. Set a reminder. Keep it short — don't re-pitch.",
        "branches": []
      },
      "no_longer_involved": {
        "label": "NO LONGER AT SIMPLY STEAMBOAT",
        "say": "Oh no kidding — I didn't realize that. Are you still in the property management world, or did you go a different direction?",
        "note": "She may have moved to another PM company (still a prospect) or left the industry entirely. Either way, she knows who replaced her at Simply Steamboat.",
        "branches": [
          {
            "label": "Still in PM at a new company",
            "to": "pain_trigger"
          },
          {
            "label": "Not in PM anymore",
            "to": "referral_ask_simply_steamboat"
          },
          {
            "label": "Still loosely connected to Resort Group",
            "to": "pain_trigger"
          }
        ]
      },
      "referral_ask_simply_steamboat": {
        "label": "ASK WHO RUNS SIMPLY STEAMBOAT NOW",
        "say": "Got it — totally appreciate you telling me. Do you happen to know who's running operations over at Simply Steamboat now? I just want to make sure I'm reaching the right person and not bugging the wrong people.",
        "note": "She likely knows Alan Koermer (SVP Ops) or whoever took over. Get a name and contact info, then wrap warmly.",
        "branches": [
          {
            "label": "Gives a name",
            "to": "referral_get_name"
          },
          {
            "label": "Not sure / doesn't want to say",
            "to": "graceful_exit"
          }
        ]
      },
      "permission_fallback": {
        "label": "PERMISSION ASK",
        "say": "Yeah totally — I mean it is a cold call. Can I get thirty seconds to tell you why I reached out? You can totally hang up on me if it's not a fit.",
        "note": "Acknowledge the cold call head-on. Disarm with honesty. Most people will give you thirty seconds once you own it.",
        "branches": [
          {
            "label": "Fine, go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "No thanks / not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION DENIED — SPLIT THE OBJECTION",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and this just isn't interesting?",
        "note": "You're splitting the objection into two easier answers. Most people will soften and pick one — then you can respond to the real reason.",
        "branches": [
          {
            "label": "Bad time",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / not relevant",
            "to": "objection_not_interested"
          },
          {
            "label": "Wait — what do you do?",
            "to": "pain_trigger"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER — THE PROBLEM",
        "say": "So I work with another property manager in a pretty similar spot to you — they run about a hundred luxury units in a mountain resort town, in-house cleaning teams, high-end guests expecting everything dialed. And the thing that kept biting them was the gap between when a cleaner finishes a unit and when the next guest walks in. Their cleaners were taking photos, supervisors were supposed to review them, but with back-to-back turns on a Saturday in peak season — stuff slipped through. A stain on a couch, a cracked tile, a missing set of towels. It wouldn't show up until the guest called the front desk at ten PM, and now it's a fire drill. The worst part? The photos were there the whole time — nobody had time to actually look at them. Is any of that landing for you?",
        "note": "PAUSE after 'landing for you.' Let her react. Do not fill the silence. This is the most important moment in the call.",
        "branches": [
          {
            "label": "Yes — we deal with that",
            "to": "pain_warm"
          },
          {
            "label": "We've got that handled",
            "to": "objection_have_process"
          },
          {
            "label": "I'm not really the person for this",
            "to": "referral_ask"
          },
          {
            "label": "Not really / pushes back",
            "to": "pain_cold"
          }
        ]
      },
      "pain_warm": {
        "label": "PAIN CONFIRMED — SOLUTION + CTA",
        "say": "Yeah — I figured that might hit home. So what we built — RapidEye — it plugs into Track, which I know you guys are already on, and it automatically analyzes the photos your cleaners are already taking. Flags damage, missing items, staging issues — before the next guest checks in. No workflow change for your team. Would you be open to taking a look when I'm not cold calling you out of the blue?",
        "note": "One sentence on the solution. Mentioning Track shows you did your homework. Then shut up and let her respond to the CTA.",
        "branches": [
          {
            "label": "Sure, let's set something up",
            "to": "booking_meeting"
          },
          {
            "label": "How does it actually work?",
            "to": "discovery_process"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "I'd need to run this by Resort Group",
            "to": "objection_resort_group"
          }
        ]
      },
      "pain_cold": {
        "label": "PAIN DIDN'T LAND — RE-ENGAGE WITH A QUESTION",
        "say": "Totally fair — I probably oversimplified it. Out of curiosity though, how are you guys handling the QA side after turnovers right now? Are your supervisors spot-checking every unit, or is it more of a cleaner self-check kind of system?",
        "note": "Don't push the pitch harder. Ask a genuine question. If she describes any process at all, you're back in the conversation.",
        "branches": [
          {
            "label": "Describes their process",
            "to": "discovery_process"
          },
          {
            "label": "Still not interested",
            "to": "objection_not_interested"
          },
          {
            "label": "We're good / have it covered",
            "to": "objection_have_process"
          }
        ]
      },
      "discovery_process": {
        "label": "DISCOVERY — CURRENT PROCESS",
        "say": "Got it — and when your cleaners finish a unit, are they taking photos as part of the process now, or is it more of a visual walkthrough by a supervisor?",
        "note": "You're mapping their workflow. Listen for the gap — who takes photos, who reviews them, what falls through the cracks. Don't pitch yet.",
        "branches": [
          {
            "label": "Yes, cleaners take photos",
            "to": "discovery_photo_volume"
          },
          {
            "label": "No photos — just visual checks",
            "to": "discovery_no_photos"
          },
          {
            "label": "Supervisors physically walk each unit",
            "to": "discovery_supervisor_model"
          }
        ]
      },
      "discovery_photo_volume": {
        "label": "DISCOVERY — PHOTO REVIEW GAP",
        "say": "Makes sense. And who's actually reviewing all those photos? Is someone going through them before every check-in, or is it more of a we-look-when-something-goes-wrong situation?",
        "note": "This is where the pain usually lives. Nobody has bandwidth to review hundreds of turnover photos across the whole Simply Steamboat and Resort Group portfolio.",
        "branches": [
          {
            "label": "Nobody reviews them all",
            "to": "solution_drop_photos"
          },
          {
            "label": "Supervisors try but can't keep up",
            "to": "solution_drop_bandwidth"
          },
          {
            "label": "We mainly use them for damage disputes",
            "to": "solution_drop_disputes"
          }
        ]
      },
      "discovery_no_photos": {
        "label": "DISCOVERY — NO PHOTO DOCUMENTATION",
        "say": "Interesting — so if a guest reports damage after check-in, how do you guys figure out whether it was pre-existing or the guest caused it?",
        "note": "No photos means dispute vulnerability. This is a strong pain angle — especially given their Damage Waiver Fee structure.",
        "branches": [
          {
            "label": "It's a challenge / we often eat the cost",
            "to": "solution_drop_disputes"
          },
          {
            "label": "We have a process for it",
            "to": "discovery_priorities"
          }
        ]
      },
      "discovery_supervisor_model": {
        "label": "DISCOVERY — SUPERVISOR BANDWIDTH",
        "say": "Got it — and on a full-turn Saturday in peak season, are your supervisors actually able to hit every single unit, or do some inevitably slip through?",
        "note": "Peak season bandwidth is the leverage point. Nobody can physically inspect every unit at Trappeur's on a high-volume turnover day.",
        "branches": [
          {
            "label": "Some slip through / can't hit them all",
            "to": "solution_drop_bandwidth"
          },
          {
            "label": "We cover them all",
            "to": "discovery_priorities"
          }
        ]
      },
      "solution_drop_photos": {
        "label": "SOLUTION — NOBODY REVIEWS THE PHOTOS",
        "say": "That's exactly what we keep hearing. The photos exist, the data's right there, but nobody has time to go through all of them. That's literally what RapidEye does — it analyzes every photo automatically as they flow through Track and flags anything that needs attention before the next guest arrives. Would you be open to a fifteen-minute walkthrough to see how it works?",
        "note": "Match the solution to the exact gap she described. Then CTA and pause.",
        "branches": [
          {
            "label": "Sure, let's do it",
            "to": "booking_meeting"
          },
          {
            "label": "Send me info first",
            "to": "send_email"
          },
          {
            "label": "Someone else would need to see this",
            "to": "referral_ask"
          },
          {
            "label": "Not right now / budget",
            "to": "objection_no_budget"
          }
        ]
      },
      "solution_drop_disputes": {
        "label": "SOLUTION — DAMAGE DOCUMENTATION",
        "say": "That's actually one of the biggest things we solve. RapidEye creates a timestamped condition report for every turnover — so if a guest disputes damage, you've got photo-verified documentation of exactly what the unit looked like before they walked in. Especially with the Damage Waiver Fee setup you guys run, having that proof changes everything. Worth a fifteen-minute look?",
        "note": "Referencing the Damage Waiver Fee shows you understand their specific policy structure. It's a detail most callers wouldn't know.",
        "branches": [
          {
            "label": "Sure, let's do it",
            "to": "booking_meeting"
          },
          {
            "label": "Send me info first",
            "to": "send_email"
          },
          {
            "label": "Someone else would need to see this",
            "to": "referral_ask"
          },
          {
            "label": "Not right now / budget",
            "to": "objection_no_budget"
          }
        ]
      },
      "solution_drop_bandwidth": {
        "label": "SOLUTION — SUPERVISOR FORCE MULTIPLIER",
        "say": "Right — and you can't clone your supervisors. What RapidEye does is basically give every unit a virtual inspection — it analyzes the cleaner photos through Track and flags issues, so your supervisors only have to physically walk the ones that actually need attention. Would you be open to seeing how that works?",
        "note": "Frame it as a force multiplier for their existing team, not a replacement. Supervisors do less busywork, catch more real issues.",
        "branches": [
          {
            "label": "Sure, let's do it",
            "to": "booking_meeting"
          },
          {
            "label": "Send me info first",
            "to": "send_email"
          },
          {
            "label": "Someone else would need to see this",
            "to": "referral_ask"
          },
          {
            "label": "Not right now / budget",
            "to": "objection_no_budget"
          }
        ]
      },
      "discovery_priorities": {
        "label": "DISCOVERY — SEASONAL PRIORITIES",
        "say": "Makes sense. What's the biggest thing on your plate heading into this next season? Is it more about growing the portfolio — adding units — or more on the operations side, keeping quality tight with the team you've got?",
        "note": "This tells you which angle to pitch. Growth = inspection bottleneck. Quality = consistency at Trappeur's. If she says labor or staffing, go there.",
        "branches": [
          {
            "label": "Growth / adding units",
            "to": "pitch_growth_angle"
          },
          {
            "label": "Quality / operations / consistency",
            "to": "pitch_quality_angle"
          },
          {
            "label": "Staffing / labor challenges",
            "to": "discovery_labor_angle"
          }
        ]
      },
      "pitch_growth_angle": {
        "label": "PITCH — GROWTH BOTTLENECK",
        "say": "That makes sense — especially if you're adding units without adding proportional headcount. One thing I keep hearing from managers in your spot is that the inspection bottleneck is what actually caps how fast they can grow — you can only add properties as fast as you can QA them. RapidEye basically removes that cap. Would it be worth fifteen minutes to see if it fits?",
        "note": "Growth without proportional headcount means the inspection burden scales faster than the team. That's RapidEye's sweet spot.",
        "branches": [
          {
            "label": "Sure",
            "to": "booking_meeting"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "objection_no_budget"
          }
        ]
      },
      "pitch_quality_angle": {
        "label": "PITCH — QUALITY AND REVIEWS",
        "say": "Totally get it. Especially with the luxury positioning Simply Steamboat has — one bad experience at Trappeur's and that review lives on Airbnb forever. What I keep hearing from managers like you is the cleaning isn't the hard part — it's knowing for sure every unit is right before the next guest walks in. That's the gap RapidEye fills. Worth a look?",
        "note": "Naming Trappeur's shows you know their actual portfolio. Luxury positioning raises the stakes per unit — one missed issue has outsized reputational cost.",
        "branches": [
          {
            "label": "Sure",
            "to": "booking_meeting"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "objection_no_budget"
          }
        ]
      },
      "discovery_labor_angle": {
        "label": "DISCOVERY — LABOR AND H-2B CHALLENGES",
        "say": "Yeah — I know staffing in Steamboat is a whole thing, especially cycling through H-2B crews every season. Are you finding that quality consistency takes a hit when you're onboarding new people every few months?",
        "note": "H-2B is a confirmed pain point for Resort Group — they bought an entire inn for employee housing. Seasonal workforce turnover makes inspection automation more valuable, not less.",
        "branches": [
          {
            "label": "Yes, quality varies with new crews",
            "to": "pitch_labor_solution"
          },
          {
            "label": "We manage it pretty well",
            "to": "discovery_priorities"
          }
        ]
      },
      "pitch_labor_solution": {
        "label": "PITCH — STANDARDIZE DESPITE TURNOVER",
        "say": "That's the exact pattern we see. When your crew changes every season, you can't rely on tribal knowledge for what guest-ready looks like. RapidEye standardizes it — checks every photo against your property's baseline, so it doesn't matter whether the cleaner's been there two years or two weeks. Worth fifteen minutes to see how it works?",
        "note": "Standardization is the antidote to seasonal labor inconsistency. This resonates hard with anyone managing H-2B teams.",
        "branches": [
          {
            "label": "Sure",
            "to": "booking_meeting"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "objection_no_budget"
          }
        ]
      },
      "objection_no_budget": {
        "label": "OBJECTION — NO BUDGET / NOT NOW",
        "say": "Totally get it. Nowadays it's harder to keep a tool, let alone buy something new — especially when everything runs through Resort Group. Just so nobody from my team bugs you again — is it that budget for this cycle is completely locked, or is it more that anything new has to go through a whole approval process over there?",
        "note": "Agree first. Then split into budget-locked vs. approval-headache. The Resort Group mention shows you understand her org reality — she doesn't have unilateral buying power.",
        "branches": [
          {
            "label": "Budget is locked",
            "to": "test_drive_future"
          },
          {
            "label": "Approvals are hard / Resort Group decides",
            "to": "objection_resort_group"
          },
          {
            "label": "It's just not a priority right now",
            "to": "objection_not_interested"
          }
        ]
      },
      "test_drive_future": {
        "label": "SELL THE FUTURE TEST DRIVE",
        "say": "Makes total sense. You're probably not buying anything on a cold call, and I totally respect that. But when budget does open up, the managers who move fastest are the ones who already know what's on their list. Would you be open to just seeing how it works — not to buy, just so you know it's out there? Worst case you steal some ideas on what other mountain resort PMs are doing with their turnover photos and we part as friends.",
        "note": "De-risk the ask completely. It's not a buying commitment — it's education. The 'steal some ideas' line gives her a reason to say yes even if she never buys.",
        "branches": [
          {
            "label": "Fine, set it up",
            "to": "booking_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "I totally get it — I should've assumed you'd be all set, otherwise you probably would've reached out. Just so nobody from my team cold calls you again — is it that inspections aren't really a problem you're focused on right now, or is it more that you just hate cold calls?",
        "note": "Agree and then split. Most people soften when you give them the easy out of 'I hate cold calls.' That reopens the door.",
        "branches": [
          {
            "label": "Not a problem for us",
            "to": "objection_have_process"
          },
          {
            "label": "I just hate cold calls",
            "to": "test_drive_offer"
          },
          {
            "label": "Inspections aren't really my area",
            "to": "referral_ask"
          }
        ]
      },
      "test_drive_offer": {
        "label": "OFFER VALUE DESPITE THE COLD CALL",
        "say": "Ha — totally fair, I don't love making them either. Look, if nothing else I could walk you through what other PM companies in Steamboat and other resort markets are doing with their turnover documentation. Worst case you steal some ideas and we part as friends. Would that be worth fifteen minutes?",
        "note": "Make the meeting worth her time even if she never buys. Peer benchmarking is the offer of value.",
        "branches": [
          {
            "label": "Fine, let's do it",
            "to": "booking_meeting"
          },
          {
            "label": "No thanks",
            "to": "graceful_exit"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          }
        ]
      },
      "objection_have_process": {
        "label": "OBJECTION — WE ALREADY HAVE SOMETHING",
        "say": "That makes total sense — with the volume you guys run across Trappeur's and the rest of the portfolio, you'd have to have something in place. Just out of curiosity — is it that you're fully covered and happy with how it's working, or is it more that switching anything right now would be a headache?",
        "note": "Agree genuinely, then split. Naming Trappeur's shows you know their properties. 'Happy' vs. 'headache to switch' are very different answers — listen carefully.",
        "branches": [
          {
            "label": "We're happy with it",
            "to": "acknowledge_and_offer"
          },
          {
            "label": "Switching would be a pain",
            "to": "acknowledge_and_offer"
          },
          {
            "label": "Describes gaps or frustrations",
            "to": "pain_warm"
          }
        ]
      },
      "acknowledge_and_offer": {
        "label": "ACKNOWLEDGE AND PLANT THE SEED",
        "say": "Totally respect that. Last thing I'd want to do is fix something that isn't broken. If you ever do want a second set of eyes on the process — or just want to see what other resort PMs are doing differently — I'm an easy guy to find. Really appreciate your time, Jody.",
        "note": "Don't push. Leave the door open. If she says 'actually tell me more' you're back in. If not, exit gracefully and preserve the relationship for a future touch.",
        "branches": [
          {
            "label": "Actually, tell me more",
            "to": "discovery_process"
          },
          {
            "label": "Thanks, bye",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_resort_group": {
        "label": "OBJECTION — RESORT GROUP HAS TO APPROVE",
        "say": "Yeah that makes sense — I figured with the Resort Group structure there'd be a few people involved. Would it make sense to loop in whoever on the Resort Group side would need to weigh in? I could put something together that's tailored to your setup so it actually lands when it gets to them.",
        "note": "This is the bridge to a multi-stakeholder meeting or a referral. She may point you to Alan Koermer (SVP Ops), Steve Frasier (CEO), or Joseph Pierce (Exec Dir of Housekeeping). Any of those is a win.",
        "branches": [
          {
            "label": "Let me talk to them first",
            "to": "send_email"
          },
          {
            "label": "You should talk to [name]",
            "to": "referral_get_name"
          },
          {
            "label": "I can set up a group call",
            "to": "booking_meeting"
          }
        ]
      },
      "referral_ask": {
        "label": "REFERRAL — WHO OWNS INSPECTIONS?",
        "say": "Totally hear you — who on your team typically owns the inspection and turnover quality piece? Is that someone on the ops side, or is there a housekeeping lead who runs that day-to-day?",
        "note": "You know Alan Koermer is SVP Ops and Joseph Pierce is Exec Dir of Housekeeping. If she names either, confirm naturally and ask for contact info. Don't name-drop first — let her volunteer.",
        "branches": [
          {
            "label": "Gives a specific name",
            "to": "referral_get_name"
          },
          {
            "label": "Not sure / vague",
            "to": "referral_ask_broader"
          }
        ]
      },
      "referral_ask_broader": {
        "label": "REFERRAL — BROADER ASK",
        "say": "No worries — would it be okay if I reached out to the operations team at Resort Group directly? I just want to make sure I'm talking to the right person so nobody's time gets wasted.",
        "note": "If she can't name someone, get permission to reach out to the ops team. You can then call Alan Koermer or Joseph Pierce directly and say Jody pointed you that way.",
        "branches": [
          {
            "label": "Sure, try the ops team",
            "to": "referral_get_name"
          },
          {
            "label": "Let me find out and get back to you",
            "to": "send_email"
          },
          {
            "label": "I'd rather you didn't",
            "to": "graceful_exit"
          }
        ]
      },
      "referral_get_name": {
        "label": "GET THE CONTACT INFO",
        "say": "Perfect — and if I can grab their email or direct line, I'll put something tailored together so it actually lands for them. I'll mention we chatted so it's not totally out of the blue.",
        "note": "Get the name, title, email, and phone if possible. Then wrap up warmly. You now have an internal referral — that's gold.",
        "branches": [
          {
            "label": "Gives contact info",
            "to": "booking_referral_followup"
          },
          {
            "label": "Doesn't have it handy",
            "to": "referral_close"
          }
        ]
      },
      "booking_referral_followup": {
        "label": "REFERRAL LOCKED — WRAP UP",
        "say": "Awesome — really appreciate that, Jody. I'll reach out to them this week and mention you pointed me their way. Thanks for taking my call.",
        "note": "You got the referral. Stop talking. Follow up within 24 hours and open with 'Jody Corey suggested I reach out.'",
        "branches": []
      },
      "referral_close": {
        "label": "REFERRAL — NO CONTACT INFO AVAILABLE",
        "say": "No worries — I'll track them down. Thanks for pointing me in the right direction, Jody. If you ever want to chat about what we're seeing in the mountain resort space, I'm easy to find.",
        "note": "You have the name even if not the contact info. Use Resort Group's email pattern — firstinitiallastname@resortgroup.com — or call the main line at (970) 879-8700.",
        "branches": []
      },
      "booking_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Perfect — I've got next week pulled up. How does Tuesday or Wednesday afternoon look? Thinking fifteen, twenty minutes tops — just enough to show you how it plugs into Track and see if it makes sense for your setup.",
        "note": "Pick specific days. Don't say 'when works for you?' — too open-ended. Lock it now and send the calendar invite while still on the phone.",
        "branches": [
          {
            "label": "Gives a time",
            "to": "booking_confirm"
          },
          {
            "label": "Next week doesn't work",
            "to": "booking_alternative"
          }
        ]
      },
      "booking_alternative": {
        "label": "FIND AN ALTERNATIVE TIME",
        "say": "No problem — what week works better for you? I'm pretty flexible.",
        "note": "Stay specific. If she says 'the week after,' immediately suggest a day and time within that week.",
        "branches": [
          {
            "label": "Gives a time",
            "to": "booking_confirm"
          },
          {
            "label": "Not sure — send me something and I'll reply",
            "to": "send_email"
          }
        ]
      },
      "booking_confirm": {
        "label": "MEETING BOOKED — STOP SELLING",
        "say": "Locked in. I'll send the calendar invite right now so it's on your calendar. Really appreciate you taking my call, Jody — looking forward to it.",
        "note": "Send the invite immediately while still on the phone. Stop selling. Don't add more pitch. You won — hang up before you undo it.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most relevant to include so it doesn't just sit in your inbox like every other vendor pitch? Is it more about how it plugs into Track, or more about what the ROI looks like for a portfolio like yours?",
        "note": "Accept the email request immediately — don't resist it. Then ask what to include. This gives you intel and makes the follow-up actually relevant.",
        "branches": [
          {
            "label": "How it works / Track integration",
            "to": "send_email_tailored"
          },
          {
            "label": "ROI / cost info",
            "to": "send_email_tailored"
          },
          {
            "label": "Just send whatever",
            "to": "send_email_tailored"
          }
        ]
      },
      "send_email_tailored": {
        "label": "CONFIRM EMAIL AND WRAP",
        "say": "Got it — I'll put that together and shoot it over today. I'll include a couple time options in case you want to dig in after you read it. Best email still jody at simplysteamboat dot com?",
        "note": "Confirm the email address. Include 2-3 specific time suggestions in the email body. Send within 2 hours of hanging up.",
        "branches": [
          {
            "label": "Confirms email",
            "to": "send_email_close"
          },
          {
            "label": "Gives a different email",
            "to": "send_email_close"
          }
        ]
      },
      "send_email_close": {
        "label": "EMAIL CONFIRMED — END CALL",
        "say": "Perfect — you'll have it this afternoon. Appreciate your time, Jody.",
        "note": "Send the email within 2 hours. Subject line should reference the call: 'Jody — following up from our call.' Include the specific content she asked for plus 2-3 calendar time slots.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes, I'm easy to find — Sam Parks, RapidEye. Appreciate your time, Jody.",
        "note": "Don't burn the bridge. Stay warm. She may come back around, or you may reach someone else at Resort Group who loops her in later.",
        "branches": []
      },
      "gatekeeper_slide": {
        "label": "GATEKEEPER — SLIDE BY",
        "say": "Hey — could you get me through to Jody? It's Sam.",
        "note": "Use this if you call the office line instead of her cell. First name only. Say nothing else. Sound like you know her. Wait.",
        "branches": [
          {
            "label": "Who's calling / what's this about?",
            "to": "gatekeeper_context"
          },
          {
            "label": "Putting you through",
            "to": "opener"
          },
          {
            "label": "She's not available",
            "to": "gatekeeper_voicemail"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — ADD CONTEXT",
        "say": "Yeah, I work with a few other property managers in Steamboat. Would you mind letting her know it's Sam Parks?",
        "note": "Just enough context to sound legitimate. Don't pitch the gatekeeper. Don't explain the product.",
        "branches": [
          {
            "label": "What company are you with?",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "Putting you through",
            "to": "opener"
          },
          {
            "label": "She's busy / not available",
            "to": "gatekeeper_voicemail"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "It's RapidEye — we help a couple other property management companies in resort markets with their inspection workflows. I sent her a note — would you mind giving her a heads up?",
        "note": "Third and final attempt. If this doesn't work, get a callback time or leave a voicemail. Don't fight the gatekeeper.",
        "branches": [
          {
            "label": "I'll let her know / leave a message",
            "to": "gatekeeper_voicemail"
          },
          {
            "label": "Putting you through",
            "to": "opener"
          },
          {
            "label": "She's not interested",
            "to": "graceful_exit"
          }
        ]
      },
      "gatekeeper_voicemail": {
        "label": "GATEKEEPER — GET CALLBACK TIME OR VM",
        "say": "No worries — is there a better time to catch her, or should I just try back tomorrow?",
        "note": "Get a callback window if possible. If they offer to put you through to voicemail, take it and leave a short message.",
        "branches": [
          {
            "label": "Gives a time to try back",
            "to": "reschedule_set"
          },
          {
            "label": "Try back anytime",
            "to": "reschedule_set"
          },
          {
            "label": "I'll put you through to her voicemail",
            "to": "voicemail_drop"
          }
        ]
      },
      "voicemail_drop": {
        "label": "VOICEMAIL",
        "say": "Hey Jody — it's Sam Parks with RapidEye. I work with a few property managers in mountain resort markets on their turnover inspection workflows — was hoping to grab two minutes with you. My number is [your number]. I'll try you again later this week if I don't hear back. Thanks.",
        "note": "Keep it under 20 seconds. Don't pitch. Create just enough curiosity to get a callback. Try again in 2-3 days if no response.",
        "branches": []
      }
    }
  }
}