{
  "name": "Joe Riley",
  "title": "President (Casago)",
  "company": "Vacasa",
  "location": "San Diego, CA",
  "phone": "+1-503-345-9399",
  "company_phone": "800-544-0300",
  "alt_phones": [
    "+1-800-544-0300",
    "+1-800-863-8415",
    "+1-850-299-9469",
    "+1-208-203-3377"
  ],
  "flow": {
    "context": "Joe Riley is President of Casago, which completed its acquisition of Vacasa on May 1, 2025 — creating a 40,000+ property vacation rental operation now transitioning to a franchise model. He's the executive sponsor for post-merger operational strategy and was publicly quoted about empowering local teams during the revised offer period. Casago just partnered with Breezeway for ops and Guesty for PMS — RapidEye plugs directly into Breezeway. Casago San Diego absorbed 150+ former Vacasa properties in August 2025, so integration pain is fresh. No direct personal connection to Sam — strongest angle is industry proximity, the Breezeway integration fit, and the massive post-acquisition operational complexity he's navigating right now.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Joe — I've been working with a few property management companies going through big integrations right now, and your name kept coming up as the one driving the operational side over at Casago. It's Sam Parks with RapidEye. Have you heard my name tossed around?",
        "note": "Sound relaxed and peer-level. The acquisition context makes this feel timely, not random. Feet up on the desk energy — you're not reading a script.",
        "branches": [
          {
            "label": "No / Who? / What's RapidEye?",
            "to": "heard_no"
          },
          {
            "label": "Yeah actually / Maybe / Sounds familiar",
            "to": "heard_yes"
          },
          {
            "label": "I'm busy / bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Guarded / 'Is this a sales call?' / skeptical tone",
            "to": "permission_fallback"
          },
          {
            "label": "Gatekeeper or assistant answers",
            "to": "gatekeeper_initial"
          }
        ]
      },
      "heard_no": {
        "label": "THEY HAVEN'T HEARD OF YOU",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call — I was just talking to another PM exec who went through a big acquisition, pretty similar to what you guys are doing with Vacasa. Their biggest headache wasn't the tech migration or the rebrand — it was that every market was doing inspections completely differently. One location's version of guest-ready looked nothing like another's. Damage was slipping through turnovers, owners were finding out from guest reviews before the ops team even caught it — and they were bleeding properties because of it.",
        "note": "PAUSE here. Let the pain sit. Do NOT rush into the solution. If Joe reacts to anything — a sigh, a 'yeah,' an interruption — stop and let him talk. The pain is doing the work.",
        "branches": [
          {
            "label": "Reacts to pain / 'Yeah, that sounds familiar'",
            "to": "pain_reaction"
          },
          {
            "label": "Silence — waiting for more",
            "to": "solution_bridge"
          },
          {
            "label": "We already have something for that",
            "to": "objection_have_process"
          },
          {
            "label": "Not interested / We're good",
            "to": "objection_not_interested"
          },
          {
            "label": "No budget / Bad timing for spend",
            "to": "objection_no_budget"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          }
        ]
      },
      "pain_reaction": {
        "label": "PAIN LANDED — LET THEM TALK",
        "say": "Yeah — what's been your experience with it? Is that something you guys are running into across markets?",
        "note": "He just told you the pain resonates. Shut up and listen. Whatever he says next becomes your ammunition for the rest of the call. Take notes.",
        "branches": [
          {
            "label": "Describes specific pain (inconsistency, missed damage, owner complaints)",
            "to": "warm_response"
          },
          {
            "label": "'It's definitely a challenge at our scale'",
            "to": "discovery_pain_acknowledged"
          },
          {
            "label": "'We're working on it' / somewhat guarded",
            "to": "discovery_deep_dive"
          }
        ]
      },
      "solution_bridge": {
        "label": "BRIDGE TO SOLUTION",
        "say": "We built something that plugs into the turnover photos your teams are already taking through Breezeway and automatically flags damage, missing items, staging issues before a guest walks in. No workflow change. Would you be open to taking a look when I'm not cold calling you out of the blue?",
        "note": "One sentence on what it does. One sentence on how. Then CTA. That's it. Don't oversell.",
        "branches": [
          {
            "label": "Interested / Tell me more / How does it work?",
            "to": "warm_response"
          },
          {
            "label": "Yeah, let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "We already have something for that",
            "to": "objection_have_process"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          }
        ]
      },
      "heard_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone in your position. What did you hear?",
        "note": "Let them talk. Whatever they describe, use it as a bridge into discovery. If positive, build on it. If vague, transition to the pain trigger.",
        "branches": [
          {
            "label": "Describes what they heard (positive or neutral)",
            "to": "warm_response"
          },
          {
            "label": "Vague / 'Not much' / 'Just the name'",
            "to": "heard_no"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again later this week? Maybe Thursday or Friday?",
        "note": "Don't apologize. Stay casual. If they give a time, lock it in and get off the phone fast.",
        "branches": [
          {
            "label": "Gives a specific time / 'Sure, try me then'",
            "to": "book_callback"
          },
          {
            "label": "What's this about? / Give me the quick version",
            "to": "heard_no"
          },
          {
            "label": "Don't call back / Not interested",
            "to": "end_graceful"
          }
        ]
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call. Can I get thirty seconds to tell you why I reached out, and you can totally hang up on me if it's not a fit?",
        "note": "Use this when they're guarded but haven't hung up. The 'hang up on me' line disarms because no salesperson ever says that. Smile through it.",
        "branches": [
          {
            "label": "Fine, go ahead / 'You've got 30 seconds'",
            "to": "heard_no"
          },
          {
            "label": "No / Not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and this just isn't interesting?",
        "note": "Last attempt. Split the rejection into timing vs. disinterest. Don't push hard — you're gathering info for the next attempt.",
        "branches": [
          {
            "label": "'Bad time'",
            "to": "bad_timing"
          },
          {
            "label": "'Not interested' / 'We're set'",
            "to": "end_graceful"
          },
          {
            "label": "Opens up slightly / curious",
            "to": "heard_no"
          }
        ]
      },
      "gatekeeper_initial": {
        "label": "GATEKEEPER — SLIDE BY",
        "say": "Hey — could you get me through to Joe? It's Sam.",
        "note": "Nothing else. No title, no company, no explanation. Just first names. Sound like you already know him and you belong.",
        "branches": [
          {
            "label": "Puts you through to Joe",
            "to": "opener"
          },
          {
            "label": "Who's calling? / What company?",
            "to": "gatekeeper_context"
          },
          {
            "label": "He's not available / What's this regarding?",
            "to": "gatekeeper_social_proof"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — ADD CONTEXT",
        "say": "Yeah, I work with a few other property management companies on their inspection workflows — similar size to you guys. Would you mind letting him know it's Sam Parks?",
        "note": "Still casual. You're not pitching the gatekeeper. Just dosing info one piece at a time.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "More pushback / He's in meetings all day",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "Can I take a message?",
            "to": "gatekeeper_message"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "Totally understand — we help a couple other property management companies with their turnover inspection workflows at scale. I sent Joe a note already — would you mind giving him a heads up that I called? Sam Parks, RapidEye. What's the best time to catch him?",
        "note": "Ask for timing info. Even if you don't get through today, you learn when to call back. That's a win.",
        "branches": [
          {
            "label": "Gives you a time / Puts you through",
            "to": "opener"
          },
          {
            "label": "I'll pass the message along",
            "to": "gatekeeper_message"
          }
        ]
      },
      "gatekeeper_message": {
        "label": "GATEKEEPER — LEAVE MESSAGE",
        "say": "Appreciate that. It's Sam Parks — S-A-M, Parks like the park — with RapidEye. Best number is my cell. And hey, who am I speaking with, just so I know who to thank when he calls back?",
        "note": "Get the gatekeeper's name. You'll use it next time you call to sound familiar. Be warm — they remember who was nice and who was pushy.",
        "branches": [
          {
            "label": "Gives name, takes message",
            "to": "end_graceful"
          }
        ]
      },
      "warm_response": {
        "label": "THEY'RE WARM — STOP PITCHING, ASK QUESTIONS",
        "say": "Yeah for sure — before I get into the weeds on what we built, I'd love to understand how you guys are thinking about it. With 40,000-plus properties across the network now and the franchise model rolling out — how are you standardizing quality checks across all those different markets?",
        "note": "STOP SELLING. You earned the conversation. Let Joe talk about his world. Listen for: inconsistency across franchise locations, photo review bottlenecks, owner complaints, damage claim costs, franchise compliance gaps.",
        "branches": [
          {
            "label": "Describes current process or challenges",
            "to": "discovery_deep_dive"
          },
          {
            "label": "We use Breezeway for that",
            "to": "discovery_breezeway"
          },
          {
            "label": "That's actually a big challenge for us",
            "to": "discovery_pain_acknowledged"
          },
          {
            "label": "Redirects — 'You should talk to someone on my team'",
            "to": "referral_from_joe"
          }
        ]
      },
      "discovery_deep_dive": {
        "label": "DISCOVERY — DIG DEEPER",
        "say": "That makes sense. So when a turnover happens — say a cleaner finishes a unit in one of the San Diego properties that just came over from Vacasa versus a Tahoe property that's been in the network longer — is there a consistent gate before that unit gets marked guest-ready? Or does that still vary by market?",
        "note": "You know Vacasa had HomeCare Hub with post-cleaning photo approval gates. Ask whether that consistency survived the acquisition and franchise transition. This is where the real pain lives.",
        "branches": [
          {
            "label": "It varies / We're still working on standardizing",
            "to": "solution_pitch"
          },
          {
            "label": "We have a standard process across markets",
            "to": "discovery_photo_review"
          },
          {
            "label": "That's more of an ops question — talk to Bob or John",
            "to": "referral_from_joe"
          }
        ]
      },
      "discovery_breezeway": {
        "label": "DISCOVERY — BREEZEWAY THREAD",
        "say": "Oh perfect — we actually plug directly into Breezeway. So the photos your teams are already uploading after turnovers, we run those through our AI and flag anything that's off — damage, missing items, staging issues, stuff that a human reviewer would catch on a good day but misses when they're looking at hundreds of units. How are you guys handling the photo review side right now? Is someone actually looking at every set that comes in?",
        "note": "This is gold. They use Breezeway. RapidEye integrates with Breezeway. Make this feel like a natural extension of what they already do — not a new system, not a new workflow.",
        "branches": [
          {
            "label": "Nobody reviews every set / It's hit or miss",
            "to": "solution_pitch"
          },
          {
            "label": "We have QA people reviewing them",
            "to": "solution_pitch_qa"
          },
          {
            "label": "Tell me more about the integration",
            "to": "solution_pitch"
          }
        ]
      },
      "discovery_pain_acknowledged": {
        "label": "PAIN ACKNOWLEDGED — LET THEM TALK",
        "say": "I bet. What's been the biggest headache with it?",
        "note": "They just told you it's a problem. Shut up and listen. Whatever they say next is your ammunition for the rest of the call. Write it down word for word.",
        "branches": [
          {
            "label": "Describes specific pain (inconsistency, missed damage, owner complaints)",
            "to": "solution_pitch"
          },
          {
            "label": "It's mostly a scale problem — too many properties",
            "to": "solution_pitch_scale"
          },
          {
            "label": "It's the franchise transition — different operators doing different things",
            "to": "solution_pitch_franchise"
          }
        ]
      },
      "discovery_photo_review": {
        "label": "DISCOVERY — PHOTO REVIEW PROCESS",
        "say": "Got it. And at your scale — that's gotta be thousands of photo sets a week across the network — who's actually reviewing those? Is there a centralized QA layer, or is it mostly on the local franchise teams to self-verify?",
        "note": "You know from Vacasa's SEC filings that they had post-cleaning photo submissions for real-time inspection approval. Probe whether that survived the Casago transition or broke during integration.",
        "branches": [
          {
            "label": "Local teams self-verify / No centralized review",
            "to": "solution_pitch"
          },
          {
            "label": "We have QA reviewers centrally",
            "to": "solution_pitch_qa"
          },
          {
            "label": "Honestly it's a gap right now",
            "to": "solution_pitch"
          }
        ]
      },
      "solution_pitch": {
        "label": "ONE-SENTENCE SOLUTION + CTA",
        "say": "That's exactly what we built for. RapidEye plugs into Breezeway — takes the photos your teams are already uploading and automatically catches damage, missing items, staging issues. No new app for your cleaners, no workflow change. The AI just runs in the background and flags what needs attention before a guest ever walks in. Would you be open to a quick fifteen-minute demo? Not asking you to buy anything — just so you can see if it even makes sense for how you guys are set up.",
        "note": "One sentence on what it does. One sentence on how it works. Then CTA. Don't list features. Don't say 'AI-powered' five times. Keep it human.",
        "branches": [
          {
            "label": "Yeah, let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "I'd need to loop in my ops team",
            "to": "referral_from_joe"
          },
          {
            "label": "What does it cost?",
            "to": "handle_pricing"
          },
          {
            "label": "We're not ready for that right now",
            "to": "objection_no_budget"
          }
        ]
      },
      "solution_pitch_qa": {
        "label": "SOLUTION — QA TEAM ANGLE",
        "say": "Respect that — most companies at your scale have to. But here's what I keep hearing: those QA people are reviewing hundreds of photo sets a day, and stuff still slips through. Not because they're bad at it — it's a volume problem. What we do is run every photo through AI before it hits a human reviewer, so your QA team only has to look at the flagged stuff. Cuts their review time way down and catches the things that get missed at 4 PM on a Saturday during peak season. Would it make sense to show you what that looks like?",
        "note": "Don't attack their current process. Compliment the team. Position RapidEye as making good people better, not replacing them.",
        "branches": [
          {
            "label": "That's interesting / Yeah let's look at it",
            "to": "book_meeting"
          },
          {
            "label": "Send me info first",
            "to": "send_email"
          },
          {
            "label": "Not a priority right now",
            "to": "objection_not_interested"
          }
        ]
      },
      "solution_pitch_scale": {
        "label": "SOLUTION — SCALE ANGLE",
        "say": "That's exactly it — and it only gets harder as you add franchise locations. Every new market means more photo sets, more turnovers, more opportunities for something to slip through. We built RapidEye specifically for that — it scales with you because the AI reviews every single photo automatically. You go from 150 properties in San Diego to 500, and the inspection quality doesn't drop. Would you be open to a quick look?",
        "note": "Joe is thinking about franchise growth. Position RapidEye as infrastructure that scales with the network, not a point solution for one market.",
        "branches": [
          {
            "label": "Yeah, let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Talk to my ops team first",
            "to": "referral_from_joe"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          }
        ]
      },
      "solution_pitch_franchise": {
        "label": "SOLUTION — FRANCHISE STANDARDIZATION ANGLE",
        "say": "That's actually where we're seeing the most traction — franchise networks where the corporate team needs every location meeting the same quality bar, but you can't put a QA person in every market. RapidEye becomes that consistent layer. Every franchise partner uploads their turnover photos through Breezeway like they already do, and the AI enforces the same standard whether it's San Diego, Tahoe, or Belize. No variance, no 'well that's how we do it here.' Would it be worth fifteen minutes to see what that looks like at your scale?",
        "note": "This is Joe's exact challenge — standardizing a franchise network post-acquisition. Nail this angle and you're speaking directly to his mandate.",
        "branches": [
          {
            "label": "Yeah, that's interesting — let's talk",
            "to": "book_meeting"
          },
          {
            "label": "I'd want my ops team on that call",
            "to": "referral_from_joe"
          },
          {
            "label": "Send me info",
            "to": "send_email"
          },
          {
            "label": "Not ready right now",
            "to": "objection_no_budget"
          }
        ]
      },
      "handle_pricing": {
        "label": "PRICING QUESTION",
        "say": "Totally fair question. It depends on volume and how you'd want to roll it out — I don't want to throw out a number that doesn't apply to your situation. That's honestly part of why a quick call makes sense. I can show you exactly what it looks like for a 40,000-property network versus starting with a single franchise market. Would next week work to walk through it?",
        "note": "Never quote pricing on a cold call. The meeting IS the answer to the pricing question. Redirect to the demo.",
        "branches": [
          {
            "label": "Sure, let's set it up",
            "to": "book_meeting"
          },
          {
            "label": "Just give me a ballpark",
            "to": "handle_pricing_pushback"
          },
          {
            "label": "Send me info with pricing",
            "to": "send_email"
          }
        ]
      },
      "handle_pricing_pushback": {
        "label": "PRICING — BALLPARK PUSHBACK",
        "say": "For companies at your scale it's typically pennies per unit per turnover — way less than what a single missed damage claim costs. But the real answer depends on whether you'd roll it out network-wide or pilot it in one market first. That's a ten-minute conversation — would Tuesday or Wednesday work better?",
        "note": "Give just enough to keep them engaged. Anchor to cost of the problem, not cost of the tool. Then redirect.",
        "branches": [
          {
            "label": "Agrees to meeting",
            "to": "book_meeting"
          },
          {
            "label": "Still hesitant / not right now",
            "to": "sell_test_drive"
          }
        ]
      },
      "objection_have_process": {
        "label": "OBJECTION — HAVE A PROCESS",
        "say": "That makes total sense — with 40,000 properties you'd have to have something in place. I'd be shocked if you didn't.",
        "note": "AGREE first. Don't fight it. Pause for a beat. Then split the objection.",
        "branches": [
          {
            "label": "Pauses / softens slightly",
            "to": "objection_split_vendor"
          }
        ]
      },
      "objection_split_vendor": {
        "label": "SPLIT — VENDOR OR PROCESS",
        "say": "Just so nobody from my team bugs you again — is it that you're fully covered and everything's catching what it needs to catch, or is it more that adding anything new right now during the Casago-Vacasa integration would just be a headache?",
        "note": "Most will pick option B — integration fatigue is real. That's your opening. If they say A, respect it and offer the test drive.",
        "branches": [
          {
            "label": "'We're fully covered and happy'",
            "to": "sell_test_drive"
          },
          {
            "label": "'Yeah, the timing is tough with the integration'",
            "to": "objection_integration_timing"
          },
          {
            "label": "Opens up about gaps / things slipping through",
            "to": "warm_response"
          }
        ]
      },
      "objection_integration_timing": {
        "label": "INTEGRATION TIMING ANGLE",
        "say": "A hundred percent — post-acquisition is the worst time to add anything to anyone's plate. But honestly, that's exactly when most of our customers first looked at us. Because the integration is when inspection quality drops the most — new teams, new systems, properties changing hands between operators. What if we just did a quick fifteen minutes so it's on your radar for when the dust settles? No commitment, just so you know what's out there.",
        "note": "The acquisition IS the pain. Don't shy away from it. Frame the meeting as future-state planning, not an immediate buy decision.",
        "branches": [
          {
            "label": "Fine, let's do a quick call",
            "to": "book_meeting"
          },
          {
            "label": "Send me something and I'll look when things calm down",
            "to": "send_email"
          },
          {
            "label": "Not now",
            "to": "end_graceful"
          }
        ]
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "Totally get it — I should've assumed you'd already be all set. Otherwise you probably would've reached out yourself.",
        "note": "Agree. Drop your guard completely. It disarms them. Pause, then split.",
        "branches": [
          {
            "label": "Pauses / softens",
            "to": "objection_split_interest"
          }
        ]
      },
      "objection_split_interest": {
        "label": "SPLIT — INTEREST",
        "say": "Just so nobody from my team cold calls you again — is it that inspection quality isn't really a problem you're focused on right now, or is it more that you just hate getting cold calls?",
        "note": "If they hate cold calls — that's not a product objection, that's a channel objection. If inspections aren't a focus — probe what IS the focus.",
        "branches": [
          {
            "label": "'I hate cold calls' / laughs",
            "to": "sell_test_drive"
          },
          {
            "label": "'Inspections aren't our focus right now'",
            "to": "probe_priorities"
          },
          {
            "label": "'Both' / still closed off",
            "to": "end_graceful"
          }
        ]
      },
      "probe_priorities": {
        "label": "PROBE — WHAT IS THE FOCUS?",
        "say": "Totally fair. What is the biggest operational priority for you guys heading into this year?",
        "note": "If he shares a priority, see if RapidEye connects. Owner retention? Guest satisfaction scores? Franchise rollout speed? Reducing claims? All of those tie back to inspection quality. If it's truly unrelated, exit gracefully.",
        "branches": [
          {
            "label": "Shares priority that connects (owner retention, guest experience, franchise standards, claims)",
            "to": "reframe_to_priority"
          },
          {
            "label": "Shares something unrelated / still closed",
            "to": "end_graceful"
          }
        ]
      },
      "reframe_to_priority": {
        "label": "REFRAME TO THEIR PRIORITY",
        "say": "That's actually exactly where this fits in. The companies we work with started looking at us because of that same thing — turns out a lot of it traces back to what's getting caught or missed at the turnover level. I'm not saying we solve all of it, but it might be worth a fifteen-minute look just to see if there's overlap. Worst case you steal some ideas from what other big PM companies are doing and we part as friends.",
        "note": "Connect their stated priority back to inspections. Don't force it if it doesn't fit. The offer of value is learning what peers in their position are doing.",
        "branches": [
          {
            "label": "Okay, sure",
            "to": "book_meeting"
          },
          {
            "label": "Send me info",
            "to": "send_email"
          },
          {
            "label": "Still no",
            "to": "end_graceful"
          }
        ]
      },
      "objection_no_budget": {
        "label": "OBJECTION — NO BUDGET",
        "say": "Totally get it. Especially post-acquisition — I'm sure every dollar is getting scrutinized ten different ways right now.",
        "note": "Agree and reference the acquisition specifically. Shows you understand their world, not just reciting an objection handler. Pause, then split.",
        "branches": [
          {
            "label": "Pauses / softens",
            "to": "objection_split_budget"
          }
        ]
      },
      "objection_split_budget": {
        "label": "SPLIT — BUDGET",
        "say": "Just so nobody bugs you again — is it that budget for new tools this cycle is completely locked, or is it more that anything you try to buy has to go through a gauntlet to get approved?",
        "note": "If locked: sell future planning and the test drive. If approval is the problem: offer to help build the internal case with data from similar-sized companies.",
        "branches": [
          {
            "label": "'Budget is completely locked'",
            "to": "sell_test_drive"
          },
          {
            "label": "'Everything has to go through approval' / 'It's a process'",
            "to": "sell_test_drive_approval"
          },
          {
            "label": "Opens up about constraints",
            "to": "sell_test_drive"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Look — you're probably not buying anything right now, and I totally respect that. But when budget does free up, the people who move fastest are the ones who already know what's one, two, three on their list. Would you be open to a fifteen-minute look — not to buy, just so you know what's out there? If nothing else, I can walk you through what other PM companies at your scale are doing with their turnover photos. Worst case you steal some ideas and we part as friends.",
        "note": "You're not asking them to buy. You're asking them to be informed. The offer of value is competitive intel from their peers. That's worth fifteen minutes to any exec.",
        "branches": [
          {
            "label": "Okay, let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "end_graceful"
          }
        ]
      },
      "sell_test_drive_approval": {
        "label": "TEST DRIVE — APPROVAL ANGLE",
        "say": "I hear you — and honestly that's exactly why a quick look now makes sense. If this ever does come up internally, you'd already have the data to skip the research phase and go straight to 'here's what it does and here's what it costs.' We can even put together a one-pager for you that maps to how Casago's ops work so it's ready to go if the conversation happens. Would fifteen minutes next week be worth it for that?",
        "note": "Frame the demo as giving Joe the tools to sell internally. He's not buying — he's building his future playbook.",
        "branches": [
          {
            "label": "That makes sense / Sure",
            "to": "book_meeting"
          },
          {
            "label": "Send me the one-pager first",
            "to": "send_email"
          },
          {
            "label": "Not now",
            "to": "end_graceful"
          }
        ]
      },
      "referral_from_joe": {
        "label": "REFERRAL — JOE REDIRECTS",
        "say": "That makes total sense — I know you've got a million things going on at the integration level. Who on your team would be the right person to dig into this? Would it be someone like Bob Milne on the ops side, or is there someone else who owns the inspection and turnover workflow across the network?",
        "note": "You know Bob Milne is SVP Ops and John Banczak is COO. Drop Bob's name to show you've done your homework. If Joe gives you any name, ask for an intro or permission to use his name.",
        "branches": [
          {
            "label": "Gives a name — Bob, John, or someone else",
            "to": "referral_lock_in"
          },
          {
            "label": "'Yeah, talk to Bob' or 'Talk to John'",
            "to": "referral_lock_in"
          },
          {
            "label": "'Just send me an email and I'll forward it'",
            "to": "send_email_with_referral"
          }
        ]
      },
      "referral_lock_in": {
        "label": "LOCK IN THE REFERRAL",
        "say": "Perfect — would you be open to shooting them a quick note so they know I'm reaching out? Or would it be better if I just mentioned your name when I call them? Either way, I'll put something tailored together so it actually lands and isn't just a generic pitch in their inbox.",
        "note": "Getting permission to use Joe's name turns the next call from cold to warm. That's the real win here. Lock in the referral's contact info if you can.",
        "branches": [
          {
            "label": "'I'll send them a note' / 'Use my name'",
            "to": "referral_confirm"
          },
          {
            "label": "'Just reach out directly'",
            "to": "referral_confirm"
          }
        ]
      },
      "referral_confirm": {
        "label": "CONFIRM REFERRAL DETAILS",
        "say": "Really appreciate that, Joe. What's the best email or direct number for them? And I'll keep you in the loop — if it makes sense for a bigger conversation down the road, I'll make sure you're included. Thanks for taking my call.",
        "note": "Get the contact info and confirm spelling. Then get off the phone. Don't overstay your welcome. You got a warm referral from the President — that's a huge win.",
        "branches": []
      },
      "send_email_with_referral": {
        "label": "EMAIL + REFERRAL",
        "say": "Totally — I'll send you something short and sharp. One quick question so it actually lands when you forward it: should I frame it more around the franchise standardization piece, or the damage detection and cost savings side? That way it speaks their language.",
        "note": "Learn what angle matters to Joe's team. Use that framing in the email. Include a specific meeting time suggestion in the email for the person he's forwarding to.",
        "branches": [
          {
            "label": "Gives direction on framing",
            "to": "send_email_referral_confirm"
          },
          {
            "label": "'Either is fine' / 'Just send it'",
            "to": "send_email_referral_confirm"
          }
        ]
      },
      "send_email_referral_confirm": {
        "label": "CONFIRM EMAIL — REFERRAL VERSION",
        "say": "Got it — I'll have that over to you today. Is joe.riley@vacasa.com still the best one? Really appreciate you pointing me in the right direction, Joe.",
        "note": "Confirm the email. Send it within the hour. Make the email forwardable — short, no fluff, clear CTA for the ops person.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most relevant to include so it's not just another generic cold email? Is it more the franchise quality standardization piece, or the damage detection and cost savings side?",
        "note": "Accept the email ask gracefully. But get ONE qualifying question answered so you can tailor it. The goal is to make the email so specific that they actually open it.",
        "branches": [
          {
            "label": "Gives direction — franchise side or cost side",
            "to": "send_email_confirm"
          },
          {
            "label": "'Just keep it short' / 'Send whatever'",
            "to": "send_email_confirm"
          }
        ]
      },
      "send_email_confirm": {
        "label": "CONFIRM EMAIL DETAILS",
        "say": "Got it — I'll keep it tight. Is joe.riley@vacasa.com still the best one? I'll send it over today and suggest a quick fifteen minutes for next week. If it doesn't resonate, no follow-up, no spam. Appreciate your time, Joe.",
        "note": "Confirm the email address. In the email: reference this conversation, use the framing he preferred, include one specific time slot for a call, and keep it under 150 words.",
        "branches": []
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next week pulled up — would Tuesday afternoon or Wednesday morning work better for a quick fifteen?",
        "note": "Two options, not open-ended. Lock the time NOW. Don't give them room to say 'let me check my calendar and get back to you.'",
        "branches": [
          {
            "label": "Picks a time",
            "to": "meeting_confirm"
          },
          {
            "label": "'Let me check and get back to you'",
            "to": "meeting_pin_down"
          },
          {
            "label": "'Can we do the week after?'",
            "to": "meeting_flex"
          }
        ]
      },
      "meeting_pin_down": {
        "label": "PIN DOWN THE MEETING",
        "say": "Totally — how about I just send over an invite for Wednesday at eleven AM your time, and if it doesn't work you just move it? That way it's on the books and neither of us has to chase it down.",
        "note": "Don't let 'I'll get back to you' happen — that's where meetings go to die. Suggest a specific time and let them adjust. The calendar invite is the commitment device.",
        "branches": [
          {
            "label": "Agrees",
            "to": "meeting_confirm"
          },
          {
            "label": "Still noncommittal",
            "to": "send_email"
          }
        ]
      },
      "meeting_flex": {
        "label": "FLEX THE TIMING",
        "say": "For sure — what day works best that week? I'm pretty flexible.",
        "note": "Give them the control but keep it specific. As soon as they name a day, propose a time on that day.",
        "branches": [
          {
            "label": "Names a day",
            "to": "meeting_confirm"
          },
          {
            "label": "'I'll email you'",
            "to": "send_email"
          }
        ]
      },
      "meeting_confirm": {
        "label": "MEETING BOOKED",
        "say": "Perfect — I'll send that invite over right now. Really appreciate you taking my call, Joe. I know cold calls aren't exactly the highlight of anyone's day. Talk soon.",
        "note": "STOP SELLING. Meeting is booked. Send the invite immediately while still on the phone if possible. Get off the call. Don't give them a reason to reconsider.",
        "branches": []
      },
      "book_callback": {
        "label": "CALLBACK LOCKED",
        "say": "Perfect — I'll try you then. Appreciate it, Joe.",
        "note": "Get off the phone fast. Set a calendar reminder for the exact callback time. When you call back, open with: 'Hey Joe, it's Sam Parks — you told me to try you back today.'",
        "branches": []
      },
      "end_graceful": {
        "label": "END GRACEFULLY",
        "say": "Totally understand, Joe. If anything changes on your end, I'm easy to find — Sam Parks, RapidEye. Appreciate your time.",
        "note": "Don't burn the bridge. Be genuinely warm. Joe is President of a 40,000-property company — even if this call didn't land, he might mention you to his ops team, or you call back in three months with a different angle. Leave a good taste.",
        "branches": []
      }
    }
  }
}