{
  "name": "Jon Eskin",
  "title": "General Manager, Vacation Rental Program / Property Management",
  "company": "Berkshire Hathaway HomeServices Colorado Properties",
  "location": "Vail, CO",
  "phone": "+1-970-790-7500",
  "company_phone": "+1-970-476-3800",
  "alt_phones": [],
  "flow": {
    "context": "Jon Eskin is the General Manager of the Vacation Rental Program at Berkshire Hathaway HomeServices Colorado Properties in Vail, CO. He's the named point of contact on their owner acquisition page — property owners call him directly to join the program. He controls inspections, housekeeping, maintenance, and damage protection for their entire vacation rental portfolio, which has operated since 1992 with long-tenured staff. They use HomeAway PM software for work orders, distribute across 50+ booking sites, inspect prior to guest arrivals, and have deployed in-residence tablets — signaling openness to operational tech. Sam skied Jackson Hole last month and Jon lives in ski country during peak season, which means peak turnover volume right now.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Jon — I actually just got back from Jackson Hole last month, so I've had ski towns on the brain. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Feet up on the desk energy. You're a skier calling a ski town guy — let that come through naturally. Don't rush past the Jackson Hole line. Pause after 'tossed around' and let him answer.",
        "branches": [
          {
            "label": "Yes / Maybe / Sounds familiar",
            "to": "heard_yes"
          },
          {
            "label": "No, I haven't",
            "to": "heard_no"
          },
          {
            "label": "Who is this? / What's this about?",
            "to": "who_is_this"
          },
          {
            "label": "Bad timing / I'm busy",
            "to": "bad_timing"
          }
        ]
      },
      "heard_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone in your shoes. What did you hear?",
        "note": "Rare but great. Let him talk. Whatever he says, transition to discovery. Don't correct him if he's slightly off — just roll with it.",
        "branches": [
          {
            "label": "Describes something / asks a question",
            "to": "warm_discovery"
          },
          {
            "label": "Vague / 'not sure exactly'",
            "to": "pain_trigger"
          }
        ]
      },
      "heard_no": {
        "label": "HAVEN'T HEARD — TRANSITION",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call is — I work with a few other vacation rental managers in ski markets, and your name kept coming up as the guy running the program out in Vail.",
        "note": "Self-deprecating humor breaks tension. Then validate him — 'your name kept coming up' makes him feel known, not targeted. Go straight to pain trigger.",
        "branches": [
          {
            "label": "Okay... / listening",
            "to": "pain_trigger"
          },
          {
            "label": "What do you do? / What's RapidEye?",
            "to": "pain_trigger"
          },
          {
            "label": "I'm not interested",
            "to": "objection_not_interested"
          },
          {
            "label": "Bad timing",
            "to": "bad_timing"
          }
        ]
      },
      "who_is_this": {
        "label": "WHO IS THIS / WHAT'S THIS ABOUT",
        "say": "Yeah totally fair — it is a cold call. I'm Sam Parks with RapidEye. Can I get 30 seconds to tell you why I called you specifically, and if it's not relevant you can totally hang up on me?",
        "note": "Honesty disarms. Saying 'you specifically' signals this isn't spray-and-pray. The permission ask gives him control, which paradoxically makes him more likely to listen.",
        "branches": [
          {
            "label": "Sure / go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "No thanks / not interested",
            "to": "permission_rejected"
          },
          {
            "label": "Make it quick",
            "to": "pain_trigger"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow, maybe early afternoon?",
        "note": "Don't fight it. Suggest a specific time so it's not vague. If he gives you a different time, take it and lock it in.",
        "branches": [
          {
            "label": "Sure, call me back / gives a time",
            "to": "bad_timing_lock"
          },
          {
            "label": "Just email me",
            "to": "send_email"
          },
          {
            "label": "Actually, what's this about? (curiosity)",
            "to": "pain_trigger"
          },
          {
            "label": "Don't call back / not interested",
            "to": "end_graceful"
          }
        ]
      },
      "bad_timing_lock": {
        "label": "LOCK CALLBACK TIME",
        "say": "Perfect — I'll try you then. It's Sam Parks, RapidEye. Appreciate it, Jon.",
        "note": "Keep it short. Put the callback in your calendar immediately. Don't try to sneak in a pitch. Call back at exactly the time you agreed on.",
        "branches": []
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and this just isn't interesting?",
        "note": "This split question often reopens the conversation. People feel compelled to clarify which one, and that gives you an opening.",
        "branches": [
          {
            "label": "It's a bad time",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / we're good",
            "to": "objection_not_interested_split"
          },
          {
            "label": "What do you do? (curiosity)",
            "to": "pain_trigger"
          },
          {
            "label": "Hard no / hangs up",
            "to": "end_graceful"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER — THE PROBLEM",
        "say": "So I work with another property manager running a pretty similar operation to yours — ski market, premium rentals, high-turnover weekends. And the thing that kept eating his time was the inspection photos. His housekeepers were taking hundreds of photos every turnover, and nobody actually had time to review them all before the next guest checked in. So stuff would slip through — a chipped countertop here, a missing throw pillow there, a stain on a sofa — and they wouldn't catch it until the guest complained or the owner noticed on their next visit. And then it's a whole fire drill figuring out which guest caused it and whether they can even charge the damage deposit anymore.",
        "note": "This is the money moment. Paint the picture — he should be nodding. His team does pre-arrival inspections and handles damage claims under their policies. This IS his life. Pause at the end. Let him react. Do NOT jump to the solution yet.",
        "branches": [
          {
            "label": "Yeah, that sounds familiar / we deal with that",
            "to": "pain_acknowledged"
          },
          {
            "label": "Listening / tell me more",
            "to": "solution_and_cta"
          },
          {
            "label": "We actually handle that pretty well",
            "to": "objection_have_process"
          },
          {
            "label": "Tries to cut you off / not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "pain_acknowledged": {
        "label": "PAIN ACKNOWLEDGED — DIG DEEPER",
        "say": "Yeah, that's what I keep hearing. Especially right now in peak ski season — I imagine your turnover volume is pretty intense. What does that process look like for you guys right now? Are your housekeepers taking photos on every turn?",
        "note": "He acknowledged the pain. Now STOP PITCHING. Ask questions. You're in discovery mode. The ski season comment is timely — it's January in Vail, peak season. Let him talk.",
        "branches": [
          {
            "label": "Describes their process",
            "to": "discovery_deep_dive"
          },
          {
            "label": "Yeah but what do you actually do?",
            "to": "solution_and_cta"
          },
          {
            "label": "We don't really take photos / no formal process",
            "to": "discovery_no_photos"
          }
        ]
      },
      "solution_and_cta": {
        "label": "ONE-SENTENCE SOLUTION + CTA",
        "say": "So what we built — we're an AI that plugs into whatever your cleaners are already using to take turnover photos and actually analyzes every image. Catches damage, missing items, staging issues — before the next guest walks in. No workflow change on your end. Would you be open to taking a look when I'm not cold calling you out of the blue?",
        "note": "One sentence on the product. That's it. Don't oversell. The CTA is low-friction — you're asking for a meeting, not a purchase. Pause after the question and let him respond.",
        "branches": [
          {
            "label": "Sure / yeah I'd look at that",
            "to": "book_meeting"
          },
          {
            "label": "Tell me more / how does it work?",
            "to": "warm_discovery"
          },
          {
            "label": "Just send me something",
            "to": "send_email"
          },
          {
            "label": "We don't have budget for that",
            "to": "objection_no_budget"
          },
          {
            "label": "We already have a process for this",
            "to": "objection_have_process"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "warm_discovery": {
        "label": "THEY'RE WARM — ASK QUESTIONS",
        "say": "Awesome — honestly the best thing I could do is understand how you guys are set up right now. What does your inspection process look like between guests? Are your housekeepers documenting everything, or is there a separate person doing walkthroughs?",
        "note": "STOP PITCHING. You're in discovery. Listen more than you talk. Key things to learn: (1) who takes photos, (2) where photos go, (3) how damage is tracked, (4) what falls through the cracks. They use HomeAway PM software — if he mentions it, note it for the integration angle.",
        "branches": [
          {
            "label": "Describes process in detail",
            "to": "discovery_deep_dive"
          },
          {
            "label": "It's pretty manual / basic",
            "to": "discovery_manual_process"
          },
          {
            "label": "Turns it around — what do you cost?",
            "to": "handle_price_question"
          }
        ]
      },
      "discovery_deep_dive": {
        "label": "DEEP DISCOVERY — THEIR PROCESS",
        "say": "That makes sense. And when your team does find something — like damage between guests — how are you handling that right now? Is that flowing through your system as a work order, or is it more ad hoc?",
        "note": "You know they use HomeAway PM software for work orders. You can reference 'your system' without naming it — if he confirms or names it, you look informed. If he corrects you, take note. The goal is to understand the damage-to-work-order pipeline.",
        "branches": [
          {
            "label": "Yeah we use HomeAway / confirms work order flow",
            "to": "discovery_integration_angle"
          },
          {
            "label": "We use something else now",
            "to": "discovery_integration_angle"
          },
          {
            "label": "It's mostly manual / text and email",
            "to": "discovery_manual_process"
          },
          {
            "label": "Ready to see a demo",
            "to": "book_meeting"
          }
        ]
      },
      "discovery_integration_angle": {
        "label": "INTEGRATION CONVERSATION",
        "say": "Got it. So the cool thing is we plug right into that workflow — the photos your team's already taking get analyzed automatically, and anything flagged can feed right into a work order. No new app for your cleaners to learn, no extra steps. The property managers we work with — one group's running about 200 luxury units in New York, another has about 600 properties on the East Coast — they're basically using it as a second set of eyes on every single turn. Would it make sense to carve out 20 minutes so I can show you what it actually looks like with a setup similar to yours?",
        "note": "Social proof with real numbers. Don't name clients unless you have permission. The integration angle matters for Jon — he doesn't want to disrupt a team with 10+ year tenure. Position as zero-friction overlay.",
        "branches": [
          {
            "label": "Yeah let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "I'd need to loop in someone else",
            "to": "referral_loop_someone"
          },
          {
            "label": "How much does it cost?",
            "to": "handle_price_question"
          }
        ]
      },
      "discovery_manual_process": {
        "label": "MANUAL PROCESS — AMPLIFY THE GAP",
        "say": "Yeah, that's super common. And honestly with a team that's been doing this since '92, I'm sure the quality of your people is solid. The gap I keep hearing about is just volume — especially during peak season, even the best inspector can't catch everything when they're turning ten units in a day. That's really all we solve for — a second set of eyes on the photos your team's already taking. Would it be worth 20 minutes to see if it even applies to how you're set up?",
        "note": "Compliment the team — they pride themselves on long tenure and quality. Frame RapidEye as augmenting, not replacing. The 'since 92' reference shows you know them without being creepy. Low-friction CTA.",
        "branches": [
          {
            "label": "Sure, let's take a look",
            "to": "book_meeting"
          },
          {
            "label": "How much does it cost?",
            "to": "handle_price_question"
          },
          {
            "label": "I'm not sure we need that",
            "to": "objection_have_process"
          },
          {
            "label": "Send me info",
            "to": "send_email"
          }
        ]
      },
      "discovery_no_photos": {
        "label": "NO FORMAL PHOTO PROCESS",
        "say": "Oh interesting — so when there's a damage dispute with a guest, how are you guys documenting that? Is it more of an after-the-fact thing?",
        "note": "If they don't take systematic photos, there's actually a bigger pain around damage disputes and owner accountability. Dig into how they prove damage happened. This could be an even larger opportunity — RapidEye could establish their baseline documentation.",
        "branches": [
          {
            "label": "Describes ad hoc process",
            "to": "solution_and_cta"
          },
          {
            "label": "We don't have many damage issues",
            "to": "objection_not_interested"
          },
          {
            "label": "Good question — we should be doing more",
            "to": "solution_and_cta"
          }
        ]
      },
      "handle_price_question": {
        "label": "PRICING QUESTION",
        "say": "Totally fair question. Honestly it depends on the number of units and turnover frequency, so I don't want to throw out a number that's way off. What I can tell you is it's a per-property monthly fee, and most of our PMs see ROI from the first damage claim they catch. Would it make more sense to jump on a quick call where I can give you real numbers based on your actual setup?",
        "note": "Don't quote pricing on a cold call. Deflect to the meeting. The ROI framing is real — one caught damage claim often pays for months of the service. If he pushes, give a directional range.",
        "branches": [
          {
            "label": "Yeah let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "Just ballpark me",
            "to": "handle_price_pushback"
          },
          {
            "label": "Send me pricing info",
            "to": "send_email"
          }
        ]
      },
      "handle_price_pushback": {
        "label": "PRICE PUSHBACK — GIVE A RANGE",
        "say": "Look, I'll be straight with you — for a portfolio like yours we're talking a few hundred bucks a month, not thousands. The PMs we work with usually frame it as less than the cost of one missed damage claim per quarter. But the real answer depends on how many units you'd want to run through it. That's why 20 minutes would actually save us both time — I can pull up real numbers instead of guessing. How's next Tuesday or Wednesday look?",
        "note": "He wants a number — give a directional range so he doesn't feel stonewalled. Then pivot right back to the meeting. Offer two specific days.",
        "branches": [
          {
            "label": "Agrees to meeting",
            "to": "book_meeting"
          },
          {
            "label": "Send me info first",
            "to": "send_email"
          },
          {
            "label": "Not in the budget",
            "to": "objection_no_budget"
          }
        ]
      },
      "objection_no_budget": {
        "label": "NO BUDGET OBJECTION",
        "say": "Totally get it. Nowadays it's harder to keep a tool than it is to buy something new. Just so no one from my team cold calls you again — is it that budget for something like this is completely off the table, or is it more that anything you'd want to try has to go through the ringer to get approved?",
        "note": "Agree first — surprise him by not pushing back. Then split the objection. If it's an approval issue, there's an opportunity to help him build the case or go directly to Michael Slevin. If budget is truly dead, pivot to the test-drive play.",
        "branches": [
          {
            "label": "It's tight right now / end of cycle",
            "to": "sell_test_drive"
          },
          {
            "label": "Everything goes through Michael / corporate",
            "to": "objection_corporate_approval"
          },
          {
            "label": "We're just not spending on new tools",
            "to": "sell_test_drive"
          },
          {
            "label": "Hard no",
            "to": "end_graceful"
          }
        ]
      },
      "objection_not_interested": {
        "label": "NOT INTERESTED OBJECTION",
        "say": "I totally get it — I should've assumed you'd be all set. Otherwise you probably would've reached out to us. Just so no one from my team bugs you again — is it that inspection quality isn't really a problem you're focused on right now, or is it more that you just hate cold calls?",
        "note": "Self-deprecating and non-threatening. The split question almost always gets a real answer. If it's 'hate cold calls' you can recover. If it's 'not a problem,' dig into why.",
        "branches": [
          {
            "label": "I just hate cold calls",
            "to": "objection_not_interested_recover"
          },
          {
            "label": "We've got it handled / not a priority",
            "to": "objection_not_interested_split"
          },
          {
            "label": "Lightens up / 'well, tell me more'",
            "to": "pain_trigger"
          },
          {
            "label": "Hard no / hangs up",
            "to": "end_graceful"
          }
        ]
      },
      "objection_not_interested_recover": {
        "label": "HATES COLD CALLS — RECOVER",
        "say": "Ha — you and me both, honestly. Look, I won't keep you. But if nothing else, I could shoot you a two-minute video showing what we're doing with a couple other ski-market PMs. Worst case you see what's out there and we never talk again. Fair enough?",
        "note": "Match his energy — if he's annoyed, don't be chipper. The video offer is low-friction and gives you a reason to follow up. If he agrees, get his email and send it within the hour.",
        "branches": [
          {
            "label": "Sure, send it over",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "end_graceful"
          }
        ]
      },
      "objection_not_interested_split": {
        "label": "NOT A PRIORITY — DIG IN",
        "say": "Makes total sense — with a team that's been running since '92 you'd have to have something solid in place. Out of curiosity, when your team does catch damage between guests, how long does it usually take to figure out who to charge? That's the piece I keep hearing kills the most time.",
        "note": "Acknowledge their maturity. Then ask a specific question about damage attribution — even great teams struggle here. Their site says 'damages beyond normal wear and tear are covered under our policies' so you know this is real for them. If he engages, you're back in the conversation.",
        "branches": [
          {
            "label": "Admits it's a pain / takes a while",
            "to": "solution_and_cta"
          },
          {
            "label": "We handle it fine",
            "to": "sell_test_drive"
          },
          {
            "label": "That's really more someone else's area",
            "to": "referral_not_right_person"
          }
        ]
      },
      "objection_have_process": {
        "label": "ALREADY HAVE A PROCESS",
        "say": "That makes total sense — with your portfolio you'd have to have something dialed in. Just out of curiosity — is it that you're fully covered and happy with how it works, or is it more that switching anything right now during peak season would be a nightmare?",
        "note": "Split the objection. 'Fully covered and happy' is rare — most people admit there are gaps. 'Switching during peak season' means they might look after April. Either way, you learn something useful.",
        "branches": [
          {
            "label": "We're happy with what we have",
            "to": "sell_test_drive"
          },
          {
            "label": "Timing is bad / after ski season",
            "to": "sell_test_drive_seasonal"
          },
          {
            "label": "It works but it's not perfect",
            "to": "warm_discovery"
          },
          {
            "label": "Who told you about our process?",
            "to": "deflect_source"
          }
        ]
      },
      "objection_corporate_approval": {
        "label": "CORPORATE / EXEC APPROVAL NEEDED",
        "say": "Yeah, that makes total sense. Would it help if I put together something specific to your operation that you could float up? Or would it make more sense for me to reach out to Michael Slevin directly so it's not all on your plate?",
        "note": "You know Michael Slevin is President and Owner. Dropping his name shows you've done homework and takes pressure off Jon. If he wants you to go to Michael, that's a warm referral. If he wants to own it, help him build the case.",
        "branches": [
          {
            "label": "Yeah talk to Michael",
            "to": "referral_to_michael"
          },
          {
            "label": "Let me handle it — send me info",
            "to": "send_email"
          },
          {
            "label": "Let's set up a call with both of us",
            "to": "book_meeting"
          }
        ]
      },
      "referral_to_michael": {
        "label": "REFERRAL TO MICHAEL SLEVIN",
        "say": "Perfect — would you mind if I mentioned you pointed me his way? Just so it doesn't land cold on his desk too. What's the best way to reach him?",
        "note": "Get permission to use Jon's name. Even though you have Michael's number (970-390-9440), ask Jon — it validates the referral and makes Jon feel involved. If Jon offers to intro you directly, even better.",
        "branches": [
          {
            "label": "Gives contact info / offers to intro",
            "to": "referral_confirm"
          },
          {
            "label": "Just reach out to him directly",
            "to": "referral_confirm"
          }
        ]
      },
      "referral_confirm": {
        "label": "CONFIRM REFERRAL",
        "say": "Really appreciate that, Jon. I'll reach out to him this week and mention we spoke. And hey — if you want to be on the call too, you're more than welcome. I'll send you both a quick note. Thanks for your time.",
        "note": "Include Jon on any outreach to Michael. He's your internal champion now. Send the follow-up email within the hour while the conversation is fresh.",
        "branches": []
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Look, you're probably not buying anything off a cold call, and I totally respect that. But the property managers who end up working with us are usually the ones who took a look early — before they even had budget — just so they knew what was out there. If nothing else, I could walk you through what a couple other ski-market PMs are doing with their turnover photos. Worst case you steal some ideas and we part as friends. Would 20 minutes be worth it?",
        "note": "The 'steal some ideas' line works because it's genuine value with no commitment. He learns something either way. If he says yes, book it NOW. Don't let it stay vague.",
        "branches": [
          {
            "label": "Sure, why not",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "end_graceful"
          },
          {
            "label": "Maybe after ski season",
            "to": "sell_test_drive_seasonal"
          }
        ]
      },
      "sell_test_drive_seasonal": {
        "label": "AFTER SKI SEASON — LOCK A DATE",
        "say": "Totally makes sense — you're in the middle of the war right now. What if we penciled something in for late April, early May? That way it's on the calendar but there's no pressure during your busiest stretch. Would that work?",
        "note": "Ski season in Vail typically winds down mid-to-late April. Offering a post-season date shows you understand his business cycle. Even a loose calendar hold keeps you in the picture. Try to get a specific week.",
        "branches": [
          {
            "label": "Yeah, let's do that",
            "to": "book_meeting"
          },
          {
            "label": "Just follow up with me then",
            "to": "send_email_seasonal"
          },
          {
            "label": "I'll reach out if I'm interested",
            "to": "end_graceful"
          }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question so I don't just send you a generic deck — what would be most relevant to include? Is it more the damage-detection side, or is it the inspection-workflow piece that would catch your eye?",
        "note": "Always ask what to include. It tells you what he cares about AND keeps the conversation going for another 30 seconds. Whatever he says, tailor the email to exactly that and include a specific time suggestion for a follow-up call.",
        "branches": [
          {
            "label": "Gives direction on what to include",
            "to": "send_email_confirm"
          },
          {
            "label": "Just send whatever / general info",
            "to": "send_email_confirm"
          }
        ]
      },
      "send_email_confirm": {
        "label": "CONFIRM EMAIL + PLANT FOLLOW-UP",
        "say": "Got it — I'll send that over today. And I'll throw a couple of times in there in case you want to hop on a quick call after you've looked at it. What's the best email for you?",
        "note": "Get his email directly — don't rely on the Cloudflare-obfuscated site. The 'couple of times' in the email plants the seed for a follow-up without being pushy. Send within the hour.",
        "branches": [
          {
            "label": "Gives email",
            "to": "end_positive"
          },
          {
            "label": "Just use the one on the website",
            "to": "end_positive"
          }
        ]
      },
      "send_email_seasonal": {
        "label": "SEASONAL FOLLOW-UP EMAIL",
        "say": "Will do. I'll drop you a note in mid-April so it's on your radar when things slow down. What's the best email to reach you at?",
        "note": "Get the email. Set a calendar reminder for mid-April. Reference this conversation in the follow-up: 'We talked in January during peak season and you mentioned after ski season would be better timing.'",
        "branches": [
          {
            "label": "Gives email",
            "to": "end_positive"
          },
          {
            "label": "Just call back then",
            "to": "end_positive"
          }
        ]
      },
      "referral_not_right_person": {
        "label": "NOT THE RIGHT PERSON",
        "say": "Totally hear you. Who on your team would typically own the inspection workflow — is there a housekeeping director or someone running QC on turnovers?",
        "note": "Their website doesn't publicly name a housekeeping or maintenance lead. This is your chance to get that name. If he gives you a name, ask for their direct line or email. If he says it's actually him but he's not interested, respect it.",
        "branches": [
          {
            "label": "Gives a name / title",
            "to": "referral_get_name"
          },
          {
            "label": "That's actually me, but...",
            "to": "pain_trigger"
          },
          {
            "label": "Try Michael Slevin",
            "to": "referral_to_michael"
          },
          {
            "label": "I don't want to give that out",
            "to": "end_graceful"
          }
        ]
      },
      "referral_get_name": {
        "label": "GET THE REFERRAL NAME",
        "say": "Perfect — and what's the best way to reach them? If I can mention you pointed me their way, I'll put something tailored together so it actually lands instead of just being another cold email.",
        "note": "Ask for name, direct number, and permission to use Jon's name. This is gold — an internal referral from the GM. Send a personalized note the same day.",
        "branches": [
          {
            "label": "Gives contact info",
            "to": "referral_confirm"
          },
          {
            "label": "I'll pass your info along to them",
            "to": "referral_passive"
          }
        ]
      },
      "referral_passive": {
        "label": "THEY'LL PASS YOUR INFO",
        "say": "Appreciate that. I'll shoot you a quick email with a summary they can forward — just something short so they know what it's about. And if they want to reach me directly, I'm easy to find. Thanks Jon, really appreciate you taking my call.",
        "note": "Passive referrals rarely convert on their own. Send the email immediately, then follow up in a week. If you don't hear back, try calling the main reservations line (970-476-3800) and ask for the housekeeping or inspections manager by title.",
        "branches": []
      },
      "referral_loop_someone": {
        "label": "NEEDS TO LOOP SOMEONE IN",
        "say": "Absolutely — who would you want on the call? I'm happy to set it up so everyone sees the same thing at once.",
        "note": "If he mentions Michael Slevin, great — you've got context on him. If he mentions a housekeeping lead or ops person, get their name and contact info. Try to book the multi-person meeting right now while you have momentum.",
        "branches": [
          {
            "label": "Mentions a specific person",
            "to": "book_meeting"
          },
          {
            "label": "Let me figure it out and get back to you",
            "to": "send_email"
          }
        ]
      },
      "deflect_source": {
        "label": "DEFLECT 'WHO TOLD YOU' QUESTION",
        "say": "Ha — nobody shared anything internal, I promise. Your website actually talks about inspections and maintenance as a core part of the program, so it was pretty clear you guys take that seriously. That's really why I called — we usually work with PMs who already have high standards and just want a way to scale the consistency.",
        "note": "Be transparent — he may be protective of internal info. Complimenting their standards disarms defensiveness. Then redirect to the value prop.",
        "branches": [
          {
            "label": "Okay, tell me more",
            "to": "solution_and_cta"
          },
          {
            "label": "Still not interested",
            "to": "end_graceful"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Perfect — I've got next week pulled up. Would Tuesday or Wednesday work better for you? I'm flexible on time.",
        "note": "Pick two specific days. Don't say 'whenever works' — that stalls. If he picks a day, narrow to morning or afternoon, then lock a specific time. Send the calendar invite WHILE ON THE PHONE if possible.",
        "branches": [
          {
            "label": "Picks a day/time",
            "to": "book_meeting_confirm"
          },
          {
            "label": "Let me check and get back to you",
            "to": "book_meeting_nudge"
          }
        ]
      },
      "book_meeting_nudge": {
        "label": "NUDGE TO LOCK A TIME",
        "say": "Totally — how about I send over an invite for Wednesday at 2 and you can always move it if something comes up? That way it's at least on the calendar and neither of us has to play email tag.",
        "note": "The 'send it and you can move it' approach works because it reduces friction. A tentative hold beats 'I'll get back to you' every time. If he agrees, send it immediately.",
        "branches": [
          {
            "label": "Sure, send it",
            "to": "book_meeting_confirm"
          },
          {
            "label": "Just email me some times",
            "to": "send_email_confirm"
          }
        ]
      },
      "book_meeting_confirm": {
        "label": "CONFIRM MEETING — LOCK IT IN",
        "say": "Done — I'll send the invite right now so it's locked in. Really appreciate you taking my call, Jon. And hey, if you ever need a Jackson Hole recommendation, I owe you one. Talk soon.",
        "note": "Send the invite immediately. The ski callback is a personal touch to end on. Once booked, STOP SELLING. Don't add 'and one more thing.' You got the meeting. Celebrate after you hang up.",
        "branches": []
      },
      "end_positive": {
        "label": "POSITIVE ENDING",
        "say": "Sounds good, Jon. I'll get that over to you today. Appreciate your time — enjoy the powder out there.",
        "note": "Keep it warm and short. The Vail ski reference keeps the personal connection alive. Follow up within the hour. Put a task in your CRM to call back in 3-5 days if no reply to the email.",
        "branches": []
      },
      "end_graceful": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes, I'm easy to find. Appreciate your time, Jon.",
        "note": "Don't burn the bridge. No guilt trips, no 'are you sure?' He's a GM in Vail — you might cross paths at a VRMA event or he might change his mind in 6 months. Leave a good impression.",
        "branches": []
      },
      "voicemail": {
        "label": "VOICEMAIL",
        "say": "Hey Jon, it's Sam Parks — I work with a few vacation rental managers in ski markets on their inspection workflows. Had a quick question about how you guys are handling turnover photos during peak season. My number is [your number]. Again, it's Sam Parks with RapidEye. Thanks.",
        "note": "Keep it under 20 seconds. Don't pitch. The 'quick question' creates curiosity. Say your number slowly and clearly. Follow up with a short email referencing the voicemail. Try calling again in 2-3 days at a different time of day.",
        "branches": []
      },
      "someone_else_answers": {
        "label": "SOMEONE ELSE ANSWERS",
        "say": "Hey — could you get me through to Jon? It's Sam.",
        "note": "This is Jon's direct line (970-790-7500) but someone else might pick up. Keep it casual — first name only for both of you. Don't volunteer what it's about. If they ask, go to the next step.",
        "branches": [
          {
            "label": "Transfers you / Jon picks up",
            "to": "opener"
          },
          {
            "label": "Who's calling? / What's this about?",
            "to": "gatekeeper_context"
          },
          {
            "label": "He's not available",
            "to": "gatekeeper_not_available"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER WANTS CONTEXT",
        "say": "Yeah, I work with a few other property managers in the Vail Valley. Would you mind letting him know it's Sam Parks?",
        "note": "Dose info slowly. Don't say 'RapidEye' yet — it sounds like a product pitch. 'Property managers in the Vail Valley' sounds like a peer or partner. If they push further, go to social proof.",
        "branches": [
          {
            "label": "Transfers you",
            "to": "opener"
          },
          {
            "label": "What company? / Still pushing",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "He's not available",
            "to": "gatekeeper_not_available"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "Sure — it's Sam Parks with RapidEye. We help a couple other vacation rental companies with their inspection workflows. I sent Jon a note and just wanted to follow up. Would you mind letting him know?",
        "note": "Now you've given company name and context. 'Sent a note' implies prior contact. If they still won't put you through, get a callback time or ask for Jon's email directly.",
        "branches": [
          {
            "label": "Transfers you",
            "to": "opener"
          },
          {
            "label": "I'll pass the message along",
            "to": "gatekeeper_leave_message"
          },
          {
            "label": "He's not available",
            "to": "gatekeeper_not_available"
          }
        ]
      },
      "gatekeeper_not_available": {
        "label": "JON NOT AVAILABLE",
        "say": "No worries — when's a good time to catch him? I want to make sure I'm not calling during the craziest part of his day.",
        "note": "Get a specific callback time. If they won't give one, ask 'are mornings or afternoons usually better for him?' Any intel helps. Then try again at that time.",
        "branches": [
          {
            "label": "Gives a time / suggestion",
            "to": "gatekeeper_leave_message"
          },
          {
            "label": "Just leave a message",
            "to": "gatekeeper_leave_message"
          }
        ]
      },
      "gatekeeper_leave_message": {
        "label": "LEAVE MESSAGE WITH GATEKEEPER",
        "say": "Perfect — just let him know Sam Parks called, and I'll try him again. Appreciate your help.",
        "note": "Keep it simple. Don't ask the gatekeeper to relay a pitch. Just your name. Then call back at the suggested time. Also send a short email so Jon sees your name twice before the next attempt.",
        "branches": []
      }
    }
  }
}