{
  "name": "Jon Eskin",
  "title": "General Manager, Vacation Rental Program / Property Management",
  "company": "Berkshire Hathaway HomeServices Colorado Properties",
  "location": "Vail, CO",
  "phone": "+1-970-790-7500",
  "company_phone": "+1-970-476-3800",
  "alt_phones": [],
  "flow": {
    "context": "Jon Eskin is the General Manager of BHHS Colorado Properties' vacation rental program covering Vail and Beaver Creek — he's the person owners are told to call, meaning he owns inspections, housekeeping, maintenance, and damage disputes. The program has run since 1992 with long-tenured staff (10+ years), they inspect before every guest arrival, use HomeAway PM software for work orders, distribute across 50+ sites, and maintain a 35K repeat-guest database. They also deployed an in-residence tablet, so they're not anti-tech. Strongest connection to Sam: Sam just went skiing at Jackson Hole in January 2026 and Jon lives and works in Vail — ski-town operator to ski-town visitor is a natural peer-level icebreaker.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Jon — this is gonna sound random, but I was just out in Jackson Hole skiing a couple weeks ago and I've been working with a few vacation rental operators in ski towns out west. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Feet-up energy. You're a guy who just skied Jackson Hole calling a guy in Vail — peer to peer, not salesperson to prospect. Pause after the question and wait.",
        "branches": [
          {
            "label": "No, I haven't heard of you",
            "to": "not_popular"
          },
          {
            "label": "Yeah / maybe / sounds familiar",
            "to": "heard_of_us"
          },
          {
            "label": "Who? What's this about?",
            "to": "not_popular"
          },
          {
            "label": "Now's not a good time",
            "to": "bad_timing"
          }
        ]
      },
      "not_popular": {
        "label": "NOT POPULAR PIVOT — PAIN TRIGGER",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call — I work with a couple other vacation rental managers who run a pretty similar operation to yours. Full-service, high-end properties, inspections before every arrival. And the thing I keep hearing is the same problem. Their team's doing walkthroughs, taking photos, doing everything right — but stuff still slips through. A guest checks in, finds a stain on the couch or a missing set of towels, and suddenly the five-star review turns into a three-star complaint. And the GM's the one who hears about it. We built a tool that plugs into the inspection photos your team's already taking and uses AI to catch the stuff human eyes miss — damage, missing items, staging issues. Would you be open to seeing what that looks like? I promise I won't take more than fifteen minutes when I'm not cold calling you out of the blue.",
        "note": "Paint the picture — he lives this daily. Pause after 'the GM's the one who hears about it.' If he jumps in with his own story, STOP and let him talk. Don't barrel through to the pitch.",
        "branches": [
          {
            "label": "Tells you about their process / engages",
            "to": "warm_discovery"
          },
          {
            "label": "Yeah I'd take a look / sure",
            "to": "book_meeting"
          },
          {
            "label": "We're pretty set / have a process",
            "to": "obj_have_process"
          },
          {
            "label": "Not interested",
            "to": "obj_not_interested"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          },
          {
            "label": "No budget for that",
            "to": "obj_no_budget"
          }
        ]
      },
      "heard_of_us": {
        "label": "HEARD OF US",
        "say": "Oh nice — well normally we'd be working with someone like you on the inspection side. What'd you hear?",
        "note": "Let him talk. Whatever he says, bridge it to discovery or the pain trigger depending on how warm it is.",
        "branches": [
          {
            "label": "Describes what they heard / knows something",
            "to": "warm_discovery"
          },
          {
            "label": "Not sure / vague / confusing me with someone",
            "to": "not_popular"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow or later this week? I'll be quick, I promise.",
        "note": "Don't pitch now. Just lock down a callback window. Respect the timing.",
        "branches": [
          {
            "label": "Gives a better time",
            "to": "lock_callback"
          },
          {
            "label": "Just tell me what it is real quick",
            "to": "not_popular"
          },
          {
            "label": "No, don't call back",
            "to": "graceful_exit"
          }
        ]
      },
      "lock_callback": {
        "label": "LOCK CALLBACK",
        "say": "Perfect — I've got my calendar pulled up. Would morning or afternoon work better? I'll keep it to ten minutes max.",
        "note": "Get a specific day AND time. Don't leave it as 'sometime next week.' Confirm it back to them before hanging up.",
        "branches": [
          {
            "label": "Gives a specific time",
            "to": "confirm_callback"
          },
          {
            "label": "Just email me instead",
            "to": "send_email"
          }
        ]
      },
      "confirm_callback": {
        "label": "CONFIRM CALLBACK",
        "say": "Got it — I'll give you a ring then. Really appreciate it, Jon. Talk soon.",
        "note": "Stop selling. You got the callback. End warm and hang up.",
        "branches": []
      },
      "warm_discovery": {
        "label": "WARM — ASK QUESTIONS",
        "say": "That's actually really helpful. So just so I'm not wasting your time — what does the inspection process look like for you guys right now? Are your cleaners taking photos after every turnover, or is it more of a walkthrough situation?",
        "note": "STOP PITCHING. He's warm. You know they inspect before arrivals and use HomeAway PM software. Let him confirm and elaborate. Listen for the pain you can mirror back later.",
        "branches": [
          {
            "label": "Describes their process — photos, walkthroughs, etc.",
            "to": "dig_deeper"
          },
          {
            "label": "We use HomeAway / our software handles it",
            "to": "tech_stack_probe"
          },
          {
            "label": "We have a pretty solid system already",
            "to": "validate_then_probe"
          }
        ]
      },
      "dig_deeper": {
        "label": "DIG INTO PAIN",
        "say": "Got it. And when something does slip through — a guest finds damage or something's off after check-in — how does that usually play out? Does it come back to you, or does someone on your team handle the dispute side?",
        "note": "You're looking for who feels the pain of missed issues. As GM, it almost certainly rolls up to Jon. Give him space to vent.",
        "branches": [
          {
            "label": "Yeah it comes to me / describes frustration",
            "to": "mirror_pain"
          },
          {
            "label": "We have a housekeeping lead who handles it",
            "to": "referral_path"
          },
          {
            "label": "It doesn't happen much honestly",
            "to": "seasonal_probe"
          }
        ]
      },
      "tech_stack_probe": {
        "label": "TECH STACK PROBE",
        "say": "Makes sense — I know you guys use the HomeAway PM software for work orders and accounting. Are you running inspection documentation through that same system, or is that a separate workflow?",
        "note": "Show you did your homework. This tells you where their photos live today and whether there's a clean integration path.",
        "branches": [
          {
            "label": "Describes their photo / inspection workflow",
            "to": "dig_deeper"
          },
          {
            "label": "Surprised you know that — how do you know?",
            "to": "credibility_build"
          },
          {
            "label": "It's all handled through our system",
            "to": "validate_then_probe"
          }
        ]
      },
      "credibility_build": {
        "label": "CREDIBILITY BUILD",
        "say": "Ha — I did a little homework before calling. I saw you guys have been running the vacation rental program since '92 and your team's got ten-plus years of tenure. That's honestly rare in this industry. The reason I reached out specifically is because operators at your level — ones who already take inspections seriously — are the ones who get the most out of what we built. You're not starting from zero. You're just looking for a way to catch the last five percent that slips through.",
        "note": "Use the research to build credibility and reframe the pitch: RapidEye isn't for broken operations, it's for good operations that want to be bulletproof. Pause and let him react.",
        "branches": [
          {
            "label": "Intrigued / tells you more about their operation",
            "to": "warm_discovery"
          },
          {
            "label": "What exactly does your thing do?",
            "to": "one_sentence_solution"
          },
          {
            "label": "We're pretty tight on what we have",
            "to": "obj_have_process"
          }
        ]
      },
      "validate_then_probe": {
        "label": "VALIDATE THEN PROBE",
        "say": "That makes total sense — with the tenure your team has, I'd expect that. Here's what I'm curious about though. During peak ski season when turnovers are back to back — is there ever a gap between what gets documented and what actually gets caught? Or do you feel like your team catches everything every single time?",
        "note": "Nobody catches everything every time. You're giving him permission to admit the gap without feeling like he's criticizing his team. Pause and let him answer honestly.",
        "branches": [
          {
            "label": "Admits there's a gap sometimes",
            "to": "mirror_pain"
          },
          {
            "label": "We're pretty good / defends the team",
            "to": "seasonal_probe"
          },
          {
            "label": "Opens up about specific challenges",
            "to": "mirror_pain"
          }
        ]
      },
      "mirror_pain": {
        "label": "MIRROR THEIR PAIN",
        "say": "Yeah — that's exactly what I hear from other operators in the Valley. It's not a people problem, it's a volume problem. When you've got back-to-back turnovers in January and your team's grinding, things just get missed. And then the owner calls you asking why their Restoration Hardware sofa has a new scratch and nobody documented it before the guest checked in. That's specifically what we built RapidEye to solve. Would it make sense to block fifteen minutes later this week so I can show you what it actually looks like? Worst case you steal some ideas from what other ski-town PMs are doing.",
        "note": "Tie his specific pain to the CTA. The 'Restoration Hardware sofa' detail makes it visceral — Vail properties are expensive. 'Worst case you steal some ideas' lowers the stakes. Go for the meeting NOW.",
        "branches": [
          {
            "label": "Yeah let's do it / sure",
            "to": "book_meeting"
          },
          {
            "label": "What does it actually do though?",
            "to": "one_sentence_solution"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "I'd have to loop someone else in",
            "to": "referral_path"
          }
        ]
      },
      "seasonal_probe": {
        "label": "SEASONAL PROBE",
        "say": "That's great your team's that dialed in. Let me ask you this — heading into next ski season, are you looking at adding units to the program, or is the portfolio staying pretty stable? Because what I hear from other operators is the inspection process that works at fifty units starts cracking at seventy-five or a hundred.",
        "note": "If he won't admit current pain, project it forward. Growth equals future pain. If portfolio is stable, pivot to the damage documentation and owner reporting angle.",
        "branches": [
          {
            "label": "We are growing / adding units",
            "to": "growth_angle"
          },
          {
            "label": "Pretty stable right now",
            "to": "damage_angle"
          },
          {
            "label": "Actually yeah we do have some challenges",
            "to": "mirror_pain"
          }
        ]
      },
      "growth_angle": {
        "label": "GROWTH ANGLE",
        "say": "That's what I figured — Vail market's too strong not to grow right now. So here's the thing. We work with a PM company on the East Coast that went from about four hundred to six hundred units and their inspection quality dropped off a cliff until they plugged us in. We basically analyze every photo their cleaners already take and flag anything that's off before the guest walks in. No workflow change on their end. Would it make sense to jump on a quick call later this week so I can show you how that'd work with your setup?",
        "note": "Social proof with the East Coast 600-unit client. Don't name them unless asked. Keep the CTA simple and specific.",
        "branches": [
          {
            "label": "Sure / let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Who's the company?",
            "to": "social_proof_detail"
          },
          {
            "label": "Not right now",
            "to": "obj_not_interested"
          },
          {
            "label": "Send me info first",
            "to": "send_email"
          }
        ]
      },
      "damage_angle": {
        "label": "DAMAGE ANGLE",
        "say": "Got it. So let me ask you this — on the damage side, I know you guys cover damages beyond normal wear and tear under your policies. When there's a dispute about whether damage was pre-existing or the guest caused it, how are you documenting that today? Is it photo-based, or more of a manual log?",
        "note": "Their website explicitly mentions damage coverage as a selling point to owners. Every undocumented damage is a cost they eat or an owner dispute they can't win. This angle hits the wallet directly.",
        "branches": [
          {
            "label": "Describes their documentation process",
            "to": "mirror_pain"
          },
          {
            "label": "We take photos before and after",
            "to": "one_sentence_solution"
          },
          {
            "label": "That's handled by someone else on the team",
            "to": "referral_path"
          }
        ]
      },
      "one_sentence_solution": {
        "label": "ONE-SENTENCE SOLUTION",
        "say": "So in simple terms — we plug into the photos your team's already taking during turnovers and our AI flags damage, missing items, staging issues automatically. No new workflow, no new app for your cleaners to learn. It just catches the stuff that gets missed when humans are moving fast. We're working with PM companies doing two hundred to six hundred units right now and it's saving them from the 'guest found it first' problem. Worth fifteen minutes to take a look?",
        "note": "One sentence on what it does, one on social proof, one on CTA. Don't go deeper than this. Sell the meeting, not the product.",
        "branches": [
          {
            "label": "Yeah I'd look at that",
            "to": "book_meeting"
          },
          {
            "label": "How does it integrate with our system?",
            "to": "integration_answer"
          },
          {
            "label": "What does it cost?",
            "to": "deflect_price"
          },
          {
            "label": "Not interested / we're set",
            "to": "obj_not_interested"
          },
          {
            "label": "Send me info",
            "to": "send_email"
          }
        ]
      },
      "integration_answer": {
        "label": "INTEGRATION QUESTION",
        "say": "Good question. We plug into the PMS or inspection tool you're already using — so if your team's running things through your HomeAway system or anything else, we sit on top of that. No new app, no new process for your cleaners. That's the whole point — zero workflow change. But honestly that's way easier to show than explain over the phone. Would it make sense to do a quick screen share later this week?",
        "note": "You know they use HomeAway PM software — drop it naturally. Answer briefly, then redirect to the meeting. Don't get into technical weeds on a cold call.",
        "branches": [
          {
            "label": "Sure let's do that",
            "to": "book_meeting"
          },
          {
            "label": "Let me think about it / send me info",
            "to": "send_email"
          },
          {
            "label": "We'd need to involve IT or someone else",
            "to": "referral_path"
          }
        ]
      },
      "deflect_price": {
        "label": "DEFLECT PRICE",
        "say": "Totally fair question. It depends on unit count and how your turnovers flow — but I don't want to throw a number out without actually understanding your setup first. That's part of why I'm suggesting the fifteen minutes. I can walk you through exactly what it'd look like for your operation and give you a real number, not a ballpark. How's later this week?",
        "note": "Never quote price on a cold call. You don't have enough info and any number will sound arbitrary. Redirect to the meeting where you can tie price to value.",
        "branches": [
          {
            "label": "Okay let's set it up",
            "to": "book_meeting"
          },
          {
            "label": "Just give me a ballpark range",
            "to": "deflect_price_again"
          },
          {
            "label": "Send me info with pricing",
            "to": "send_email"
          }
        ]
      },
      "deflect_price_again": {
        "label": "PRICE PUSHBACK",
        "say": "I hear you — I really don't want to give you a garbage number though. What I can tell you is the PM companies we work with are paying less than what one missed damage claim costs them per quarter. That's the math that usually makes it click. Let me show you the whole picture — I've got Thursday afternoon open, does that work?",
        "note": "Reframe price as ROI. One more push for the meeting with a specific day. If he still resists, accept the email route gracefully.",
        "branches": [
          {
            "label": "Okay fine let's do Thursday",
            "to": "book_meeting"
          },
          {
            "label": "Just send me something",
            "to": "send_email"
          }
        ]
      },
      "obj_have_process": {
        "label": "OBJECTION — HAVE A PROCESS",
        "say": "That makes total sense — you guys have been doing this since '92, you'd have to have something dialed in by now. Just so nobody from my team bugs you again — is it that you're fully covered and happy with how inspection documentation works right now, or is it more that adding anything new isn't realistic with everything you've got going on?",
        "note": "Miyagi method: agree genuinely first, then split the objection. If it's timing you can revisit. If it's satisfaction, probe whether it's real or reflexive.",
        "branches": [
          {
            "label": "We're happy with what we have",
            "to": "test_drive_pitch"
          },
          {
            "label": "It's more of a timing thing right now",
            "to": "timing_bridge"
          },
          {
            "label": "A little of both honestly",
            "to": "test_drive_pitch"
          }
        ]
      },
      "obj_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "Totally get it — I should've assumed you'd be all set. Otherwise you probably would've reached out yourself. Just so nobody from my team cold calls you again — is it that inspection quality just isn't a problem you're focused on right now, or is it more that you just hate cold calls? Because honestly I get it either way.",
        "note": "Miyagi: agree first, then split. The humor on 'hate cold calls' usually gets a laugh and loosens them up. Listen to which side they pick.",
        "branches": [
          {
            "label": "It's not a priority right now",
            "to": "timing_bridge"
          },
          {
            "label": "Ha — I just hate cold calls / laughs",
            "to": "permission_fallback"
          },
          {
            "label": "We're really not interested at all",
            "to": "graceful_exit"
          }
        ]
      },
      "obj_no_budget": {
        "label": "OBJECTION — NO BUDGET",
        "say": "Totally get it — nowadays it's hard enough to keep a tool, let alone buy something new. Just so nobody bugs you again — is it that budget for this cycle is completely locked, or is it that anything you try to buy has to go through corporate and it's just a nightmare?",
        "note": "BHHS is a big brand — there may be corporate approval layers even though the local office has some autonomy. The split helps you understand if it's real budget constraint or process friction with the parent company.",
        "branches": [
          {
            "label": "Budget is fully locked right now",
            "to": "test_drive_pitch"
          },
          {
            "label": "It's more of a corporate approval thing",
            "to": "corporate_angle"
          },
          {
            "label": "Both / it's just not happening",
            "to": "graceful_exit"
          }
        ]
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call, I'll fully own that. Can I get thirty seconds to tell you why I actually reached out to you specifically, and you can totally hang up on me if it's not a fit?",
        "note": "Last shot before the exit. If he says yes, go back to the pain trigger. If no, exit gracefully and don't push further.",
        "branches": [
          {
            "label": "Fine, go ahead — thirty seconds",
            "to": "not_popular"
          },
          {
            "label": "No thanks / not right now",
            "to": "graceful_exit"
          }
        ]
      },
      "timing_bridge": {
        "label": "TIMING BRIDGE",
        "say": "That's totally fair. You're probably not buying anything new before ski season winds down anyway. But here's what I've found — the operators who come out of season ready to move are the ones who looked at their options before things got crazy. Would you be open to a quick fifteen minutes sometime in the next couple weeks? No pressure to buy anything — just see what's out there so when timing's right you already know what's on the table.",
        "note": "Sell the test drive. Position the meeting as prep and planning, not a purchase decision. Ski season timing actually works in your favor here — he's busy now but thinking about next season.",
        "branches": [
          {
            "label": "Sure that makes sense",
            "to": "book_meeting"
          },
          {
            "label": "Call me after season ends",
            "to": "lock_callback"
          },
          {
            "label": "Just send me something for now",
            "to": "send_email"
          }
        ]
      },
      "test_drive_pitch": {
        "label": "TEST DRIVE PITCH",
        "say": "Totally respect that. Here's my thought though — you're probably not buying this right now, and that's completely fine. But when budget does free up or priorities shift, the people who move fastest are the ones who already know what's out there. Would you be open to just seeing what other vacation rental operators in ski markets are doing with their turnover photos? Worst case you steal some ideas and we part as friends.",
        "note": "Low-pressure CTA. 'Steal some ideas' reframes the meeting as valuable even if they never buy. This is your last real shot at a meeting before the exit.",
        "branches": [
          {
            "label": "Okay sure / that's fair enough",
            "to": "book_meeting"
          },
          {
            "label": "Not right now honestly",
            "to": "graceful_exit"
          },
          {
            "label": "Send me info and maybe later",
            "to": "send_email"
          }
        ]
      },
      "corporate_angle": {
        "label": "CORPORATE APPROVAL ANGLE",
        "say": "Yeah — that's what I figured with the Berkshire Hathaway name behind you. Let me ask you this though — if you saw something that made sense operationally for the vacation rental program, would you be the one making the case internally? Or does that go through someone else? Because I could help you build that case if the fit's actually there.",
        "note": "Figure out if Jon has local authority or needs a sponsor. If he needs someone above him, that's likely Michael Slevin, the President and Owner. Offer to help Jon sell internally — that makes you an ally, not a vendor.",
        "branches": [
          {
            "label": "I'd make the case / I have authority locally",
            "to": "book_meeting"
          },
          {
            "label": "It would go to Michael / the owner / someone above me",
            "to": "slevin_referral"
          },
          {
            "label": "It's complicated / not sure",
            "to": "book_meeting"
          }
        ]
      },
      "slevin_referral": {
        "label": "REFERRAL TO SLEVIN",
        "say": "Got it — that'd be Michael Slevin, right? Would it make sense for me to reach out to him directly, or would it be better if I showed you first and then we looped him in together? In my experience it usually lands better when the ops person is already bought in.",
        "note": "You know Michael Slevin is President and Owner. Show you did your homework but let Jon decide the approach. Getting Jon bought in first is almost always better — recommend that path.",
        "branches": [
          {
            "label": "Show me first then we'll loop him in",
            "to": "book_meeting"
          },
          {
            "label": "You can reach out to him directly",
            "to": "ask_for_intro"
          },
          {
            "label": "Let me mention it to him first",
            "to": "send_email"
          }
        ]
      },
      "referral_path": {
        "label": "REFERRAL PATH",
        "say": "Totally makes sense. Who on your team typically owns the inspection and housekeeping quality side day to day? I'd love to put something tailored together so it actually lands with the right person and doesn't just go into a black hole.",
        "note": "Research says there's likely a Head of Housekeeping or Inspections who isn't publicly named. Jon is the person who would know that name. Get it.",
        "branches": [
          {
            "label": "Gives a name or role",
            "to": "ask_for_intro"
          },
          {
            "label": "That's actually me / I handle it",
            "to": "warm_discovery"
          },
          {
            "label": "Won't share a name / protective",
            "to": "send_email"
          }
        ]
      },
      "ask_for_intro": {
        "label": "ASK FOR INTRO",
        "say": "That's super helpful. Would you be open to making a quick intro — even just a one-line email — or would it be easier if I reached out directly and just mentioned we spoke? Either way works. I just want to make sure it doesn't land totally cold.",
        "note": "A warm intro from Jon is gold. But even a 'mention we spoke' is enough to open the next door. Don't push too hard — take whatever he offers.",
        "branches": [
          {
            "label": "I'll intro you / send an email connecting you",
            "to": "confirm_referral"
          },
          {
            "label": "Just reach out and mention my name",
            "to": "confirm_referral"
          },
          {
            "label": "Send me info and I'll forward it internally",
            "to": "send_email"
          }
        ]
      },
      "confirm_referral": {
        "label": "CONFIRM REFERRAL",
        "say": "Really appreciate that, Jon. I'll send you a quick note with exactly what to pass along so it's easy on your end. And if it's cool I'll follow up with them in a day or two. Thanks for taking my call — I know it came out of nowhere. Enjoy the rest of ski season out there.",
        "note": "Lock the referral down. Send the email to Jon within the hour with a clean, forwardable summary. Follow up with the referred person within 48 hours. Don't oversell — you already won.",
        "branches": []
      },
      "social_proof_detail": {
        "label": "SOCIAL PROOF DETAIL",
        "say": "I can't name them on a cold call — you know how it is — but it's a luxury PM company on the East Coast doing about six hundred high-end units. Similar guest expectations to what you deal with in Vail. I can walk you through the specifics on a call though — how's later this week look?",
        "note": "Don't name clients without permission. Use the mystery to pull him into the meeting. Redirect back to the CTA.",
        "branches": [
          {
            "label": "Sure let's set it up",
            "to": "book_meeting"
          },
          {
            "label": "Send me info first",
            "to": "send_email"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got my calendar pulled up — how does Thursday afternoon look for you? Say two o'clock Mountain Time? I'll keep it to fifteen minutes, I promise.",
        "note": "Pick a SPECIFIC day and time. Don't say 'when works for you' — that creates decision paralysis. Suggest something concrete and let him adjust. Send the calendar invite while still on the phone if possible.",
        "branches": [
          {
            "label": "That works for me",
            "to": "confirm_meeting"
          },
          {
            "label": "Different day or time",
            "to": "alt_time"
          },
          {
            "label": "Send me an invite and I'll confirm",
            "to": "confirm_meeting"
          }
        ]
      },
      "alt_time": {
        "label": "ALTERNATE TIME",
        "say": "No problem — what day works better for you? I'm pretty flexible this week and next.",
        "note": "Let him pick but get a specific day AND time locked in before hanging up. Don't leave it vague.",
        "branches": [
          {
            "label": "Gives a specific day and time",
            "to": "confirm_meeting"
          },
          {
            "label": "I'll look at my calendar and email you",
            "to": "send_email"
          }
        ]
      },
      "confirm_meeting": {
        "label": "CONFIRM MEETING",
        "say": "Perfect — I'll shoot you a calendar invite right now. What's the best email for you? And really appreciate you taking my call, Jon. I know cold calls aren't exactly the highlight of anyone's day. Talk to you on Thursday.",
        "note": "Get the email address. Send the invite IMMEDIATELY after hanging up. Stop selling — you already won. End warm and human.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair — one quick question before I do though. What would be most useful to include so it's not just another generic pitch sitting in your inbox? Like are you more curious about the tech side, the ROI side, or what other ski-market operators are doing with this?",
        "note": "Accept the email route. Ask one tailoring question so your email actually stands out. Then get the email address and suggest a specific follow-up time in the email itself.",
        "branches": [
          {
            "label": "Tells you what to focus on",
            "to": "confirm_email"
          },
          {
            "label": "Just send whatever you've got",
            "to": "confirm_email"
          },
          {
            "label": "Gives you their email address",
            "to": "confirm_email"
          }
        ]
      },
      "confirm_email": {
        "label": "CONFIRM EMAIL SEND",
        "say": "Got it — I'll send that over today. What's the best email for you? And I'll throw a couple time options in there in case you want to hop on a quick call after you look it over. Appreciate your time, Jon.",
        "note": "Get the email address. Send within the hour — not end of day. Include two specific time options in the email. Follow up by phone in 3 days if no response. Don't ask if the Cloudflare-protected email works — just get it from him directly.",
        "branches": []
      },
      "gatekeeper": {
        "label": "GATEKEEPER",
        "say": "Hey — could you get me through to Jon? It's Sam.",
        "note": "Say it like you already know him. First name only, no company name, no explanation. Wait for them to respond. If they put you through, you're in.",
        "branches": [
          {
            "label": "Who's calling? / What's this about?",
            "to": "gatekeeper_context"
          },
          {
            "label": "Puts you through to Jon",
            "to": "opener"
          },
          {
            "label": "He's not available right now",
            "to": "gatekeeper_not_available"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — CONTEXT",
        "say": "Yeah — I work with a few other vacation rental managers in the Vail Valley on their inspection workflows. Would you mind letting him know it's Sam Parks?",
        "note": "Dose information bit by bit. Don't pitch the gatekeeper. Don't explain the product. End with a redirect question — you ask the questions, you stay in control.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Can I take a message?",
            "to": "gatekeeper_message"
          },
          {
            "label": "What company are you with?",
            "to": "gatekeeper_social_proof"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "RapidEye — we help a couple of property management companies in the area with their inspection workflows. I sent Jon a note about it. Would you mind giving him a heads up that I'm on the line?",
        "note": "Even if you haven't emailed yet, this creates implied familiarity. End with a redirect question to keep momentum. Don't over-explain.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "He's not available / leave a message",
            "to": "gatekeeper_message"
          }
        ]
      },
      "gatekeeper_not_available": {
        "label": "GATEKEEPER — NOT AVAILABLE",
        "say": "No worries at all — when's the best time to catch him? I want to make sure I'm not calling during a turnover rush or something.",
        "note": "The turnover comment shows you understand their world and builds subtle credibility. Get a specific callback time — day and morning vs afternoon at minimum.",
        "branches": [
          {
            "label": "Gives a time to call back",
            "to": "lock_callback"
          },
          {
            "label": "I can take a message for him",
            "to": "gatekeeper_message"
          }
        ]
      },
      "gatekeeper_message": {
        "label": "GATEKEEPER — LEAVE MESSAGE",
        "say": "Sure thing — it's Sam Parks from RapidEye. My number is [your number]. And if you could just mention it's about the inspection workflow for the vacation rental program, he'll know what it's about. Really appreciate your help.",
        "note": "Keep it short and specific. 'He'll know what it's about' implies prior context even if there isn't any. Call back in 2 days regardless of whether he returns the message.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand, Jon. If anything ever changes on your end, I'm easy to find — Sam Parks, RapidEye. Appreciate you taking the call. Enjoy the rest of ski season out there.",
        "note": "Don't burn the bridge. The ski season comment keeps it warm and human. Log this in CRM with notes on what he said and circle back in 6 months before next ski season ramps up.",
        "branches": []
      }
    }
  }
}