{
  "name": "Jordan Bodenhamer",
  "title": "Qualifying Broker, Director of Business Development",
  "company": "Young's Suncoast Realty & Vacation Rentals",
  "location": "Gulf Shores, AL",
  "phone": "+1-251-948-0408",
  "company_phone": "+1-251-968-7158",
  "alt_phones": [],
  "flow": {
    "context": "Jordan Bodenhamer is the Qualifying Broker (since Sep 2024) and Director of Business Development at Young's Suncoast — a 250+ unit vacation rental and property management company in Gulf Shores, AL with 50 years of history. She previously worked as a floating Property Manager across multiple buildings, so she has deep hands-on ops experience. The company heavily markets 'Thorough Property Inspections' after each professional cleaning and runs an in-house maintenance team doing 10 preventative visits per year — no Breezeway or Matterport detected, so inspections may be manual or basic. They also manage condo associations and use Vintory for owner acquisition. Sam's strongest angle is industry and geographic proximity — he works with similar Gulf Coast PM companies on inspection workflows, and Jordan's dual ops-plus-growth role makes her the ideal person to evaluate a tool that protects property condition and owner trust.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Jordan — I work with a few other vacation rental companies along the Gulf Coast. It's Sam Parks with RapidEye. Have you heard my name tossed around?",
        "note": "Feet up on the desk energy. Sound like you're calling someone who should already know you. Don't rush — let the silence after the question do the work. You're calling her direct line so she should answer.",
        "branches": [
          {
            "label": "No, I haven't heard of you",
            "to": "heard_no"
          },
          {
            "label": "Yeah / Maybe / Sounds familiar",
            "to": "heard_yes"
          },
          {
            "label": "I'm busy / Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Who? What company?",
            "to": "who_is_this"
          }
        ]
      },
      "heard_no": {
        "label": "HAVEN'T HEARD — PIVOT TO PAIN",
        "say": "Oh, guess I'm not as popular as I thought. Well hey — the reason for my call is, I was talking to another property manager in a pretty similar spot to you guys — couple hundred vacation rentals, beach market, tons of turnovers — and their big headache was that even with someone inspecting every unit after the cleaners left, stuff was still slipping through. A stain on a sofa cushion, a scuff on the wall, a cracked tile nobody noticed. Small stuff individually — but then an owner shows up, sees it, and starts wondering if anyone's actually watching their place. And I know you guys put those thorough post-clean inspections front and center when you're pitching owners — so when something does get missed, it kind of undercuts the whole promise.",
        "note": "PAUSE here. Do NOT keep talking. Let Jordan react. The pain is about owner trust erosion — she's Dir of Biz Dev so losing owners or having the inspection promise undercut hits her directly. The 'thorough property inspections' reference is from their own marketing on join.youngssuncoast.com.",
        "branches": [
          {
            "label": "Yeah, that's real / We deal with that",
            "to": "pain_interested"
          },
          {
            "label": "We actually have a pretty good handle on that",
            "to": "pain_handled"
          },
          {
            "label": "I mean... what are you selling exactly?",
            "to": "pain_skeptical"
          },
          {
            "label": "Not really our issue / Not interested",
            "to": "pain_pushback"
          }
        ]
      },
      "heard_yes": {
        "label": "THEY'VE HEARD OF SAM OR RAPIDEYE",
        "say": "Oh nice — well normally we'd be working with someone like you. What did you hear?",
        "note": "Let her talk. Whatever she says, agree and bridge to discovery. If she's vague, she might just be being polite — treat it like a soft 'no I haven't' and move to the pain trigger.",
        "branches": [
          {
            "label": "Shares what she heard / Has real context",
            "to": "discovery_process"
          },
          {
            "label": "Vague / Just the name / Not really sure",
            "to": "heard_no"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow or later this week?",
        "note": "Respect the timing. Get a specific callback window. Don't pitch — just lock a time.",
        "branches": [
          {
            "label": "Yeah try me at [specific time]",
            "to": "reschedule_confirmed"
          },
          {
            "label": "What's this about though?",
            "to": "heard_no"
          },
          {
            "label": "No, don't call back",
            "to": "permission_denied"
          }
        ]
      },
      "who_is_this": {
        "label": "CONFUSED — RE-INTRODUCE",
        "say": "Yeah sorry — Sam Parks, I'm with a company called RapidEye. We work with a few vacation rental managers in the Gulf Coast area on their inspection workflows. I was actually reaching out because of how you guys position those post-clean property inspections — it's something we help with.",
        "note": "Stay casual. Don't over-explain. Referencing their own inspection marketing shows you've done homework. Bridge quickly to the pain trigger.",
        "branches": [
          {
            "label": "OK go ahead / What about it?",
            "to": "heard_no"
          },
          {
            "label": "Not interested",
            "to": "pain_pushback"
          },
          {
            "label": "I'm in the middle of something",
            "to": "bad_timing"
          }
        ]
      },
      "pain_interested": {
        "label": "PAIN LANDS — THEY RELATE",
        "say": "Yeah — so what we built is an AI that plugs into the photos your team's already taking during turnovers and automatically flags damage, missing items, staging issues — no workflow change at all. Would you be open to seeing what that looks like, maybe when I'm not cold calling you out of the blue?",
        "note": "One sentence on the solution, then the soft CTA. Don't oversell. If she's warm, be ready to pivot to discovery questions instead of pushing the meeting immediately.",
        "branches": [
          {
            "label": "Yeah I'd take a look",
            "to": "book_meeting"
          },
          {
            "label": "How does that actually work?",
            "to": "discovery_process"
          },
          {
            "label": "We already have something for that",
            "to": "objection_have_process"
          },
          {
            "label": "Send me some info",
            "to": "send_email"
          }
        ]
      },
      "pain_handled": {
        "label": "THEY SAY THEY HAVE IT HANDLED",
        "say": "That makes total sense — with 250-plus units you'd have to have something solid in place. Just out of curiosity, what does your inspection process look like right now? After the cleaners finish a unit, is someone physically walking through, or are they working off photos, or some kind of mix?",
        "note": "Don't argue. Validate, then get curious. You want to understand: who inspects, how they document, what tool they use if any, where things break down. There's almost always a gap.",
        "branches": [
          {
            "label": "Inspectors walk through in person",
            "to": "discovery_manual_gap"
          },
          {
            "label": "Cleaners take photos, someone reviews",
            "to": "discovery_photo_gap"
          },
          {
            "label": "We use a specific tool or platform",
            "to": "discovery_tool_gap"
          },
          {
            "label": "I don't really want to get into it",
            "to": "pain_pushback"
          }
        ]
      },
      "pain_skeptical": {
        "label": "SKEPTICAL — WHAT ARE YOU SELLING",
        "say": "Yeah totally fair — I mean it is a cold call. Can I get 30 seconds to tell you why I actually reached out, and you can totally hang up on me if it doesn't land?",
        "note": "Acknowledge the cold call directly. Asking for 30 seconds resets the conversation and earns a little respect. If she grants it, go to the shortened pain trigger.",
        "branches": [
          {
            "label": "Fine, go ahead",
            "to": "permission_granted_pain"
          },
          {
            "label": "No, I'm good",
            "to": "permission_denied"
          }
        ]
      },
      "pain_pushback": {
        "label": "NOT INTERESTED — FIRST ATTEMPT",
        "say": "Totally get it — I should've assumed you'd be all set, otherwise you probably would've reached out yourself. Just so nobody from my team bugs you again — is it that this isn't really a problem you're focused on right now, or is it more that you just hate cold calls? Honest answer's fine either way.",
        "note": "Agree first — surprise her by not pushing back. Then split the objection. You're trying to find out if it's a real 'no' or just a reaction to the interruption.",
        "branches": [
          {
            "label": "I just hate cold calls / It's the timing",
            "to": "split_timing_recovery"
          },
          {
            "label": "It's not something we need",
            "to": "split_not_relevant"
          },
          {
            "label": "Both honestly / Just not interested",
            "to": "referral_ask"
          },
          {
            "label": "Actually... tell me more",
            "to": "permission_granted_pain"
          }
        ]
      },
      "permission_denied": {
        "label": "HARD NO — LAST SPLIT",
        "say": "Shoot, totally my bad. Just so nobody from my team cold calls you again — is it that I caught you at a horrible time, or is it that you already know what we do and this just isn't interesting?",
        "note": "Last chance to split the objection. If it's timing, get a callback. If it's relevance, try for a referral. If it's a hard wall, exit gracefully.",
        "branches": [
          {
            "label": "Horrible time",
            "to": "reschedule_attempt"
          },
          {
            "label": "Not interesting / We're good",
            "to": "referral_ask"
          },
          {
            "label": "Don't call me again",
            "to": "graceful_exit"
          }
        ]
      },
      "permission_granted_pain": {
        "label": "30 SECONDS — SHORTENED PAIN TRIGGER",
        "say": "Appreciate it. Quick version — we work with vacation rental companies, and the pattern we keep seeing is that teams are taking hundreds of photos during turnovers but nobody has time to actually review them all carefully. Stuff gets missed — a stain here, a broken drawer there, a missing remote — and it turns into a damage dispute or an owner complaint two weeks later. We built an AI that reviews those photos automatically and flags the issues before the next guest checks in. Given you guys are doing post-clean inspections across 250-plus properties — figured it might be worth a conversation. Does that sound like something worth a 15-minute look, or am I totally off base?",
        "note": "This is the compressed version. Hit the pain, the solution, and the CTA in one breath. Then STOP and let her respond.",
        "branches": [
          {
            "label": "Yeah that's interesting / Tell me more",
            "to": "discovery_process"
          },
          {
            "label": "Yeah, set something up",
            "to": "book_meeting"
          },
          {
            "label": "We already have something for that",
            "to": "objection_have_process"
          },
          {
            "label": "Not for us right now",
            "to": "referral_ask"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          }
        ]
      },
      "split_timing_recovery": {
        "label": "IT'S TIMING — RECOVER",
        "say": "Ha — I respect the honesty. Look, I know a cold call isn't anyone's favorite thing. Would it be a terrible idea if I shot you a quick email and followed up later this week when you're not in the middle of something?",
        "note": "If it's just the cold call she hates, get permission for a warmer follow-up. Email plus callback is the play.",
        "branches": [
          {
            "label": "Yeah send me something",
            "to": "send_email"
          },
          {
            "label": "Sure, try me at [specific time]",
            "to": "reschedule_confirmed"
          },
          {
            "label": "No, just don't",
            "to": "graceful_exit"
          }
        ]
      },
      "split_not_relevant": {
        "label": "NOT A PRIORITY — DIG DEEPER",
        "say": "Totally fair. Just so I understand — is it that inspections are running smooth and you're not seeing damage slip through, or is it more that it's on the list but there's bigger stuff you're focused on heading into summer season?",
        "note": "Keep splitting. If inspections are genuinely not an issue, pivot to referral. If it's a priority thing, plant a seed for later. Gulf Shores peak season is summer — if she's planning for that, timing pressure is real.",
        "branches": [
          {
            "label": "Inspections are fine for us",
            "to": "referral_ask"
          },
          {
            "label": "It's on the list but not top priority right now",
            "to": "sell_test_drive"
          },
          {
            "label": "We've got bigger things going on right now",
            "to": "sell_test_drive"
          }
        ]
      },
      "discovery_process": {
        "label": "DISCOVERY — CURRENT PROCESS",
        "say": "So just to make sure I'm not wasting your time — what does your inspection process actually look like right now? After the cleaners finish a unit, is someone physically walking through, or are they working off photos, or a little of both?",
        "note": "STOP PITCHING. You're in discovery mode now. Listen. Take notes. You want to understand: who inspects, how they document, what tool they use if any, where things break down. Their site mentions 'Property Care Specialists' — if she uses that term, mirror it back.",
        "branches": [
          {
            "label": "Inspectors walk through in person",
            "to": "discovery_manual_gap"
          },
          {
            "label": "Cleaners take photos, someone reviews them",
            "to": "discovery_photo_gap"
          },
          {
            "label": "Mix of both / Depends on the property",
            "to": "discovery_photo_gap"
          },
          {
            "label": "We use a platform or tool for it",
            "to": "discovery_tool_gap"
          }
        ]
      },
      "discovery_manual_gap": {
        "label": "MANUAL INSPECTIONS — FIND THE GAP",
        "say": "Got it — so your team's physically checking each unit. How many turnovers are you guys doing on a busy week during summer season? And is one person covering all of those, or do you have a team spread across the buildings?",
        "note": "You're looking for the volume problem. 250+ units in peak Gulf Shores summer equals massive turnover volume. Their site mentions Property Care Specialists plural — so probably a team, but still stretched thin on peak days. Saturday-to-Saturday turns are brutal.",
        "branches": [
          {
            "label": "High volume / Hard to keep up during peak",
            "to": "volume_pain_bridge"
          },
          {
            "label": "We manage it fine with our team",
            "to": "consistency_angle"
          },
          {
            "label": "She asks where this is going",
            "to": "volume_pain_bridge"
          }
        ]
      },
      "discovery_photo_gap": {
        "label": "PHOTO-BASED INSPECTIONS — FIND THE GAP",
        "say": "Yeah that's what we see at most companies your size. So when those photos come in — who's actually reviewing them? Is someone going through every photo for every unit, or is it more like they check that photos were taken and move on?",
        "note": "This is the exact problem RapidEye solves. Most teams take photos but nobody has time to review them all. The photos become a checkbox, not an inspection tool. If she admits this, you're golden.",
        "branches": [
          {
            "label": "Nobody reviews them all / It's basically a checkbox",
            "to": "photo_pain_bridge"
          },
          {
            "label": "Someone does review them",
            "to": "review_depth_question"
          },
          {
            "label": "Honestly not sure how thoroughly they get reviewed",
            "to": "photo_pain_bridge"
          }
        ]
      },
      "discovery_tool_gap": {
        "label": "THEY USE A TOOL — LEARN WHICH",
        "say": "Oh nice — which platform are you on? Just so I know if we'd even integrate or if it's something totally different.",
        "note": "Find out the tool. If it's Breezeway, Track, or a PMS with inspection modules — RapidEye integrates. No Breezeway or Matterport was detected in research, so this might be a basic tool, just their PMS, or spreadsheets. Don't sound surprised either way.",
        "branches": [
          {
            "label": "Names a PMS or inspection platform",
            "to": "tool_integration_bridge"
          },
          {
            "label": "Just spreadsheets / Checklists / Google forms",
            "to": "discovery_manual_gap"
          },
          {
            "label": "Doesn't want to share specifics",
            "to": "book_meeting_soft"
          }
        ]
      },
      "volume_pain_bridge": {
        "label": "VOLUME PAIN CONFIRMED — BRIDGE TO SOLUTION",
        "say": "Yeah and that's exactly the pattern we keep hitting — especially in beach markets where you've got Saturday-to-Saturday turns and everything has to flip in a few hours. The stuff that gets missed isn't because people aren't trying, it's because there's physically not enough time to catch everything. So what we do is — your team takes the photos they're already taking, we run them through AI, and within minutes you've got a report flagging anything that looks off. Damage, missing items, staging issues. No extra steps for your team at all.",
        "note": "Connect their specific pain — volume plus time crunch — directly to the solution. Keep it one breath. Then pause and let her react before pushing to CTA.",
        "branches": [
          {
            "label": "That's interesting / How does it actually work?",
            "to": "solution_detail"
          },
          {
            "label": "What does that cost?",
            "to": "price_deflect"
          },
          {
            "label": "Yeah set something up to show me",
            "to": "book_meeting"
          }
        ]
      },
      "photo_pain_bridge": {
        "label": "PHOTO REVIEW GAP CONFIRMED — BRIDGE TO SOLUTION",
        "say": "That's literally what we hear from every company we work with. The photos are there — they're just sitting in a folder or a system and nobody has time to actually look at them all carefully. So what ends up happening is damage gets documented in the photos but nobody catches it until the next guest complains or the owner visits. We basically built an AI that does the reviewing for you — same photos, no extra work, it just flags anything that looks wrong.",
        "note": "This is the money moment. She just admitted the gap. Don't oversell — one sentence on the solution, then let her react.",
        "branches": [
          {
            "label": "That would actually be huge / Tell me more",
            "to": "solution_detail"
          },
          {
            "label": "How does it integrate with what we use?",
            "to": "tool_integration_bridge"
          },
          {
            "label": "Sounds interesting, set something up",
            "to": "book_meeting"
          },
          {
            "label": "Send me some info on that",
            "to": "send_email"
          }
        ]
      },
      "review_depth_question": {
        "label": "SOMEONE REVIEWS — HOW DEEP?",
        "say": "Got it — and are they comparing against a baseline? Like do they know what the unit's supposed to look like, or are they mostly just checking that everything looks clean and nothing's obviously broken?",
        "note": "Most inspectors check for cleanliness, not change detection. RapidEye compares against baseline photos to catch subtle damage — a new scratch, a missing throw pillow, a stain that wasn't there last time. If she says they're just eyeballing it, that's the gap.",
        "branches": [
          {
            "label": "Just checking cleanliness / Eyeballing it",
            "to": "consistency_angle"
          },
          {
            "label": "They compare against a standard",
            "to": "consistency_angle"
          },
          {
            "label": "Good question, probably not a real baseline",
            "to": "photo_pain_bridge"
          }
        ]
      },
      "consistency_angle": {
        "label": "CONSISTENCY ANGLE — HUMAN LIMITS",
        "say": "Yeah and that's what I hear from a lot of companies that actually do have a solid team — it's not that the process is bad, it's that humans are inconsistent. Your best inspector catches everything on Monday morning, but by Friday afternoon after 40 units they're missing stuff. And then you get turnover on the team and the new person doesn't know what they're looking for yet. That's really all we solve — we just make it so the photos your team's already taking get a second set of eyes. Automatically, every unit, every time.",
        "note": "Don't insult their process. Position RapidEye as a safety net, not a replacement. 'Second set of eyes' is the key frame. She used to be a floating PM — she lived this problem firsthand.",
        "branches": [
          {
            "label": "Makes sense / I could see that helping",
            "to": "book_meeting_soft"
          },
          {
            "label": "We'd need to talk to the operations team about that",
            "to": "referral_internal"
          },
          {
            "label": "What does something like this cost?",
            "to": "price_deflect"
          }
        ]
      },
      "tool_integration_bridge": {
        "label": "INTEGRATION — CONNECT TO THEIR STACK",
        "say": "Yeah so we plug into whatever you're already using — Breezeway, Track, most of the major PMS platforms. Basically wherever your photos live now, we connect to that and run the analysis on the back end. Nothing changes for your cleaners or inspectors — they just keep doing what they're doing and we add the AI layer on top.",
        "note": "If she names a specific tool, acknowledge it. If they're not on a major platform, don't panic — pivot to the standalone option. The key message is always: zero workflow change for her team.",
        "branches": [
          {
            "label": "We'd want to see how that works with our setup",
            "to": "book_meeting"
          },
          {
            "label": "We're not on any of those platforms",
            "to": "standalone_option"
          },
          {
            "label": "Who else is using this?",
            "to": "social_proof"
          }
        ]
      },
      "standalone_option": {
        "label": "NO MAJOR PLATFORM — STANDALONE WORKS",
        "say": "Totally fine — we actually work with a few companies that just upload photos directly or send us the video walkthroughs from a phone. It's pretty flexible. Honestly that might be worth showing you — it'd take like 15 minutes and you could see exactly how it'd work with whatever your team's doing now.",
        "note": "No Breezeway or Matterport was detected in research, so this might be their exact situation. Use it as a reason to get the demo booked — 'let me show you how it works with YOUR specific setup.'",
        "branches": [
          {
            "label": "Sure, set it up",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          }
        ]
      },
      "social_proof": {
        "label": "SOCIAL PROOF — WHO ELSE USES THIS",
        "say": "Yeah — right now we're working with a PM company out of New York that manages about 200 luxury homes, another group on the East Coast with around 600 properties, and a company in Dubai with about 100 units. Range of sizes, but the pattern's the same — high turnover volume, photos that nobody has bandwidth to review thoroughly, and damage slipping through the cracks.",
        "note": "Specific numbers, real traction. Don't name-drop clients unless you have explicit permission. The range shows it works at different scales. Then bridge back to booking.",
        "branches": [
          {
            "label": "Interesting / OK let's talk more",
            "to": "book_meeting"
          },
          {
            "label": "Those are pretty different markets from us though",
            "to": "market_relevance"
          },
          {
            "label": "Send me more info",
            "to": "send_email"
          }
        ]
      },
      "market_relevance": {
        "label": "DIFFERENT MARKETS — BRIDGE TO GULF COAST",
        "say": "For sure — and honestly that's part of why I'm reaching out to you specifically. We're working with more beach market companies now because the turnover volume in season is insane and the wear and tear from sand, salt, humidity — it's a whole different animal. Your team's probably seeing stuff that a New York City PM would never deal with. That's actually what made me want to talk to you — I figured you'd know better than anyone whether this would actually work in a Gulf Coast operation.",
        "note": "Turn the objection into a compliment. She knows her market better than anyone — position the call as Sam wanting to learn from her, not just sell to her. She was a floating PM, she's lived the beach turnover grind.",
        "branches": [
          {
            "label": "Yeah it definitely is different / I appreciate that",
            "to": "book_meeting_soft"
          },
          {
            "label": "Still not sure it's right for us",
            "to": "sell_test_drive"
          }
        ]
      },
      "solution_detail": {
        "label": "THEY WANT MORE DETAIL",
        "say": "Yeah so two ways it works — one, we connect to whatever system your photos live in now, and we analyze every photo automatically. You get a report that says hey, unit 302 has a new stain on the living room couch, unit 415 is missing a throw pillow from last turnover. Second way is video walkthroughs — someone walks through with their phone, and we compare that video against the last walkthrough to catch what changed. Furniture damage, wall scuffs, missing items. The whole point is your team doesn't do anything extra — we just make the photos and videos they're already taking actually useful as an inspection tool.",
        "note": "Give enough detail to be credible but don't drown her. Two workflows, specific tangible examples, 'no extra work' repeated. Then transition to booking.",
        "branches": [
          {
            "label": "That's cool / I like that",
            "to": "book_meeting"
          },
          {
            "label": "What does it cost?",
            "to": "price_deflect"
          },
          {
            "label": "I'd need to loop in someone else on this",
            "to": "referral_internal"
          },
          {
            "label": "Send me something I can look at",
            "to": "send_email"
          }
        ]
      },
      "price_deflect": {
        "label": "PRICE QUESTION — DEFLECT TO MEETING",
        "say": "Honestly it depends on your setup — number of units, turnover volume, what you're using now. It'd be way easier to give you a real number after I see your workflow for like 15 minutes. Most of our customers pay less per month than what one missed damage claim costs them. Would it make sense to hop on a quick call this week so I can actually give you a real answer instead of a range that might not apply?",
        "note": "Don't quote a price on a cold call. Deflect to the meeting where you can build context and value first. The 'less than one damage claim' line is powerful for her — she knows what those cost with 250+ units.",
        "branches": [
          {
            "label": "Yeah let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Can you at least ballpark it?",
            "to": "price_ballpark"
          },
          {
            "label": "Just send me pricing info",
            "to": "send_email"
          }
        ]
      },
      "price_ballpark": {
        "label": "PUSHES FOR A NUMBER",
        "say": "I really don't want to throw out a number that's wrong for your situation — but I'll tell you this, it's not enterprise pricing. We work with companies from 100 to 600-plus units and it scales with your volume. Easiest thing would be 15 minutes where I see your setup and give you an actual quote that means something. How's later this week look?",
        "note": "Stay firm but friendly on not quoting blind. Redirect to the meeting. 'It's not enterprise pricing' calms the budget fear without committing to a number.",
        "branches": [
          {
            "label": "OK let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "Email me first",
            "to": "send_email"
          }
        ]
      },
      "objection_have_process": {
        "label": "THEY HAVE SOMETHING IN PLACE",
        "say": "That makes total sense — with 250-plus properties you'd have to have something solid in place. And honestly it sounds like you guys take the inspection piece more seriously than most companies I talk to. Just out of curiosity — is it that you're fully covered and happy with how everything's working, or is it more that switching or adding anything right now would just be a headache?",
        "note": "Agree hard. Validate them — their marketing literally sells inspection quality to owners. Then split the objection: 'happy with it' vs. 'switching is painful' are very different objections with different paths.",
        "branches": [
          {
            "label": "We're pretty happy with what we have",
            "to": "sell_test_drive"
          },
          {
            "label": "It's more that changing anything is hard right now",
            "to": "no_change_needed"
          },
          {
            "label": "I mean it works but it's definitely not perfect",
            "to": "discovery_process"
          }
        ]
      },
      "no_change_needed": {
        "label": "SWITCHING IS THE PAIN — POSITION AS ADD-ON",
        "say": "Totally — and that's actually the thing, this isn't a replacement for anything you're doing. It layers on top. Your cleaners and inspectors don't change a single thing about their workflow — we just analyze the photos they're already taking and send you a report. It's not a rip-and-replace, it's more like adding a second set of eyes that never gets tired and never has an off day. Would you be open to a quick 15-minute look just to see if it even makes sense with your current setup?",
        "note": "Key reframe: add-on, not replacement. 'Second set of eyes' is the phrase. Zero friction for her existing team. She was a floating PM — she knows how hard it is to get field staff to adopt new tools.",
        "branches": [
          {
            "label": "OK yeah, let's take a look",
            "to": "book_meeting"
          },
          {
            "label": "Send me info first and I'll decide",
            "to": "send_email"
          },
          {
            "label": "I'd need to talk to someone else about this",
            "to": "referral_internal"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE — FUTURE VALUE",
        "say": "Totally respect that. And look — you're probably not buying anything from a cold call today, I get it. But the companies that end up moving on stuff like this are usually the ones who saw it six months before and already knew what was on their list when budget opened up. Even if this isn't the right time, would you be open to a 15-minute look so you at least know what's out there? Worst case, I walk you through what other PM companies in beach markets are doing with their turnover photos and you steal some ideas. We part as friends.",
        "note": "This is the 'plant a seed' play. Low pressure. 'Steal some ideas and part as friends' is the offer of value — the meeting is worth her time even if she never buys. If she's thinking about summer season prep, this is the time to see it.",
        "branches": [
          {
            "label": "Yeah sure, let's set it up",
            "to": "book_meeting"
          },
          {
            "label": "Yeah just email me something",
            "to": "send_email"
          },
          {
            "label": "No I'm really good",
            "to": "referral_ask"
          }
        ]
      },
      "referral_internal": {
        "label": "NEEDS TO LOOP SOMEONE IN",
        "say": "Makes total sense. Who on your team would typically weigh in on something like this? Would it go through David or Patrick on the business side, or is it more of an operations call?",
        "note": "You know David Bodenhamer is Partner/Owner and Patrick Avinger is CFO. Dropping their first names casually shows you've done homework without being creepy. Get a name and offer to send something tailored. If she says a property manager, that could be DeAnn Duhon or Linda Tresler.",
        "branches": [
          {
            "label": "Names a specific person",
            "to": "referral_bridge"
          },
          {
            "label": "It'd go through David / Patrick / leadership",
            "to": "referral_bridge"
          },
          {
            "label": "I'll bring it up internally myself",
            "to": "send_email_referral"
          }
        ]
      },
      "referral_ask": {
        "label": "REFERRAL — NOT THE RIGHT FIT FOR HER",
        "say": "Totally understand. Last thing and I'll let you go — is there someone on your team who'd be closer to the inspection and turnover workflow day to day? I'd rather reach out to the right person with something tailored than keep bugging you about it.",
        "note": "Jordan may point you to a property manager like DeAnn Duhon at Crystal Tower or Linda Tresler at Boardwalk, or up to David Bodenhamer as the owner. Get a name and a title. If she says 'that is me,' you're back in the game.",
        "branches": [
          {
            "label": "Names someone specific",
            "to": "referral_bridge"
          },
          {
            "label": "I don't know / Just email the office",
            "to": "graceful_exit"
          },
          {
            "label": "Actually that is kind of me / I handle that",
            "to": "permission_granted_pain"
          }
        ]
      },
      "referral_bridge": {
        "label": "GOT A NAME — WARM THE HANDOFF",
        "say": "Perfect — I really appreciate that. If I put something together tailored to them, would you mind giving them a heads up that I'll be reaching out? That way it doesn't land like another random cold call.",
        "note": "Warm the referral. If she agrees to give them a heads up, your next call to that person is 10x warmer. Try to get their direct number or email if she offers.",
        "branches": [
          {
            "label": "Yeah I'll let them know you're calling",
            "to": "referral_confirmed"
          },
          {
            "label": "Just reach out to them directly",
            "to": "referral_confirmed"
          }
        ]
      },
      "referral_confirmed": {
        "label": "REFERRAL LOCKED — WRAP UP",
        "say": "Really appreciate it, Jordan. I'll put something together for them. And honestly, if anything changes on your end or you want to take a look yourself down the road, I'm easy to find. Thanks for your time.",
        "note": "Clean exit. Don't overstay. You got a name — that's a win. Send the referral outreach within the hour while this conversation is fresh. If she gave you David's name, lead with 'Jordan suggested I reach out.'",
        "branches": []
      },
      "send_email_referral": {
        "label": "SHE'LL CHAMPION INTERNALLY",
        "say": "Totally — I'll send you something you can forward to whoever it makes sense for. Quick question so I don't just send a generic pitch — would it be more useful to focus on how the tech actually works, or the ROI angle — like what it saves on damage claims and keeping owners happy?",
        "note": "Make it easy for her to champion internally. Tailor the email to what she'd forward. If she says ROI, the email should hit owner retention and damage cost savings — things that matter to David as owner and Patrick as CFO.",
        "branches": [
          {
            "label": "ROI / Cost savings / Owner retention",
            "to": "email_end"
          },
          {
            "label": "How the tech works / Product details",
            "to": "email_end"
          },
          {
            "label": "Both / Just send whatever you have",
            "to": "email_end"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING — LOCK IT IN NOW",
        "say": "Awesome. I've got next week pulled up — how does Tuesday or Wednesday afternoon look? Just need about 15 minutes.",
        "note": "Pick a day. Give two specific options. Don't say 'when works for you' — too open-ended. Lock the day first, then the time. Send the calendar invite WHILE ON THE PHONE so it's real.",
        "branches": [
          {
            "label": "Picks a day and time",
            "to": "meeting_booked"
          },
          {
            "label": "Can we do later in the week?",
            "to": "meeting_flex"
          },
          {
            "label": "Actually just email me and I'll find a time",
            "to": "send_email"
          }
        ]
      },
      "book_meeting_soft": {
        "label": "SOFT INTEREST — NUDGE TO BOOK",
        "say": "Tell you what — it's way easier to show this than explain it on a cold call. Would you have 15 minutes this week or next to hop on a quick screen share? I'll show you the actual product running on real photos, you tell me if it's interesting, and if not we part as friends.",
        "note": "She's warm but hasn't committed. 'Part as friends' lowers the stakes. Push to a specific time. If she hesitates, offer the email as a fallback.",
        "branches": [
          {
            "label": "Yeah let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Send me info first and then we'll see",
            "to": "send_email"
          },
          {
            "label": "Let me think about it",
            "to": "sell_test_drive"
          }
        ]
      },
      "meeting_flex": {
        "label": "FLEXIBLE ON TIMING",
        "say": "Yeah of course — Thursday or Friday work? What time's usually least hectic for you?",
        "note": "Stay flexible but keep it in the same week if at all possible. Don't let it slide to 'sometime next month.' Get a specific time committed.",
        "branches": [
          {
            "label": "Picks a specific time",
            "to": "meeting_booked"
          },
          {
            "label": "Next week would actually be better",
            "to": "meeting_next_week"
          }
        ]
      },
      "meeting_next_week": {
        "label": "PUSHES TO NEXT WEEK",
        "say": "Totally fine. How about next Tuesday? I can do morning or afternoon — whatever's better on your end.",
        "note": "Tuesday is ideal — early in the week before things pile up. Lock it down. If she pushes further out, accept it but make sure it's a specific day and time.",
        "branches": [
          {
            "label": "Picks a time",
            "to": "meeting_booked"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING CONFIRMED — STOP SELLING",
        "say": "Perfect — I'm sending you a calendar invite right now so it's locked in. Really appreciate you taking my call, Jordan. Talk to you then.",
        "note": "STOP SELLING. Send the invite immediately while you're still on the phone. Keep the goodbye short and warm. You won — don't fumble it by talking more. Add her email (likely jbodenhamer@youngssuncoast.com based on the firstinitiallastname pattern) to the invite.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL — ACCEPT THEN QUALIFY",
        "say": "Totally fair. One question before I do — what would be most relevant for me to include so it's not just another generic email you delete in two seconds? Is it more about how the AI actually works, or more about the ROI — like what this saves on damage claims and owner retention?",
        "note": "Accept the email request gracefully — don't fight it. But ask what to include so you can tailor it AND keep the conversation going for another 30 seconds. This also tells you what she actually cares about.",
        "branches": [
          {
            "label": "ROI / Cost savings / Business case",
            "to": "email_end"
          },
          {
            "label": "How it works / Product details",
            "to": "email_end"
          },
          {
            "label": "Just send whatever you have",
            "to": "email_end"
          }
        ]
      },
      "email_end": {
        "label": "EMAIL FOLLOW-UP — WRAP",
        "say": "Got it — I'll get that over to you today. I'll drop in a couple times next week in case you want to hop on a quick call after you look it over. Appreciate your time, Jordan.",
        "note": "Send the email within the hour. Personalize it based on what she asked for. Include two specific time slots for a follow-up call. Follow up in 2-3 business days if no response. Her email is likely jbodenhamer@youngssuncoast.com based on the company pattern.",
        "branches": []
      },
      "reschedule_attempt": {
        "label": "HORRIBLE TIME — GET A CALLBACK",
        "say": "Totally my fault for the timing. When's the least bad time to try you back? I promise I'll keep it quick.",
        "note": "Get a specific day and time window. Put it in your calendar immediately. Don't try to pitch anything right now.",
        "branches": [
          {
            "label": "Gives a specific time",
            "to": "reschedule_confirmed"
          },
          {
            "label": "Just email me instead",
            "to": "send_email"
          },
          {
            "label": "Don't call me back",
            "to": "graceful_exit"
          }
        ]
      },
      "reschedule_confirmed": {
        "label": "CALLBACK TIME LOCKED",
        "say": "Perfect — I'll try you then. Appreciate it, Jordan.",
        "note": "Short and clean. Put it in the calendar right now. When you call back, open with: 'Hey Jordan, it's Sam Parks — you told me to call you back today. Got a minute?'",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT — DON'T BURN THE BRIDGE",
        "say": "Totally understand. If anything ever changes, I'm easy to find — Sam Parks, RapidEye. Appreciate your time, Jordan.",
        "note": "Don't burn the bridge. Be warm and professional. She might come back later, you might call David or Patrick or one of the property managers next and use Jordan's name. Log what happened so the next attempt is informed.",
        "branches": []
      }
    }
  }
}