{
  "name": "Joseph O'Callaghan",
  "title": "Property Manager",
  "company": "Luxury Estate Managers of Aspen (LEMA)",
  "location": "Aspen, CO",
  "phone": "+1-970-456-2754",
  "company_phone": "+1-970-920-1776",
  "alt_phones": [],
  "flow": {
    "context": "Joseph O'Callaghan is a Property Manager at Luxury Estate Managers of Aspen (LEMA), a high-end estate management firm in Aspen, CO. He's an Aspen native and a U.S. Navy veteran — served as an Aviation Structural Mechanic on H60-Seahawk helicopters, meaning his entire professional DNA is built around rigorous checklists, condition verification, and catching issues before they become failures. LEMA is a boutique, confidentiality-focused luxury PM firm (unit count not published) led by President Sarah Korpela and VP Britton Nieslanik, with a team of ~8 property managers. No known PMS or inspection platform. Strongest connection: Sam recently skied Jackson Hole (Jan 2026) and Joseph is an Aspen native and outdoorsman — both are mountain guys in the property world. Joseph's military maintenance background is the strongest hook for RapidEye's systematic damage-detection pitch.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER — SKIING + ASPEN NATIVE",
        "say": "Hey Joseph — this is Sam Parks with RapidEye. I work with a few property managers out in the Aspen market. I was actually just skiing Jackson Hole a couple weeks ago — makes me jealous you get to live in Aspen full-time. Have you heard my name tossed around at all?",
        "note": "Feet-up energy. You're a fellow mountain guy, not a telemarketer. Let the skiing mention land naturally — don't oversell it. Pause and let him answer.",
        "branches": [
          {
            "label": "No, I haven't heard of you",
            "to": "no_heard"
          },
          {
            "label": "Yeah / maybe / sounds familiar",
            "to": "yes_heard"
          },
          {
            "label": "Who is this? / What's this about?",
            "to": "whats_this_about"
          },
          {
            "label": "Bad timing / busy right now",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / no thanks",
            "to": "not_interested_early"
          }
        ]
      },
      "no_heard": {
        "label": "NOT HEARD — TRANSITION TO REASON",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call — I actually work with a few other property managers who run luxury homes, pretty similar setup to what you guys do at LEMA. Wanted to run something by you real quick. You got a sec?",
        "note": "Keep it light. You're asking for a few seconds, not a meeting yet. If he says yes, go to pain trigger.",
        "branches": [
          {
            "label": "Sure, go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "I'm pretty busy / make it quick",
            "to": "pain_trigger"
          },
          {
            "label": "Not interested",
            "to": "not_interested_early"
          },
          {
            "label": "What do you sell?",
            "to": "whats_this_about"
          }
        ]
      },
      "yes_heard": {
        "label": "THEY'VE HEARD OF US",
        "say": "Oh nice — well normally we'd be working with someone like you. What'd you hear?",
        "note": "Let them talk. Whatever they say, use it as a bridge to the pain trigger. If they're vague, say 'Yeah that's the gist — basically we help property managers catch stuff in their turnover photos that's easy to miss.'",
        "branches": [
          {
            "label": "Vague / not much / just the name",
            "to": "pain_trigger"
          },
          {
            "label": "Something about AI or inspections",
            "to": "warm_discovery"
          },
          {
            "label": "Someone on your team reached out",
            "to": "warm_discovery"
          }
        ]
      },
      "whats_this_about": {
        "label": "WHAT'S THIS ABOUT",
        "say": "Yeah totally fair — I mean it is a cold call, I'll own that. Can I get thirty seconds to tell you why I called you specifically, and if it's not relevant you can totally hang up on me?",
        "note": "Honesty disarms. You're asking for permission, not forcing a pitch. If he grants 30 seconds, go straight to pain trigger.",
        "branches": [
          {
            "label": "Fine, 30 seconds",
            "to": "pain_trigger"
          },
          {
            "label": "Just email me",
            "to": "send_email"
          },
          {
            "label": "No, not interested",
            "to": "not_interested_early"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — I caught you in the middle of something. Would it be a terrible idea if I tried you again tomorrow, maybe around the same time?",
        "note": "Don't push. Get a callback commitment. If he gives a time, lock it in and move on.",
        "branches": [
          {
            "label": "Yeah try me tomorrow / gives a time",
            "to": "lock_callback"
          },
          {
            "label": "Just tell me real quick",
            "to": "pain_trigger"
          },
          {
            "label": "What's it about? / Send me an email",
            "to": "send_email"
          },
          {
            "label": "Don't call me again",
            "to": "graceful_exit"
          }
        ]
      },
      "lock_callback": {
        "label": "LOCK CALLBACK TIME",
        "say": "Perfect — I've got tomorrow pulled up. How does the same time work, or is there a better window? I'll keep it short, promise.",
        "note": "Get a specific day and time. Repeat it back to confirm. Then get off the phone — don't pitch now.",
        "branches": [
          {
            "label": "Confirms a time",
            "to": "callback_confirmed"
          },
          {
            "label": "Just email me instead",
            "to": "send_email"
          }
        ]
      },
      "callback_confirmed": {
        "label": "CALLBACK CONFIRMED",
        "say": "Awesome — I'll hit you up then. Really appreciate it, Joseph. Talk soon.",
        "note": "Stop talking. You got what you needed. Don't try to squeeze in a pitch.",
        "branches": []
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER — PHOTO FATIGUE + MISSED DAMAGE",
        "say": "So here's why I called you specifically. I work with another property manager — runs about two hundred luxury homes, similar to what you guys handle at LEMA. His team was doing turnovers, taking photos after every clean, the whole process. But the problem was nobody actually had time to go through every photo carefully. They'd batch-review them, skim through, and stuff would slip — a scuff on a wall, a missing remote, a stain on a couch that nobody flagged until the owner noticed it two weeks later. And when something gets missed on a fifteen-million-dollar home, that's not just an oops — that's a phone call nobody wants to get. With your background in aviation maintenance — I mean, you know better than anyone what happens when a checklist gets rushed and something slips through.",
        "note": "PAUSE HERE. Let the silence work. The aviation maintenance tie-in is your strongest move — it connects his identity to the problem. Don't rush past it. Let him react.",
        "branches": [
          {
            "label": "Yeah, that resonates / we deal with that",
            "to": "warm_discovery"
          },
          {
            "label": "Hmm, tell me more / what do you do about it",
            "to": "one_sentence_solution"
          },
          {
            "label": "We already have a process for that",
            "to": "have_a_process"
          },
          {
            "label": "That's not really my area / not my call",
            "to": "referral_path"
          },
          {
            "label": "Not interested / we're good",
            "to": "not_interested_after_pain"
          }
        ]
      },
      "one_sentence_solution": {
        "label": "ONE-SENTENCE SOLUTION + CTA",
        "say": "So what we built — RapidEye plugs into the photos your team's already taking after turnovers and automatically flags damage, missing items, staging issues. No workflow change, no extra steps. It just catches the stuff that's easy to miss when you're reviewing a hundred photos across multiple homes. Would you be open to taking a look when I'm not cold-calling you out of the blue?",
        "note": "One sentence on what it does, then CTA. Don't oversell. Don't list features. The goal is a meeting, not a demo on the phone.",
        "branches": [
          {
            "label": "Yeah I'd take a look / sure",
            "to": "book_meeting"
          },
          {
            "label": "How does it work exactly?",
            "to": "keep_it_brief"
          },
          {
            "label": "Sounds interesting but I'd need to check with Sarah / leadership",
            "to": "referral_to_sarah"
          },
          {
            "label": "We're not really looking for anything right now",
            "to": "not_interested_after_pain"
          },
          {
            "label": "Send me some info first",
            "to": "send_email"
          }
        ]
      },
      "warm_discovery": {
        "label": "WARM — STOP PITCHING, ASK QUESTIONS",
        "say": "Yeah, that's exactly what I keep hearing. So let me ask you — what does your turnover process look like right now? Like after a guest checks out and the cleaners go through, how does the documentation and photo side actually work for you guys?",
        "note": "He's warm. STOP SELLING. Every word from here should be a question. You want to understand their current process, where it breaks, and who decides on changes. Take notes.",
        "branches": [
          {
            "label": "Describes their process / they take photos",
            "to": "discovery_dig_deeper"
          },
          {
            "label": "We don't really do formal photo documentation",
            "to": "discovery_no_photos"
          },
          {
            "label": "That's more of a team-level thing / Sarah handles that",
            "to": "referral_to_sarah"
          }
        ]
      },
      "discovery_dig_deeper": {
        "label": "DIG DEEPER — FIND THE GAP",
        "say": "Got it. And when those photos come in — who's actually reviewing them? Is it you going through them property by property, or does someone else handle that piece?",
        "note": "You're looking for the gap: who reviews, how much time it takes, what falls through. The more specific their answer, the better your pitch lands.",
        "branches": [
          {
            "label": "I review them / we all do individually",
            "to": "discovery_time_pain"
          },
          {
            "label": "Nobody really reviews them closely",
            "to": "discovery_nobody_reviews"
          },
          {
            "label": "We have a system / we use a platform",
            "to": "discovery_what_platform"
          }
        ]
      },
      "discovery_time_pain": {
        "label": "TIME PAIN — HOW LONG",
        "say": "Yeah — and honestly how long does that take you per property? Because I hear from a lot of PMs that it's one of those things that either eats an hour of your day or you just start skimming after the third home.",
        "note": "You're quantifying the pain. Whatever number he gives you, that's your ammo for the close.",
        "branches": [
          {
            "label": "Yeah it takes a while / admits it's a pain",
            "to": "pitch_after_discovery"
          },
          {
            "label": "It's not that bad / we manage",
            "to": "pitch_after_discovery"
          }
        ]
      },
      "discovery_nobody_reviews": {
        "label": "NOBODY REVIEWS CLOSELY",
        "say": "Yeah, that's super common honestly. The photos get taken but they kind of just sit there unless something goes wrong. That's actually exactly the gap we fill — would it make sense to show you what that looks like? Like fifteen minutes, I can walk you through how other luxury PMs are handling it.",
        "note": "This is a strong signal. If nobody reviews, there's no safety net. Push gently toward a meeting.",
        "branches": [
          {
            "label": "Sure, I'd take a look",
            "to": "book_meeting"
          },
          {
            "label": "I'd need to loop in Sarah / leadership",
            "to": "referral_to_sarah"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          }
        ]
      },
      "discovery_what_platform": {
        "label": "WHAT PLATFORM DO THEY USE",
        "say": "Oh nice — what are you guys using? Just so I know what I'm working with.",
        "note": "Critical intel. If they name Breezeway, Track, Properly, etc., note it. RapidEye integrates with most of them. If they say spreadsheets or nothing formal, that's even better.",
        "branches": [
          {
            "label": "Names a platform (Breezeway, Track, etc.)",
            "to": "pitch_after_discovery"
          },
          {
            "label": "Spreadsheets / checklists / nothing formal",
            "to": "pitch_after_discovery"
          },
          {
            "label": "I'm not sure / that's more Sarah's area",
            "to": "referral_to_sarah"
          }
        ]
      },
      "pitch_after_discovery": {
        "label": "TAILORED PITCH AFTER DISCOVERY",
        "say": "That makes a lot of sense. So what we do — RapidEye basically sits on top of whatever you're already doing. Your team takes photos after turnovers, same as now, and our AI analyzes every image automatically. Flags damage, missing items, staging discrepancies — the stuff that slips when you're managing multiple luxury homes and you physically can't eyeball every single photo. We're working with a company right now that runs about two hundred high-end homes in New York and it's cut their missed-damage incidents significantly. Would it make sense to carve out fifteen minutes so I can show you what it actually looks like? Not a big production — just a quick walkthrough.",
        "note": "You've earned the right to pitch because you asked questions first. Keep it brief. Social proof from the NYC luxury PM is strong for LEMA's world. Push for the meeting.",
        "branches": [
          {
            "label": "Yeah let's do it / I'm open to that",
            "to": "book_meeting"
          },
          {
            "label": "I'd need to check with Sarah or Britton first",
            "to": "referral_to_sarah"
          },
          {
            "label": "Sounds interesting, send me info",
            "to": "send_email"
          },
          {
            "label": "Not sure it's in our budget right now",
            "to": "no_budget"
          },
          {
            "label": "We're pretty happy with what we have",
            "to": "have_a_process"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING — LOCK IT NOW",
        "say": "Awesome. I've got next week pulled up — how does Tuesday or Wednesday look for you? I'm thinking like a fifteen-minute window, afternoon if that's easier.",
        "note": "Pick a specific day. Don't say 'when works for you' — give options. Lock day and time, send the invite while on the phone if possible.",
        "branches": [
          {
            "label": "Picks a day/time",
            "to": "meeting_booked"
          },
          {
            "label": "Let me check my calendar and get back to you",
            "to": "pin_down_meeting"
          },
          {
            "label": "Can you include Sarah or Britton?",
            "to": "include_leadership"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING BOOKED — CLOSE GRACEFULLY",
        "say": "Perfect — I just sent over a calendar invite. Really appreciate you taking my call, Joseph. Looking forward to showing you what we've got. Talk soon.",
        "note": "STOP SELLING. You got the meeting. Get off the phone. Don't add features or benefits — you'll unsell it.",
        "branches": []
      },
      "pin_down_meeting": {
        "label": "PIN DOWN THE MEETING",
        "say": "Totally — tell you what, I'll shoot you an email with a couple time options and a quick summary so you have something to look at. What's the best email — is it joe at luxury E-M-A dot com?",
        "note": "Confirm the email. If he pushes back on meeting entirely, pivot to email with specific time suggestions.",
        "branches": [
          {
            "label": "Confirms email / agrees to follow up",
            "to": "confirm_email_close"
          },
          {
            "label": "Actually let's just do [picks a time]",
            "to": "meeting_booked"
          }
        ]
      },
      "include_leadership": {
        "label": "INCLUDE SARAH OR BRITTON",
        "say": "Yeah absolutely — honestly that'd be ideal. Would it make sense for me to reach out to Sarah directly to set it up, or do you want to loop her in on your end?",
        "note": "This is a great outcome. You're getting a warm intro to the decision maker. Either way works — but if he offers to make the intro, that's gold.",
        "branches": [
          {
            "label": "I'll loop her in / I'll talk to her",
            "to": "warm_intro_close"
          },
          {
            "label": "Yeah reach out to her directly",
            "to": "get_sarah_details"
          },
          {
            "label": "Let me check with her first, then get back to you",
            "to": "confirm_email_close"
          }
        ]
      },
      "warm_intro_close": {
        "label": "WARM INTRO CLOSE",
        "say": "That would be huge, Joseph. I really appreciate that. I'll send you a quick email with a summary you can forward to her — keeps it easy. And I'll include a couple time options for next week. Sound good?",
        "note": "He's championing you internally. Make it easy for him to pass it along. Send a clean, short email he can forward.",
        "branches": [
          {
            "label": "Sounds good / confirms",
            "to": "confirm_email_close"
          }
        ]
      },
      "get_sarah_details": {
        "label": "GET SARAH'S DETAILS",
        "say": "Perfect — I've actually got her info. I'll reach out to Sarah and mention you and I chatted. That way it's not totally cold for her either. Really appreciate the intro, Joseph.",
        "note": "You already have Sarah's direct line (970.379.4705) and email (sarah@luxuryema.com). Mention Joseph by name when you call her.",
        "branches": [
          {
            "label": "Sounds good",
            "to": "confirm_email_close"
          }
        ]
      },
      "referral_to_sarah": {
        "label": "REFERRAL — ROUTE TO SARAH/LEADERSHIP",
        "say": "Yeah that makes total sense — with something like this you'd want Sarah or Britton in the loop. If I reached out to Sarah, would it help if I mentioned that you and I talked? Just so it's not totally out of the blue for her.",
        "note": "Joseph is a PM — he likely can't greenlight new tools alone. Sarah Korpela (President) or Britton Nieslanik (VP) are the decision makers. Get Joseph to warm the path.",
        "branches": [
          {
            "label": "Yeah sure, mention my name",
            "to": "get_sarah_details"
          },
          {
            "label": "I'll talk to her first and get back to you",
            "to": "confirm_email_close"
          },
          {
            "label": "I don't think we're interested as a company",
            "to": "graceful_exit"
          }
        ]
      },
      "have_a_process": {
        "label": "OBJECTION — WE HAVE A PROCESS",
        "say": "That makes total sense — honestly with the level of homes you guys manage, you'd have to have something in place. I wouldn't expect anything less. Just out of curiosity though — is it that you're fully covered and happy with how it's working, or is it more that switching anything right now would just be a headache?",
        "note": "Miyagi method: agree first, then split the objection. You're not arguing — you're getting to the real reason.",
        "branches": [
          {
            "label": "We're happy with what we have",
            "to": "happy_with_process"
          },
          {
            "label": "Switching would be a headache / bad timing",
            "to": "sell_test_drive"
          },
          {
            "label": "Honestly it's not perfect but...",
            "to": "warm_discovery"
          }
        ]
      },
      "happy_with_process": {
        "label": "THEY'RE HAPPY — OFFER VALUE ANYWAY",
        "say": "That's great honestly. Look — I'm not trying to fix something that's not broken. But if nothing else, I could walk you through what a couple other luxury PMs in mountain markets are doing differently with their turnover documentation. Worst case you steal some ideas and we part as friends. Would that be worth fifteen minutes?",
        "note": "The offer of value: the meeting is useful even if they never buy. You're positioning as a peer sharing intel, not a salesman pushing a product.",
        "branches": [
          {
            "label": "Sure, that could be useful",
            "to": "book_meeting"
          },
          {
            "label": "Nah, I think we're good",
            "to": "graceful_exit"
          },
          {
            "label": "Maybe — send me something first",
            "to": "send_email"
          }
        ]
      },
      "not_interested_early": {
        "label": "OBJECTION — NOT INTERESTED (EARLY)",
        "say": "I totally get it — I should have assumed you'd already be all set. Otherwise you probably would have reached out to us. Just so nobody from my team bugs you again — is it that this isn't a problem you're focused on right now, or is it more that you just hate cold calls? Because honestly, I get it either way.",
        "note": "Miyagi: agree, then split. The humor about hating cold calls disarms. Most people will laugh and open up slightly.",
        "branches": [
          {
            "label": "I just don't like cold calls / bad timing",
            "to": "sell_test_drive"
          },
          {
            "label": "It's not a problem we're focused on",
            "to": "not_a_priority"
          },
          {
            "label": "Both / just not interested",
            "to": "graceful_exit"
          }
        ]
      },
      "not_interested_after_pain": {
        "label": "OBJECTION — NOT INTERESTED (AFTER PAIN)",
        "say": "Totally fair. I appreciate you hearing me out. Is it that this just isn't a priority for you guys right now, or is it more that you already feel covered on the inspection side?",
        "note": "Same Miyagi split but calibrated to where you are in the call. He heard the pitch — now find out if it's timing or fit.",
        "branches": [
          {
            "label": "Not a priority right now",
            "to": "not_a_priority"
          },
          {
            "label": "We feel covered",
            "to": "happy_with_process"
          },
          {
            "label": "I'd need to talk to leadership",
            "to": "referral_to_sarah"
          }
        ]
      },
      "not_a_priority": {
        "label": "NOT A PRIORITY — SEED FOR LATER",
        "say": "Makes sense. Honest question — is it that it's just not top of list right now, or is this genuinely not something that would ever be relevant for you guys? Because if it's timing, I'd rather just follow up when it makes sense than keep bugging you.",
        "note": "You're trying to distinguish 'not now' from 'not ever.' If it's timing, get permission to follow up. If it's never, exit gracefully.",
        "branches": [
          {
            "label": "Not now but maybe later / follow up in a few months",
            "to": "set_follow_up"
          },
          {
            "label": "Genuinely not relevant / not interested",
            "to": "graceful_exit"
          }
        ]
      },
      "set_follow_up": {
        "label": "SET FOLLOW-UP",
        "say": "Totally fair. When would make sense — are you guys more heads-down right now with ski season, and would spring be a better time to revisit? I'll put a reminder on my end and just check back in.",
        "note": "Aspen ski season is peak. Spring/summer might be when they evaluate ops changes. Get a rough timeframe and note it.",
        "branches": [
          {
            "label": "Yeah try me in spring / gives timeframe",
            "to": "follow_up_confirmed"
          },
          {
            "label": "Just email me then",
            "to": "send_email"
          }
        ]
      },
      "follow_up_confirmed": {
        "label": "FOLLOW-UP CONFIRMED",
        "say": "Perfect — I'll circle back around then. And if anything comes up before that, my email's sam at rapideye dot com. Really appreciate your time, Joseph. Enjoy the rest of ski season.",
        "note": "Leave on a high note. Ski season reference keeps it personal. Log the follow-up date immediately after the call.",
        "branches": []
      },
      "no_budget": {
        "label": "OBJECTION — NO BUDGET",
        "say": "Totally get it. Nowadays it's harder to keep a tool, let alone buy something new. Is it that the budget for this kind of thing is completely off the table, or is it more that anything new has to go through Sarah and the approval process is a pain?",
        "note": "Miyagi: agree, then split. You're testing whether it's a real budget constraint or a decision-authority issue. If it's authority, pivot to getting Sarah involved.",
        "branches": [
          {
            "label": "Budget is tight / off the table",
            "to": "sell_test_drive"
          },
          {
            "label": "Would need Sarah's approval",
            "to": "referral_to_sarah"
          },
          {
            "label": "We just don't spend on this kind of thing",
            "to": "graceful_exit"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Look, you're probably not buying anything right now, and I totally respect that. But the people who end up pulling the trigger later are usually the ones who already know what's out there. Would you be open to just seeing what it looks like — fifteen minutes, no commitment? If nothing else, you'll know whether it's worth revisiting when the timing's better.",
        "note": "This is your last-resort pitch for a meeting. You're removing all pressure. If he says no here, move to email or exit.",
        "branches": [
          {
            "label": "Fine, let's do a quick look",
            "to": "book_meeting"
          },
          {
            "label": "Send me something and I'll look at it",
            "to": "send_email"
          },
          {
            "label": "Nah, I'm good for now",
            "to": "graceful_exit"
          }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. Quick question before I do — what would be most useful to include? Like would you rather see how it works with the actual photo analysis, or more of a high-level overview of what other luxury PMs are doing? Just want to make sure it's not another generic email that gets buried.",
        "note": "Accept the email request but ask a qualifying question. This tells you what they care about AND keeps the conversation going. Confirm their email address.",
        "branches": [
          {
            "label": "Just send me an overview / whatever",
            "to": "confirm_email_close"
          },
          {
            "label": "Show me the photo analysis piece",
            "to": "confirm_email_close"
          },
          {
            "label": "Actually tells you what they care about",
            "to": "confirm_email_close"
          }
        ]
      },
      "confirm_email_close": {
        "label": "CONFIRM EMAIL + CLOSE",
        "say": "Got it. I'll send that over to joe at luxury E-M-A dot com — that right? And I'll include a couple times for next week in case you want to hop on a quick call after you've looked at it. Really appreciate your time, Joseph.",
        "note": "Confirm the email. Include specific time options in the email — don't leave it open-ended. Follow up within 24 hours.",
        "branches": [
          {
            "label": "Confirms email",
            "to": "email_confirmed_end"
          },
          {
            "label": "Corrects email",
            "to": "email_confirmed_end"
          }
        ]
      },
      "email_confirmed_end": {
        "label": "EMAIL CONFIRMED — END CALL",
        "say": "Perfect — I'll get that over to you today. Thanks again, Joseph. Talk soon.",
        "note": "Send the email within the hour. Reference this conversation specifically. Include 2-3 specific time slots for next week.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes down the road, I'm easy to find — Sam Parks at RapidEye. Appreciate your time, Joseph, and enjoy the snow out there.",
        "note": "Don't burn the bridge. Leave friendly. The ski season / Aspen reference keeps it personal. Log this as a 'not now' and revisit in 3-6 months.",
        "branches": []
      },
      "keep_it_brief": {
        "label": "HOW DOES IT WORK — KEEP IT BRIEF",
        "say": "Yeah so in short — your team takes photos after every turnover, same as you already do. RapidEye's AI analyzes every photo automatically and flags anything off. Damage, missing items, staging that's wrong, stuff that's changed since last time. No extra steps for your team — it just sits on top of your existing workflow. Think of it like having a second set of eyes on every single photo, except it never gets tired and never skims. For a guy who used to do pre-flight checks on Seahawks, it's basically the same concept — systematic verification so nothing slips.",
        "note": "The Seahawk reference is intentional — you're speaking his language. Military maintenance = systematic verification = RapidEye. Don't go deeper than this. Push to the meeting.",
        "branches": [
          {
            "label": "That's cool / interesting",
            "to": "book_meeting"
          },
          {
            "label": "How much does it cost?",
            "to": "handle_price"
          },
          {
            "label": "I'd need to talk to Sarah about this",
            "to": "referral_to_sarah"
          }
        ]
      },
      "handle_price": {
        "label": "PRICE QUESTION",
        "say": "Yeah great question — it honestly depends on the number of homes and the volume of turnovers, so I don't want to throw out a number that's not accurate. That's actually one of the things we'd nail down in a quick call. Would fifteen minutes next week work to walk through it and give you real numbers based on what you guys actually manage?",
        "note": "Never give price on a cold call. Use it as a bridge to the meeting. If they push hard, say it ranges based on portfolio size and turnover frequency.",
        "branches": [
          {
            "label": "Sure, let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "Just give me a ballpark",
            "to": "ballpark_and_redirect"
          },
          {
            "label": "I need to talk to leadership first",
            "to": "referral_to_sarah"
          }
        ]
      },
      "ballpark_and_redirect": {
        "label": "BALLPARK + REDIRECT TO MEETING",
        "say": "So for most luxury PM companies your size, it's a fraction of what one missed damage claim costs — we're talking a few hundred a month range, not thousands. But the exact number really depends on your setup. Honestly the quickest way to get you a real number is a fifteen-minute call where I can see what your workflow looks like. Would next week work?",
        "note": "Give a vague but honest range, then immediately redirect to the meeting. Don't get into a pricing negotiation on a cold call.",
        "branches": [
          {
            "label": "Okay let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Send me pricing info",
            "to": "send_email"
          },
          {
            "label": "Need to talk to leadership",
            "to": "referral_to_sarah"
          }
        ]
      }
    }
  }
}