{
  "name": "Kaprie Dawson",
  "title": "Local Operations Manager (Belize)",
  "company": "Vacasa",
  "location": "San Diego, CA",
  "phone": "+1-503-345-9399",
  "company_phone": "800-544-0300",
  "alt_phones": [
    "+1-800-544-0300",
    "+1-800-863-8415",
    "+1-850-299-9469",
    "+1-208-203-3377"
  ],
  "flow": {
    "context": "Kaprie Dawson is the Local Operations Manager for Vacasa's Belize market, based out of San Diego. She owns day-to-day turnovers, inspections, cleaning quality, and maintenance dispatch in a tropical international market where humidity, salt air, and storms accelerate property damage fast. Vacasa became a Casago subsidiary in May 2025, and the post-acquisition push to give local teams more autonomy means more accountability on Kaprie with fewer corporate resources. Her Senior GM is Sheldon Arnold. Sam's best hook: surfing — Sam surfed El Salvador this past fall and Indonesia last summer, and Belize is a coastal destination. No direct school or personal overlap found, but geographic proximity to San Diego and the surf lifestyle connection make the opener feel warm.",
    "start": "gatekeeper_slide",
    "nodes": {
      "gatekeeper_slide": {
        "label": "GATEKEEPER — SLIDE BY",
        "say": "Hey — could you get me through to Kaprie? It's Sam.",
        "note": "Say it like you know her. First name only. No company name. No pitch. If Kaprie answered directly, jump to opener.",
        "branches": [
          {
            "label": "Kaprie answered directly",
            "to": "opener"
          },
          {
            "label": "Putting you through / hold on",
            "to": "opener"
          },
          {
            "label": "Who's calling? / What's this about?",
            "to": "gatekeeper_context"
          },
          {
            "label": "She's not available",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — ADD CONTEXT",
        "say": "Yeah — I work with a few other property managers in the area on their inspection workflows. Would you mind letting Kaprie know it's Sam Parks?",
        "note": "Still don't pitch. Give just enough context to sound legitimate. End with a redirect question — you ask, you control.",
        "branches": [
          {
            "label": "Putting you through",
            "to": "opener"
          },
          {
            "label": "What company? / More detail?",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "She's not available / can I take a message?",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "It's Sam Parks with RapidEye — we help a couple other property management companies with their turnover inspection workflows. I sent Kaprie a note — would you mind giving her a heads up that I'm on the line?",
        "note": "This is your last gatekeeper move. If they still won't put you through, get a callback time or voicemail. Don't argue.",
        "branches": [
          {
            "label": "Putting you through",
            "to": "opener"
          },
          {
            "label": "She's not available / take a message",
            "to": "gatekeeper_unavailable"
          },
          {
            "label": "She doesn't take cold calls",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_unavailable": {
        "label": "GATEKEEPER — UNAVAILABLE",
        "say": "No worries at all. When would be the best time to catch her? I'd rather not just leave a voicemail if I can help it.",
        "note": "Get a specific callback window. If they won't give one, ask for her direct line or email. Log whatever you get.",
        "branches": [
          {
            "label": "Gives a time / suggests when to call back",
            "to": "confirm_callback"
          },
          {
            "label": "Just leave a message / email her",
            "to": "gatekeeper_email_fallback"
          },
          {
            "label": "Won't help",
            "to": "graceful_exit_gatekeeper"
          }
        ]
      },
      "gatekeeper_email_fallback": {
        "label": "GATEKEEPER — GET EMAIL",
        "say": "Totally fair — what's the best email for her? I'll send something short so she's got context when I try her again.",
        "note": "You already know pattern is likely kaprie.dawson@vacasa.com or kaprie-dawson@vacasa.com. Confirm it. Then call back in 1-2 days.",
        "branches": [
          {
            "label": "Gives email / confirms",
            "to": "graceful_exit_gatekeeper"
          },
          {
            "label": "Won't give email",
            "to": "graceful_exit_gatekeeper"
          }
        ]
      },
      "graceful_exit_gatekeeper": {
        "label": "EXIT — GATEKEEPER",
        "say": "Appreciate your help — thanks a lot.",
        "note": "Log the interaction. Send a brief email to kaprie.dawson@vacasa.com today. Try calling again in 1-2 days at a different time.",
        "branches": []
      },
      "opener": {
        "label": "OPENER",
        "say": "Hey Kaprie — this is gonna sound a little random, but I work with a few property managers and I've honestly been curious about the Belize side of things. I surf a lot — was just down in El Salvador this past fall — and I've been eyeing that coast. Anyway, it's Sam Parks with RapidEye. Have you heard my name tossed around?",
        "note": "Feet up on the desk energy. Smile. The surfing line is genuine — Sam surfs, Belize is coastal. Don't rush it. Let her process the question.",
        "branches": [
          {
            "label": "No, I haven't heard of you",
            "to": "heard_no"
          },
          {
            "label": "Yeah / maybe / sounds familiar",
            "to": "heard_yes"
          },
          {
            "label": "I'm busy / bad time",
            "to": "bad_timing"
          },
          {
            "label": "Who is this? / What's this about?",
            "to": "permission_ask"
          }
        ]
      },
      "heard_no": {
        "label": "HEARD NO — PIVOT TO PAIN",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call is — I work with a few other ops managers who run properties in markets kinda like yours. Tropical, international, high turnover variance. And the thing I keep hearing is — their cleaners are submitting photos after every turn through the app, but nobody actually has time to review all of them carefully. Stuff slips through — a water stain behind a headboard, mold starting on a bathroom ceiling, a cracked tile — and the next guest finds it before anyone on the team does. And in a market like Belize where you can't just call a contractor down the street, by the time you catch it, it's a scramble. We built something that automatically reviews those turnover photos and flags damage, missing items, condition changes — before the next guest walks in. Would you be open to taking a look sometime when I'm not cold calling you out of the blue?",
        "note": "Pause after 'it's a scramble.' Let her react to the pain before you pitch the solution. The Belize contractor scarcity is the sharpest pain point — that's what should land.",
        "branches": [
          {
            "label": "That's interesting / tell me more",
            "to": "warm_response"
          },
          {
            "label": "We already have a process for that",
            "to": "objection_have_process"
          },
          {
            "label": "I'm not the right person for this",
            "to": "referral_probe"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          },
          {
            "label": "How does it work?",
            "to": "how_it_works"
          }
        ]
      },
      "heard_yes": {
        "label": "HEARD YES — EXPLORE",
        "say": "Oh nice — well normally we'd be working with someone exactly like you. What'd you hear?",
        "note": "Let her talk. Whatever she says, bridge into discovery about her process or the pain trigger.",
        "branches": [
          {
            "label": "Vague / just heard the name",
            "to": "warm_response"
          },
          {
            "label": "Knows what RapidEye does",
            "to": "warm_response"
          },
          {
            "label": "Confused / mixing it up",
            "to": "heard_no"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow or later this week?",
        "note": "Don't apologize. Just offer a reschedule. If she gives a time, lock it in immediately.",
        "branches": [
          {
            "label": "Sure, try me at [time]",
            "to": "book_callback"
          },
          {
            "label": "What's this about? (opens up)",
            "to": "permission_ask"
          },
          {
            "label": "No, don't call back",
            "to": "graceful_exit"
          }
        ]
      },
      "permission_ask": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not a fit?",
        "note": "This is your last chance to earn attention. If she says yes, go straight to pain trigger. Sound relaxed, not desperate.",
        "branches": [
          {
            "label": "Sure, go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "No / I'm not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED — SPLIT",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and it's just not interesting?",
        "note": "Split the objection. If it's timing, get a callback. If it's disinterest, try for a referral or exit gracefully.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / don't need it",
            "to": "referral_probe"
          },
          {
            "label": "Hangs up",
            "to": "graceful_exit_hung_up"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "So — I work with another ops manager who runs a portfolio in a similar situation to yours. Tropical market, international, lots of property variance. And the thing she kept telling me was — her cleaners were submitting photos after every single turn, which is great, but she physically couldn't review them all carefully enough. And in that kind of environment — humidity, salt air, storms — stuff degrades fast. A guest would check in and find water damage behind a dresser, or mold starting on a bathroom ceiling, and the photos were technically there but nobody caught it in time. And then you're trying to fix it when there's maybe two contractors available on the whole coast. We built a tool that automatically reviews those turnover photos — flags damage, missing items, condition changes compared to a baseline of each property — so the stuff that actually matters gets surfaced before the next guest walks in. Would you be open to seeing how it works?",
        "note": "Pause after 'two contractors available on the whole coast.' That's the line that should hit hardest for someone managing Belize. Let her react before you pitch the solution.",
        "branches": [
          {
            "label": "That sounds interesting / tell me more",
            "to": "warm_response"
          },
          {
            "label": "We already handle that",
            "to": "objection_have_process"
          },
          {
            "label": "I'd need to run that by my manager",
            "to": "objection_need_approval"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          },
          {
            "label": "How does it actually work?",
            "to": "how_it_works"
          }
        ]
      },
      "warm_response": {
        "label": "WARM — STOP PITCHING, START ASKING",
        "say": "Cool — before I ramble on, I'm curious. What does your inspection process actually look like in Belize right now? Like after a cleaner finishes a turn, what happens before the next guest checks in?",
        "note": "She's interested. DO NOT keep pitching. Ask about her world. Listen for: photo submissions, who reviews them, what gets missed, turnover timing, contractor availability.",
        "branches": [
          {
            "label": "Describes process (photos, app, checklists)",
            "to": "discovery_deeper"
          },
          {
            "label": "Pretty manual / visual walkthroughs",
            "to": "discovery_manual_process"
          },
          {
            "label": "We use HomeCare Hub / the Vacasa field app",
            "to": "discovery_homecare_hub"
          },
          {
            "label": "I'm not sure I'm the right person",
            "to": "referral_probe"
          }
        ]
      },
      "discovery_deeper": {
        "label": "DISCOVERY — DIG INTO PAIN",
        "say": "Got it. And when something does slip through — like a guest finds damage that should've been caught — what does that look like on your end? How often does that actually happen?",
        "note": "You're looking for frequency of missed issues, consequences (bad reviews, owner complaints, emergency fixes). If she shares real pain, mirror it back before offering the solution.",
        "branches": [
          {
            "label": "Admits it happens / shares examples",
            "to": "mirror_pain_and_pitch"
          },
          {
            "label": "Says it's rare / we catch most things",
            "to": "probe_scale_challenge"
          },
          {
            "label": "Talks about owner complaints or reviews",
            "to": "mirror_pain_and_pitch"
          }
        ]
      },
      "discovery_manual_process": {
        "label": "DISCOVERY — MANUAL PROCESS",
        "say": "Makes sense. And how many properties are you managing over in Belize right now? Like how many turns are you dealing with in a typical week during high season?",
        "note": "Establish volume. If she's doing visual walkthroughs at scale, the pain is that she can't be everywhere. RapidEye is another set of eyes on every turn.",
        "branches": [
          {
            "label": "Shares numbers / sounds overwhelmed",
            "to": "mirror_pain_and_pitch"
          },
          {
            "label": "It's manageable / small portfolio",
            "to": "probe_growth_casago"
          },
          {
            "label": "Deflects / unsure of numbers",
            "to": "cta_low_friction"
          }
        ]
      },
      "discovery_homecare_hub": {
        "label": "DISCOVERY — HOMECARE HUB / VACASA FIELD APP",
        "say": "Yeah, that's what I figured — I know Vacasa has the field app where cleaners submit photos after each turn for inspection approval. So who's actually reviewing those photos on your end? Is that you, or does that go through a central team?",
        "note": "This is gold. You know Vacasa's system supports post-cleaning photo submissions for real-time inspection approval. If Kaprie reviews them, she's the exact user who'd benefit. If central, ask how well that works for Belize-specific conditions.",
        "branches": [
          {
            "label": "I review them / my team reviews",
            "to": "probe_review_volume"
          },
          {
            "label": "Goes through central / different team",
            "to": "probe_central_review_gap"
          },
          {
            "label": "Not sure how it works post-acquisition",
            "to": "probe_casago_transition"
          }
        ]
      },
      "probe_review_volume": {
        "label": "PROBE — PHOTO REVIEW VOLUME",
        "say": "How many photos are you looking at per turn, roughly? And be honest — when you've got back-to-back turns in high season, are you actually able to look at every single one carefully, or are you kinda scanning through?",
        "note": "She'll likely admit she's scanning or skipping some. That's the opening — RapidEye catches what the human eye skips when you're moving fast.",
        "branches": [
          {
            "label": "Admits scanning / can't review thoroughly",
            "to": "mirror_pain_and_pitch"
          },
          {
            "label": "Says she reviews everything carefully",
            "to": "probe_scale_challenge"
          },
          {
            "label": "Talks about volume / overwhelm",
            "to": "mirror_pain_and_pitch"
          }
        ]
      },
      "probe_central_review_gap": {
        "label": "PROBE — CENTRAL REVIEW GAP",
        "say": "Got it. And does that central team actually know what normal looks like for each property in Belize? Like, can they tell the difference between a stain that's always been there and a new one, or that a certain unit always has condensation versus actual water damage?",
        "note": "Central teams miss local context. RapidEye uses per-property baselines — it knows what 'normal' looks like for each specific unit.",
        "branches": [
          {
            "label": "No, they don't have that context",
            "to": "mirror_pain_and_pitch"
          },
          {
            "label": "It's hit or miss",
            "to": "mirror_pain_and_pitch"
          },
          {
            "label": "We handle it fine",
            "to": "cta_low_friction"
          }
        ]
      },
      "probe_casago_transition": {
        "label": "PROBE — CASAGO TRANSITION",
        "say": "Yeah, makes sense — I know there's been a ton of change since the Casago acquisition. Has the transition affected how your ops tools work in Belize? Like are you guys moving to Breezeway and Guesty, or still on the Vacasa stack?",
        "note": "Shows homework. Casago network standardized on Breezeway + Guesty. If transitioning, RapidEye integrates with Breezeway directly. If still on Vacasa tools, works either way. This also builds trust — you understand her world.",
        "branches": [
          {
            "label": "Still on Vacasa tools / unclear",
            "to": "transition_pitch"
          },
          {
            "label": "Moving to Breezeway / Guesty",
            "to": "transition_pitch_breezeway"
          },
          {
            "label": "Doesn't want to discuss internal changes",
            "to": "cta_low_friction"
          }
        ]
      },
      "probe_scale_challenge": {
        "label": "PROBE — CHALLENGE GENTLY",
        "say": "That's great — honestly, that's rare. Most ops managers I talk to are stretched thin. Let me ask you this though — with the Casago transition happening and things shifting, are you expecting the Belize portfolio to grow? Because the managers I work with who had it dialed at 20 or 30 units — that's usually when things start cracking.",
        "note": "Don't argue. Validate, then plant a seed about future scale. Casago is expanding aggressively — if Belize grows, manual inspection won't scale.",
        "branches": [
          {
            "label": "Yeah, we might be growing",
            "to": "mirror_pain_and_pitch"
          },
          {
            "label": "Not sure / we'll see",
            "to": "cta_low_friction"
          },
          {
            "label": "We're fine as is",
            "to": "cta_low_friction"
          }
        ]
      },
      "probe_growth_casago": {
        "label": "PROBE — CASAGO GROWTH",
        "say": "Makes sense. I know Casago's been expanding pretty aggressively — they just picked up 150 former Vacasa homes in San Diego alone back in August. Any talk about growing the Belize portfolio too? Because that's usually when the process that works fine at a small scale starts breaking.",
        "note": "San Diego expansion is a concrete, dated fact (Aug 18, 2025). Plant the seed that growth breaks manual processes.",
        "branches": [
          {
            "label": "Growth is planned / possible",
            "to": "mirror_pain_and_pitch"
          },
          {
            "label": "Not sure",
            "to": "cta_low_friction"
          },
          {
            "label": "That's above my pay grade",
            "to": "referral_probe"
          }
        ]
      },
      "mirror_pain_and_pitch": {
        "label": "MIRROR PAIN + ONE-SENTENCE SOLUTION",
        "say": "Yeah — that's exactly what I keep hearing. And that's really what we built RapidEye for. It plugs into whatever system you're using for turnover photos — the Vacasa app, Breezeway, whatever you end up on — and it automatically flags damage, missing items, condition changes compared to a baseline of each property. So instead of scanning through photos hoping you catch something, the stuff that actually matters gets surfaced for you. Would it make sense to hop on a quick call this week so I can show you what it looks like?",
        "note": "One sentence on what it does, then CTA. Don't oversell. She's warm — close the meeting.",
        "branches": [
          {
            "label": "Yeah, I'd be open to that",
            "to": "book_meeting"
          },
          {
            "label": "I'd need to loop in my manager / Sheldon",
            "to": "objection_need_approval"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Not sure I can commit right now",
            "to": "cta_low_friction"
          }
        ]
      },
      "transition_pitch": {
        "label": "TRANSITION — STILL ON VACASA STACK",
        "say": "Got it. Well either way — whether you stay on the Vacasa field app or move to something new — RapidEye just sits on top of whatever photo workflow you're already running. No new process for your cleaners, nothing changes for them. It just reviews what they're already submitting and catches what humans miss. Especially in a tropical market where things degrade fast. Would you be open to a quick look?",
        "note": "Emphasize zero workflow change. She's in the middle of a systems transition — last thing she wants is another new tool to learn.",
        "branches": [
          {
            "label": "Yeah, let's look at it",
            "to": "book_meeting"
          },
          {
            "label": "I need to check with someone",
            "to": "objection_need_approval"
          },
          {
            "label": "Send me info",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "objection_not_interested"
          }
        ]
      },
      "transition_pitch_breezeway": {
        "label": "TRANSITION — MOVING TO BREEZEWAY",
        "say": "Oh perfect — we actually integrate directly with Breezeway. So the photos your cleaners submit through Breezeway after each turn, RapidEye automatically pulls those and analyzes them. Flags damage, missing items, staging issues — compared to a baseline of what each property should look like. Zero extra work for your team. Would you be open to a quick look at how that works?",
        "note": "Breezeway integration is a huge selling point. Make it sound seamless. If she's moving to Breezeway, this is an easy add-on conversation.",
        "branches": [
          {
            "label": "That sounds good / let's talk",
            "to": "book_meeting"
          },
          {
            "label": "I'd need to run it by someone",
            "to": "objection_need_approval"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          },
          {
            "label": "Not interested right now",
            "to": "objection_not_interested"
          }
        ]
      },
      "how_it_works": {
        "label": "HOW IT WORKS — BRIEF",
        "say": "Yeah — so your cleaners are already taking photos after each turn, right? Through whatever app or system you're using. RapidEye plugs into that and automatically reviews every photo. It compares each one against a baseline of what that specific property should look like — so it catches new damage, missing items, furniture that's been moved, staging issues. Think of it like an extra set of eyes that never gets tired and knows every property. The whole point is it surfaces the stuff that matters so you're not scanning through hundreds of photos yourself.",
        "note": "Keep it simple. Don't get technical. If she asks detailed follow-ups, that's buying signal — pivot to booking a demo.",
        "branches": [
          {
            "label": "That's cool / makes sense",
            "to": "cta_low_friction"
          },
          {
            "label": "How does it integrate with our system?",
            "to": "integration_answer"
          },
          {
            "label": "What does it cost?",
            "to": "deflect_price"
          }
        ]
      },
      "integration_answer": {
        "label": "INTEGRATION QUESTION",
        "say": "We plug into whatever PMS or ops platform you're running — Breezeway, the Vacasa field app, Guesty, Track — wherever the photos live, we pull from there. No new app for your cleaners, no new process. It just sits on top of what they're already doing. Honestly the best way to see it is a quick 15-minute walkthrough. Would you have time this week or next?",
        "note": "Integration questions are buying signals. Pivot to booking the meeting immediately.",
        "branches": [
          {
            "label": "Sure, let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "I need to check with someone first",
            "to": "objection_need_approval"
          },
          {
            "label": "Send me details",
            "to": "send_email"
          }
        ]
      },
      "deflect_price": {
        "label": "PRICE QUESTION — DEFLECT",
        "say": "It depends on the portfolio size and setup — I don't want to throw out a number without understanding what you're working with. But honestly, when you think about what a missed damage incident costs — an emergency repair in Belize, a bad review on a property, an owner calling you asking why nobody caught it — it's usually a pretty easy math problem. Can I show you the product first and then we can talk numbers? That way you'll know exactly what you'd be getting.",
        "note": "Never quote price on a cold call. Redirect to the demo. Price questions are strong interest signals — she's evaluating.",
        "branches": [
          {
            "label": "Okay, sure",
            "to": "book_meeting"
          },
          {
            "label": "Just give me a ballpark",
            "to": "cta_low_friction"
          },
          {
            "label": "Send me pricing info",
            "to": "send_email"
          }
        ]
      },
      "objection_have_process": {
        "label": "OBJECTION — WE HAVE A PROCESS",
        "say": "That makes total sense — managing properties in Belize, you'd have to have something solid in place. I wouldn't expect anything less. Just so nobody from my team cold calls you again — is it that you're totally covered and happy with how inspections work right now, or is it more that adding anything new during the Casago transition would just be a headache?",
        "note": "Agree first — don't argue. Then split the objection. The Casago transition is real disruption — use it to see if the door opens for later.",
        "branches": [
          {
            "label": "We're happy with what we have",
            "to": "sell_test_drive"
          },
          {
            "label": "It's more the timing / transition",
            "to": "sell_test_drive_timing"
          },
          {
            "label": "A bit of both",
            "to": "sell_test_drive"
          }
        ]
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "Totally get it — I should've assumed you'd be all set, otherwise you probably would've reached out. Just so nobody from my team bugs you again — is it that this isn't really a problem you're dealing with, or is it more that you just hate cold calls? Because honestly, I get it either way.",
        "note": "Agree. Don't push. Split the objection to find the real reason. If it's the cold call itself, you can still salvage it.",
        "branches": [
          {
            "label": "I just hate cold calls / bad timing",
            "to": "sell_test_drive_timing"
          },
          {
            "label": "Not a problem we have",
            "to": "sell_test_drive"
          },
          {
            "label": "I'm not the right person",
            "to": "referral_probe"
          },
          {
            "label": "Firm no",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_need_approval": {
        "label": "OBJECTION — NEED APPROVAL",
        "say": "Totally makes sense. Would that be Sheldon Arnold, or someone on the corporate side? Because what I could do is put together something specific to the Belize market — the tropical damage detection angle, how it plugs into your current workflow — so when you bring it to them, it's not just 'some random guy cold called me.' Would that help?",
        "note": "Name-drop Sheldon Arnold (Senior GM Belize — her direct manager). If she confirms, offer to include him on the demo. If it's corporate, ask for the name. Showing you know the org builds trust.",
        "branches": [
          {
            "label": "Yeah, it's Sheldon / my manager",
            "to": "include_sheldon"
          },
          {
            "label": "It's someone at corporate / HQ",
            "to": "referral_corporate"
          },
          {
            "label": "Let me just talk to them first",
            "to": "send_email"
          }
        ]
      },
      "include_sheldon": {
        "label": "INCLUDE SHELDON ON DEMO",
        "say": "Perfect — what if we just loop Sheldon in on the call? That way you're not playing telephone. I could set up a 15-minute walkthrough, show both of you what it looks like with tropical properties specifically, and if it's not a fit, no hard feelings. Would later this week work, or is next week better?",
        "note": "Get both on the call. A two-person demo with the local ops manager AND the senior GM is way more likely to move forward. Lock in a time NOW.",
        "branches": [
          {
            "label": "Let me check with Sheldon on timing",
            "to": "book_meeting"
          },
          {
            "label": "I'll run it by him and get back to you",
            "to": "send_email"
          },
          {
            "label": "Just send me something first",
            "to": "send_email"
          }
        ]
      },
      "referral_corporate": {
        "label": "REFERRAL — CORPORATE",
        "say": "Got it — is that someone like Bob Milne on the ops side, or more of a tech decision through someone like Carlos Corzo's team? Just want to make sure if I reach out, I'm going to the right person — and I can mention you pointed me there.",
        "note": "Bob Milne is SVP Ops, Carlos Corzo is CTO at Vacasa. Name-dropping shows you've done deep homework and aren't guessing. Get a specific name and permission to use Kaprie's name.",
        "branches": [
          {
            "label": "Gives a name / confirms one of them",
            "to": "book_meeting_with_referral"
          },
          {
            "label": "Not sure who specifically",
            "to": "referral_generic"
          },
          {
            "label": "Doesn't want to give a name",
            "to": "send_email"
          }
        ]
      },
      "referral_probe": {
        "label": "REFERRAL — FIND RIGHT PERSON",
        "say": "Totally fair — who on your team would typically own anything related to inspection workflows or turnover quality? I'd rather reach the right person than keep bugging you.",
        "note": "If she says Sheldon Arnold, pivot to getting his direct line or looping him in. If she names someone at corporate, get specifics. Even a title helps.",
        "branches": [
          {
            "label": "Names Sheldon / her manager",
            "to": "include_sheldon"
          },
          {
            "label": "Names a corporate person",
            "to": "book_meeting_with_referral"
          },
          {
            "label": "Not sure / doesn't want to say",
            "to": "graceful_exit"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally respect that. And look — you're probably not buying anything from a cold call today, I get it. But if nothing else, I could walk you through what a few other property managers in similar tropical markets are doing with their turnover photos. Worst case you steal some ideas for Belize and we part as friends. Would that be worth 15 minutes?",
        "note": "The meeting has value even if she never buys. Frame it as insight, not a sales pitch. 'Steal some ideas' lowers the stakes.",
        "branches": [
          {
            "label": "Sure, why not",
            "to": "book_meeting"
          },
          {
            "label": "Not right now",
            "to": "graceful_exit"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          }
        ]
      },
      "sell_test_drive_timing": {
        "label": "SELL TEST DRIVE — TIMING",
        "say": "Totally get it — especially with the Casago transition, last thing you need is someone pitching you something new. But here's the thing — when the dust settles and you're looking at your ops stack, the people who move fastest are the ones who already know what's out there. Would you be open to a quick look — not to buy anything, just so it's on your radar when things stabilize?",
        "note": "Acknowledge the transition is real disruption. Position the demo as future-proofing, not a purchase decision. Low pressure.",
        "branches": [
          {
            "label": "Yeah, that's fair / okay",
            "to": "book_meeting"
          },
          {
            "label": "Reach out in a few months",
            "to": "book_callback"
          },
          {
            "label": "No thanks",
            "to": "graceful_exit"
          }
        ]
      },
      "cta_low_friction": {
        "label": "LOW-FRICTION CTA",
        "say": "Look, I know I caught you out of the blue. Would you be open to a 15-minute call sometime this week where I can just show you what it looks like? If it's not a fit, you'll never hear from me again. If it is — could save you a ton of headaches before high season hits.",
        "note": "Simple ask. 15 minutes, no commitment. Belize high season (Dec-April) creates urgency. Adjust the seasonal reference based on when you're calling.",
        "branches": [
          {
            "label": "Sure, let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Send me an email first",
            "to": "send_email"
          },
          {
            "label": "I need to check with someone",
            "to": "objection_need_approval"
          },
          {
            "label": "No thanks",
            "to": "graceful_exit"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next Tuesday and Thursday pulled up — does morning or afternoon work better for you?",
        "note": "Lock it in NOW. Offer two day options. Once she picks, confirm exact time, say you're sending the invite. Then STOP SELLING.",
        "branches": [
          {
            "label": "Picks a day/time",
            "to": "confirm_meeting"
          },
          {
            "label": "Let me check my calendar and get back",
            "to": "send_email_with_times"
          }
        ]
      },
      "confirm_meeting": {
        "label": "CONFIRM + CLOSE",
        "say": "Perfect — I'll shoot over a calendar invite right now. And hey, I really appreciate you taking my call, Kaprie. Talk to you then.",
        "note": "Send the invite WHILE on the phone if possible. Stop selling. Keep it warm. You're done. Log everything immediately after hanging up.",
        "branches": []
      },
      "send_email_with_times": {
        "label": "SEND EMAIL WITH TIMES",
        "say": "No problem — I'll send over an email with a couple time slots. What's the best email for you — is it kaprie dot dawson at vacasa?",
        "note": "Confirm the email address. Include 2-3 specific time options in the email. Send within 5 minutes of hanging up. Follow up in 2 days if no response.",
        "branches": [
          {
            "label": "Confirms email",
            "to": "confirm_email"
          },
          {
            "label": "Gives different email",
            "to": "confirm_email"
          }
        ]
      },
      "book_meeting_with_referral": {
        "label": "BOOK MEETING — WITH REFERRAL",
        "say": "Awesome — I really appreciate that. Can I mention that you and I connected when I reach out to them? And honestly, if you'd be open to being on the call too, it'd go a lot smoother — you know the Belize operations inside and out. Would that work?",
        "note": "Try to get Kaprie on the referral call. Her local context makes the demo way more relevant. Get the referral's email or direct line if possible.",
        "branches": [
          {
            "label": "Yeah, loop me in",
            "to": "book_meeting"
          },
          {
            "label": "Just reach out to them directly",
            "to": "send_email_referral"
          },
          {
            "label": "Let me talk to them first",
            "to": "send_email"
          }
        ]
      },
      "book_callback": {
        "label": "BOOK A CALLBACK",
        "say": "Totally fair. When would be a better time to try you? I'd rather catch you when you've actually got a minute.",
        "note": "Get a specific day and time. Put it in your calendar immediately. Send a brief email as a touchpoint before the callback.",
        "branches": [
          {
            "label": "Gives a specific time",
            "to": "confirm_callback"
          },
          {
            "label": "Just email me",
            "to": "send_email"
          },
          {
            "label": "Vague / 'in a few weeks'",
            "to": "send_email"
          }
        ]
      },
      "confirm_callback": {
        "label": "CONFIRM CALLBACK",
        "say": "Got it — I'll give you a ring then. Appreciate your time, Kaprie. Talk soon.",
        "note": "Log the callback time immediately. Send a brief, one-line email before the callback so she remembers who you are.",
        "branches": []
      },
      "send_email": {
        "label": "SEND EMAIL — ASK ONE QUESTION",
        "say": "Totally fair. One quick question before I do — what would be most relevant to include so it's not just another generic pitch sitting in your inbox? Like is it more about how it works technically, or more about what other managers in tropical markets have seen?",
        "note": "Get intel for the email. Whatever she says, tailor it. Include a specific meeting time suggestion in the email. Send within 10 minutes of hanging up.",
        "branches": [
          {
            "label": "Tells you what to include",
            "to": "confirm_email"
          },
          {
            "label": "Just send whatever / doesn't care",
            "to": "confirm_email"
          }
        ]
      },
      "send_email_referral": {
        "label": "CONFIRM REFERRAL EMAIL",
        "say": "Perfect — I'll put something together for them and mention we connected. Kaprie, really appreciate your time. And hey, if there's ever anything I can help with on the Belize ops side — even just what we're seeing other managers do — don't hesitate to reach out.",
        "note": "Leave the door open. Send the referral email same day. CC Kaprie if she gave permission. Keep her warm — she's your internal champion path.",
        "branches": []
      },
      "confirm_email": {
        "label": "CONFIRM EMAIL + CLOSE",
        "say": "Got it — I'll send that over today. And I'll drop in a couple times to connect in case you want to take a look. Appreciate your time, Kaprie.",
        "note": "Send within 10 minutes. Include: (1) the angle she asked for, (2) one concrete example from a similar market, (3) two specific meeting time suggestions. Follow up in 3 days if no response.",
        "branches": []
      },
      "referral_generic": {
        "label": "REFERRAL — GENERIC",
        "say": "No worries — if I can get a name, I'll put something tailored together so it actually lands instead of going to a generic inbox. Anyone on the ops leadership side you'd point me toward?",
        "note": "Push gently for a name. Even a title or department helps. If she truly won't give one, thank her and exit gracefully.",
        "branches": [
          {
            "label": "Gives a name",
            "to": "book_meeting_with_referral"
          },
          {
            "label": "Won't give a name",
            "to": "graceful_exit"
          }
        ]
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand, Kaprie. If anything ever changes, I'm easy to find. Appreciate your time — and hey, if you ever need surf spot recommendations for El Salvador, I got you.",
        "note": "End warm. The surf callback makes it human and memorable. Don't burn the bridge. Log the call outcome. Try again in 3-4 weeks with a different angle or email first.",
        "branches": []
      },
      "graceful_exit_hung_up": {
        "label": "HUNG UP",
        "say": "",
        "note": "Log the call. Send a brief, non-pushy email within the hour: 'Hey Kaprie, sorry for the cold call — here's a 30-second overview of why I reached out in case it's ever relevant.' Include a calendar link. Try again in 3 weeks at a different time of day.",
        "branches": []
      }
    }
  }
}