{
  "name": "Karen Haley",
  "title": "Main Point of Contact",
  "company": "Southern Shores Realty",
  "location": "Outer Banks, NC",
  "phone": "+1-252-261-2000 ext. 301",
  "company_phone": "+1-800-334-1000",
  "alt_phones": [],
  "flow": {
    "context": "Karen Haley is the Main Point of Contact at Southern Shores Realty — one of the oldest OBX vacation rental operators (since the 1940s), managing 350–700+ homes out of Southern Shores, NC. She is the primary contact listed in the Outer Banks Chamber of Commerce directory, meaning she is likely senior leadership or the person who routes all vendor and partner inquiries internally. Critical insight: their owner-facing marketing explicitly promotes in-house cleaning teams using detailed checklists and photo verification — they already value exactly what RapidEye automates, but are almost certainly doing it manually at massive scale during peak Saturday-to-Saturday turns. Sam's hook: surfer and fisherman who knows the OBX coast, and RapidEye already works with East Coast PM companies managing hundreds of properties. Call her direct at (252) 261-2000 ext. 301.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Karen — I spend a good bit of time out on the Outer Banks, big surfer and fisherman, and I've been working with a few vacation rental managers in the area on their inspection workflows. It's Sam Parks with RapidEye. Have you heard my name tossed around?",
        "note": "Feet-up energy. Smile. Don't rush. The surfing and fishing line is genuine — Sam founded a fishing club and surfs regularly. Pause after 'tossed around' and let her respond. You're calling her direct extension so she'll likely pick up.",
        "branches": [
          {
            "label": "Yes / Maybe / Sounds familiar",
            "to": "heard_yes"
          },
          {
            "label": "No / Who?",
            "to": "heard_no"
          },
          {
            "label": "Bad timing / I'm busy right now",
            "to": "bad_timing"
          },
          {
            "label": "Guarded / What is this about?",
            "to": "guarded"
          }
        ]
      },
      "heard_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well usually we'd be working with someone in your position. What'd you hear?",
        "note": "Rare but great. Let her talk. Mirror whatever she says and use it to transition into discovery. Don't correct anything she says — just build on it.",
        "branches": [
          {
            "label": "Describes something positive or specific",
            "to": "warm_reaction"
          },
          {
            "label": "Vague / Not really sure",
            "to": "pain_trigger"
          }
        ]
      },
      "heard_no": {
        "label": "HAVEN'T HEARD — TRANSITION",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call —",
        "note": "Keep it light, laugh at yourself, then flow directly into the pain trigger with no pause. This is a bridge, not a stop.",
        "branches": [
          {
            "label": "Continue to pain trigger",
            "to": "pain_trigger"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow, maybe around the same time?",
        "note": "Respect the timing. Don't pitch through resistance. Lock a specific callback window if she gives you one.",
        "branches": [
          {
            "label": "Sure, try me tomorrow / Gives a time",
            "to": "reschedule_confirmed"
          },
          {
            "label": "What's this about though? (curiosity)",
            "to": "pain_trigger"
          },
          {
            "label": "No, don't call back",
            "to": "end_graceful"
          }
        ]
      },
      "reschedule_confirmed": {
        "label": "CALLBACK LOCKED",
        "say": "Perfect — I'll try you then. Appreciate it, Karen.",
        "note": "Write down the exact day and time immediately. Set a calendar reminder. This is a warm callback now — lead with 'Hey Karen, it's Sam — you told me to try you back today' when you redial.",
        "branches": []
      },
      "guarded": {
        "label": "GUARDED — ASK PERMISSION",
        "say": "Yeah totally fair — it is a cold call. Can I get 30 seconds to tell you why I reached out? And you can totally hang up on me if it's not a fit.",
        "note": "Acknowledge the cold call head-on. Asking for 30 seconds with an explicit exit lowers the wall. Smile through this line — she can hear it.",
        "branches": [
          {
            "label": "OK, go ahead / You've got 30 seconds",
            "to": "pain_trigger"
          },
          {
            "label": "No, not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED — SPLIT",
        "say": "Shoot — totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and this just isn't interesting?",
        "note": "This isn't a real objection yet — she's reacting to the interruption. The split gives her a graceful way back in. If she says 'horrible time,' you've got a callback. If she says 'not interesting,' probe one more step.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not interesting / Not relevant to me",
            "to": "last_chance_value"
          },
          {
            "label": "I'm not the right person for this",
            "to": "not_my_area"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "I was just talking to another property manager about your size — few hundred homes on the coast. And she was telling me her team takes hundreds of photos every single turnover day, but nobody actually has the time to sit there and review them all. Stuff slips through — a cracked deck railing, a stained couch cushion, a missing set of towels — and the first person to notice is the guest checking in. By then it's a bad review and an owner calling asking what happened. I actually saw you guys promote photo verification as part of your housekeeping process, so I figured you'd get that more than most. Does any of that ring a bell?",
        "note": "PAUSE after 'ring a bell' — this is the most important silence on the call. Let her react. You referenced their own marketing language from their owner-acquisition site — that shows you did real homework. Do not rush past the pause.",
        "branches": [
          {
            "label": "Yes / That's exactly our issue / Tells a story",
            "to": "warm_reaction"
          },
          {
            "label": "Kinda / We have a process for that",
            "to": "neutral_reaction"
          },
          {
            "label": "I'm not really the one who handles that",
            "to": "not_my_area"
          },
          {
            "label": "Not interested / We're good",
            "to": "early_objection"
          }
        ]
      },
      "warm_reaction": {
        "label": "SHE'S WARM — STOP PITCHING",
        "say": "Yeah, that makes total sense at your scale. So what does that process actually look like right now — your cleaners take photos after every turn and then someone on the team reviews them?",
        "note": "She's engaged. DO NOT PITCH. Ask questions and let her describe the pain in her own words. Mirror and validate everything. The more she talks, the more she sells herself on the meeting.",
        "branches": [
          {
            "label": "Describes their current photo / inspection process",
            "to": "discovery_photo_detail"
          },
          {
            "label": "We use a vendor or software for that",
            "to": "discovery_vendor_detail"
          },
          {
            "label": "It's honestly a mess / We struggle with it",
            "to": "discovery_peak_pain"
          }
        ]
      },
      "neutral_reaction": {
        "label": "LUKEWARM — GIVE THE SOLUTION",
        "say": "Makes sense — you guys have been at this since the forties, you'd have to have something dialed in. What we built is an AI that plugs into whatever system your team's already using for those turnover photos — it reviews every single one automatically and flags damage, missing items, staging issues before the guest walks in. No workflow change on your end. Would you be open to taking a look when I'm not cold calling you out of the blue?",
        "note": "Acknowledge their longevity — it shows respect and homework. One-sentence solution, then soft CTA. Don't oversell. If she pushes back, don't repeat the pitch.",
        "branches": [
          {
            "label": "Sure / Could be interesting",
            "to": "book_meeting"
          },
          {
            "label": "Send me some info first",
            "to": "send_email_request"
          },
          {
            "label": "We already have something for that",
            "to": "objection_have_process"
          },
          {
            "label": "I'm not the right person for this",
            "to": "not_my_area"
          }
        ]
      },
      "discovery_photo_detail": {
        "label": "DISCOVERY — PHOTO PROCESS",
        "say": "Got it. And when those photos come in after a turn — is someone on the team manually going through each one, or does your system flag stuff automatically?",
        "note": "You're probing for the manual gap. If it's manual review, that's your opening — nobody can eyeball hundreds of photos consistently. If they claim automation, dig into what it actually catches versus misses.",
        "branches": [
          {
            "label": "Manual review / Someone eyeballs them",
            "to": "discovery_peak_pain"
          },
          {
            "label": "We have a system that flags things",
            "to": "discovery_vendor_detail"
          },
          {
            "label": "Honestly most of them don't get reviewed",
            "to": "discovery_peak_pain"
          }
        ]
      },
      "discovery_vendor_detail": {
        "label": "DISCOVERY — CURRENT VENDOR",
        "say": "Oh interesting — what are you guys using? Just curious because we plug into most of the major platforms.",
        "note": "Find out their PMS or ops tool — Breezeway, Track, Streamline, Escapia, etc. Don't bash their current vendor. RapidEye layers on top, it doesn't replace. If she doesn't know the tool name, that tells you she's not the ops person.",
        "branches": [
          {
            "label": "Names a tool (Breezeway, Track, etc.)",
            "to": "discovery_peak_pain"
          },
          {
            "label": "Something homegrown / Spreadsheets / Checklists",
            "to": "discovery_peak_pain"
          },
          {
            "label": "I'm not sure, you'd have to ask our ops team",
            "to": "not_my_area"
          }
        ]
      },
      "discovery_peak_pain": {
        "label": "DISCOVERY — PEAK SEASON PRESSURE",
        "say": "And during peak summer — when you've got what, hundreds of Saturday turnovers happening at once — how does that hold up? Does the team ever get stretched thin reviewing everything?",
        "note": "OBX vacation rentals turn Saturday-to-Saturday in summer. That means massive volume concentrated on one day per week. This is where the pain is most visceral. Let her vent if she wants to.",
        "branches": [
          {
            "label": "Yes / It's brutal / Things get missed in summer",
            "to": "validate_and_cta"
          },
          {
            "label": "We manage / It works OK",
            "to": "validate_and_cta"
          },
          {
            "label": "That's really more of a question for our ops team",
            "to": "not_my_area"
          }
        ]
      },
      "validate_and_cta": {
        "label": "VALIDATE + ASK FOR MEETING",
        "say": "Yeah — that's exactly what we keep hearing from managers your size. So what we do is our AI reviews every photo your team's already taking, automatically, and catches the stuff that's impossible to spot consistently at speed. No workflow change, just plugs in. Would you be open to a quick fifteen-minute look? Even if it's just to see what other OBX managers are doing with their turnover photos — worst case you steal some ideas and we part as friends.",
        "note": "The 'steal some ideas' line gives her a low-commitment reason to say yes even if she's not buying. Lock a specific time if she says yes. Don't leave it vague.",
        "branches": [
          {
            "label": "Sure / That could work",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email_request"
          },
          {
            "label": "I'd need to loop in our ops person",
            "to": "referral_ask"
          },
          {
            "label": "Not right now / Not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "not_my_area": {
        "label": "NOT THE RIGHT PERSON",
        "say": "Totally makes sense. Who on your team would own something like this — would that be like a director of operations, or whoever runs your housekeeping and inspections day-to-day?",
        "note": "Karen is the main point of contact for the whole company — she WILL know who handles ops even if it's not her. Push for a name, not just a title. Their site mentions in-house cleaning teams, so there's definitely a housekeeping or ops leader.",
        "branches": [
          {
            "label": "Gives a name or title",
            "to": "referral_ask"
          },
          {
            "label": "You'd have to call the main line / I can't give that out",
            "to": "referral_no_name"
          },
          {
            "label": "Actually that might be me / Let me think",
            "to": "pain_trigger"
          }
        ]
      },
      "referral_ask": {
        "label": "GET THE REFERRAL",
        "say": "Perfect — do you have a name I could ask for? That way I can put something tailored together so it's not just another generic cold call for them.",
        "note": "Push for a first and last name. If she gives only a title, ask 'And who's in that role right now?' If she offers to forward your info or transfer you, accept AND still get the name as a backup.",
        "branches": [
          {
            "label": "Gives a name",
            "to": "referral_received"
          },
          {
            "label": "I can transfer you / forward your info",
            "to": "referral_transfer"
          },
          {
            "label": "I'd rather not give that out",
            "to": "referral_no_name"
          }
        ]
      },
      "referral_received": {
        "label": "GOT A NAME",
        "say": "Awesome, really appreciate that. And is the best way to reach them through the main line, or do they have a direct number or extension? I'll mention you pointed me their way.",
        "note": "Get as much contact info as possible — extension, email, direct line. Mention Karen's name when you call the referral. This is a warm intro now. Write everything down immediately.",
        "branches": [
          {
            "label": "Gives number / email / extension",
            "to": "end_with_referral"
          },
          {
            "label": "Just try the main line and ask for them",
            "to": "end_with_referral"
          }
        ]
      },
      "referral_transfer": {
        "label": "OFFERED TO TRANSFER OR FORWARD",
        "say": "That'd be great — and just so I have it in case we get disconnected, what's their name?",
        "note": "Always get the name before the transfer. Transfers drop constantly. You need the name as a fallback to call back directly.",
        "branches": [
          {
            "label": "Gives name and transfers",
            "to": "end_with_referral"
          },
          {
            "label": "Transfers without giving a name",
            "to": "end_with_referral"
          }
        ]
      },
      "referral_no_name": {
        "label": "NO NAME GIVEN",
        "say": "No worries at all. If I call back through the main line, should I just ask for whoever runs housekeeping operations or your property inspections?",
        "note": "Don't push — she's protecting her team. Get the best routing language you can. 'Housekeeping operations' or 'turnover quality' are the right ask-for phrases at their front desk.",
        "branches": [
          {
            "label": "Yes / Gives a department or title to ask for",
            "to": "end_graceful"
          },
          {
            "label": "I'll pass your info along myself",
            "to": "send_email_request"
          }
        ]
      },
      "early_objection": {
        "label": "EARLY OBJECTION — LISTEN AND ROUTE",
        "say": "I hear you —",
        "note": "She's pushing back early. Don't argue. Listen to her specific words and click the matching branch below. Your job is to identify which type of objection this is and route to the right response.",
        "branches": [
          {
            "label": "We already have a process / vendor for that",
            "to": "objection_have_process"
          },
          {
            "label": "Not interested / We're all set",
            "to": "objection_not_interested"
          },
          {
            "label": "No budget / Not buying anything right now",
            "to": "objection_no_budget"
          }
        ]
      },
      "objection_have_process": {
        "label": "THEY HAVE A PROCESS",
        "say": "That makes total sense — with a few hundred homes you'd have to have something dialed in, otherwise you wouldn't still be around after eighty years. Honestly that's a good thing. Just so I'm not bugging you again — is it that your current process catches everything and you're fully covered, or is it more that switching or adding anything right now would be a headache?",
        "note": "Agree first — validate their longevity. Then split. If 'fully covered,' respect it and offer value. If 'switching is a headache,' that's your opening because RapidEye layers on top with zero workflow change.",
        "branches": [
          {
            "label": "We're fully covered / Happy with what we have",
            "to": "last_chance_value"
          },
          {
            "label": "Switching would be a pain / Too many tools already",
            "to": "sell_test_drive"
          },
          {
            "label": "Actually opens up about gaps or frustrations",
            "to": "discovery_photo_detail"
          }
        ]
      },
      "objection_not_interested": {
        "label": "NOT INTERESTED",
        "say": "Totally get it — I should've assumed you'd be all set, otherwise you probably would've reached out yourself. Just so nobody from my team cold calls you again — is it that this just isn't a problem you're focused on right now, or is it more that you hate cold calls? Because honestly I get it either way.",
        "note": "Light laugh on the cold calls line. The split gives her permission to admit it's just the medium, not the message. If she says 'hate cold calls,' pivot to email or test drive.",
        "branches": [
          {
            "label": "Not a priority right now / Not focused on this",
            "to": "last_chance_value"
          },
          {
            "label": "I just hate cold calls / Bad medium",
            "to": "sell_test_drive"
          },
          {
            "label": "Truly not interested at all",
            "to": "end_graceful"
          }
        ]
      },
      "objection_no_budget": {
        "label": "NO BUDGET",
        "say": "Totally get it — nowadays it's harder to keep a tool, let alone buy something new. Just to make sure I'm understanding — is it that budget for this kind of thing is completely locked for the year, or is it more that anything new has to go through the ringer to get approved?",
        "note": "Agree and empathize. The split separates 'truly no money' from 'hard approval process.' Both can lead to a test drive — the play is 'get educated now so when budget opens you already know what's number one on your list.'",
        "branches": [
          {
            "label": "Budget is locked / Nothing new this year",
            "to": "sell_test_drive"
          },
          {
            "label": "Approval process is tough / Would need owner sign-off",
            "to": "sell_test_drive"
          },
          {
            "label": "We're just not spending on anything right now",
            "to": "last_chance_value"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally respect that — you're probably not buying anything off a cold call today, nor should you. But the managers who end up pulling the trigger on something like this are usually the ones who already knew what was out there before they needed it. Would you be open to a fifteen-minute look — not a hard sell, just a walkthrough of what we're doing with a few other coastal property managers? Worst case you see how they're handling turnover photos and steal a few ideas.",
        "note": "This is your strongest pitch for the meeting. Low commitment, high perceived value, no pressure. If she says no here, respect it and exit gracefully. Don't loop back to another pitch.",
        "branches": [
          {
            "label": "Sure / OK let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first and I'll take a look",
            "to": "send_email_request"
          },
          {
            "label": "No, not right now",
            "to": "end_graceful"
          }
        ]
      },
      "last_chance_value": {
        "label": "LAST CHANCE — OFFER VALUE",
        "say": "Totally fair. If nothing else — would it be helpful if I just sent over a quick breakdown of what other OBX property managers are doing with their inspection workflows heading into summer? No pitch, just intel. Worst case you toss it.",
        "note": "This is your soft exit with a value offer. If she says yes, you have a legitimate reason to follow up and a foot in the door. If she says no, exit cleanly.",
        "branches": [
          {
            "label": "Sure, send it over",
            "to": "send_email_request"
          },
          {
            "label": "No thanks",
            "to": "end_graceful"
          }
        ]
      },
      "send_email_request": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question so I don't send you something generic — what would be most relevant to include? Is it more the photo analysis and quality-control side, or the damage-tracking and owner-reporting piece?",
        "note": "Get ONE qualifying detail so the email feels tailored. Then confirm her email address. Their domain is @southernshores.com. Try: 'Is karen at southernshores dot com the best address, or is there a better one?'",
        "branches": [
          {
            "label": "Tells you what to include / Shows preference",
            "to": "email_confirmed"
          },
          {
            "label": "Just send whatever / General info is fine",
            "to": "email_confirmed"
          }
        ]
      },
      "email_confirmed": {
        "label": "CONFIRM EMAIL + LOCK FOLLOW-UP",
        "say": "Got it — I'll get that over to you today. And I'll throw a time suggestion in there for next week in case you want to take a closer look. Is karen at southernshores dot com the best spot, or is there a better email?",
        "note": "Confirm the exact email address. Include a specific suggested meeting day and time in the email. Follow up in 48 hours if no response. Put her in a 3-touch email sequence.",
        "branches": [
          {
            "label": "Confirms email or gives correct one",
            "to": "end_with_email"
          },
          {
            "label": "Use the rentals@ or general inbox",
            "to": "end_with_email"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome — I've got next week pulled up. Would Tuesday or Wednesday work better for you? I'm thinking late morning so it's not too early.",
        "note": "Pick two days. Give a specific window. Lock the time NOW and send the calendar invite while still on the phone. Don't say 'I'll send you a link' — say 'I'm sending the invite right now.'",
        "branches": [
          {
            "label": "Picks a day and time",
            "to": "meeting_booked"
          },
          {
            "label": "Let me check my calendar and get back to you",
            "to": "send_email_request"
          },
          {
            "label": "Can we include our ops person / someone else too?",
            "to": "meeting_booked_with_referral"
          }
        ]
      },
      "meeting_booked_with_referral": {
        "label": "MEETING + ADDITIONAL ATTENDEE",
        "say": "Love that — the more the merrier. What's their name and email so I can add them to the invite?",
        "note": "This is gold — you now have two contacts and the ops person is pre-sold by Karen. Get first name, last name, and email. Send the invite to both immediately.",
        "branches": [
          {
            "label": "Gives name and email for the other person",
            "to": "meeting_booked"
          },
          {
            "label": "I'll forward the invite to them myself",
            "to": "meeting_booked"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING CONFIRMED",
        "say": "Perfect — sending the invite right now so it doesn't get lost. Really appreciate you taking my call, Karen. Talk to you soon.",
        "note": "STOP SELLING. Send the calendar invite immediately while she can still see it come in. Add her to your CRM with full notes from this call. Prep the demo around whatever she told you — their photo verification process, peak season pain, current tools.",
        "branches": []
      },
      "end_with_email": {
        "label": "EXIT — EMAIL FOLLOW-UP PROMISED",
        "say": "Sounds good — you'll have it in your inbox within the hour. Appreciate your time, Karen.",
        "note": "Send the email within 30 minutes — not end of day. Include: (1) whatever she asked for, (2) one specific insight about OBX PM inspection trends heading into summer, (3) a concrete suggested meeting time for next week. Follow up in 48 hours if no reply. Set a 3-touch sequence.",
        "branches": []
      },
      "end_with_referral": {
        "label": "EXIT — GOT A REFERRAL",
        "say": "Really appreciate you pointing me in the right direction, Karen. I'll mention you sent me their way. Have a good one.",
        "note": "Write down the name, title, extension, and any contact details immediately. Call the referral ASAP and open with 'Karen Haley over at Southern Shores pointed me your way.' Update CRM with both contacts. Karen is still a relationship to nurture — send her a thank-you email.",
        "branches": []
      },
      "end_graceful": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes, I'm easy to find — Sam Parks, RapidEye. Appreciate your time, Karen.",
        "note": "Don't burn the bridge. She's the main point of contact for the entire company — even if this call didn't convert, she's the gateway to every future conversation with Southern Shores. Log the call, note the specific objection, and set a 90-day follow-up reminder. Consider a light LinkedIn connect.",
        "branches": []
      }
    }
  }
}