{
  "name": "Kelly McLean Lewin",
  "title": "COO (McLean Company) / CEO of Poppy",
  "company": "Poppy (Stay Poppy)",
  "location": "Palm Springs, CA",
  "phone": "",
  "company_phone": "+1-760-307-4329",
  "alt_phones": [],
  "flow": {
    "context": "Kelly McLean Lewin is COO of McLean Company and publicly described as CEO of Poppy — she is the top operational decision-maker for a family-owned vacation rental business running 130+ homes in Palm Springs. McLean Company was founded in 1984 and rebranded the STR side to Poppy in Spring 2022. They use Streamline as their PMS and AppFolio for long-term rentals — no Breezeway or inspection platform detected, meaning turnover photo review is likely manual. Kelly is a VRMA member, in the business since 2010, and won a Palm Springs CVB Palm Award in 2013. Sam's strongest angle: he grew up in La Cañada (LA area), Palm Springs is his backyard, and he already works with other PM companies at similar scale in resort markets.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Kelly — I work with a few vacation rental operators out in the desert, and your name kept coming up. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Relaxed, warm tone. You're from LA — Palm Springs is your backyard. Sound like a peer, not a vendor. Pause and let her answer.",
        "branches": [
          {
            "label": "No / who are you?",
            "to": "not_popular"
          },
          {
            "label": "Yes / maybe",
            "to": "heard_of_us"
          },
          {
            "label": "Bad timing / busy",
            "to": "bad_timing"
          },
          {
            "label": "Gatekeeper picks up",
            "to": "gatekeeper"
          }
        ]
      },
      "gatekeeper": {
        "label": "GATEKEEPER — SLIDE BY",
        "say": "Hey — could you get me through to Kelly? It's Sam.",
        "note": "Don't pitch. Don't explain. Just say it like you're expected. If they ask what it's about, go to context line.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Asks what it's regarding",
            "to": "gatekeeper_context"
          },
          {
            "label": "She's not available",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — CONTEXT",
        "say": "Yeah, I work with a few other vacation rental managers out in Palm Springs. Would you mind letting her know it's Sam Parks?",
        "note": "Still no pitch. Dose information slowly. If they push harder, add social proof.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Pushes back more",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "She's not available",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "Totally understand — we help a couple other property management companies with their inspection workflows. I sent Kelly a note. Would you mind just giving her a heads up that I called?",
        "note": "This is your last play. If they won't budge, get a callback time and move on gracefully.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Won't put you through",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_unavailable": {
        "label": "GATEKEEPER — GET INTEL",
        "say": "No worries at all. When would be the best time to catch her? And is this the best number to reach her directly?",
        "note": "Get a callback time and confirm the number. If they offer another contact like Angela Swan or one of the property managers, take it.",
        "branches": [
          {
            "label": "Gives callback time",
            "to": "end_graceful"
          },
          {
            "label": "Suggests someone else",
            "to": "referral_from_gatekeeper"
          }
        ]
      },
      "referral_from_gatekeeper": {
        "label": "GATEKEEPER REFERRAL",
        "say": "That'd be great — who on the ops side would be best to talk to about how turnovers and inspections get handled? If I can get a name I'll make sure it's relevant to them.",
        "note": "Angela Swan, Kelly Lipscomb, and Pedro Mondaca are property managers there. If they name one, take it and call that person next.",
        "branches": [
          {
            "label": "Gives a name",
            "to": "end_graceful"
          },
          {
            "label": "Won't share",
            "to": "end_graceful"
          }
        ]
      },
      "not_popular": {
        "label": "NOT POPULAR TRANSITION",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call — I've been working with a couple other vacation rental companies around your size, 100 to 200 doors, and one thing that keeps coming up is this issue with turnover photos.",
        "note": "Smooth transition into the pain trigger. You're setting up the peer story. Don't rush — let this land naturally.",
        "branches": [
          {
            "label": "She's listening / go on",
            "to": "pain_trigger"
          },
          {
            "label": "What do you mean?",
            "to": "pain_trigger"
          },
          {
            "label": "Not interested / we're good",
            "to": "objection_not_interested"
          },
          {
            "label": "I'm busy right now",
            "to": "bad_timing"
          }
        ]
      },
      "heard_of_us": {
        "label": "THEY'VE HEARD OF US",
        "say": "Oh nice — well normally we'd be working with someone like you. What'd you hear?",
        "note": "Let her talk. Whatever she says, pivot to discovery. If she's vague, transition to the pain trigger to give her more context.",
        "branches": [
          {
            "label": "Describes what she heard",
            "to": "discovery_warm"
          },
          {
            "label": "Vague / not much",
            "to": "pain_trigger"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow around the same time?",
        "note": "Don't fight it. Lock a specific callback. If she pushes back on tomorrow, offer later this week.",
        "branches": [
          {
            "label": "Sure / gives a time",
            "to": "book_callback"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          },
          {
            "label": "Hard no / don't call back",
            "to": "end_graceful"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "So I was talking to another manager who runs about 150 homes in a resort market — pretty similar setup to you guys. Their cleaners were taking photos after every turnover, uploading them into Streamline, and technically everything looked good on paper. But nobody actually had time to go through all those photos. So stuff was slipping — a stained couch here, a chipped countertop there, a missing patio cushion nobody noticed. And by the time anyone caught it, the next guest was already checking in, the damage claim window was gone, and the owner's asking why their place looks worse every quarter. Sound familiar at all?",
        "note": "You mentioned Streamline on purpose — they use it. Pause after 'sound familiar at all?' and let her react. This is the most important silence in the call.",
        "branches": [
          {
            "label": "Yes / that resonates",
            "to": "solution_bridge"
          },
          {
            "label": "We actually handle that pretty well",
            "to": "objection_have_process"
          },
          {
            "label": "Asks what you do about it",
            "to": "solution_bridge"
          },
          {
            "label": "Not interested / too busy",
            "to": "permission_fallback"
          }
        ]
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not a fit?",
        "note": "This is your safety net. If she says yes, go to the pain trigger. If no, go to rejection split.",
        "branches": [
          {
            "label": "Sure / go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "No / not interested",
            "to": "rejection_split"
          }
        ]
      },
      "rejection_split": {
        "label": "REJECTION SPLIT",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and this just isn't interesting?",
        "note": "Multiple choice question. Horrible time equals rebook. Not interesting equals dig into why.",
        "branches": [
          {
            "label": "Bad time",
            "to": "bad_timing"
          },
          {
            "label": "Not interesting / we're set",
            "to": "objection_not_interested"
          },
          {
            "label": "Hangs up",
            "to": "end_hangup"
          }
        ]
      },
      "solution_bridge": {
        "label": "ONE-SENTENCE SOLUTION",
        "say": "So what we built — RapidEye plugs into your Streamline workflow and automatically analyzes the photos your team's already taking after every turnover. It flags damage, missing items, staging issues — all before the next guest checks in. No workflow change for your cleaners at all.",
        "note": "One breath. Don't oversell. Move straight to the CTA or let her react. You mentioned Streamline because they use it — that should land.",
        "branches": [
          {
            "label": "That's interesting / tell me more",
            "to": "discovery_warm"
          },
          {
            "label": "How does that work exactly?",
            "to": "discovery_warm"
          },
          {
            "label": "We don't really have that problem",
            "to": "objection_have_process"
          },
          {
            "label": "What does it cost?",
            "to": "deflect_price"
          }
        ]
      },
      "discovery_warm": {
        "label": "DISCOVERY — SHE'S WARM",
        "say": "That's great to hear. So let me ask you — with 130-plus homes, what does your inspection process actually look like right now after a turnover? Are your cleaners taking photos, or do you have a separate QA step?",
        "note": "STOP pitching. She's interested — now learn. Listen for who takes photos, what tool they use, who reviews, what falls through the cracks. Every answer is ammo for the close.",
        "branches": [
          {
            "label": "Describes their process",
            "to": "discovery_dig_deeper"
          },
          {
            "label": "We use a checklist / basic process",
            "to": "discovery_dig_deeper"
          },
          {
            "label": "Honestly we don't have a great system",
            "to": "discovery_no_system"
          }
        ]
      },
      "discovery_dig_deeper": {
        "label": "DISCOVERY — DIG DEEPER",
        "say": "Got it — and when something does get missed, like a stain or damage that nobody caught in photos, how does that usually play out? Does the owner find it, or does it come up with the next guest?",
        "note": "You're looking for the emotional pain — owner complaints, bad reviews, lost deposit claims. Whatever she says, mirror it back and transition to booking.",
        "branches": [
          {
            "label": "Shares a pain point or story",
            "to": "book_meeting"
          },
          {
            "label": "It's not a huge issue for us",
            "to": "objection_have_process"
          },
          {
            "label": "Asks more about RapidEye",
            "to": "book_meeting"
          }
        ]
      },
      "discovery_no_system": {
        "label": "DISCOVERY — NO SYSTEM",
        "say": "That's actually really common at your scale — I hear that from a lot of operators managing over a hundred doors. The volume just makes it impossible to eyeball everything. Who on your team ends up being the one that catches stuff when it slips through?",
        "note": "She just admitted the gap. Don't pile on. Ask who feels the pain day-to-day — this also surfaces potential champions like Angela Swan, Kelly Lipscomb, or Pedro Mondaca.",
        "branches": [
          {
            "label": "Names someone / describes who handles it",
            "to": "book_meeting"
          },
          {
            "label": "It's kind of everyone / me",
            "to": "book_meeting"
          }
        ]
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "I totally get it. I should've assumed you'd be all set — otherwise you probably would've reached out to us. Just so no one from my team cold calls you again — is it that inspection quality isn't really a priority right now, or is it more that you just hate cold calls?",
        "note": "Agree first. Then split the objection. If she says cold calls, you can still book. If she says not a priority, dig into what IS the priority.",
        "branches": [
          {
            "label": "I just hate cold calls",
            "to": "hate_cold_calls"
          },
          {
            "label": "It's not a priority right now",
            "to": "not_priority_dig"
          },
          {
            "label": "We already have something for that",
            "to": "objection_have_process"
          },
          {
            "label": "Hard no",
            "to": "end_graceful"
          }
        ]
      },
      "hate_cold_calls": {
        "label": "HATES COLD CALLS — PIVOT",
        "say": "Ha — honestly, fair enough. Nobody loves getting these. Tell you what — would you be open to me sending over a quick two-minute thing showing what we actually flagged for another PM company around your size? If it's interesting, great. If not, no hard feelings and I won't bug you again.",
        "note": "She doesn't hate you, she hates the medium. Give her a low-pressure off-ramp that still keeps the door open.",
        "branches": [
          {
            "label": "Sure, send it",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "end_graceful"
          }
        ]
      },
      "not_priority_dig": {
        "label": "NOT A PRIORITY — DIG",
        "say": "Totally fair. Out of curiosity, what is taking up most of your bandwidth right now heading into the busy season? I only ask because a lot of the operators I talk to in the desert are dealing with pretty similar stuff.",
        "note": "This opens a real conversation. If she shares what she's focused on — revenue, staffing, owner acquisition — you can reframe RapidEye around her actual priority. Palm Springs peak seasons are winter-spring for snowbirds and events like Coachella and Modernism Week.",
        "branches": [
          {
            "label": "Shares a priority (staffing, revenue, owners)",
            "to": "reframe_to_priority"
          },
          {
            "label": "I really don't have time for this",
            "to": "bad_timing"
          },
          {
            "label": "Hard no",
            "to": "end_graceful"
          }
        ]
      },
      "reframe_to_priority": {
        "label": "REFRAME TO HER PRIORITY",
        "say": "That makes total sense. You know what's funny — the reason most of the operators I work with started looking at us wasn't actually inspections. It was because they were losing money on damage claims they couldn't prove, or owners were getting frustrated and pulling properties. RapidEye basically gives you the documentation that holds up — so when something does happen, you've got proof and your owners trust the process. Would it make sense to take a quick look at that side of it?",
        "note": "Reframe RapidEye to whatever she cares about — owner retention, revenue protection, liability. This is the bridge back to booking.",
        "branches": [
          {
            "label": "That's more relevant / sure",
            "to": "book_meeting"
          },
          {
            "label": "Still not interested",
            "to": "referral_attempt"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          }
        ]
      },
      "objection_have_process": {
        "label": "OBJECTION — HAVE A PROCESS",
        "say": "That makes total sense — with 130-plus homes you'd have to have something in place. Just so I'm not wasting your time — is it that you're fully covered and nothing's slipping through, or is it more that switching anything right now would be a headache?",
        "note": "Split the objection. If she says nothing slips through, respectfully challenge with scale reality. If switching is the headache, that's your opening — RapidEye requires zero workflow change.",
        "branches": [
          {
            "label": "Nothing slips through / we're good",
            "to": "challenge_gently"
          },
          {
            "label": "Switching would be a pain",
            "to": "no_switch_needed"
          },
          {
            "label": "A little of both",
            "to": "no_switch_needed"
          }
        ]
      },
      "challenge_gently": {
        "label": "RESPECTFUL CHALLENGE",
        "say": "That's awesome — seriously, most operators your size can't say that. I'm curious though — when you're running, what, probably 40-plus turnovers a week in peak season, who's actually reviewing all the photos? Is it you, or does someone on the team own that?",
        "note": "You're not calling her a liar — you're making her think about the math. 130-plus homes in Palm Springs peak season equals massive turnover volume. Nobody reviews every photo. Let the silence work.",
        "branches": [
          {
            "label": "Admits gaps / nobody reviews all of them",
            "to": "solution_bridge"
          },
          {
            "label": "We have property managers who handle it",
            "to": "sell_test_drive"
          },
          {
            "label": "Stands firm / not interested",
            "to": "referral_attempt"
          }
        ]
      },
      "no_switch_needed": {
        "label": "NO SWITCH NEEDED",
        "say": "That's actually the best part — there's nothing to switch. Your cleaners keep doing exactly what they're doing in Streamline. We just read the photos they're already uploading and flag anything that looks off. It's like a second set of eyes that doesn't need a paycheck. Would you be open to seeing how it works? Like a 15-minute thing — I can show you what it catches on actual turnover photos.",
        "note": "This is your strongest play when the objection is about workflow disruption. Zero change for her team. Go straight to booking.",
        "branches": [
          {
            "label": "Sure / that could work",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "sell_test_drive"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally fair — you're probably not buying anything on a cold call, and I respect that. But when you do look at this stuff down the road, the people who get it are the ones who already know what's out there. If nothing else, I could walk you through what a couple other PM companies in the Coachella Valley are doing with their turnover photos. Worst case you steal some ideas and we part as friends.",
        "note": "Low pressure. The meeting has value even if she never buys. Coachella Valley reference shows you know her market.",
        "branches": [
          {
            "label": "Sure / why not",
            "to": "book_meeting"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          },
          {
            "label": "Not interested",
            "to": "referral_attempt"
          }
        ]
      },
      "deflect_price": {
        "label": "DEFLECT PRICE QUESTION",
        "say": "Great question — honestly it depends on the setup. For a portfolio your size it's usually pretty straightforward. But I'd rather show you what it actually catches before we talk numbers — that way you can tell me if it's even worth a conversation. Would you be open to a quick 15 minutes this week?",
        "note": "Never quote price on a cold call. Redirect to the meeting. The price question is actually a buying signal — she's interested enough to ask.",
        "branches": [
          {
            "label": "Sure",
            "to": "book_meeting"
          },
          {
            "label": "Give me a ballpark",
            "to": "deflect_price_again"
          },
          {
            "label": "Send me info first",
            "to": "send_email"
          }
        ]
      },
      "deflect_price_again": {
        "label": "DEFLECT PRICE — SECOND ASK",
        "say": "I hear you — I don't want to throw out a number that doesn't mean anything without context. What I can tell you is operators at your scale typically see ROI in the first month just from damage claims they would've missed. Let me show you the math on a quick call — 15 minutes, I'll make it worth your time. How's Thursday look?",
        "note": "Give enough to satisfy curiosity without anchoring on a number. Push to the meeting with a specific day.",
        "branches": [
          {
            "label": "Agrees to meeting",
            "to": "book_meeting"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          },
          {
            "label": "Not interested",
            "to": "end_graceful"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next week pulled up — would Tuesday or Thursday work better for you? I'm thinking 15 minutes, I'll keep it tight.",
        "note": "Give two options. Lock a specific day and time NOW. Don't leave it open-ended. Once she picks, confirm and send the invite while on the phone.",
        "branches": [
          {
            "label": "Picks a day/time",
            "to": "confirm_meeting"
          },
          {
            "label": "Let me check my calendar / not sure",
            "to": "push_for_time"
          },
          {
            "label": "Send me something first then we'll see",
            "to": "send_email"
          }
        ]
      },
      "push_for_time": {
        "label": "PUSH FOR SPECIFIC TIME",
        "say": "Totally — how about I throw something on for Thursday at 10am your time, and if you need to move it just let me know? That way it's on the books and neither of us forgets.",
        "note": "Anchor a specific time. It's easier to move a meeting than to schedule one from scratch. Palm Springs is Pacific time.",
        "branches": [
          {
            "label": "Sure / that works",
            "to": "confirm_meeting"
          },
          {
            "label": "Suggests a different time",
            "to": "confirm_meeting"
          },
          {
            "label": "I'll get back to you",
            "to": "send_email"
          }
        ]
      },
      "confirm_meeting": {
        "label": "CONFIRM MEETING",
        "say": "Perfect — I'll send that over right now. It'll come from Sam Parks at RapidEye. And Kelly — really appreciate you taking my call. Talk soon.",
        "note": "Send the calendar invite IMMEDIATELY while still on the phone. Stop selling. Confirm the email address. Done.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most relevant to include so it's not just another generic pitch sitting in your inbox?",
        "note": "This keeps her engaged and tells you what she cares about. Whatever she says, tailor the email to it. Suggest a specific meeting time in the email.",
        "branches": [
          {
            "label": "Tells you what she wants to see",
            "to": "email_confirm"
          },
          {
            "label": "Just send whatever / general info",
            "to": "email_confirm"
          }
        ]
      },
      "email_confirm": {
        "label": "CONFIRM EMAIL SEND",
        "say": "Got it — I'll put something together and get it over to you today. What's the best email for you? And I'll suggest a couple times in there in case you want to hop on a quick call after you look at it. Thanks Kelly — talk soon.",
        "note": "Get her direct email. Inferred guesses are klewin@staypoppy.com or kmclean@staypoppy.com. If she gives you a different one, use it. Include a specific meeting time suggestion in the email.",
        "branches": []
      },
      "referral_attempt": {
        "label": "REFERRAL — NOT THE RIGHT FIT",
        "say": "Totally understand — and I appreciate your honesty. Let me ask you this — who on your team is closest to the day-to-day turnover and inspection workflow? If I can get a name, I'll put something tailored together so it actually lands with the right person.",
        "note": "You're looking for Angela Swan, Kelly Lipscomb, or Pedro Mondaca — the property managers. If she gives you Michael or Jenny McLean, even better. Take whatever name she gives.",
        "branches": [
          {
            "label": "Gives a name",
            "to": "referral_confirm"
          },
          {
            "label": "That would be me / I handle it",
            "to": "sell_test_drive"
          },
          {
            "label": "Won't share / doesn't want to",
            "to": "end_graceful"
          }
        ]
      },
      "referral_confirm": {
        "label": "CONFIRM REFERRAL",
        "say": "That's super helpful — thank you. And do you have a direct number or email for them? I'll mention you pointed me their way so it doesn't come out of left field. Really appreciate it, Kelly.",
        "note": "Get the name, number, and email. Mention Kelly sent you when you call that person — instant credibility. End warm.",
        "branches": [
          {
            "label": "Gives contact info",
            "to": "end_graceful"
          },
          {
            "label": "Just call the main line",
            "to": "end_graceful"
          }
        ]
      },
      "book_callback": {
        "label": "BOOK CALLBACK",
        "say": "Perfect — I'll try you at that time. And is this the best number? Great. Talk to you then, Kelly.",
        "note": "Write down the exact day and time. Set a reminder. Don't re-pitch — just confirm and go.",
        "branches": []
      },
      "end_graceful": {
        "label": "END — GRACEFUL",
        "say": "Totally understand. If anything changes, I'm easy to find — Sam Parks, RapidEye. Appreciate your time, Kelly.",
        "note": "Don't burn the bridge. She runs 130-plus homes — she may come back. Log the call, note what happened, and set a follow-up for 3-4 weeks out.",
        "branches": []
      },
      "end_hangup": {
        "label": "END — HUNG UP",
        "say": "",
        "note": "She hung up. It happens. Log it, don't take it personally. Try again in 2-3 weeks at a different time of day, or try reaching Michael McLean or one of the property managers like Angela Swan instead.",
        "branches": []
      }
    }
  }
}