{
  "name": "Laughlin McIntyre",
  "title": "Marketing",
  "company": "Aspen Luxury Vacation Rentals (ALVR)",
  "location": "Aspen, CO",
  "phone": "+1-970-618-7628",
  "company_phone": "+1-970-205-9960",
  "alt_phones": [],
  "flow": {
    "context": "Laughlin McIntyre handles marketing at ALVR, a luxury vacation rental company in Aspen, CO — locally owned since 2003, positions itself as the largest independent vacation rental network in Aspen/Snowmass, and has a Marriott Bonvoy Homes & Villas partnership. He is NOT the ops or finance decision-maker — this call is primarily about getting routed to Tricia McIntyre (Consultant, former daily ops leader, likely family given shared surname) or Sharon Redfield (CFO, controls budget and systems). It's a small team so Laughlin may know more than his title suggests. Sam's connection: just skied Jackson Hole in January 2026 — Aspen is rival ski country and this makes the call feel local and human.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Laughlin — so I just got back from Jackson Hole a couple weeks ago and I've kinda got ski country on the brain. I know that's enemy territory for you guys in Aspen. It's Sam Parks with RapidEye — have you heard my name tossed around at all?",
        "note": "Relaxed, feet-up energy. The Jackson Hole trip was January 2026 — it's real and recent. Don't rush the 'heard my name' question. Let it hang.",
        "branches": [
          {
            "label": "Yes / maybe",
            "to": "heard_name_yes"
          },
          {
            "label": "No / who?",
            "to": "heard_name_no"
          },
          {
            "label": "Bad timing / busy",
            "to": "bad_timing"
          },
          {
            "label": "Confused / guarded — 'What is this about?'",
            "to": "confused_guard_up"
          }
        ]
      },
      "heard_name_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — we've been working with a few vacation rental companies on their inspection workflows. What did you hear?",
        "note": "Rare but possible in a tight Aspen market. Let him talk. Whatever he says, bridge toward who owns turnovers and property ops.",
        "branches": [
          {
            "label": "Engages / shares what they heard",
            "to": "warm_response"
          },
          {
            "label": "Vague — 'Not sure' / 'Someone mentioned it'",
            "to": "pain_trigger"
          },
          {
            "label": "'That's not really my area'",
            "to": "not_my_department"
          }
        ]
      },
      "heard_name_no": {
        "label": "HAVEN'T HEARD — TRANSITION",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call —",
        "note": "Smile through this. The self-deprecating beat breaks tension. Pause briefly, then continue to the pain trigger.",
        "branches": [
          {
            "label": "Continue to pain trigger",
            "to": "pain_trigger"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "So I work with a few other luxury vacation rental companies — some pretty similar to you guys — and one thing that keeps coming up is this gap between the brand and what actually gets caught during turnovers. Like, you've got this beautiful luxury positioning, the Marriott partnership, twenty-plus years of reputation in Aspen — and then a guest checks in and there's a scratch on a dining table or a missing throw pillow that nobody caught in the turnover photos. Suddenly there's a bad review undoing months of marketing work. We built something that automatically catches that stuff in the photos your team's already taking. Does any of that ring true for you guys?",
        "note": "PAUSE after 'ring true for you guys.' Let him react. You're framing around marketing and brand impact because that's his world. The Marriott mention shows homework without being heavy-handed. He may not own this problem — that's fine, you're warming him up for a referral.",
        "branches": [
          {
            "label": "Engages — 'Yeah actually...' / 'That does happen'",
            "to": "warm_response"
          },
          {
            "label": "'That's not really my side of things'",
            "to": "not_my_department"
          },
          {
            "label": "'We're not interested' / 'We're good'",
            "to": "handle_not_interested"
          },
          {
            "label": "'We already have a process for that'",
            "to": "handle_have_process"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again later this week? I'll keep it super quick.",
        "note": "Don't grovel. Keep it casual. If he gives a time, take it and get off the phone cleanly.",
        "branches": [
          {
            "label": "Gives a better time",
            "to": "reschedule_lock"
          },
          {
            "label": "'Just email me' / 'Send me something'",
            "to": "send_email_request"
          },
          {
            "label": "Hard no — 'Don't call back'",
            "to": "graceful_exit"
          }
        ]
      },
      "reschedule_lock": {
        "label": "LOCK CALLBACK",
        "say": "Perfect — I'll try you then. Appreciate it, Laughlin. Talk soon.",
        "note": "Write down the exact day and time. Don't add anything else. You earned a callback — protect it.",
        "branches": []
      },
      "confused_guard_up": {
        "label": "GUARD UP — ASK PERMISSION",
        "say": "Yeah totally fair — it is a cold call, I'll be honest. Can I get 30 seconds to tell you why I reached out? And you can totally hang up on me if it's not relevant.",
        "note": "He's suspicious. Owning that it's a cold call disarms people. The 30-second ask lowers the bar. Smile through it.",
        "branches": [
          {
            "label": "Grants permission — 'Sure, go ahead'",
            "to": "pain_trigger"
          },
          {
            "label": "Denies permission — 'No thanks'",
            "to": "permission_denied"
          }
        ]
      },
      "permission_denied": {
        "label": "PERMISSION DENIED — SPLIT",
        "say": "Shoot — totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is this just not something that's on your radar?",
        "note": "Two doors. 'Horrible time' reopens the callback path. 'Not on your radar' lets you pivot to a referral — which is ideal since inspection ops isn't his department anyway.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "'Not my area' / 'Not on my radar'",
            "to": "not_my_department"
          },
          {
            "label": "Still hard no",
            "to": "graceful_exit"
          }
        ]
      },
      "warm_response": {
        "label": "THEY'RE WARM — STOP PITCHING",
        "say": "Oh interesting — so what does that actually look like for you guys right now? Like when a turnover happens, who's checking the property and how are they documenting everything?",
        "note": "He's engaging — STOP SELLING and start asking. Since he's in marketing he may not know the ops details. That's fine. If he gives real answers, pull the thread. If he defers, you've warmed him up enough to get a referral easily.",
        "branches": [
          {
            "label": "Gives real operational detail",
            "to": "deeper_discovery"
          },
          {
            "label": "'I'm not sure honestly' / defers to someone else",
            "to": "warm_pivot_to_referral"
          },
          {
            "label": "Mentions a specific person who handles it",
            "to": "names_someone"
          }
        ]
      },
      "deeper_discovery": {
        "label": "DISCOVERY — HE KNOWS THE OPS",
        "say": "That's really helpful. And when something does get missed — like damage that wasn't caught before the next guest — what does that look like for you guys? Is it coming out of ALVR's pocket, going back to the guest, or is it more of an owner relationship thing?",
        "note": "Small family company — he may wear more hats than his title suggests. Keep asking. You're building the business case in his own words.",
        "branches": [
          {
            "label": "Shares pain around missed damage or cost",
            "to": "bridge_to_meeting"
          },
          {
            "label": "'You'd really need to talk to someone else about this'",
            "to": "warm_pivot_to_referral"
          },
          {
            "label": "'Honestly it doesn't happen much'",
            "to": "handle_have_process"
          }
        ]
      },
      "bridge_to_meeting": {
        "label": "BRIDGE TO MEETING",
        "say": "That's exactly what I'm hearing from other companies too. Look — I don't want to take up your whole afternoon on a cold call. Would you be open to me showing you what this looks like? Even just fifteen minutes. Worst case you see what other luxury PM companies are doing with their turnover photos and steal some ideas.",
        "note": "You've got pain in his own words. Close for the meeting now. 'Steal some ideas' makes it feel safe. Keep it low pressure.",
        "branches": [
          {
            "label": "Open to it",
            "to": "book_meeting"
          },
          {
            "label": "'You should really talk to [name]'",
            "to": "names_someone"
          },
          {
            "label": "'Send me something first'",
            "to": "send_email_request"
          },
          {
            "label": "Hesitant / not sure",
            "to": "sell_test_drive"
          }
        ]
      },
      "not_my_department": {
        "label": "NOT HIS DEPARTMENT",
        "say": "That makes total sense — I figured with you being on the marketing side this might live somewhere else. Who on your team would typically own the inspection or turnover process? Like who's making sure properties are guest-ready between stays?",
        "note": "This is the MOST LIKELY path on this call. Don't make him feel bad — validate and make it easy to hand you off. He's in a small company, he probably knows exactly who does this.",
        "branches": [
          {
            "label": "Names someone (Tricia, Sharon, etc.)",
            "to": "names_someone"
          },
          {
            "label": "Vague — 'I'm not sure' / 'It's kind of everyone'",
            "to": "vague_no_name"
          },
          {
            "label": "'We're a small team, I can pass it along'",
            "to": "offer_to_pass_along"
          }
        ]
      },
      "names_someone": {
        "label": "GOT A NAME",
        "say": "Perfect — and what's the best way to get in front of them? Would it make sense for me to reach out directly, or would it land better coming from you?",
        "note": "If he names Tricia, you already have her direct line (970-618-8290) and email. But getting Laughlin to intro you or letting you drop his name is way warmer. Don't reveal you already have her info.",
        "branches": [
          {
            "label": "'I can mention it to them' / offers to intro",
            "to": "lock_warm_intro"
          },
          {
            "label": "'Just reach out to them directly'",
            "to": "lock_referral_direct"
          },
          {
            "label": "'Let me check and get back to you'",
            "to": "send_email_request"
          }
        ]
      },
      "vague_no_name": {
        "label": "VAGUE — SUGGEST TRICIA",
        "say": "Got it. I noticed Tricia McIntyre on your team page — it looked like she's been pretty involved on the operations side. Would she be the right person to have this conversation with?",
        "note": "Suggesting the name from research. Do NOT mention the family connection even though they share a last name — let him bring that up. Tricia is the top target per research.",
        "branches": [
          {
            "label": "'Yeah, Tricia would be the one'",
            "to": "lock_referral_tricia"
          },
          {
            "label": "Suggests someone else instead",
            "to": "names_someone"
          },
          {
            "label": "'I'm not sure' / deflects",
            "to": "offer_to_pass_along"
          }
        ]
      },
      "lock_warm_intro": {
        "label": "WARM INTRO — SET IT UP",
        "say": "That would be amazing honestly. I'll shoot you a quick email with a couple bullet points — nothing long — so you've got something easy to forward. What's the best email for you? And just so I'm not sending something generic — anything specific you think would catch their attention?",
        "note": "Make his job easy. His published email is laughlinmci@gmail.com but confirm it. Asking what would resonate means the email actually gets forwarded.",
        "branches": [
          {
            "label": "Gives email and some direction",
            "to": "close_warm_intro"
          },
          {
            "label": "'Just send it to info@' or gives email only",
            "to": "close_warm_intro"
          }
        ]
      },
      "lock_referral_direct": {
        "label": "DIRECT REFERRAL — NAME DROP",
        "say": "Totally. Would you mind if I mentioned that you pointed me their way? Just helps it not feel like a completely random cold call on their end.",
        "note": "Getting permission to name-drop turns the next call from cold to warm. This is the real win of the whole conversation.",
        "branches": [
          {
            "label": "'Yeah that's fine' / gives blessing",
            "to": "close_referral"
          },
          {
            "label": "Hesitant / 'I'd rather you didn't'",
            "to": "close_referral_soft"
          }
        ]
      },
      "lock_referral_tricia": {
        "label": "TRICIA CONFIRMED",
        "say": "Great — would you mind if I mentioned you pointed me her way? And is her direct line the best way to reach her, or should I start with email?",
        "note": "You already have Tricia's line (970-618-8290) and email (tricia@aspenluxuryvacationrentals.com). Getting Laughlin's blessing to name-drop is the real objective. Let him tell you the contact info even if you already have it.",
        "branches": [
          {
            "label": "'Sure, tell her I said to call' / gives details",
            "to": "close_referral"
          },
          {
            "label": "'Just try the office' / minimal",
            "to": "close_referral_soft"
          }
        ]
      },
      "offer_to_pass_along": {
        "label": "HE'LL PASS IT ALONG",
        "say": "That would actually be great. Want me to send you a quick email with a couple bullet points you can forward? Nothing long — just enough that whoever owns it can see if it's worth a conversation.",
        "note": "He's volunteering to be the messenger. Accept it. A forwardable email is a solid outcome from a marketing contact. Make his job as easy as possible.",
        "branches": [
          {
            "label": "'Yeah send it over'",
            "to": "close_warm_intro"
          },
          {
            "label": "Gives a specific name to send to directly",
            "to": "names_someone"
          }
        ]
      },
      "close_warm_intro": {
        "label": "CLOSE — WARM INTRO PATH",
        "say": "Perfect. I'll get that over to you today. Really appreciate you taking my call, Laughlin — especially when I'm out here repping Jackson Hole over Aspen. Talk soon.",
        "note": "End on the ski joke to keep it human. Send that email within 30 minutes while the call is fresh. Include a specific meeting time suggestion and make it dead easy to forward.",
        "branches": []
      },
      "close_referral": {
        "label": "CLOSE — REFERRAL SECURED",
        "say": "Awesome — I really appreciate that, Laughlin. I'll reach out to her this week and keep it quick. And hey, if you ever need ski recs outside of Aspen, Jackson Hole's not bad. Thanks again.",
        "note": "You got what you needed. Call Tricia TODAY and open with 'Laughlin pointed me your way.' That single line changes the entire temperature of the next call.",
        "branches": []
      },
      "close_referral_soft": {
        "label": "CLOSE — SOFT REFERRAL",
        "say": "Totally understand. I'll reach out to them separately and keep it low-key. Really appreciate the direction, Laughlin. Talk soon.",
        "note": "He didn't give full blessing to name-drop but you still have a name. When you call Tricia, you can say 'I was chatting with your team' without naming Laughlin specifically. Still warmer than a fully cold call.",
        "branches": []
      },
      "handle_not_interested": {
        "label": "NOT INTERESTED — AGREE AND SPLIT",
        "say": "Totally get it. Honestly I should have assumed you guys were all set — otherwise you probably would've reached out to us. Just so nobody from my team cold calls you again — is it more that this isn't a problem you deal with, or is it that you just hate cold calls? Both are totally valid.",
        "note": "Agree first — don't push back. The split gives him an easy out. 'Hate cold calls' is the lightest door — most people pick it and it lets you keep going. 'Not a problem I deal with' is the golden path to a referral.",
        "branches": [
          {
            "label": "'Not my area' / 'Not a problem I deal with'",
            "to": "not_my_department"
          },
          {
            "label": "'I just hate cold calls' / laughs",
            "to": "sell_test_drive"
          },
          {
            "label": "Still firm no",
            "to": "graceful_exit"
          }
        ]
      },
      "handle_have_process": {
        "label": "HAVE A PROCESS — AGREE AND SPLIT",
        "say": "That makes total sense — I'd honestly be shocked if you guys didn't have something in place, especially at the level you're operating at. Just curious — is it that your team's really happy with how it's working, or is it more that switching anything right now would just be a headache?",
        "note": "Validate them. 'At the level you're operating at' is a sincere compliment for a luxury operator. The split gives you two paths — both can lead to a test drive pitch or a referral to the ops person.",
        "branches": [
          {
            "label": "'It works fine' / happy with current process",
            "to": "sell_test_drive"
          },
          {
            "label": "'Switching would be a pain'",
            "to": "sell_test_drive"
          },
          {
            "label": "'You'd need to talk to someone else about that'",
            "to": "not_my_department"
          },
          {
            "label": "Hard no",
            "to": "graceful_exit"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Look — you're probably not buying anything from a cold call today, and I totally respect that. But we've been working with a few luxury PM companies on this exact stuff, and if nothing else I could walk whoever handles your operations through what they're doing with their turnover photos. Worst case they steal some ideas and we part as friends. Would you be open to connecting me with the right person for a quick look?",
        "note": "Low pressure. You're not asking Laughlin to buy or even to take a meeting himself — you're asking him to connect you. 'Steal some ideas' makes it feel safe and worth their time even if they never buy.",
        "branches": [
          {
            "label": "Open to connecting you with someone",
            "to": "not_my_department"
          },
          {
            "label": "'Send me an email'",
            "to": "send_email_request"
          },
          {
            "label": "'I'll take a look myself'",
            "to": "book_meeting"
          },
          {
            "label": "No thanks",
            "to": "graceful_exit"
          }
        ]
      },
      "warm_pivot_to_referral": {
        "label": "WARM BUT WRONG PERSON",
        "say": "Totally makes sense. I appreciate you humoring me on this — seriously. Who on your team would be the best person to dig into the operations side with? I don't want to waste your time on stuff that's outside your lane.",
        "note": "He was warm but can't go deeper on ops. That warmth is valuable — he'll give you a name willingly now. Be grateful, not pushy.",
        "branches": [
          {
            "label": "Names someone",
            "to": "names_someone"
          },
          {
            "label": "Vague / unsure",
            "to": "vague_no_name"
          },
          {
            "label": "'I can pass it along'",
            "to": "offer_to_pass_along"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Let's do it. I've got next week pulled up — how does Tuesday or Wednesday afternoon look? I'll keep it to fifteen minutes tops.",
        "note": "Give two specific options. Don't say 'whenever works.' Lock a day and time NOW. Send the calendar invite while you're still on the phone if possible.",
        "branches": [
          {
            "label": "Picks a time",
            "to": "meeting_booked"
          },
          {
            "label": "'Let me check and get back to you'",
            "to": "send_email_request"
          },
          {
            "label": "'Send me something first'",
            "to": "send_email_request"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING LOCKED",
        "say": "Perfect — I'll send over a calendar invite right now so it doesn't get lost. Really appreciate you taking my call, Laughlin. And for what it's worth — Aspen's next on my ski list. Talk soon.",
        "note": "STOP SELLING. You got the meeting. Send the invite immediately. End on the personal ski note. Do not add anything about the product.",
        "branches": []
      },
      "send_email_request": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. I'll get you something today. One quick question — what would be most useful to include so it's not just another generic pitch sitting in your inbox?",
        "note": "Accept the email request gracefully, then use the question to get intel and make the email way more likely to get read. His published email is laughlinmci@gmail.com.",
        "branches": [
          {
            "label": "Tells you what to include",
            "to": "email_close"
          },
          {
            "label": "'Just the basics' / 'Whatever you've got'",
            "to": "email_close"
          }
        ]
      },
      "email_close": {
        "label": "CLOSE — EMAIL PATH",
        "say": "Got it — I'll send that over this afternoon. And if there's someone else on your team I should copy on it — like whoever handles the property ops side — I'm happy to include them. Appreciate your time, Laughlin.",
        "note": "One last attempt to get a referral name via the CC angle. If he gives one, note it. Send the email within an hour. Include a specific meeting time in the email. Follow up in 3 business days if no response.",
        "branches": [
          {
            "label": "Gives another name to CC",
            "to": "close_referral"
          },
          {
            "label": "'Just send it to me' / no additional name",
            "to": "graceful_exit_warm"
          }
        ]
      },
      "graceful_exit_warm": {
        "label": "EXIT — WARM",
        "say": "Will do. Thanks again, Laughlin — talk soon.",
        "note": "Clean and short. Send the email immediately. Mark this contact as warm for follow-up. He may forward it internally even if he didn't say he would.",
        "branches": []
      },
      "graceful_exit": {
        "label": "EXIT — GRACEFUL",
        "say": "Totally understand. If anything changes, I'm easy to find. Appreciate your time, Laughlin.",
        "note": "Don't burn the bridge. He's at a small family company — even a 'no' today could turn into a mention to the ops person tomorrow. Stay classy.",
        "branches": []
      }
    }
  }
}