{
  "name": "Laurie McChesney",
  "title": "Founder / Principal Broker",
  "company": "Preferred Properties Key West (RealKeyWest.com)",
  "location": "Key West, FL",
  "phone": "305-923-6639",
  "company_phone": "305-294-3040",
  "alt_phones": [],
  "flow": {
    "context": "Laurie McChesney is the Founder and Principal Broker of Preferred Properties Key West — the vacation rental arm operates as RealKeyWest.com. Dan Skahen grew their management division from 3 homes to 150+ homes. They run Escapia as their PMS with a Bluetent-built website. Their rental policies already emphasize damage handling — guests choose between a $100 damage waiver or a $5,000 refundable security deposit — signaling this is an active operational pain point. Strongest personal connection: Laurie grew up in the San Francisco Bay Area and Sam has deep family ties in SF (aunt is Global VP at Salesforce there, Sam visits regularly).",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Laurie — this might be a little out of left field, but I noticed you're originally from the Bay Area. I've got family out in SF, I'm out there all the time. Small world. It's Sam Parks with RapidEye — have you heard my name tossed around at all?",
        "note": "Feet-up-on-the-desk energy. Warm, not rushed. Pause after 'tossed around' and let her respond. The Bay Area connection is real — aunt is Global VP at Salesforce in SF.",
        "branches": [
          {
            "label": "Yes / maybe",
            "to": "heard_yes"
          },
          {
            "label": "No, I haven't",
            "to": "heard_no"
          },
          {
            "label": "Now's not a good time",
            "to": "bad_timing"
          },
          {
            "label": "Who is this? / What's this about?",
            "to": "who_is_this"
          }
        ]
      },
      "heard_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone like you on the property management side. What'd you hear?",
        "note": "Genuinely curious. Let her talk. Whatever she says, bridge into discovery or the pain trigger depending on how much she knows.",
        "branches": [
          {
            "label": "Describes what they heard",
            "to": "warm_discovery"
          },
          {
            "label": "Vague / not sure where",
            "to": "pain_trigger"
          }
        ]
      },
      "heard_no": {
        "label": "HAVEN'T HEARD — TRANSITION",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call is —",
        "note": "Say this with a smile. Self-deprecating. Flow straight into the pain trigger without pausing.",
        "branches": [
          {
            "label": "Continue to pain trigger",
            "to": "pain_trigger"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again later this week? Maybe Thursday or Friday afternoon?",
        "note": "Don't push. Offer a specific window. If she gives a time, lock it in and get off the phone.",
        "branches": [
          {
            "label": "Gives a better time",
            "to": "reschedule"
          },
          {
            "label": "Just tell me what it's about",
            "to": "pain_trigger"
          },
          {
            "label": "Don't call back / hard no",
            "to": "graceful_exit"
          }
        ]
      },
      "reschedule": {
        "label": "CALLBACK LOCKED",
        "say": "Perfect — I'll give you a ring then. Appreciate it, Laurie. Talk soon.",
        "note": "Write down the callback time immediately. Don't try to squeeze in a pitch. Clean exit.",
        "branches": []
      },
      "who_is_this": {
        "label": "WHO IS THIS",
        "say": "Yeah totally fair — it is a cold call. I work with a few property management companies on their inspection workflows and I came across your team. Can I get 30 seconds to tell you why I reached out? You can totally hang up on me if it's not a fit.",
        "note": "Own the cold call honestly. The 30-second ask lowers the stakes. Sound confident, not apologetic.",
        "branches": [
          {
            "label": "Sure, go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "Not interested / no",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and this just isn't interesting?",
        "note": "Split the reaction. Most people soften and give a real answer. Don't sound defeated — genuinely curious.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not interested at all",
            "to": "last_chance_value"
          },
          {
            "label": "Opens up a bit / explains",
            "to": "pain_trigger"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "So I work with another property manager on the East Coast — similar setup to you guys, about 150 homes, running Escapia. And the thing that kept coming up was every turnover, their cleaners are snapping photos, uploading them into the system, and nobody's actually reviewing them in any meaningful way. So when a guest breaks a lamp or drags furniture across the floor, they don't catch it until the next guest complains — and at that point the damage waiver's already been processed, the deposit window's closed, and the owner's calling asking why nobody caught it. Does that sound familiar at all, or is your process pretty dialed in?",
        "note": "Tailored to Laurie's world: 150+ homes, Escapia, their damage waiver vs deposit structure. PAUSE after the question. Let her react. The goal is to get her talking about HER experience. Don't rush past the silence.",
        "branches": [
          {
            "label": "Yes, that's a real problem / relates to pain",
            "to": "pain_positive"
          },
          {
            "label": "We handle it okay / neutral",
            "to": "pain_neutral"
          },
          {
            "label": "We already have something for that",
            "to": "objection_have_process"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "pain_positive": {
        "label": "THEY FEEL THE PAIN",
        "say": "Yeah — and with 150-plus homes in Key West, I can only imagine the volume. So what we built is basically an AI layer that plugs into the photos your team's already taking in Escapia — it automatically flags damage, missing items, staging issues, and generates an inspection report without anyone changing their workflow. Would you be open to taking a look when I'm not cold calling you out of the blue?",
        "note": "One sentence on what RapidEye does. Reference Escapia by name. Then soft CTA. Don't oversell — let the pain she just described do the work.",
        "branches": [
          {
            "label": "Sure / open to it",
            "to": "warm_discovery"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Budget / timing concern",
            "to": "objection_no_budget"
          },
          {
            "label": "Who would I talk to?",
            "to": "book_meeting"
          }
        ]
      },
      "pain_neutral": {
        "label": "NEUTRAL — DIG DEEPER",
        "say": "Got it — out of curiosity, what does that look like on your end right now? Are your PMs or cleaners doing photo documentation every turnover, or is it more of a spot-check situation?",
        "note": "She's not rejecting you — she just needs a reason to care. Ask about HER process. Listen for where it breaks down. She may also redirect you to Dan or Angela.",
        "branches": [
          {
            "label": "Describes their process (has gaps)",
            "to": "pain_bridge"
          },
          {
            "label": "We have a good system",
            "to": "objection_have_process"
          },
          {
            "label": "I'm not the right person for this",
            "to": "referral_ask"
          }
        ]
      },
      "pain_bridge": {
        "label": "BRIDGE TO SOLUTION",
        "say": "Yeah that makes sense. So what we've seen is even when the photos are getting taken, the bottleneck is someone actually reviewing them — especially across 150-plus homes. What we built is an AI that does that review automatically. Plugs right into Escapia, flags anything that changed, and spits out an inspection report. No workflow change on your team's end. Would it be worth a quick look?",
        "note": "Mirror back what she described, then bridge to the solution. Keep it conversational, not pitchy.",
        "branches": [
          {
            "label": "Yeah, I'd look at that",
            "to": "warm_discovery"
          },
          {
            "label": "Send me info",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "objection_no_budget"
          }
        ]
      },
      "warm_discovery": {
        "label": "DISCOVERY — STOP PITCHING",
        "say": "Awesome. Before I set anything up — what's your biggest headache heading into season right now? Is it more on the guest experience side, or more on the owner relations and damage accountability side?",
        "note": "STOP SELLING. Ask questions. Key West high season is winter through spring — she's likely mid-season right now. Tailor the conversation to what SHE cares about as the founder.",
        "branches": [
          {
            "label": "Guest experience / reviews",
            "to": "discovery_guest_experience"
          },
          {
            "label": "Owner relations / damage costs",
            "to": "discovery_owner_relations"
          },
          {
            "label": "Scaling / staffing",
            "to": "discovery_scaling"
          },
          {
            "label": "Just show me what you've got",
            "to": "book_meeting"
          }
        ]
      },
      "discovery_guest_experience": {
        "label": "DISCOVERY — GUEST EXPERIENCE",
        "say": "That makes sense — especially in Key West where every listing's competing for five-star reviews. Are you seeing issues where stuff gets missed between turnovers and then shows up in a guest review? Like a cleanliness thing or something broken nobody flagged?",
        "note": "Let her vent. The more she talks, the more she's selling herself on the problem. Listen for specific examples you can reference when booking the meeting.",
        "branches": [
          {
            "label": "Yes, gives examples",
            "to": "book_meeting"
          },
          {
            "label": "It happens but we manage",
            "to": "offer_value_meeting"
          },
          {
            "label": "Who else in Key West uses this?",
            "to": "social_proof"
          }
        ]
      },
      "discovery_owner_relations": {
        "label": "DISCOVERY — OWNER RELATIONS",
        "say": "Yeah — I imagine with 150-plus owners, even a few damage disputes a month add up fast. When something does get missed, what does that process look like? Are you eating the cost, or is it coming out of the damage waiver?",
        "note": "We know they have a $100 waiver vs $5,000 deposit structure. Listen for how often they actually recover costs. This is where the ROI conversation lives for a founder.",
        "branches": [
          {
            "label": "Explains their process",
            "to": "book_meeting"
          },
          {
            "label": "It's a headache / we lose money on it",
            "to": "book_meeting"
          },
          {
            "label": "Dan or Angela handles that side",
            "to": "referral_internal"
          }
        ]
      },
      "discovery_scaling": {
        "label": "DISCOVERY — SCALING",
        "say": "I hear that a lot — especially from companies that grew fast. Dan Skahen's team took you guys from a few homes to 150-plus, right? At that volume, how are you keeping inspection quality consistent across all those properties?",
        "note": "Referencing Dan by name shows you did homework. If she's surprised, it builds credibility. Listen for where the process breaks at scale.",
        "branches": [
          {
            "label": "It's hard / we're working on it",
            "to": "book_meeting"
          },
          {
            "label": "Dan handles all of that",
            "to": "referral_internal"
          },
          {
            "label": "We've got a system that works",
            "to": "offer_value_meeting"
          }
        ]
      },
      "social_proof": {
        "label": "SOCIAL PROOF",
        "say": "We're not working with anyone in Key West yet, honestly — that's part of why I reached out to you. Most of our clients right now are on the East Coast — one company does about 200 luxury homes in New York, another's got around 600 properties. Similar pain, different market. Would it be useful to see how they're handling it? Even just to compare notes on the inspection side.",
        "note": "Be honest about Key West. Use real traction numbers. The 'compare notes' frame makes the meeting valuable regardless of whether she buys.",
        "branches": [
          {
            "label": "Sure, that'd be interesting",
            "to": "book_meeting"
          },
          {
            "label": "Send me info first",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "test_drive"
          }
        ]
      },
      "objection_no_budget": {
        "label": "OBJECTION — NO BUDGET",
        "say": "Totally get it. Nowadays it's harder to keep a tool than to buy something new. Just so no one from my team cold calls you again — is it that budget for this kind of thing is completely locked up, or is it more that anything new you try to bring in puts you through the ringer?",
        "note": "Agree first — surprise her by not pushing back. Then split the objection. Most founders will clarify, which reopens the conversation.",
        "branches": [
          {
            "label": "Budget is tight but not impossible",
            "to": "test_drive"
          },
          {
            "label": "Locked up / can't spend right now",
            "to": "test_drive"
          },
          {
            "label": "Hard no",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "Totally get it — I should have assumed you'd be all set. Otherwise you probably would have reached out. Just so nobody from my team bugs you again — is it that this just isn't a problem you're focused on right now, or is it more that you just hate cold calls?",
        "note": "Self-deprecating. The humor in the second option usually gets a laugh and softens the wall. Listen to which one she picks — it tells you the real objection.",
        "branches": [
          {
            "label": "Laughs / softens / it's the cold call",
            "to": "test_drive"
          },
          {
            "label": "We're really not focused on this",
            "to": "offer_value_meeting"
          },
          {
            "label": "Hard no",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_have_process": {
        "label": "OBJECTION — HAVE A PROCESS",
        "say": "That makes total sense — with 150-plus homes you'd have to have something in place. Is it that you're fully covered and happy with how it's working, or is it more that switching anything right now would be a headache?",
        "note": "No Breezeway or Matterport was detected on their sites — they may be doing manual inspections or using Escapia's basic tools. If she names a tool, listen carefully. That's valuable intel.",
        "branches": [
          {
            "label": "Happy with current setup",
            "to": "offer_value_meeting"
          },
          {
            "label": "It works but it's not great / open to looking",
            "to": "warm_discovery"
          },
          {
            "label": "Switching would be a nightmare",
            "to": "no_workflow_change"
          }
        ]
      },
      "no_workflow_change": {
        "label": "NO WORKFLOW CHANGE NEEDED",
        "say": "Totally hear that — that's actually why I called. We don't replace anything. We literally just plug into the photos your team's already uploading into Escapia and run analysis on top. Your cleaners and PMs don't change a single thing they're doing today. Only difference is you get an inspection report out the other end. Would it be worth a 15-minute look just to see if it fits?",
        "note": "This is the key differentiator for companies that hate switching tools. Emphasize ZERO workflow change. Plug into Escapia, not replace it.",
        "branches": [
          {
            "label": "Okay, that's different — I'd look",
            "to": "book_meeting"
          },
          {
            "label": "Send me info",
            "to": "send_email"
          },
          {
            "label": "Still not interested",
            "to": "graceful_exit"
          }
        ]
      },
      "test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "I totally respect that. You're probably not buying anything off a cold call, and I wouldn't expect you to. But when budget does free up, the people who move fast are the ones who already know what's on their list. Would you be open to a quick look — not to buy anything, but just so you know it exists? Worst case I can walk you through what other PM companies are doing with their turnover photos and you steal some ideas.",
        "note": "Low pressure. The 'steal some ideas' line makes the meeting valuable even if she never buys. This is about getting on her radar for when the timing is right.",
        "branches": [
          {
            "label": "Sure, I'll take a look",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "graceful_exit"
          }
        ]
      },
      "offer_value_meeting": {
        "label": "OFFER OF VALUE",
        "say": "Totally fair. If nothing else — would it be useful if I walked you through what a couple other property managers at your scale are doing on the inspection and turnover documentation side? Not a sales pitch, just a comparison. Worst case you steal some ideas and we part as friends.",
        "note": "Pure value offer. No pitch pressure. This works well with founders who are intellectually curious but not ready to buy anything.",
        "branches": [
          {
            "label": "Sure, that'd be interesting",
            "to": "book_meeting"
          },
          {
            "label": "Send it over",
            "to": "send_email"
          },
          {
            "label": "I'm good",
            "to": "graceful_exit"
          }
        ]
      },
      "last_chance_value": {
        "label": "LAST CHANCE — VALUE OFFER",
        "say": "Totally understand. Look — if nothing else, we've been pulling together data on what the top property managers are doing with AI and turnover photos. Happy to send it over, no strings attached. Would that be useful at all?",
        "note": "This is your last shot before exit. Keep it generous and zero-pressure. If she says no, exit clean.",
        "branches": [
          {
            "label": "Sure, send it",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "graceful_exit"
          }
        ]
      },
      "referral_ask": {
        "label": "REFERRAL — WRONG PERSON",
        "say": "Totally makes sense — you've got a lot on your plate running the whole operation. Who on your team typically owns the inspection and turnover workflow? Is that Dan Skahen's world, or someone else?",
        "note": "Drop Dan's name to show you did research. Laurie may also point to Angela McChesney (likely family — same last name, Broker Associate/PM), Jose Wenzel, or Jenny Perry. Get a specific name and ideally a warm intro.",
        "branches": [
          {
            "label": "Gives a name (Dan, Angela, Jose, etc.)",
            "to": "referral_get_name"
          },
          {
            "label": "I handle it but I'm not interested",
            "to": "test_drive"
          },
          {
            "label": "Not sure / won't refer",
            "to": "graceful_exit"
          }
        ]
      },
      "referral_internal": {
        "label": "REFERRAL — INTERNAL HANDOFF",
        "say": "Got it — would it make sense for me to reach out to them directly? If I can get their direct number, I'll put something tailored together so it actually lands and doesn't feel like another random cold pitch.",
        "note": "She may confirm Dan Skahen or Angela McChesney. If she offers to connect you internally, that's gold — accept it. Ask for the direct number or email.",
        "branches": [
          {
            "label": "Gives name + contact or offers to connect",
            "to": "referral_get_name"
          },
          {
            "label": "Just email me and I'll forward it",
            "to": "send_email"
          },
          {
            "label": "No, we're fine",
            "to": "graceful_exit"
          }
        ]
      },
      "referral_get_name": {
        "label": "REFERRAL — GOT THE NAME",
        "say": "Perfect — I really appreciate that. I'll put something together specifically for them so it's relevant and not generic. And Laurie — if it ever does come back across your desk, I'm easy to find. Thanks for taking my call.",
        "note": "Write down the name, number, and email immediately. Don't push further — you got what you needed. Log this referral and call them within 24 hours while Laurie might still mention it to them.",
        "branches": []
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome — let's get something on the calendar so I'm not cold calling you again. I've got next week pulled up — would Tuesday or Wednesday afternoon work better for you?",
        "note": "Pick specific days. Afternoons work well for Key West PM operators — mornings are turnover chaos. Send the calendar invite WHILE on the phone. Don't let her leave without a locked time.",
        "branches": [
          {
            "label": "Gives a day/time",
            "to": "meeting_booked"
          },
          {
            "label": "Let me check and get back to you",
            "to": "send_email_with_times"
          },
          {
            "label": "Send me info first, then we'll schedule",
            "to": "send_email"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING LOCKED",
        "say": "Perfect — I'll shoot you a calendar invite right now. Is mcchesneykeywest@gmail.com still the best email? Great. Really appreciate you taking my call, Laurie. Talk soon.",
        "note": "Confirm the email. Send the invite IMMEDIATELY while still on the phone. Stop selling. Don't add anything else. End clean and warm.",
        "branches": []
      },
      "send_email_with_times": {
        "label": "SEND EMAIL WITH TIMES",
        "say": "Totally — I'll shoot you an email today with a couple time options. That way you can just pick one when you've got your calendar in front of you. Is mcchesneykeywest@gmail.com the best one?",
        "note": "She's interested but noncommittal. The email with specific times creates urgency. Follow up in 2 days if no response. Include 2-3 specific time slots.",
        "branches": [
          {
            "label": "Confirms email",
            "to": "send_email_confirm"
          },
          {
            "label": "Gives different email",
            "to": "send_email_confirm"
          }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair — I'll send something over. One quick question before I do so it's not just another generic pitch sitting in your inbox — what would be most relevant to include? The damage detection side, the inspection automation piece, or more of a case study from another company at your scale?",
        "note": "This question tells you what she actually cares about. Tailor the email to her answer. Always include 2-3 specific time suggestions in the email.",
        "branches": [
          {
            "label": "Tells you what to include",
            "to": "send_email_confirm"
          },
          {
            "label": "Just send whatever",
            "to": "send_email_confirm"
          }
        ]
      },
      "send_email_confirm": {
        "label": "EMAIL CONFIRMED",
        "say": "Got it — I'll get that over to you today. I'll include a couple times in case you want to hop on a quick call after you look it over. Is mcchesneykeywest@gmail.com the best email? Perfect. Thanks Laurie — appreciate your time.",
        "note": "Confirm the email address. Send the email within 2 hours while the call is fresh. Include the specific content she asked for plus 2-3 time options. Follow up in 2-3 days if no response.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes down the road, I'm easy to find. Appreciate your time, Laurie.",
        "note": "Don't burn the bridge. Stay warm. She may google RapidEye after the call. Log the outcome and set a follow-up reminder for 60 days. She's still the ultimate decision-maker even if today wasn't the day.",
        "branches": []
      }
    }
  }
}