{
  "name": "Lee Zeller",
  "title": "Owner / Proprietor",
  "company": "Accommodations in Telluride",
  "location": "Telluride, CO",
  "phone": "+1-970-728-4831 ext. 302",
  "company_phone": "970-728-4831",
  "alt_phones": [],
  "flow": {
    "context": "Calling Lee Zeller, Owner and Proprietor of Accommodations in Telluride — a vacation rental and property management company in Telluride, CO, in business since 1997 and locally owned since 2004. Lee is the final decision-maker and markets her company on checking 'every system and detail' and keeping homes 'tip top.' They use Streamline as their PMS. Her team includes Kelsy Colvin (Director of Home Care and Owner Services) and Katja Butts (Inspector and Guest Services). Strongest connection to Sam: Lee moved to Telluride for the mountains and ski culture, and Sam just skied Jackson Hole in January 2026.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER — SKI TOWN CONNECTION",
        "say": "Hey Lee — this is gonna sound a little random, but I was actually just out in Jackson Hole skiing last month and ended up talking with a few property managers in mountain towns about how they handle turnovers. Saw your name come up with Accommodations in Telluride. It's Sam Parks with RapidEye — have you heard my name tossed around at all?",
        "note": "Ski connection is real — Sam was in Jackson Hole Jan 2026. Feet-up-on-the-desk energy. Don't rush. Let her process the question.",
        "branches": [
          {
            "label": "No, haven't heard of you",
            "to": "heard_no"
          },
          {
            "label": "Yeah / maybe / sounds familiar",
            "to": "heard_yes"
          },
          {
            "label": "Now's not a good time",
            "to": "bad_timing"
          },
          {
            "label": "Who is this? / What's this about?",
            "to": "permission_fallback"
          }
        ]
      },
      "heard_no": {
        "label": "HAVEN'T HEARD — TRANSITION TO PAIN",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call — I work with a few other vacation rental managers in resort markets, and the thing I keep hearing, especially from owners who've been doing this as long as you have, is that the inspection piece is kind of this black hole. You've got cleaners going through these high-end mountain homes, they're taking photos, maybe logging stuff in Streamline, but nobody's actually reviewing every shot. And then a guest checks in and finds a cracked window or a missing set of towels, and suddenly it's a bad review or a homeowner calling you asking what happened. Does any of that ring true for you?",
        "note": "Dropping Streamline shows you did homework. PAUSE after the question and let her talk. The pain is owner-level: protecting reputation, keeping homeowners happy, avoiding blame when something slips through.",
        "branches": [
          {
            "label": "Yeah, that's definitely a problem / tells a story",
            "to": "warm_response"
          },
          {
            "label": "We actually handle that pretty well",
            "to": "objection_have_process"
          },
          {
            "label": "I'm not really interested",
            "to": "objection_not_interested"
          },
          {
            "label": "What exactly do you do?",
            "to": "solution_and_cta"
          }
        ]
      },
      "heard_yes": {
        "label": "HEARD OF US — EXPLORE",
        "say": "Oh nice — well normally we'd be working with someone like you. What'd you hear?",
        "note": "Let her talk. Whatever she says, agree and redirect to pain or discovery. Don't correct anything — just flow with it.",
        "branches": [
          {
            "label": "Tells you what she heard",
            "to": "warm_response"
          },
          {
            "label": "Not sure / vague",
            "to": "heard_no"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING — LOCK CALLBACK",
        "say": "Totally hear you — would it be a terrible idea if I tried you again later this week? Maybe Thursday afternoon?",
        "note": "Don't push. Offer a specific day. Lock in a callback if possible.",
        "branches": [
          {
            "label": "Sure, try me Thursday / gives a time",
            "to": "callback_locked"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          },
          {
            "label": "What's this about? (gives you a window)",
            "to": "permission_fallback"
          },
          {
            "label": "No, don't call back",
            "to": "graceful_exit"
          }
        ]
      },
      "callback_locked": {
        "label": "CALLBACK CONFIRMED",
        "say": "Perfect — I'll try you Thursday. Really appreciate it, Lee. Talk soon.",
        "note": "Write down the exact day and time immediately. Set a reminder. Don't oversell the callback.",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean, it is a cold call. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not a fit?",
        "note": "Disarming honesty. Most people give you 30 seconds when you frame it this way. If she laughs, you're in.",
        "branches": [
          {
            "label": "Sure, go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "No / not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED — SPLIT",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it more that you already know what we do and it's just not interesting?",
        "note": "Splitting the objection. If it's timing, you get a callback. If it's disinterest, you can still offer value or exit gracefully.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / don't need it",
            "to": "sell_test_drive"
          },
          {
            "label": "Hard no / hangs up",
            "to": "graceful_exit"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER — OWNER LEVEL",
        "say": "So I work with a few other vacation rental operators in mountain resort towns — one's pretty similar to you actually, been running their portfolio for over 20 years, takes a lot of pride in keeping homes in great shape for owners. The problem they kept running into was their cleaners were going through turnovers, taking photos, but nobody had time to actually look at every single image across every property. Stuff was slipping — a stain on a couch from the last guest, a cracked tile in the bathroom, a staging issue in the living room. And it wouldn't surface until either the next guest complained or the homeowner showed up for their own trip and noticed. At that point, you've already lost the damage deposit window, and now it's an awkward conversation with the owner about who's accountable. Does any of that ring true for how things work on your end?",
        "note": "This is the money moment. PAUSE after the question. Let silence do the work. Lee markets 'checking every system and detail' — this pain is about the gap between that promise and the reality of doing it at scale during peak season.",
        "branches": [
          {
            "label": "Yes / shares her own version of the pain",
            "to": "warm_response"
          },
          {
            "label": "We have a pretty good process for that",
            "to": "objection_have_process"
          },
          {
            "label": "Not really a problem for us",
            "to": "objection_not_interested"
          },
          {
            "label": "What do you do about it?",
            "to": "solution_and_cta"
          }
        ]
      },
      "warm_response": {
        "label": "THEY'RE WARM — STOP PITCHING, ASK QUESTIONS",
        "say": "Yeah, that's exactly what I keep hearing. I'm curious — what does your inspection process actually look like right now after a cleaner finishes a turnover? Like, is Katja going through every single unit before check-in, or are there times where photos are the only check?",
        "note": "You know Katja Butts is their Inspector. Dropping her name shows deep homework. This is discovery mode — shut up and listen. Learn their workflow before pitching anything.",
        "branches": [
          {
            "label": "Describes their process / opens up",
            "to": "discovery_deeper"
          },
          {
            "label": "How do you know about Katja?",
            "to": "research_explain"
          },
          {
            "label": "We handle it fine internally",
            "to": "objection_have_process"
          },
          {
            "label": "What exactly does RapidEye do?",
            "to": "solution_and_cta"
          }
        ]
      },
      "research_explain": {
        "label": "EXPLAIN THE HOMEWORK",
        "say": "Oh — I just saw her listed as your inspector on your team page. We tend to do our homework before calling someone. Didn't wanna waste your time with something generic. But yeah — is she the one physically walking every property, or do you rely on cleaner photos for some of the checks?",
        "note": "Be honest and casual about the research. It's flattering, not creepy. Redirect back to discovery immediately.",
        "branches": [
          {
            "label": "Describes their process",
            "to": "discovery_deeper"
          },
          {
            "label": "Asks more about RapidEye",
            "to": "solution_and_cta"
          }
        ]
      },
      "discovery_deeper": {
        "label": "DEEPER DISCOVERY — COST OF THE PROBLEM",
        "say": "That makes sense. And when something does slip through — like a damage that wasn't caught at turnover — how does that usually play out with the homeowner? I imagine in a market like Telluride, those homes are worth a lot, and the owners have pretty high expectations about how their property's being taken care of.",
        "note": "This is about surfacing the COST of the problem. Telluride = high-value mountain properties = demanding owners. Let Lee quantify the pain herself. If she gives you a story, you're golden.",
        "branches": [
          {
            "label": "Shares a story or quantifies the pain",
            "to": "solution_and_cta"
          },
          {
            "label": "It doesn't happen often / we're pretty good",
            "to": "solution_and_cta_soft"
          },
          {
            "label": "Asks what you do about it",
            "to": "solution_and_cta"
          }
        ]
      },
      "solution_and_cta": {
        "label": "ONE-SENTENCE SOLUTION + CTA",
        "say": "So what we built — it's pretty simple. RapidEye plugs into the photos your cleaners are already taking, runs them through AI, and flags damage, missing items, staging issues — basically generates an inspection report automatically before anyone checks in. It works with Streamline, so there's no workflow change for your team. Would you be open to seeing a quick demo sometime this week when I'm not cold calling you out of the blue?",
        "note": "Mention Streamline — they use it and it shows you know their stack. One sentence on what it does, one on integration, then CTA. Don't oversell. The goal is a meeting, not a sale.",
        "branches": [
          {
            "label": "Sure, let's set something up",
            "to": "booking_meeting"
          },
          {
            "label": "Send me an email first",
            "to": "send_email"
          },
          {
            "label": "I'd want Kelsy to look at this too",
            "to": "referral_to_kelsy"
          },
          {
            "label": "We don't have budget for that",
            "to": "objection_no_budget"
          },
          {
            "label": "We're pretty set with our current process",
            "to": "objection_have_process"
          }
        ]
      },
      "solution_and_cta_soft": {
        "label": "SOFT CTA — THEY'RE NOT FEELING ACUTE PAIN",
        "say": "That's great — honestly, the fact that you've built a process that works after doing this since '97 says a lot. What I've been hearing from other operators who feel pretty dialed in is that the value isn't replacing what they do — it's catching the one or two things that slip through on a busy Saturday when you've got back-to-back turnovers and Katja can't physically be in every home. Would you be open to just seeing what it looks like? Worst case you steal some ideas and we part as friends.",
        "note": "She may not feel acute pain — that's fine. Sell the meeting, not the product. 'Since '97' validates her experience. 'Back-to-back turnovers' hits harder for ski-town operators with compressed changeover windows on Saturdays.",
        "branches": [
          {
            "label": "Sure, I'd take a look",
            "to": "booking_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Kelsy would be better for this",
            "to": "referral_to_kelsy"
          },
          {
            "label": "Not right now",
            "to": "sell_test_drive"
          }
        ]
      },
      "booking_meeting": {
        "label": "BOOK THE MEETING — NOW",
        "say": "Awesome. I've got next week pulled up — would Tuesday or Wednesday work better for you? Thinking like 15, 20 minutes tops.",
        "note": "Give two options, not open-ended. Lock it in NOW. Don't let it become 'I'll reach out to schedule.' Have your calendar ready.",
        "branches": [
          {
            "label": "Picks a day/time",
            "to": "meeting_confirmed"
          },
          {
            "label": "Let me check my calendar and get back to you",
            "to": "pin_down_meeting"
          },
          {
            "label": "Include Kelsy on the call",
            "to": "meeting_with_kelsy"
          }
        ]
      },
      "meeting_confirmed": {
        "label": "MEETING LOCKED",
        "say": "Perfect — I'll send you a calendar invite right now to lee@vacationtelluride.com. Really appreciate you taking my call, Lee. Talk to you then.",
        "note": "Send the invite WHILE on the phone. Confirm the email. Stop selling — you got the meeting. Be warm, be brief, get off the phone.",
        "branches": []
      },
      "pin_down_meeting": {
        "label": "PIN DOWN THE TIME",
        "say": "Totally — I'll shoot you an invite for Wednesday at 2 as a placeholder, and if that doesn't work just let me know and we'll slide it. Sound fair?",
        "note": "Don't let it float. Anchor a specific time. A calendar invite is harder to ignore than a vague 'let me know.'",
        "branches": [
          {
            "label": "Sure, that works",
            "to": "meeting_confirmed"
          },
          {
            "label": "Gives a different time",
            "to": "meeting_confirmed"
          },
          {
            "label": "Just email me",
            "to": "send_email"
          }
        ]
      },
      "meeting_with_kelsy": {
        "label": "MEETING WITH KELSY INCLUDED",
        "say": "Love that — Kelsy would be great to have on since she's running home care day-to-day. What's the best way to loop her in? Should I reach out to her directly, or would it be easier if you just forwarded the invite?",
        "note": "Lee wants to delegate or co-attend — both are wins. Getting access to Kelsy (operational buyer) through Lee (economic buyer) is ideal.",
        "branches": [
          {
            "label": "I'll forward it / I'll loop her in",
            "to": "meeting_confirmed"
          },
          {
            "label": "Reach out to her directly",
            "to": "referral_to_kelsy"
          }
        ]
      },
      "referral_to_kelsy": {
        "label": "REFERRAL TO KELSY COLVIN",
        "say": "That makes total sense — Kelsy's probably closer to the day-to-day on inspections and turnovers. Would you mind if I reached out to her directly? And would it help if you gave her a quick heads up so it's not a total cold call?",
        "note": "Kelsy Colvin is Director of Home Care and Owner Services — the operational buyer. Her direct email isn't public (only info@vacationtelluride.com). Getting Lee to intro you is gold.",
        "branches": [
          {
            "label": "Sure, I'll give her a heads up / gives you her info",
            "to": "referral_confirmed"
          },
          {
            "label": "Just email info@ and we'll route it",
            "to": "send_email_referral"
          },
          {
            "label": "Let me talk to her first and get back to you",
            "to": "referral_pending"
          }
        ]
      },
      "referral_confirmed": {
        "label": "REFERRAL LOCKED",
        "say": "Really appreciate that, Lee. I'll put something tailored together for Kelsy so it actually makes sense for what she's dealing with day-to-day. And if you want to be on the call too, you're more than welcome. Thanks again for your time.",
        "note": "You got a warm intro to the operational buyer from the owner. This is a great outcome. Follow up within 24 hours before the intro goes cold.",
        "branches": []
      },
      "send_email_referral": {
        "label": "EMAIL ROUTED THROUGH INFO@",
        "say": "Totally — I'll send something to info@ addressed to Kelsy. Would it be helpful if I mentioned that you and I chatted so she knows it's not coming out of left field?",
        "note": "You want Lee's name attached to your email so it gets attention and doesn't get filtered. Even a soft 'Lee suggested I reach out' changes everything.",
        "branches": [
          {
            "label": "Sure, that's fine",
            "to": "referral_confirmed"
          },
          {
            "label": "Just send it, she'll see it",
            "to": "referral_confirmed"
          }
        ]
      },
      "referral_pending": {
        "label": "REFERRAL PENDING — ANCHOR FOLLOW-UP",
        "say": "Totally understand. I'll follow up with a quick email to you in the meantime so you've got something to share with her if it makes sense. Would end of this week be a good time to check back in?",
        "note": "Don't push. Anchor a follow-up date. Send the email to Lee immediately after hanging up — short, specific, easy to forward.",
        "branches": [
          {
            "label": "Sure / gives a timeframe",
            "to": "graceful_exit_warm"
          },
          {
            "label": "Don't call back, we'll reach out if interested",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_no_budget": {
        "label": "NO BUDGET — AGREE + SPLIT",
        "say": "Totally get it. Nowadays it's harder to keep a tool you already have, let alone buy something new — especially heading into the off-season. Just so no one from my team cold calls you again — is it that the budget for this cycle is completely locked, or is it more that anything new has to prove itself before it's worth even looking at?",
        "note": "Agree first — surprise her by not pushing back. Then split the objection. You're finding out if it's a timing issue or a threshold issue. Either way, you have a path forward.",
        "branches": [
          {
            "label": "Budget is locked / can't spend right now",
            "to": "sell_test_drive"
          },
          {
            "label": "It's more about proving the value first",
            "to": "sell_test_drive_roi"
          },
          {
            "label": "Hard no on budget",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_not_interested": {
        "label": "NOT INTERESTED — AGREE + SPLIT",
        "say": "I totally get it — I should've assumed you'd be all set, otherwise you probably would've reached out. Just so no one from my team bugs you again — is it that this isn't a problem you're focused on right now, or is it more that you just hate cold calls? I'd totally get either one.",
        "note": "Disarm with humor. The split gives you information. If it's the cold call itself, you may still get a meeting through email. If it's not a priority, plant a seed for later.",
        "branches": [
          {
            "label": "It's not a priority right now",
            "to": "sell_test_drive"
          },
          {
            "label": "I just hate cold calls / bad timing",
            "to": "send_email"
          },
          {
            "label": "We really don't need this",
            "to": "last_resort_value"
          },
          {
            "label": "Hard no",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_have_process": {
        "label": "HAVE A PROCESS — AGREE + SPLIT",
        "say": "That makes total sense — you've been doing this since '97, you'd have to have something pretty dialed in by now. And honestly, most of the companies I work with aren't starting from scratch either. Just so I'm not wasting your time — is it that you're fully covered and everything's airtight, or is it more that switching or adding anything right now would just be a headache?",
        "note": "Validate their longevity. The split separates 'we're perfect' (rare — push gently) from 'change is hard' (very common — sell the test drive as no workflow change).",
        "branches": [
          {
            "label": "We're pretty well covered",
            "to": "last_resort_value"
          },
          {
            "label": "It's more about the hassle of adding something new",
            "to": "sell_test_drive"
          },
          {
            "label": "Katja and Kelsy handle all that",
            "to": "referral_to_kelsy"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally fair — and you're probably not buying anything from a cold call today, I respect that. But what I've found is the managers who end up loving this are the ones who saw it before they needed it. If nothing else, I could walk you through what a few other mountain-town operators are doing with their turnover photos — some of it's pretty clever stuff. Worst case you steal some ideas and we part as friends. Would you be open to 15 minutes?",
        "note": "This is the last real ask. You're selling the VALUE of the meeting, not the product. 'Mountain-town operators' is specific to her world. If she says no here, move to email or exit.",
        "branches": [
          {
            "label": "Fine, let's do it",
            "to": "booking_meeting"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "graceful_exit_warm"
          },
          {
            "label": "Kelsy should look at this",
            "to": "referral_to_kelsy"
          }
        ]
      },
      "sell_test_drive_roi": {
        "label": "SELL TEST DRIVE — ROI FRAMED",
        "say": "That's totally fair. What a lot of owners in your position tell me is that the math has to work — which I love, because that's actually where this thing shines. One of the managers we work with tracked it and found they were catching an average of two damage incidents per month that would've gone unnoticed. At Telluride price points, that adds up fast. Would you be open to a quick 15-minute look just to see if the numbers would make sense for your portfolio?",
        "note": "She wants ROI proof before even looking. Give her a concrete number from a real customer. Telluride = high-value homes, so even small damage adds up. This reframes the meeting as a math exercise, not a sales pitch.",
        "branches": [
          {
            "label": "Sure, let's look at it",
            "to": "booking_meeting"
          },
          {
            "label": "Send me the numbers in an email",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "graceful_exit_warm"
          }
        ]
      },
      "last_resort_value": {
        "label": "LAST RESORT — PLANT THE SEED",
        "say": "Totally hear you. One thing I will say — we've been working with a few PM companies that also use Streamline, and there are some interesting things they're doing with the photo data that goes beyond inspections — damage deposit documentation, owner reporting, liability protection. If any of that's ever relevant, I'm easy to find. Could I at least shoot you a quick email so you've got my info?",
        "note": "Soft landing. Mentioning Streamline shows specificity. Planting seeds around damage deposits and owner reporting — those are business outcomes an owner cares about even if 'inspections' don't excite her. An email keeps the door open.",
        "branches": [
          {
            "label": "Sure, send it over",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "graceful_exit"
          }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL — QUALIFY IT",
        "say": "Totally fair. One quick question before I do — what would be most relevant to include so it's not just another generic pitch sitting in your inbox? Like, is it more about the property care side, or the owner-reporting piece, or something else entirely?",
        "note": "Don't just accept 'send an email' and hang up. Ask what to include — gets her talking about her priorities and makes your follow-up far more effective. Send to lee@vacationtelluride.com.",
        "branches": [
          {
            "label": "Tells you what she cares about",
            "to": "email_confirmed"
          },
          {
            "label": "Just send whatever / general overview",
            "to": "email_confirmed"
          }
        ]
      },
      "email_confirmed": {
        "label": "EMAIL SEND-OFF",
        "say": "Got it — I'll send something over today to lee@vacationtelluride.com. I'll keep it short and include a time to chat in case you want to dig in after you read it. Really appreciate your time, Lee.",
        "note": "Confirm the email address. Include a specific meeting time suggestion in the email body. Follow up within the hour while the call is still fresh in her mind.",
        "branches": []
      },
      "graceful_exit_warm": {
        "label": "WARM EXIT",
        "say": "Totally understand. If anything changes — especially heading into summer when turnovers ramp up — I'm easy to find. Really appreciate your time, Lee. Enjoy the snow out there.",
        "note": "Leave it warm. The seasonal hook plants a seed — summer is peak season in Telluride and pain is highest. The ski reference keeps the personal connection alive. Set a reminder to re-engage in April/May before summer rush.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. Appreciate your time, Lee. If anything ever comes up, I'm easy to find. Have a great rest of your day.",
        "note": "Don't burn the bridge. Keep it short and genuine. Log the outcome and set a reminder to revisit in 3-6 months or try Kelsy Colvin directly.",
        "branches": []
      }
    }
  }
}