{
  "name": "Linda Tresler",
  "title": "Property Manager (Boardwalk)",
  "company": "Young's Suncoast Realty & Vacation Rentals",
  "location": "Gulf Shores, AL",
  "phone": "+1-251-747-4099",
  "company_phone": "+1-251-968-7158",
  "alt_phones": [],
  "flow": {
    "context": "Calling Linda Tresler, Property Manager for the Boardwalk condo association at Young's Suncoast Realty & Vacation Rentals in Gulf Shores, AL. She's the on-the-ground person responsible for property condition, maintenance coordination, and operational updates — she literally posted about elevator repairs on 10/03/2025. Young's Suncoast manages 250+ vacation rentals across Gulf Shores, Orange Beach, and Fort Morgan; they've been around 50 years and market 'Thorough Property Inspections' after every professional clean plus an in-house maintenance team doing 10 preventative visits per year. No confirmed use of Breezeway or Matterport. Her bosses are David Bodenhamer (Partner/Owner, also Dept Manager for Boardwalk) and Jordan Bodenhamer (Qualifying Broker since Sep 2024 / Director of Business Development). Calling her mobile: 251-747-4099. Strongest Sam connection: coastal/fishing lifestyle overlap with Gulf Shores market plus direct work with similar-sized PM companies in beach markets.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Linda, I work with a few other property managers down on the Gulf Coast — it's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Feet-up energy. You're calling her mobile so she may answer casually or cautiously. Pause after the question and let her respond. Sound like a peer, not a pitch.",
        "branches": [
          {
            "label": "No, I haven't heard of you",
            "to": "heard_name_no"
          },
          {
            "label": "Yes / Maybe / Sounds familiar",
            "to": "heard_name_yes"
          },
          {
            "label": "Who is this? / What's this about?",
            "to": "whats_this_about"
          },
          {
            "label": "Bad timing / I'm busy right now",
            "to": "bad_timing"
          }
        ]
      },
      "heard_name_no": {
        "label": "HAVEN'T HEARD THE NAME",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason I'm reaching out — I work with a couple other property managers who run a pretty similar operation to what you've got at Boardwalk. And the thing I keep hearing is that after every turnover, their cleaners are taking photos, their inspectors are taking photos, but nobody actually has time to go through all of them carefully. So stuff slips through — a stain on a couch, a chip in a countertop, a missing remote — and it doesn't get caught until a guest complains or an owner notices. We built an AI that plugs into the photos your team's already taking and flags the damage and the missing items automatically — so you're not the one who has to catch everything. Would you be open to taking a look when I'm not cold calling you out of the blue?",
        "note": "Pause after 'or an owner notices' — let the pain sit before jumping to the solution. She lives this every single day. Don't rush through the CTA.",
        "branches": [
          {
            "label": "That's interesting / Tell me more",
            "to": "warm_response"
          },
          {
            "label": "We already have a process for that",
            "to": "have_process_objection"
          },
          {
            "label": "I'm not really the person for this",
            "to": "not_right_person"
          },
          {
            "label": "Not interested",
            "to": "not_interested_objection"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          },
          {
            "label": "No budget / We're not buying anything",
            "to": "no_budget_objection"
          }
        ]
      },
      "heard_name_yes": {
        "label": "HEARD THE NAME",
        "say": "Oh nice — well normally we'd be working with someone like you on the inspection side. What did you hear?",
        "note": "Let her talk. Whatever she says, use it to transition into discovery. Don't correct her if she's wrong about what RapidEye does — just guide the conversation.",
        "branches": [
          {
            "label": "Shares what they heard",
            "to": "warm_response"
          },
          {
            "label": "Not much / Can't remember",
            "to": "heard_name_no"
          }
        ]
      },
      "whats_this_about": {
        "label": "WHAT'S THIS ABOUT",
        "say": "Yeah totally fair — it is a cold call, I'll own that. Can I get 30 seconds to tell you why I reached out? And you can totally hang up on me if it's not a fit.",
        "note": "She's guarded. Don't get defensive. The 30-second permission ask resets the dynamic — you're being transparent and giving her control, which paradoxically makes her more likely to listen.",
        "branches": [
          {
            "label": "Sure, go ahead",
            "to": "pain_trigger_short"
          },
          {
            "label": "No / Not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow, maybe in the afternoon?",
        "note": "Don't push. Offer a specific callback time. If she gives you a window, take it and lock it down. Write the time down immediately.",
        "branches": [
          {
            "label": "Sure, try me tomorrow / gives a time",
            "to": "callback_locked"
          },
          {
            "label": "What's this about first?",
            "to": "pain_trigger_short"
          },
          {
            "label": "No, don't call back",
            "to": "end_graceful"
          }
        ]
      },
      "callback_locked": {
        "label": "CALLBACK LOCKED",
        "say": "Perfect — I'll try you then. Really appreciate it, Linda. Talk soon.",
        "note": "Write down the exact time. Set a calendar reminder. When you call back open with: 'Hey Linda, it's Sam Parks — you told me to try you back today.'",
        "branches": []
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already have something in place and this just isn't interesting?",
        "note": "Last chance. The 'so nobody bugs you again' reframes the question as being in HER interest. The multiple choice forces a real answer instead of a brush-off.",
        "branches": [
          {
            "label": "Bad time",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / have something",
            "to": "not_interested_split"
          },
          {
            "label": "Hangs up / hard no",
            "to": "end_graceful"
          }
        ]
      },
      "pain_trigger_short": {
        "label": "PAIN TRIGGER (30-SEC VERSION)",
        "say": "So I work with a couple property managers running a similar setup to what you guys have at Boardwalk — post-clean inspections, in-house maintenance, the whole thing. The problem they kept running into is their team's taking hundreds of photos every turnover, but nobody actually has time to review them all carefully. So damage gets missed, stuff disappears, and then it turns into a he-said-she-said with the guest or the owner. We built an AI that looks at every photo automatically and flags what's wrong — damage, missing items, staging issues — without changing anything about how your team already works. Would you be open to seeing what that looks like?",
        "note": "You asked for 30 seconds so keep it tight. Reference Boardwalk and their inspection process specifically. Pause after 'he-said-she-said' to let the pain breathe.",
        "branches": [
          {
            "label": "That's interesting / Tell me more",
            "to": "warm_response"
          },
          {
            "label": "We already have a process for that",
            "to": "have_process_objection"
          },
          {
            "label": "I'm not really the person for this",
            "to": "not_right_person"
          },
          {
            "label": "Not interested",
            "to": "not_interested_objection"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          },
          {
            "label": "No budget / We're not buying anything",
            "to": "no_budget_objection"
          }
        ]
      },
      "warm_response": {
        "label": "THEY'RE WARM — STOP PITCHING",
        "say": "Nice — well I don't want to pitch you without understanding what you've got going on. What does your inspection process look like right now after a cleaner finishes a unit at Boardwalk?",
        "note": "She's interested. STOP selling and START asking. Let her describe her world. Listen for: who takes photos, how many, what tool they use, who reviews them, what falls through the cracks.",
        "branches": [
          {
            "label": "Describes their current process",
            "to": "discovery_dig_deeper"
          },
          {
            "label": "We do inspections after every clean",
            "to": "discovery_photo_volume"
          },
          {
            "label": "It's pretty manual right now",
            "to": "discovery_manual_pain"
          }
        ]
      },
      "discovery_dig_deeper": {
        "label": "DIG DEEPER ON PROCESS",
        "say": "Got it. And when your team's going through those photos — or honestly, if nobody really has time to go through them — what's the stuff that tends to slip through the cracks?",
        "note": "You're hunting for the specific pain: missed damage, deposit disputes, owner complaints, guest complaints. Whatever she says, mirror it back and connect it to what RapidEye solves.",
        "branches": [
          {
            "label": "Mentions specific issues (damage, missing items, disputes)",
            "to": "mirror_and_cta"
          },
          {
            "label": "Honestly nobody reviews them closely",
            "to": "mirror_and_cta"
          },
          {
            "label": "We catch most stuff / It's not a big problem",
            "to": "reframe_volume"
          }
        ]
      },
      "discovery_photo_volume": {
        "label": "PHOTO VOLUME DISCOVERY",
        "say": "Yeah, that's exactly what the other PMs I work with are doing too. How many units are you overseeing at Boardwalk? I'm just trying to get a sense of the volume your team's dealing with on turnovers.",
        "note": "Get the unit count. Then calculate implied photo volume in your head. If she mentions 100+ units with regular turnovers, that's thousands of photos per week nobody's really reviewing.",
        "branches": [
          {
            "label": "Shares unit count or details",
            "to": "discovery_dig_deeper"
          },
          {
            "label": "Why do you need to know that?",
            "to": "explain_why_volume"
          }
        ]
      },
      "discovery_manual_pain": {
        "label": "MANUAL PROCESS PAIN",
        "say": "Yeah, that's what I hear a lot. What's been the biggest headache with doing it manually?",
        "note": "She just told you it's manual. Let her vent. The more she talks about the pain, the more she sells herself on needing a solution. Don't interrupt.",
        "branches": [
          {
            "label": "Shares specific pain points",
            "to": "mirror_and_cta"
          },
          {
            "label": "It's just time-consuming / not enough people",
            "to": "mirror_and_cta"
          }
        ]
      },
      "explain_why_volume": {
        "label": "EXPLAIN WHY VOLUME MATTERS",
        "say": "Totally fair question. The reason I ask is the property managers we work with are dealing with hundreds of photos every week, and the AI gets way more valuable the higher that volume is — because that's exactly where the most stuff falls through the cracks. No human can carefully review 500 photos a day.",
        "note": "Reframe the question as being about helping her, not sizing her up. Then pivot back to discovery naturally.",
        "branches": [
          {
            "label": "Makes sense / shares details",
            "to": "discovery_dig_deeper"
          },
          {
            "label": "Still guarded",
            "to": "mirror_and_cta"
          }
        ]
      },
      "reframe_volume": {
        "label": "REFRAME — VOLUME ANGLE",
        "say": "That's great that your team catches a lot. The thing I hear from other PMs who said the same thing is that once they ran their photos through the AI, they found stuff their best inspectors were missing consistently — not because they're bad at their jobs, but because nobody can stare at 200 photos and catch everything. Would you be open to just running a batch through as a test? No commitment — just to see if anything pops up that you wouldn't have caught.",
        "note": "Don't argue with her. Validate that her team is good. The test offer is low-risk and high-curiosity. If she says yes, that IS the meeting.",
        "branches": [
          {
            "label": "Sure, that could be interesting",
            "to": "book_meeting"
          },
          {
            "label": "I'd have to talk to my boss about that",
            "to": "referral_boss"
          },
          {
            "label": "Not right now",
            "to": "test_drive_pitch"
          }
        ]
      },
      "mirror_and_cta": {
        "label": "MIRROR PAIN + ASK FOR THE MEETING",
        "say": "Yeah, that's exactly what I'm hearing from other managers in the Gulf Shores market. And honestly that's the whole reason we built this — so the AI catches the stuff that's impossible to catch manually at volume. Would it make sense to carve out 15 minutes later this week so I can show you what it actually looks like? I'll pull some examples from properties similar to Boardwalk so it's relevant to what you're dealing with.",
        "note": "Mirror back whatever she said. Make her feel heard. The CTA is specific — 15 minutes, this week, relevant examples. Don't leave it vague.",
        "branches": [
          {
            "label": "Sure / What day works?",
            "to": "book_meeting"
          },
          {
            "label": "I'd need to loop in Jordan or David",
            "to": "referral_boss"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Not right now / Maybe later",
            "to": "test_drive_pitch"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Let me pull up my calendar — how does Thursday afternoon look? I've got 2 PM Central open.",
        "note": "Pick a specific day and time. Don't say 'when works for you' — that creates decision paralysis. If she counters with another time, take it immediately. Send the invite while still on the phone.",
        "branches": [
          {
            "label": "That works / suggests another time",
            "to": "meeting_booked"
          },
          {
            "label": "I need to check my calendar / get back to me",
            "to": "lock_followup"
          },
          {
            "label": "I should include Jordan or David in this",
            "to": "include_decision_maker"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING BOOKED",
        "say": "Perfect. I'll shoot you an invite right now — what's the best email for you? And I'll keep it super focused, no hour-long demo or anything. Really appreciate you taking my call, Linda.",
        "note": "Get her email. Send the invite NOW while on the phone. Stop selling. Don't add features or benefits. You won. Confirm and get off the phone cleanly.",
        "branches": []
      },
      "lock_followup": {
        "label": "LOCK THE FOLLOW-UP",
        "say": "Totally get it. How about this — I'll send you a quick email with a couple time options and some context on what we'd cover. What's the best email for you?",
        "note": "Don't let this end with 'I'll get back to you' — that's a dead end. Get her email, send something specific within the hour. Include exactly two time slots.",
        "branches": [
          {
            "label": "Gives email",
            "to": "followup_confirmed"
          },
          {
            "label": "Just find me on the website / use the office email",
            "to": "followup_confirmed"
          }
        ]
      },
      "followup_confirmed": {
        "label": "FOLLOW-UP CONFIRMED",
        "say": "Got it. I'll get that over to you today. Appreciate your time, Linda — talk soon.",
        "note": "Send the email within 30 minutes. Subject line should reference this conversation or Boardwalk. Include two specific time options, a one-liner on what RapidEye does, and one relevant proof point from a similar PM company.",
        "branches": []
      },
      "include_decision_maker": {
        "label": "INCLUDE DECISION MAKER",
        "say": "That'd be great actually — is that Jordan Bodenhamer or David? I want to make sure whoever's on the call gets the right context ahead of time so we're not wasting anyone's time.",
        "note": "Drop the names you already know. This shows you've done your homework and makes the conversation feel less random. Get their availability and send a joint invite.",
        "branches": [
          {
            "label": "Jordan / gives details",
            "to": "meeting_booked"
          },
          {
            "label": "David / gives details",
            "to": "meeting_booked"
          },
          {
            "label": "Someone else / I'll check with them",
            "to": "lock_followup"
          }
        ]
      },
      "not_interested_objection": {
        "label": "NOT INTERESTED",
        "say": "I totally get it. I should have assumed you'd be all set — otherwise you probably would have reached out to us. Just so no one from my team cold calls you again — is it that this isn't really a problem you're focused on right now, or is it more that you just hate cold calls?",
        "note": "Agree first. Don't push back. The split question gives her an easy out but also reopens a door. If she says 'hate cold calls,' the problem is the medium not the message.",
        "branches": [
          {
            "label": "Not a problem I'm focused on",
            "to": "not_focused_reframe"
          },
          {
            "label": "I hate cold calls / just bad timing",
            "to": "hate_cold_calls"
          },
          {
            "label": "We're just not in the market for anything",
            "to": "test_drive_pitch"
          },
          {
            "label": "Hard no / hangs up",
            "to": "end_graceful"
          }
        ]
      },
      "not_interested_split": {
        "label": "NOT INTERESTED — SPLIT",
        "say": "Totally fair. Is it that inspections are already handled and working great, or is it more that you're just not the right person to be talking to about this kind of thing?",
        "note": "Two outcomes: she tells you inspections are fine (reframe opportunity) or she redirects you to the right person (referral). Both are wins.",
        "branches": [
          {
            "label": "Inspections are handled",
            "to": "have_process_objection"
          },
          {
            "label": "I'm not the right person",
            "to": "not_right_person"
          },
          {
            "label": "Both / hard no",
            "to": "end_graceful"
          }
        ]
      },
      "not_focused_reframe": {
        "label": "NOT FOCUSED — REFRAME WITH SEASONAL HOOK",
        "say": "Makes total sense — especially heading into summer season, you've probably got a hundred things on your plate. The reason I bring it up is the PMs I work with told me the exact same thing before they realized how much they were losing to damage that never got flagged. One company — similar size to you guys — found over 40K in missed damage in their first month just from photos their team was already taking. Not trying to scare you, just — would it be worth 15 minutes to see if that kind of thing is happening at Boardwalk?",
        "note": "Gulf Shores summer is peak season with maximum turnover volume. The $40K stat is from real customer traction. Pause after the number. If she engages, transition to booking.",
        "branches": [
          {
            "label": "That's a lot / Tell me more",
            "to": "warm_response"
          },
          {
            "label": "Maybe after the season / not right now",
            "to": "test_drive_pitch"
          },
          {
            "label": "Still not interested",
            "to": "end_graceful"
          }
        ]
      },
      "hate_cold_calls": {
        "label": "HATES COLD CALLS",
        "say": "Ha — honestly, fair enough. I'm not a huge fan of making them either. Would it be better if I just shot you a quick email with what we do? That way you can look at it on your own time, and if it's interesting great — if not, no hard feelings.",
        "note": "She doesn't hate you, she hates the format. Pivot to email. Get her address and send something personalized within the hour. Don't try to re-pitch on this call.",
        "branches": [
          {
            "label": "Sure, send me an email",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "end_graceful"
          }
        ]
      },
      "no_budget_objection": {
        "label": "NO BUDGET",
        "say": "Totally get it. Nowadays it's harder to keep a tool you already have, let alone bring in something new. Just so no one from my team bugs you again — is it that budget for this year is completely locked, or is it more that anything you try to bring in has to go through a whole approval process?",
        "note": "Agree hard. Then split. 'Locked budget' vs 'approval process' tells you if this is a timing issue or a structural issue. Both are workable.",
        "branches": [
          {
            "label": "Budget is locked / not my call",
            "to": "test_drive_pitch"
          },
          {
            "label": "Everything has to go through approval",
            "to": "referral_boss"
          },
          {
            "label": "Hard no",
            "to": "end_graceful"
          }
        ]
      },
      "have_process_objection": {
        "label": "ALREADY HAVE A PROCESS",
        "say": "That makes total sense — with 250-plus properties and 50 years doing this, you'd have to have something dialed in. Is it that you're fully covered and happy with how it's all working, or is it more that switching or adding anything right now would just be a headache?",
        "note": "Validate them. They're a legacy company with real operational maturity. The split separates 'we're happy' from 'we're stuck with what we have.' If they're stuck, you have an opening.",
        "branches": [
          {
            "label": "It's working fine / we're happy with it",
            "to": "reframe_volume"
          },
          {
            "label": "Switching or adding anything would be a headache",
            "to": "no_workflow_change"
          },
          {
            "label": "We use a specific tool (names it)",
            "to": "specific_tool_response"
          }
        ]
      },
      "no_workflow_change": {
        "label": "NO WORKFLOW CHANGE NEEDED",
        "say": "That's actually the whole point of what we built — it plugs into whatever your team's already doing. If your cleaners or inspectors are taking photos on their phones or through any software, we just analyze those same photos. Nothing changes for anyone's day-to-day. You just start getting reports that flag the stuff that would've been missed. Would you be open to seeing how that works?",
        "note": "This is RapidEye's biggest differentiator — zero workflow change. Hit it hard. If her concern was adding complexity or another tool to learn, this removes that objection entirely.",
        "branches": [
          {
            "label": "That's interesting / Sure",
            "to": "book_meeting"
          },
          {
            "label": "I'd need to run it by someone else",
            "to": "referral_boss"
          },
          {
            "label": "Still not sure / not right now",
            "to": "test_drive_pitch"
          }
        ]
      },
      "specific_tool_response": {
        "label": "THEY NAME A SPECIFIC TOOL",
        "say": "Oh nice — yeah we actually work alongside most of the major platforms. We're not replacing anything — we just sit on top and analyze the photos already flowing through. Think of it like a second set of eyes that never gets tired and never misses a Tuesday morning turnover. Would you be open to seeing how it layers on top of what you've already got?",
        "note": "If she names Breezeway, Track, or any PMS — great, we integrate. If she names something obscure, don't promise integration you can't deliver. Say 'we work with most platforms and can usually connect.' Don't lie.",
        "branches": [
          {
            "label": "Sure / That makes sense",
            "to": "book_meeting"
          },
          {
            "label": "I'd need to check with someone",
            "to": "referral_boss"
          },
          {
            "label": "Not right now",
            "to": "test_drive_pitch"
          }
        ]
      },
      "not_right_person": {
        "label": "NOT THE RIGHT PERSON",
        "say": "Totally get it — who on your team would be the right person to talk to about how turnover inspections get handled? Would that be Jordan or David?",
        "note": "Drop the names you already know from research. If she confirms one, ask for a warm handoff or direct number. If she gives a completely different name, that's gold — write it down immediately.",
        "branches": [
          {
            "label": "Jordan Bodenhamer",
            "to": "referral_jordan"
          },
          {
            "label": "David Bodenhamer",
            "to": "referral_david"
          },
          {
            "label": "Someone else / gives a different name",
            "to": "referral_other"
          },
          {
            "label": "I don't know / won't say",
            "to": "referral_push_gentle"
          }
        ]
      },
      "referral_boss": {
        "label": "NEEDS BOSS APPROVAL",
        "say": "Totally makes sense. Would that be Jordan Bodenhamer or David? I want to put something tailored together so when you bring it up it actually lands and doesn't create more work for you.",
        "note": "She's telling you she can't decide alone. That's fine — help her be the internal champion. Offer to make it easy for her to bring it up the chain. Frame it as saving HER effort.",
        "branches": [
          {
            "label": "Jordan",
            "to": "referral_jordan"
          },
          {
            "label": "David",
            "to": "referral_david"
          },
          {
            "label": "Someone else",
            "to": "referral_other"
          },
          {
            "label": "I'll bring it up myself / let me handle it",
            "to": "arm_the_champion"
          }
        ]
      },
      "referral_jordan": {
        "label": "REFERRED TO JORDAN",
        "say": "Perfect — Jordan's the one running business development over there, right? Would it be better if I reached out to her directly, or would you rather introduce us? Either way totally works for me.",
        "note": "Show you know who Jordan is without being creepy about it. If Linda offers to introduce you, that's a warm intro worth 10x a cold call. If she says reach out directly, ask for Jordan's best number or email.",
        "branches": [
          {
            "label": "Reach out to her directly / gives contact info",
            "to": "referral_confirmed"
          },
          {
            "label": "I'll introduce you / I'll mention it to her",
            "to": "arm_the_champion"
          },
          {
            "label": "Let me check with her first",
            "to": "lock_followup"
          }
        ]
      },
      "referral_david": {
        "label": "REFERRED TO DAVID",
        "say": "Got it — David would make sense, he's been running things there for a long time. Would you rather I reach out to him directly, or would it be easier if you gave him a heads up first?",
        "note": "David is the partner and owner. If she's sending you to David, this becomes a senior-level conversation. Ask if she wants to give him context first — that positions her as the champion.",
        "branches": [
          {
            "label": "Reach out directly / gives contact info",
            "to": "referral_confirmed"
          },
          {
            "label": "I'll give him a heads up",
            "to": "arm_the_champion"
          },
          {
            "label": "Let me check first",
            "to": "lock_followup"
          }
        ]
      },
      "referral_other": {
        "label": "REFERRED TO SOMEONE ELSE",
        "say": "Oh great — what's their name and role? I'll put something specific together for them so it's not just a generic cold pitch.",
        "note": "Write down the name, title, and any contact info she gives. Ask for email or direct number. This is a brand new lead — add them to your call list immediately.",
        "branches": [
          {
            "label": "Gives name and contact details",
            "to": "referral_confirmed"
          },
          {
            "label": "Vague / won't share specifics",
            "to": "referral_push_gentle"
          }
        ]
      },
      "referral_push_gentle": {
        "label": "GENTLE PUSH FOR REFERRAL",
        "say": "No worries at all. If I could just get a name, I'll do my homework on my end and put something together that's actually relevant to them — that way nobody's time gets wasted. Who would that be?",
        "note": "One more gentle push. If she still won't give a name, don't press further. Thank her and move on gracefully. You can try to find the person through other channels.",
        "branches": [
          {
            "label": "Gives a name",
            "to": "referral_confirmed"
          },
          {
            "label": "Won't share / still guarded",
            "to": "end_graceful"
          }
        ]
      },
      "referral_confirmed": {
        "label": "REFERRAL CONFIRMED",
        "say": "Really appreciate that, Linda. I'll reach out to them and mention you pointed me their way — hopefully that saves everyone some time. Thanks for taking my call, hope the rest of your day goes smooth.",
        "note": "When you contact the referral, open with: 'Linda Tresler pointed me your way.' Send Linda a quick thank-you text or email too — she did you a favor and may be an ally later.",
        "branches": []
      },
      "arm_the_champion": {
        "label": "ARM THE INTERNAL CHAMPION",
        "say": "That'd be awesome. Let me make it easy for you — I'll shoot you a quick one-pager you can forward along. It'll have the basics plus what we've done for a couple other PM companies with a similar setup. That way you're not trying to explain what we do from scratch. What's your best email?",
        "note": "She's willing to champion internally. Make it frictionless. The one-pager should be forwardable — not a sales deck. Include: what RapidEye does in one paragraph, one proof point from a similar company, and a CTA for a 15-minute call with the decision maker.",
        "branches": [
          {
            "label": "Gives email",
            "to": "champion_confirmed"
          },
          {
            "label": "Just send it to the office / I'll find it",
            "to": "champion_confirmed"
          }
        ]
      },
      "champion_confirmed": {
        "label": "CHAMPION CONFIRMED",
        "say": "Perfect. I'll get that over to you today. And if it's cool, I'll follow up in a couple days just to see if it landed. Really appreciate it, Linda.",
        "note": "Follow up in exactly 2-3 business days. When you do, reference this call: 'Hey Linda, it's Sam — we talked the other day about RapidEye. Did you get a chance to pass that along?' Set a calendar reminder RIGHT NOW.",
        "branches": []
      },
      "test_drive_pitch": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally respect that. You're probably not buying anything right now, and that's fine. But here's what I've seen — when budget does open up or when something changes, the people who move fastest are the ones who already know what's on their shortlist. Would you be open to just taking a look? Not a commitment, not an hour-long demo — just 15 minutes so you know what's out there. Worst case, you steal some ideas about what other Gulf Coast PMs are doing with their turnover photos and we part as friends.",
        "note": "This is the 'future budget' play. You're not asking her to buy — you're asking her to be informed. 'Steal some ideas' is a value offer that has nothing to do with purchasing RapidEye.",
        "branches": [
          {
            "label": "Sure / I can do 15 minutes",
            "to": "book_meeting"
          },
          {
            "label": "Maybe after the season / circle back later",
            "to": "lock_followup"
          },
          {
            "label": "No thanks",
            "to": "end_graceful"
          }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most useful to include so it's not just another generic pitch sitting in your inbox?",
        "note": "Accept the email request. The question makes the email actually worth sending — you'll know what to focus on. Whatever she says, tailor the email to exactly that. Include a specific meeting time suggestion in the email.",
        "branches": [
          {
            "label": "Tells you what to include / shares a pain point",
            "to": "send_email_confirmed"
          },
          {
            "label": "Just send whatever / general info is fine",
            "to": "send_email_confirmed"
          }
        ]
      },
      "send_email_confirmed": {
        "label": "EMAIL — GET THE ADDRESS",
        "say": "Got it — I'll keep it short and relevant. What's the best email for you? And I'll suggest a couple times to chat in case anything jumps out.",
        "note": "Get her email. It likely follows the pattern ltresler@youngssuncoast.com based on other confirmed emails at the company. Send within 30 minutes. Follow up by phone in 2-3 days if no reply.",
        "branches": [
          {
            "label": "Gives email address",
            "to": "email_sent_end"
          },
          {
            "label": "It's on the website / use the office one",
            "to": "email_sent_end"
          }
        ]
      },
      "email_sent_end": {
        "label": "EMAIL WRAP-UP",
        "say": "Perfect. I'll get that over to you today. Appreciate your time, Linda — talk soon.",
        "note": "Send the email within 30 minutes. Subject line should reference Boardwalk or this conversation specifically. Follow up by phone in 2-3 days. Open the follow-up with: 'Hey Linda, it's Sam Parks — I sent you that email about RapidEye earlier this week. Did anything in there jump out?'",
        "branches": []
      },
      "end_graceful": {
        "label": "END GRACEFULLY",
        "say": "Totally understand. If anything ever changes, I'm easy to find — Sam Parks, RapidEye. Appreciate your time, Linda.",
        "note": "Don't burn the bridge. She may Google you after this call. Make sure your LinkedIn and RapidEye site look sharp. Log this call with detailed notes and set a reminder to try again in 60-90 days with fresh context or a new angle.",
        "branches": []
      }
    }
  }
}