{
  "name": "Lisa Riding",
  "title": "Director of Portfolio Development",
  "company": "ACME House Company",
  "location": "Palm Springs, CA",
  "phone": "",
  "company_phone": "+1-866-840-9552",
  "alt_phones": [],
  "flow": {
    "context": "Lisa Riding is Director of Portfolio Development at ACME House Company — she owns new-owner acquisition and onboarding for their 150+ luxury vacation rental portfolio in Greater Palm Springs. Deep industry veteran: GM at ACME from 2010–2014, then 8+ years at TurnKey Vacation Rentals, Director of Biz Dev at Grand Welcome, and now back at ACME as of Feb 2024. All prospective-owner calls route directly to her. ACME is extremely process-heavy — self-described Breezeway 'enthusiasts,' plus Track PMS, Matterport, HubSpot, PointCentral smart locks/HVAC across 150+ luxury homes. Strongest connection to Sam: both SoCal natives (Sam grew up in LA, Lisa works Palm Springs two hours east), and Lisa attended College of Marin in the Bay Area where Sam spent time working at two YC startups.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Lisa — I've been chatting with a few vacation rental managers out in Palm Springs, and your name came up since you've been in the space forever. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Feet-up energy. Don't rush. She's been in vacation rentals 14+ years — acknowledging that immediately separates you from a generic cold caller. Smile while you say it.",
        "branches": [
          {
            "label": "No, I haven't heard of you",
            "to": "heard_no"
          },
          {
            "label": "Yes / Maybe / Sounds familiar",
            "to": "heard_yes"
          },
          {
            "label": "Who is this? / What's this about?",
            "to": "who_is_this"
          },
          {
            "label": "I'm busy / bad timing",
            "to": "bad_timing"
          }
        ]
      },
      "heard_no": {
        "label": "HAVEN'T HEARD — TRANSITION TO PAIN",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call — I was talking to another portfolio development director at a company pretty similar to yours, about 150 luxury homes. She told me the hardest part isn't getting owners to sign on — it's keeping them past that first year. And the number one thing that erodes trust is damage slipping through between turnovers. A guest breaks something, your cleaning team's moving fast, nobody catches it, and the owner finds out three months later when they visit the property themselves. Now you've got a trust problem that no amount of revenue reporting fixes.",
        "note": "PAUSE here. Let her react. The pain is owner trust erosion — that's her world. She lives and dies by owner retention and acquisition. Do NOT jump to the solution.",
        "branches": [
          {
            "label": "Yeah, that's real / we deal with that",
            "to": "warm_response"
          },
          {
            "label": "So what do you do about it?",
            "to": "one_sentence_solution"
          },
          {
            "label": "We already have a process for that",
            "to": "objection_have_process"
          },
          {
            "label": "I'm not really the right person for this",
            "to": "referral_redirect"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "heard_yes": {
        "label": "HEARD THE NAME — EXPLORE",
        "say": "Oh nice — well normally we'd be working with someone like you on the portfolio side. What did you hear?",
        "note": "Let her talk. Whatever she says, bridge to the pain trigger or discovery. Don't correct her if she's off — just steer toward the conversation.",
        "branches": [
          {
            "label": "Mentions AI / inspections / photos",
            "to": "warm_response"
          },
          {
            "label": "Vague / doesn't remember details",
            "to": "pain_trigger_bridge"
          },
          {
            "label": "Confusing you with someone else",
            "to": "pain_trigger_bridge"
          }
        ]
      },
      "who_is_this": {
        "label": "CLARIFY — STAY CASUAL",
        "say": "Yeah totally fair — it's Sam Parks, I'm with a company called RapidEye. We work with a few vacation rental companies in the Palm Springs market on their inspection and turnover workflows. Reason I'm calling you specifically is I know you're leading portfolio development over at ACME, and I think there's something really relevant to how you're pitching owners.",
        "note": "She's screening. Stay calm. Don't pitch — just give enough context to earn 30 more seconds. Mentioning her role shows you're not dialing from a list.",
        "branches": [
          {
            "label": "Okay, go on",
            "to": "pain_trigger_bridge"
          },
          {
            "label": "Not interested / I'm busy",
            "to": "permission_fallback"
          },
          {
            "label": "You need to talk to someone else",
            "to": "referral_redirect"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING — RESCHEDULE",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow or later this week? When's less hectic?",
        "note": "Don't push. Get a specific day and time. If she says something vague like 'call me next week,' pin it down: 'Morning or afternoon work better?'",
        "branches": [
          {
            "label": "Gives a specific time",
            "to": "lock_callback"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          },
          {
            "label": "Don't call back",
            "to": "end_graceful"
          }
        ]
      },
      "pain_trigger_bridge": {
        "label": "BRIDGE TO PAIN",
        "say": "So real quick — I was talking to another portfolio growth leader at a company running about 150 luxury homes, pretty similar setup to you guys. She told me owner trust is everything — and the fastest way to lose it is when damage slips through between turnovers and the owner finds out before you do. A guest chips a countertop, your cleaning crew's turning the place in two hours, nobody flags it, and then the owner walks in a month later and wonders what they're paying you for. Does that ring true at all with 150-plus homes?",
        "note": "PAUSE after 'ring true at all.' Let her respond. She's now mentally scrolling through every owner conversation where trust came up. Silence is your friend here.",
        "branches": [
          {
            "label": "Yeah, that happens / that's a real problem",
            "to": "warm_response"
          },
          {
            "label": "So what's the solution?",
            "to": "one_sentence_solution"
          },
          {
            "label": "We handle that through Breezeway",
            "to": "breezeway_branch"
          },
          {
            "label": "Not really our biggest issue",
            "to": "pivot_differentiation"
          },
          {
            "label": "I'm not the right person for this",
            "to": "referral_redirect"
          }
        ]
      },
      "warm_response": {
        "label": "THEY'RE WARM — STOP PITCHING, ASK QUESTIONS",
        "say": "Yeah — I figured with 150-plus luxury homes that'd hit close. Can I ask — when you're onboarding a new owner, what's your pitch around how ACME protects their property between guests? Like what do you point to specifically?",
        "note": "She's engaged. DO NOT pitch more. Ask discovery questions tailored to her portfolio development role. You want to understand how she sells ACME to owners and where the gap is in that pitch.",
        "branches": [
          {
            "label": "Describes their process / Breezeway / inspections",
            "to": "discovery_dig_deeper"
          },
          {
            "label": "Asks what RapidEye does first",
            "to": "one_sentence_solution"
          },
          {
            "label": "Admits it's a weak spot in the pitch",
            "to": "discovery_weak_spot"
          }
        ]
      },
      "one_sentence_solution": {
        "label": "ONE-SENTENCE SOLUTION",
        "say": "So we built an AI layer that plugs right into Breezeway — since I know you guys are big Breezeway users — and it automatically analyzes the turnover photos your team's already taking. Flags damage, missing items, staging issues. No extra work for your ops team, but now you've got documentation you can actually show owners. Would you be open to seeing what that looks like when I'm not cold calling you out of the blue?",
        "note": "Mentioning Breezeway by name shows you did your homework and this isn't a spray-and-pray call. Keep it to one sentence on the product, then CTA. Don't oversell.",
        "branches": [
          {
            "label": "Yeah, I'd be open to that",
            "to": "book_meeting"
          },
          {
            "label": "How does it work with Breezeway exactly?",
            "to": "breezeway_detail"
          },
          {
            "label": "I'd need to loop in our ops team / IT",
            "to": "referral_ops"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          },
          {
            "label": "We're not looking for new tools right now",
            "to": "objection_no_budget"
          }
        ]
      },
      "breezeway_branch": {
        "label": "THEY MENTION BREEZEWAY",
        "say": "Yeah — I actually know you guys are big Breezeway users, which is exactly why I called. Breezeway's great for task management and workflows, but one thing I keep hearing from other managers using it is — the photos go in, but nobody's actually reviewing every single one across 150 homes. It's just too much volume. That's literally what we built for. We sit on top of Breezeway and automatically analyze those photos so nothing slips through. Would you be open to a quick look?",
        "note": "Do NOT trash Breezeway — they self-describe as 'Breezeway Enthusiasts.' Position RapidEye as the missing layer on top of a tool they already love and trust.",
        "branches": [
          {
            "label": "That's interesting — tell me more",
            "to": "discovery_dig_deeper"
          },
          {
            "label": "I'd be open to seeing it",
            "to": "book_meeting"
          },
          {
            "label": "I'd need to loop in Jay / IT",
            "to": "referral_it"
          },
          {
            "label": "We're happy with our current setup",
            "to": "objection_have_process"
          }
        ]
      },
      "breezeway_detail": {
        "label": "BREEZEWAY INTEGRATION DETAIL",
        "say": "So your cleaners are already uploading photos into Breezeway after every turn, right? We connect directly to that — no extra app, no workflow change. Our AI reviews every photo and flags anything that looks off. Chipped tile, stained couch, missing throw pillows, broken pool furniture — stuff a human would catch if they had time to look at every photo from every turn, which at 150 homes nobody does. Then it generates a report you could share with owners or use internally for maintenance tickets in HubSpot.",
        "note": "Keep it practical. She cares about owner-facing value and zero operational burden. Mentioning HubSpot subtly (they use it for ticketing) shows depth. Don't go too technical — save that for Jay in IT.",
        "branches": [
          {
            "label": "That's really interesting",
            "to": "book_meeting"
          },
          {
            "label": "Who else is using this?",
            "to": "social_proof"
          },
          {
            "label": "I'd need to bring in ops / IT",
            "to": "referral_ops"
          }
        ]
      },
      "discovery_dig_deeper": {
        "label": "DISCOVERY — DIG INTO PROCESS",
        "say": "That makes sense. So when a turn is done and the photos are in Breezeway — who's actually reviewing those? Like is someone on the ops team going through every set, or is it more of a spot-check situation?",
        "note": "You already know ACME is process-heavy with documented SOPs. The goal is to get her to articulate the gap herself: nobody reviews every photo at scale. That's your opening.",
        "branches": [
          {
            "label": "Admits it's spot-check / not every photo",
            "to": "discovery_gap_found"
          },
          {
            "label": "Says ops team reviews them all",
            "to": "discovery_volume_challenge"
          },
          {
            "label": "Doesn't know the details",
            "to": "referral_ops"
          }
        ]
      },
      "discovery_weak_spot": {
        "label": "DISCOVERY — WEAK SPOT ACKNOWLEDGED",
        "say": "That's really honest — and you're not alone. Most managers I talk to say the same thing. The tech stack is solid, the process is there, but when it comes to showing an owner 'here's exactly how we caught this before it became your problem' — there's a gap. What if you could hand a prospective owner a report that says 'after every single turnover, AI reviewed your home and here's what it found'? How would that change the conversation?",
        "note": "Paint the vision for her. She's a portfolio growth person — that's a sales role. Show her the pitch tool she doesn't have yet. Let her imagine using it.",
        "branches": [
          {
            "label": "That would be huge / I'd love that",
            "to": "book_meeting"
          },
          {
            "label": "How does it actually work?",
            "to": "one_sentence_solution"
          },
          {
            "label": "Interesting but I'd need buy-in from others",
            "to": "referral_ops"
          }
        ]
      },
      "discovery_gap_found": {
        "label": "GAP CONFIRMED — BRIDGE TO CTA",
        "say": "Right — and that's exactly the gap. The photos exist, Breezeway's capturing them, but with 150-plus homes turning over constantly there's just no way a human catches everything. That's what we automate. Other managers using this are catching stuff in the first week they never would've found — and the owner-facing piece is huge. Imagine telling a prospective owner: 'After every turnover, AI reviews your home and generates a condition report.' That's a differentiator none of your competitors in Palm Springs can match right now.",
        "note": "Hit the competitive angle hard. She knows the Palm Springs market inside out — she was at Grand Welcome, TurnKey. She knows Oranj Palm, Poppy, all of them. Differentiation is her language.",
        "branches": [
          {
            "label": "That's compelling — let's talk more",
            "to": "book_meeting"
          },
          {
            "label": "Who else in Palm Springs is doing this?",
            "to": "social_proof"
          },
          {
            "label": "I'd need to involve Michael / leadership",
            "to": "referral_ceo"
          },
          {
            "label": "Send me something I can share internally",
            "to": "send_email"
          }
        ]
      },
      "discovery_volume_challenge": {
        "label": "DISCOVERY — CHALLENGE THE VOLUME",
        "say": "Got it — so someone's looking at them. Out of curiosity, with 150-plus homes, how many turnover photo sets is that a week? Especially heading into spring season — that's gotta be hundreds of photo sets?",
        "note": "The math is on your side. Even if they review photos, nobody reviews ALL of them at scale. Let her do the mental math herself. Palm Springs peak is roughly October through May.",
        "branches": [
          {
            "label": "Admits it's a lot / impossible to review everything",
            "to": "discovery_gap_found"
          },
          {
            "label": "Says they manage it fine",
            "to": "pivot_differentiation"
          }
        ]
      },
      "pivot_differentiation": {
        "label": "PIVOT TO COMPETITIVE DIFFERENTIATION",
        "say": "Totally fair. Here's the other angle I keep hearing from portfolio growth folks — it's less about catching more stuff internally and more about what you can tell a prospective owner that nobody else in Palm Springs can say. Right now every PM company says 'we inspect, we care, we're hands-on.' But if you could show a prospective owner an AI-generated condition report after every single turnover — that's proof, not a promise. With your experience at TurnKey and Grand Welcome, you know how hard it is to differentiate in this market.",
        "note": "She's not feeling the ops pain? Pivot to her world: competitive differentiation and owner acquisition. Dropping TurnKey and Grand Welcome shows you know her career and you're talking peer-to-peer about the industry.",
        "branches": [
          {
            "label": "That's an interesting angle",
            "to": "book_meeting"
          },
          {
            "label": "We differentiate in other ways",
            "to": "objection_not_interested"
          },
          {
            "label": "Tell me more about the owner-facing piece",
            "to": "discovery_weak_spot"
          }
        ]
      },
      "social_proof": {
        "label": "SOCIAL PROOF",
        "say": "So right now we're working with a luxury PM company in New York doing about 200 homes — similar profile to you guys, high-end owners who are really particular about their properties. We've also got a company on the East Coast with about 600 units and one out in Dubai with around 100. The common thread is they all use turnover photos already and just needed something to actually make sense of them at scale.",
        "note": "Don't name-drop specific company names unless asked. The NYC luxury comparison is the strongest match for ACME's luxury positioning. If she asks 'are any of those on Breezeway?' — that's buying intent.",
        "branches": [
          {
            "label": "Interesting — I'd like to see it",
            "to": "book_meeting"
          },
          {
            "label": "Are any of those on Breezeway?",
            "to": "breezeway_detail"
          },
          {
            "label": "Still need to think about it",
            "to": "send_email"
          }
        ]
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call. Can I get 30 seconds to tell you why I reached out, and if it's not relevant you can totally hang up on me?",
        "note": "Say this with a smile. You're acknowledging the interruption honestly. Most people will give you 30 seconds when you ask this directly and give them explicit permission to bail.",
        "branches": [
          {
            "label": "Fine, go ahead",
            "to": "pain_trigger_bridge"
          },
          {
            "label": "No, I'm really not interested",
            "to": "permission_rejected"
          },
          {
            "label": "Send me an email instead",
            "to": "send_email"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED — SPLIT",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I just caught you at a horrible time, or is it that you already know what we do and it's just not relevant?",
        "note": "The split forces a real answer. If it's timing, you get a callback. If it's relevance, you learn something and can try the test-drive close. Either way you're being respectful of her time.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not relevant / not interested",
            "to": "sell_test_drive"
          },
          {
            "label": "Just don't call again",
            "to": "end_graceful"
          }
        ]
      },
      "objection_not_interested": {
        "label": "NOT INTERESTED — AGREE + SPLIT",
        "say": "I totally get it. I should've assumed you'd be all set — otherwise you probably would've reached out to us. Just so no one from my team cold calls you again — is it that this isn't a problem you're focused on right now, or is it more that you just hate cold calls? Because honestly I get it either way.",
        "note": "Agree first — it disarms. Then split. The 'hate cold calls' option is disarming because it gives her an out that's about the format, not the product. Either answer gives you a path forward.",
        "branches": [
          {
            "label": "Not a priority right now",
            "to": "sell_test_drive"
          },
          {
            "label": "I just hate cold calls",
            "to": "sell_test_drive_light"
          },
          {
            "label": "We're genuinely not interested",
            "to": "end_graceful"
          }
        ]
      },
      "objection_have_process": {
        "label": "HAVE A PROCESS — AGREE + SPLIT",
        "say": "That makes total sense — with 150-plus homes and the stack you guys already run, you'd have to have something solid in place. Just curious — is it that you're fully covered and nothing's slipping through, or is it more that adding anything new right now would just be a headache to get through the team?",
        "note": "Validate first. Referencing the stack size subtly shows you know they run a lot of tools already. The split separates 'we're perfect' (rare and challengeable) from 'change is hard' (common and workable).",
        "branches": [
          {
            "label": "It's more the change / adding something new is hard",
            "to": "sell_test_drive"
          },
          {
            "label": "We're fully covered",
            "to": "pivot_differentiation"
          },
          {
            "label": "It'd have to go through IT / leadership",
            "to": "referral_ops"
          }
        ]
      },
      "objection_no_budget": {
        "label": "NO BUDGET — AGREE + SPLIT",
        "say": "Totally get it. Nowadays it's harder to keep a tool, let alone buy something new — especially with the stack you guys already run between Breezeway, Track, PointCentral and everything else. Just so I know — is it that budget for this cycle is completely locked, or is it more that anything new has to go through a pretty long approval chain?",
        "note": "Name their actual tools to show this isn't generic. The split separates 'no money' from 'long process' — two totally different situations that need different responses.",
        "branches": [
          {
            "label": "Budget is locked for now",
            "to": "sell_test_drive"
          },
          {
            "label": "Long approval process / goes through leadership",
            "to": "sell_test_drive_with_champion"
          },
          {
            "label": "Both",
            "to": "sell_test_drive"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Look, you're probably not buying anything right now, and I totally respect that. But when budget does free up or priorities shift — and heading into your busy season they usually do — the people who move fastest are the ones who already know what's on their list. Would you be open to a 15-minute look? Worst case, I walk you through what other PM companies are doing with their turnover photos and you steal some ideas. We part as friends either way.",
        "note": "Low pressure. The 'steal some ideas' reframe makes the meeting valuable even if they never buy. Palm Springs peak season is roughly Oct–May, so if calling in Feb she's mid-season. Use whatever timing pressure is natural.",
        "branches": [
          {
            "label": "Okay, I can do a quick look",
            "to": "book_meeting"
          },
          {
            "label": "Send me an email first",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "end_graceful"
          }
        ]
      },
      "sell_test_drive_with_champion": {
        "label": "SELL THE TEST DRIVE — CHAMPION ANGLE",
        "say": "Totally makes sense. What I've found works best in that situation — the people who get buy-in fastest are the ones who can walk in and say 'I already looked at this, here's exactly what it does, here's why it matters.' Would you be open to a quick 15-minute look, just so you've got the full picture if and when it comes up? No commitment, just intel.",
        "note": "Reframe the meeting as giving HER internal leverage. She's a director-level hire — she's used to navigating internal approvals. Position the demo as her tool for building the business case.",
        "branches": [
          {
            "label": "That makes sense, let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "I'll think about it",
            "to": "send_email"
          }
        ]
      },
      "sell_test_drive_light": {
        "label": "SELL THE TEST DRIVE — LIGHT TOUCH",
        "say": "Ha — fair enough, I hate getting them too. Tell you what — I'll shoot you a two-line email with exactly what we do and a link. If it looks interesting, you can grab time on my calendar whenever. If not, you never hear from me again. Fair?",
        "note": "She hates cold calls — don't push for a meeting on this call. Give her control. The email follow-up is your second chance. Make it count.",
        "branches": [
          {
            "label": "Sure, send it over",
            "to": "send_email"
          },
          {
            "label": "Fine",
            "to": "send_email"
          },
          {
            "label": "Don't bother",
            "to": "end_graceful"
          }
        ]
      },
      "referral_redirect": {
        "label": "NOT THE RIGHT PERSON — REFERRAL",
        "say": "Totally hear you — who on your team typically owns the inspection and turnover quality piece? I know you've got a solid ops team over there. Would that be more Jocelyn's world, or someone else?",
        "note": "Drop Jocelyn Gutierrez's name casually (Director of Operations). If Lisa confirms, you've got a warm lead. If she corrects you with a different name — even better, you get the real owner. Don't force it if she's uncomfortable.",
        "branches": [
          {
            "label": "Yes, talk to Jocelyn",
            "to": "referral_get_name_jocelyn"
          },
          {
            "label": "Gives a different name",
            "to": "referral_get_name_other"
          },
          {
            "label": "Talk to Mark in property care",
            "to": "referral_get_name_mark"
          },
          {
            "label": "You'd need to talk to Michael / the CEO",
            "to": "referral_ceo"
          }
        ]
      },
      "referral_ops": {
        "label": "NEEDS OPS / TEAM BUY-IN — GET THE INTRO",
        "say": "That makes total sense — something like this would definitely touch the ops side. Would it make sense to loop in whoever runs that? I think Jocelyn's on the ops side — would a quick three-way call or a meeting with both of you make this easier? That way you've got the owner-value angle and she's got the operational picture.",
        "note": "Try to keep Lisa involved. She's the portfolio/owner-value angle, ops is the implementation angle. A joint meeting is the ideal outcome. If she wants to vet it first, let her.",
        "branches": [
          {
            "label": "Yeah, let me connect you with Jocelyn",
            "to": "referral_get_name_jocelyn"
          },
          {
            "label": "I'll check internally and get back to you",
            "to": "send_email"
          },
          {
            "label": "You should talk to Jay in IT",
            "to": "referral_it"
          }
        ]
      },
      "referral_it": {
        "label": "REFERRED TO IT — JAY BORROMEI",
        "say": "Oh perfect — Jay Borromei, right? I know he'd be the one to talk to on the integration side since you guys are running Breezeway and Track. Would you mind giving him a heads up that I'll reach out? That way it's not totally cold when I call.",
        "note": "Use Jay's full name naturally. You have his direct email (jay@acmehouseco.com) and multiple phone numbers from research. Getting Lisa to warm the intro is ideal — even a 'sure, mention my name' helps.",
        "branches": [
          {
            "label": "Sure, I'll let him know",
            "to": "lock_referral_jay"
          },
          {
            "label": "Just reach out to him directly",
            "to": "lock_referral_jay"
          },
          {
            "label": "Not sure he's the right person either",
            "to": "referral_redirect"
          }
        ]
      },
      "referral_ceo": {
        "label": "REFERRED TO CEO — MICHAEL FLANNERY",
        "say": "Got it — makes sense that Michael would need to be in the loop on something like this. Would it be better if I reached out to him directly, or would you want to float it internally first and I follow up with you in a couple days?",
        "note": "You have Michael's direct email (michael@acmehouseco.com) and direct dial (760-861-3771). But a warm intro from Lisa is worth 10x a cold outreach to the CEO. Try to get her to bridge it.",
        "branches": [
          {
            "label": "I'll mention it to him — follow up with me",
            "to": "send_email"
          },
          {
            "label": "Just reach out to him directly",
            "to": "lock_referral_michael"
          },
          {
            "label": "Let me think about it first",
            "to": "send_email"
          }
        ]
      },
      "referral_get_name_jocelyn": {
        "label": "LOCK REFERRAL — JOCELYN",
        "say": "Perfect — Jocelyn Gutierrez, Director of Operations, right? Would you mind shooting her a quick note or just giving her a heads up I'll call? That way when I reach out it's not totally out of the blue. And I'll put something tailored together so it's relevant to her world, not just a generic pitch.",
        "note": "Confirm the full name and title. Get her to agree to a warm intro. If she gives you Jocelyn's direct contact, even better. You don't have a confirmed direct email for Jocelyn — this is your chance to get it.",
        "branches": [
          {
            "label": "Agrees to intro / gives contact info",
            "to": "end_referral_booked"
          },
          {
            "label": "Just email her",
            "to": "ask_jocelyn_email"
          },
          {
            "label": "I'll have her reach out to you",
            "to": "end_referral_pending"
          }
        ]
      },
      "referral_get_name_mark": {
        "label": "REFERRED TO MARK DUDGEON",
        "say": "Mark Dudgeon, right — the guest experience and property care side? That makes sense, he'd be closest to the day-to-day turnover piece. Would you mind letting him know I'll reach out? I'll keep it quick — promise I won't give him the full cold call treatment.",
        "note": "Mark is Guest Experience Manager (Property Care). You don't have his direct contact info, so getting Lisa to intro or even confirm the name and best way to reach him is valuable.",
        "branches": [
          {
            "label": "Sure, I'll let him know",
            "to": "end_referral_pending"
          },
          {
            "label": "Gives his contact info",
            "to": "end_referral_booked"
          },
          {
            "label": "He's not the right person either",
            "to": "referral_redirect"
          }
        ]
      },
      "referral_get_name_other": {
        "label": "LOCK REFERRAL — NEW NAME",
        "say": "Oh great — what's their name and title? I want to make sure I put something relevant together so it actually lands. And would you mind giving them a quick heads up? It goes a long way when it's not a totally cold call.",
        "note": "Write down everything: name, title, email, phone if offered. Ask how they prefer to be reached. This is a new contact not in your research — log it carefully.",
        "branches": [
          {
            "label": "Gives name and agrees to intro",
            "to": "end_referral_booked"
          },
          {
            "label": "Gives name but won't intro",
            "to": "end_referral_pending"
          },
          {
            "label": "Vague / won't give a name",
            "to": "send_email"
          }
        ]
      },
      "ask_jocelyn_email": {
        "label": "GET JOCELYN'S EMAIL",
        "say": "Totally — what's the best email for her? I want to make sure it lands in the right inbox.",
        "note": "You suspect Jocelyn's email might be jocelyn@acmehouseco.com or g-something based on SignalHire. If Lisa gives it to you, confirm it. This is high-value info you don't have.",
        "branches": [
          {
            "label": "Gives the email",
            "to": "end_referral_booked"
          },
          {
            "label": "Try the general info email",
            "to": "end_referral_pending"
          }
        ]
      },
      "lock_referral_jay": {
        "label": "LOCK JAY REFERRAL — CLOSE",
        "say": "Appreciate that, Lisa. I'll reach out to Jay this week and mention you pointed me his way. And honestly — if the owner-facing piece ever becomes relevant for how you're pitching new owners, I'd love to circle back with you too. That angle's been huge for other portfolio growth folks. Really appreciate your time.",
        "note": "Leave the door open with Lisa. She may not own the ops decision but she could be a powerful internal champion for the owner-value angle. Send her a brief thank-you email today referencing the conversation.",
        "branches": []
      },
      "lock_referral_michael": {
        "label": "LOCK MICHAEL REFERRAL — CLOSE",
        "say": "Perfect — I'll reach out to Michael directly and mention we chatted. Really appreciate you pointing me in the right direction, Lisa. If the portfolio development angle ever comes up — like using AI inspection reports as a differentiator when you're pitching new owners — I'd love to reconnect with you on that piece too.",
        "note": "You have Michael's email (michael@acmehouseco.com) and direct dial (760-861-3771). Call within 24 hours while Lisa's mention is fresh. Open with: 'Lisa Riding mentioned I should reach out to you directly.'",
        "branches": []
      },
      "end_referral_booked": {
        "label": "REFERRAL LOCKED — CLOSE WARM",
        "say": "This is super helpful, Lisa. I'll reach out to them in the next day or two and keep it tailored. And if you ever want to see the owner-facing side of what we do — how other portfolio growth folks are using AI reports in their pitch — just let me know. Really appreciate your time today.",
        "note": "Send Lisa a brief thank-you email within an hour. Reach out to the referral within 24-48 hours and open with Lisa's name. Keep Lisa in the loop as you progress — she could become an internal champion.",
        "branches": []
      },
      "end_referral_pending": {
        "label": "REFERRAL PENDING — CLOSE",
        "say": "Really appreciate that, Lisa. I'll give them a couple days and then reach out. And if the owner-facing piece ever becomes interesting for your portfolio growth — like using AI inspection reports as a selling point — I'm always around. Thanks for your time.",
        "note": "Log the referral name and any details. Wait 2-3 days, then call the referral and mention Lisa pointed you their way. Send Lisa a quick email today so she has your info and can forward it if she wants to.",
        "branches": []
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome — I've got next week pulled up. How does Tuesday or Wednesday look? I only need about 20 minutes, and I'll show you exactly what the reports look like and how it connects to Breezeway.",
        "note": "Pick TWO specific days. Don't say 'when works for you' — too open-ended. Lock the day and time NOW. Send the calendar invite while still on the phone if possible.",
        "branches": [
          {
            "label": "Gives a day / time",
            "to": "confirm_meeting"
          },
          {
            "label": "Let me check my calendar and get back to you",
            "to": "pin_down_meeting"
          },
          {
            "label": "Can you include our ops team / Jocelyn?",
            "to": "confirm_meeting_with_ops"
          }
        ]
      },
      "pin_down_meeting": {
        "label": "PIN DOWN THE MEETING",
        "say": "Totally — I'll shoot you an invite for Wednesday at 11. If that doesn't work, just move it around. That way it's on the calendar and we're not playing email tag.",
        "note": "Don't let it float. Send an invite for a specific time and let her adjust. 'Playing email tag' reframes the invite as doing her a favor. Send it to Lisa@acmehouseco.com immediately.",
        "branches": [
          {
            "label": "Okay, sounds good",
            "to": "confirm_meeting"
          },
          {
            "label": "I'd rather do email first",
            "to": "send_email"
          }
        ]
      },
      "confirm_meeting_with_ops": {
        "label": "CONFIRM — MULTI-STAKEHOLDER MEETING",
        "say": "Love that idea. I'll send over an invite and you can add whoever makes sense from the ops or IT side — Jocelyn, Jay, whoever you think should see it. I'll tailor the demo so there's something for both the owner-facing angle and the operational piece. What day works best next week?",
        "note": "Multi-stakeholder meeting is the best outcome. More people in the room = higher close rate. Let her add people rather than you requesting specific names — she'll pull in who matters.",
        "branches": [
          {
            "label": "Gives a day / time",
            "to": "confirm_meeting"
          },
          {
            "label": "Let me coordinate internally first",
            "to": "send_email"
          }
        ]
      },
      "confirm_meeting": {
        "label": "CONFIRM + CLOSE",
        "say": "Perfect — I'll send over a calendar invite right now so it's locked in. I'll include a quick one-pager so you know what to expect. Really appreciate you taking my call, Lisa — looking forward to it.",
        "note": "Send the invite IMMEDIATELY after hanging up. Include a short agenda and one-pager. Stop selling — you won. Don't add anything that could create doubt.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL — ACCEPT + ASK",
        "say": "Totally fair — I'll shoot something over today. Quick question so it's not just another generic pitch in your inbox — would the owner-facing angle be most relevant for you? Like how this becomes a differentiator when you're pitching prospective owners? Or would you want more on the ops and inspection side so you can share it with the team?",
        "note": "Her email is Lisa@acmehouseco.com. The question ensures the email gets read because it's tailored. Include a specific meeting time suggestion in the email. Follow up in 3 business days if no response.",
        "branches": [
          {
            "label": "Owner-facing / portfolio growth angle",
            "to": "end_email_owner"
          },
          {
            "label": "Ops / inspection / Breezeway side",
            "to": "end_email_ops"
          },
          {
            "label": "Just send whatever / doesn't specify",
            "to": "end_email_general"
          }
        ]
      },
      "end_email_owner": {
        "label": "EMAIL FOLLOW-UP — OWNER ANGLE",
        "say": "Got it — I'll focus on the owner piece. How it works as a retention tool and a differentiator in your pitch to new owners. I'll drop a time in there for next week in case you want to dig in. Thanks Lisa — talk soon.",
        "note": "Send within 1 hour. Subject: something like 'Owner retention + AI inspection reports — for ACME portfolio growth.' Keep body under 100 words. Include one specific day/time to meet. Follow up Day 3 if no reply.",
        "branches": []
      },
      "end_email_ops": {
        "label": "EMAIL FOLLOW-UP — OPS ANGLE",
        "say": "Perfect — I'll put together the inspection and Breezeway integration side so your ops team can see how it fits. I'll include a time for next week in case you want to dig in. Appreciate it, Lisa.",
        "note": "Send within 1 hour. Suggest she forward to Jocelyn or Jay for their take. Include a specific meeting time. Follow up Day 3 if no reply.",
        "branches": []
      },
      "end_email_general": {
        "label": "EMAIL FOLLOW-UP — GENERAL",
        "say": "You got it — I'll keep it short and relevant. Appreciate your time today, Lisa. Talk soon.",
        "note": "Send within 1 hour. Keep it to 4-5 sentences max. Lead with the owner-value angle since that's her world as portfolio development. Include one specific time to meet. Follow up Day 3 if no reply.",
        "branches": []
      },
      "lock_callback": {
        "label": "LOCK THE CALLBACK",
        "say": "Perfect — I'll call you back then. And just so you know what it's about when my number pops up — it's Sam with RapidEye, we help PM companies with their turnover inspection process. Talk to you then, Lisa.",
        "note": "Put the callback in your calendar immediately with full context notes. When you call back, reference this call: 'Hey Lisa, it's Sam Parks — we chatted earlier this week, you said to try you back now.'",
        "branches": []
      },
      "end_graceful": {
        "label": "END — GRACEFUL EXIT",
        "say": "Totally understand. If anything changes — especially heading into peak season — I'm easy to find. Appreciate your time, Lisa.",
        "note": "Don't burn the bridge. Add her to a light-touch nurture cadence (no more than 1 email/month). She may come around when she's pitching a high-value owner and needs a new differentiator. Also consider reaching out to Jocelyn, Mark, or Jay independently.",
        "branches": []
      },
      "gatekeeper": {
        "label": "GATEKEEPER — SLIDE BY",
        "say": "Hey — could you get me through to Lisa? It's Sam.",
        "note": "Say it like you belong. No last name, no company name, no explanation. Casual and confident. If they ask 'Lisa who?' say 'Lisa Riding.'",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Who's calling / what company?",
            "to": "gatekeeper_context"
          },
          {
            "label": "She's not available",
            "to": "gatekeeper_not_available"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — ADD CONTEXT",
        "say": "Yeah — I work with a few other property managers in Palm Springs. Would you mind letting her know it's Sam Parks?",
        "note": "Still no pitch. Just enough to sound like a legitimate business contact, not a telemarketer. Let the gatekeeper decide. Stay relaxed.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "What's this regarding?",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "She's in a meeting / unavailable",
            "to": "gatekeeper_not_available"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "We help a couple other vacation rental companies out here with their inspection workflows. I sent Lisa a note — would you mind just giving her a heads up that I called?",
        "note": "The 'I sent her a note' line implies prior contact and legitimacy. If they still won't connect you, don't fight. Get a callback time or ask for her voicemail.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "I'll pass along the message",
            "to": "gatekeeper_leave_message"
          },
          {
            "label": "What's your number?",
            "to": "gatekeeper_leave_message"
          }
        ]
      },
      "gatekeeper_not_available": {
        "label": "GATEKEEPER — NOT AVAILABLE",
        "say": "No worries — when's usually a good time to catch her? I'll try back then.",
        "note": "Get a specific time window: morning vs. afternoon, which days she's in the office. If they offer voicemail, take it but don't rely on it — always call back.",
        "branches": [
          {
            "label": "Gives a time / suggests calling back",
            "to": "gatekeeper_leave_message"
          },
          {
            "label": "Offers voicemail",
            "to": "gatekeeper_leave_message"
          },
          {
            "label": "Transferred to voicemail directly",
            "to": "gatekeeper_voicemail"
          }
        ]
      },
      "gatekeeper_leave_message": {
        "label": "LEAVE MESSAGE + LOG CALLBACK",
        "say": "Perfect — I'll try her back then. It's Sam Parks — P as in Parks — with RapidEye. Appreciate your help.",
        "note": "Log the callback time in your calendar immediately. If you get voicemail: 'Hey Lisa, it's Sam Parks with RapidEye — I work with a few PM companies in Palm Springs on their turnover inspection process. Hoping to get 2 minutes with you. I'll try again [day]. My number is [number].' Under 20 seconds.",
        "branches": []
      },
      "gatekeeper_voicemail": {
        "label": "VOICEMAIL — LEAVE SHORT MESSAGE",
        "say": "Hey Lisa, it's Sam Parks with RapidEye — I work with a few vacation rental companies in Palm Springs on their inspection and turnover workflows. Was hoping to grab two minutes with you. I'll try you again later this week — my number is [your number]. Thanks.",
        "note": "Under 20 seconds. Don't pitch. Don't explain what RapidEye does. Just enough to pique curiosity. Call back in 1-2 days at a different time of day. Consider also sending a brief email to Lisa@acmehouseco.com referencing the voicemail.",
        "branches": []
      }
    }
  }
}