{
  "name": "Manuel Nava",
  "title": "Housekeeping Manager",
  "company": "Frias Properties of Aspen Snowmass",
  "location": "Aspen, CO",
  "phone": "+1-970-618-8433",
  "company_phone": "+1-970-920-2000",
  "alt_phones": [],
  "flow": {
    "context": "Manuel Nava is the Housekeeping Manager at Frias Properties of Aspen Snowmass — he's been there since 2008 and is known internally for his attention to detail. He oversees housekeeping across 130+ luxury vacation rentals in Aspen and Snowmass Village. Frias is a full-service, hospitality-style PM company that expanded into Snowmass in 2023 and runs on Streamline for their PMS and work orders. Strongest connection to Sam: Sam was skiing Jackson Hole last month and works with property managers in ski markets — Manuel lives this world daily. If Manuel isn't the decision-maker, referral targets are Ben Wolff (Managing Partner & GM), Chris Longden (Director of Ops — East Aspen), or Zane Strickland (Director of Ops — West Aspen).",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Manuel — I was just out at Jackson Hole last month and ended up talking with a couple property managers about turnover ops in ski markets. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Feet up on the desk. Casual. You're a fellow skier calling someone in Aspen — let that feel natural. Don't rush the question at the end. Pause and let him answer.",
        "branches": [
          {
            "label": "No / who? / haven't heard of you",
            "to": "heard_name_no"
          },
          {
            "label": "Yeah actually / maybe / sounds familiar",
            "to": "heard_name_yes"
          },
          {
            "label": "Bad timing / busy / can't talk right now",
            "to": "bad_timing"
          },
          {
            "label": "Suspicious / what is this / are you selling something",
            "to": "permission_fallback"
          }
        ]
      },
      "heard_name_no": {
        "label": "HAVEN'T HEARD — TRANSITION TO PAIN",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call — I work with another housekeeping lead at a luxury PM company, similar setup to you guys, hundred-plus units in a resort market. And what she kept telling me was — peak season hits, you've got back-to-back turnovers, cleaners are rushing through units, snapping photos, but nobody actually has time to look at all of them. Then a guest checks in, finds a stain on a sofa or a scratch on a countertop, and somehow it lands on housekeeping even though you've got a hundred other units spinning. She was burning hours just scrolling through photos trying to catch stuff before it turned into a guest complaint. Is any of that hitting close to home for you?",
        "note": "Paint the picture vividly — he should SEE his own life in this story. Then PAUSE. Let him react. Do NOT keep talking after the question.",
        "branches": [
          {
            "label": "Yeah that's real / we deal with that / totally",
            "to": "pain_resonates"
          },
          {
            "label": "Kinda / we have ways to handle it / it's manageable",
            "to": "pain_lukewarm"
          },
          {
            "label": "Not really / we're good / not a problem for us",
            "to": "pain_pushback"
          },
          {
            "label": "What do you guys do exactly?",
            "to": "solution_cta"
          }
        ]
      },
      "heard_name_yes": {
        "label": "THEY'VE HEARD OF US",
        "say": "Oh nice — well normally we'd be working with someone like you. What'd you hear?",
        "note": "Genuine curiosity. Let him talk. Whatever he says, use it to bridge into discovery or the pain trigger.",
        "branches": [
          {
            "label": "Heard something positive / vague awareness",
            "to": "warm_discovery"
          },
          {
            "label": "Not sure / confused with something else",
            "to": "heard_name_no"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again later this week? Maybe Thursday or Friday when things calm down a bit?",
        "note": "Respect the timing. Get a specific callback window. Don't pitch — just lock a day and get off the phone.",
        "branches": [
          {
            "label": "Sure / yeah try me then",
            "to": "reschedule_confirmed"
          },
          {
            "label": "What's this about? / give me the quick version",
            "to": "heard_name_no"
          },
          {
            "label": "No / don't call back / not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "reschedule_confirmed": {
        "label": "CALLBACK LOCKED",
        "say": "Perfect — I'll try you Thursday afternoon. Appreciate it, Manuel. Talk soon.",
        "note": "Log the callback time immediately. Don't overstay. He gave you a window — protect it.",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION ASK",
        "say": "Yeah totally — I mean it is a cold call, I'll be honest with you. Can I get 30 seconds to tell you why I reached out? And you can totally hang up on me if it doesn't sound relevant.",
        "note": "Disarming honesty. Smile when you say it. The 'hang up on me' line gives him control and usually gets a laugh or a relaxation in tone.",
        "branches": [
          {
            "label": "Sure / go ahead / you've got 30 seconds",
            "to": "heard_name_no"
          },
          {
            "label": "No / not interested / take me off your list",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED — SPLIT",
        "say": "Shoot — totally my bad, Manuel. Just so nobody from my team bugs you again — is it that I just caught you at a horrible time, or is it more that you already know what we do and it's just not interesting?",
        "note": "This isn't pushback — it's a genuine attempt to understand. If it's timing you get a callback. If it's disinterest you exit clean or try one last value offer.",
        "branches": [
          {
            "label": "Bad timing / just busy right now",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / don't need it",
            "to": "last_shot"
          },
          {
            "label": "Hangs up / hard no",
            "to": "graceful_exit"
          }
        ]
      },
      "last_shot": {
        "label": "LAST CHANCE VALUE OFFER",
        "say": "Totally respect that. Quick thought before I let you go — we've been working with a few PM companies in ski markets and I've been putting together some notes on what they're doing differently with turnover photos heading into this season. If I shot that over to you, worst case you steal a couple ideas. Would that be useful or a total waste of your time?",
        "note": "Low-pressure value offer. If he bites you get an email thread started. If not, exit gracefully. No desperation.",
        "branches": [
          {
            "label": "Sure send it over",
            "to": "email_tailor_question"
          },
          {
            "label": "No thanks / not interested",
            "to": "graceful_exit"
          }
        ]
      },
      "pain_resonates": {
        "label": "PAIN LANDS — BRIDGE TO SOLUTION",
        "say": "Yeah — I hear that a lot. So what we built is basically an AI layer that sits on top of the turnover photos your cleaners are already taking. It flags damage, missing items, staging issues — automatically. So instead of you scrolling through hundreds of photos, you just see the stuff that actually needs your attention. Would you be open to taking a look sometime when I'm not cold calling you out of the blue?",
        "note": "One sentence on the solution. One sentence on the CTA. Don't oversell. If he's feeling the pain the meeting sells itself. PAUSE after the question.",
        "branches": [
          {
            "label": "Yeah / sure / I'd look at that",
            "to": "warm_discovery"
          },
          {
            "label": "How does it work? / tell me more",
            "to": "solution_detail"
          },
          {
            "label": "We already use Streamline for that / we have a process",
            "to": "objection_have_process"
          },
          {
            "label": "I'd need to run it by someone / not my call",
            "to": "referral_ask"
          }
        ]
      },
      "pain_lukewarm": {
        "label": "LUKEWARM — DIG DEEPER",
        "say": "Makes sense — you've been doing this since oh-eight so you've probably built a pretty tight system by now. Curious though — when your cleaners take photos after a turn, what does your review process actually look like? Are you looking at every photo yourself or is there a team handling that?",
        "note": "Compliment his tenure then pivot to discovery. You need him talking about HIS process so you can find the gap. Let him talk.",
        "branches": [
          {
            "label": "Describes their process / opens up",
            "to": "discovery_process"
          },
          {
            "label": "We've got it handled / not looking to change",
            "to": "objection_have_process"
          },
          {
            "label": "It's a lot / admits the volume is tough",
            "to": "pain_resonates"
          }
        ]
      },
      "pain_pushback": {
        "label": "NO PAIN — PIVOT",
        "say": "Hey that's great — honestly with 130-plus units most people I talk to are drowning. What are you guys doing differently? I'm genuinely curious.",
        "note": "Flip the script. If he's proud of his process let him talk. You'll either learn something useful or he'll reveal a gap while explaining. Genuine curiosity here.",
        "branches": [
          {
            "label": "Explains their process / proud of it",
            "to": "discovery_process"
          },
          {
            "label": "We just have a good team / nothing special",
            "to": "solution_cta"
          },
          {
            "label": "Still not interested / wants off the call",
            "to": "last_shot"
          }
        ]
      },
      "solution_cta": {
        "label": "SOLUTION + CTA",
        "say": "Makes sense. So real quick — we built an AI tool that looks at the turnover photos your team's already taking and automatically flags damage, missing items, anything off. No workflow change for your cleaners, it just plugs in. We're working with a few PM companies in resort markets right now. Would you be open to a quick look — fifteen minutes — just to see if it's even relevant for how you guys operate?",
        "note": "Keep it simple. 'No workflow change' is key for a housekeeping manager — he does NOT want more work for his cleaners. Fifteen minutes feels low-commitment.",
        "branches": [
          {
            "label": "Sure / yeah I'd take a look",
            "to": "warm_discovery"
          },
          {
            "label": "I'd need to loop in my boss / Chris / Zane / Ben",
            "to": "referral_ask"
          },
          {
            "label": "Not interested / we're good",
            "to": "objection_not_interested"
          },
          {
            "label": "Send me an email",
            "to": "email_tailor_question"
          }
        ]
      },
      "solution_detail": {
        "label": "HOW IT WORKS — BRIEF",
        "say": "Yeah so basically — your cleaners take photos during a turnover, right? We plug into that flow. Our AI scans every photo and flags anything that looks like damage, a missing item, or a staging issue. You get a report that just shows the stuff that needs attention instead of you having to dig through everything yourself. And over time it actually tracks cleaner performance — so you can see who's consistently missing things and who's dialed in. We can also tie into Streamline since I know you guys are on that for work orders.",
        "note": "Mentioning Streamline shows you did your homework. The cleaner performance tracking piece is huge for a housekeeping manager — that's his daily world. Don't go deeper than this — save the demo for the meeting.",
        "branches": [
          {
            "label": "That's interesting / the cleaner tracking piece",
            "to": "warm_discovery"
          },
          {
            "label": "How does it plug into Streamline?",
            "to": "streamline_bridge"
          },
          {
            "label": "I'd need to talk to someone else about this",
            "to": "referral_ask"
          },
          {
            "label": "Sounds cool but not right now",
            "to": "objection_not_interested"
          }
        ]
      },
      "streamline_bridge": {
        "label": "STREAMLINE INTEGRATION ANGLE",
        "say": "Yeah so the idea is — when we flag something, like damage in a unit, that can flow right into a work order in Streamline instead of someone having to manually create it. Keeps everything in one place. But honestly the best way to show you is to pull it up on a quick call. Would you and maybe one of your ops leads — Chris or Zane — want to jump on for fifteen minutes? I can show you exactly how it'd fit with what you're already running.",
        "note": "Name-drop the Directors of Ops naturally. If Manuel brings them into the meeting you've got decision-makers in the room. That's the ideal outcome.",
        "branches": [
          {
            "label": "Yeah let me check with them / good idea",
            "to": "book_meeting"
          },
          {
            "label": "I can take a look first myself",
            "to": "book_meeting"
          },
          {
            "label": "You'd need to talk to them directly",
            "to": "referral_ask"
          }
        ]
      },
      "warm_discovery": {
        "label": "THEY'RE WARM — ASK QUESTIONS",
        "say": "Awesome. Quick question so I don't waste your time when we do connect — what does your turnover process actually look like right now? Like when a cleaner finishes a unit, are they taking photos, and what happens with those photos after?",
        "note": "STOP PITCHING. You're in discovery mode now. Let him talk. Take notes. Everything he says is ammunition for the demo.",
        "branches": [
          {
            "label": "Describes photo process / workflow",
            "to": "discovery_deeper"
          },
          {
            "label": "We don't really take photos consistently",
            "to": "discovery_no_photos"
          },
          {
            "label": "We use Streamline for inspections",
            "to": "discovery_streamline"
          }
        ]
      },
      "discovery_process": {
        "label": "LEARNING THEIR PROCESS",
        "say": "That makes a lot of sense. So with that setup — when something does slip through, like a guest reports damage or something's off in a unit — how do you figure out when it happened? Like is there a way to trace it back to which cleaner had the unit last?",
        "note": "This question exposes the accountability gap. Most housekeeping managers can't easily trace damage to a specific turn. That's where RapidEye's cleaner performance tracking lands.",
        "branches": [
          {
            "label": "It's hard to trace / we don't always know",
            "to": "pain_resonates"
          },
          {
            "label": "We've got a system for that",
            "to": "solution_cta"
          },
          {
            "label": "That's actually a big headache for us",
            "to": "pain_resonates"
          }
        ]
      },
      "discovery_deeper": {
        "label": "DEEPER DISCOVERY",
        "say": "Got it. And with peak season — are you personally reviewing those photos or is that spread across the team? And how are you tracking cleaner performance right now — like if one cleaner's consistently missing things, is there data on that or is it more gut feel?",
        "note": "Two questions — photo review bottleneck and cleaner accountability. Both are core RapidEye value props. Let him answer both before responding.",
        "branches": [
          {
            "label": "I review a lot of them / it's a bottleneck",
            "to": "book_meeting"
          },
          {
            "label": "It's mostly gut feel / hard to track",
            "to": "book_meeting"
          },
          {
            "label": "We've got it pretty handled",
            "to": "solution_cta"
          }
        ]
      },
      "discovery_no_photos": {
        "label": "NO CONSISTENT PHOTOS",
        "say": "That's actually super common — a lot of teams we talk to have the same thing where some cleaners take photos and some don't, or it's inconsistent. One thing I could show you is how other companies in your position have gotten their teams to actually take photos consistently — and then how the AI makes those photos useful instead of just sitting in a folder somewhere. Would that be worth fifteen minutes?",
        "note": "If they're not taking photos consistently, RapidEye is still relevant — it gives cleaners a reason to take photos because the photos actually get reviewed. Position the meeting as learning from peers.",
        "branches": [
          {
            "label": "Yeah that'd be helpful",
            "to": "book_meeting"
          },
          {
            "label": "Maybe / let me think about it",
            "to": "email_tailor_question"
          },
          {
            "label": "Not right now",
            "to": "last_shot"
          }
        ]
      },
      "discovery_streamline": {
        "label": "STREAMLINE WORKFLOW",
        "say": "Oh nice — yeah I know you guys are on Streamline. So are the inspection checklists and photos living in Streamline right now? And when something gets flagged, does it automatically create a work order or is someone manually entering those?",
        "note": "This is gold — learn exactly how they use Streamline so you can position RapidEye as the missing piece. Most teams still manually create work orders from photo reviews.",
        "branches": [
          {
            "label": "It's manual / someone has to enter it",
            "to": "pain_resonates"
          },
          {
            "label": "It's pretty automated already",
            "to": "solution_cta"
          },
          {
            "label": "Describes their Streamline workflow in detail",
            "to": "discovery_deeper"
          }
        ]
      },
      "objection_have_process": {
        "label": "WE HAVE A PROCESS",
        "say": "That makes total sense — with 130-plus units and you've been running this since oh-eight, you'd have to have something solid in place. Just so I know — is it that you've got the photo review piece completely dialed and you're happy with it, or is it more that switching anything right now in the middle of season would just be a headache?",
        "note": "Split the objection. 'Happy with it' vs. 'bad timing to switch.' Most people pick the second one, which opens the door for a future conversation.",
        "branches": [
          {
            "label": "It's more the timing / mid-season is tough",
            "to": "test_drive_pitch"
          },
          {
            "label": "We're happy with what we have",
            "to": "curiosity_angle"
          },
          {
            "label": "A bit of both honestly",
            "to": "test_drive_pitch"
          }
        ]
      },
      "objection_not_interested": {
        "label": "NOT INTERESTED",
        "say": "Totally get it — I should've assumed you'd be all set. Otherwise you probably would've reached out yourself. Just so no one from my team cold calls you again — is it that this just isn't a problem you're focused on right now, or is it more that you just hate cold calls? Can't blame you either way.",
        "note": "Agree first. The split question with humor usually disarms. Most people say 'I just hate cold calls' and laugh — which reopens the conversation.",
        "branches": [
          {
            "label": "I just hate cold calls / laughs",
            "to": "test_drive_pitch"
          },
          {
            "label": "It's not a priority for us",
            "to": "last_shot"
          },
          {
            "label": "Both / firm no",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_no_budget": {
        "label": "NO BUDGET",
        "say": "Totally get it. Nowadays it's harder to keep a tool, let alone buy something new. Just curious — is it that budget for this kind of thing is completely locked for the year, or is it more that anything you try to bring in has to go through a whole approval process with Ben and the ops team?",
        "note": "Name-dropping Ben Wolff (Managing Partner) shows you know the org. The split separates 'no money' from 'I can't approve alone' — second one is a referral opportunity.",
        "branches": [
          {
            "label": "It's an approval thing / has to go through leadership",
            "to": "referral_ask"
          },
          {
            "label": "Budget is just tight right now",
            "to": "test_drive_pitch"
          },
          {
            "label": "We're not spending on new tools period",
            "to": "last_shot"
          }
        ]
      },
      "test_drive_pitch": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally hear you — and you're probably not buying anything right now, I get that. But here's what I've seen — when budget does open up or the season slows down, the people who move fastest are the ones who already know what's on their shortlist. Would you be open to just taking a look — not to buy, just so you know what's out there? Worst case you steal some ideas and we part as friends.",
        "note": "Remove all purchase pressure. This is purely about awareness. 'Steal some ideas and part as friends' is the close.",
        "branches": [
          {
            "label": "Sure / that's fair / I'll take a look",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "email_tailor_question"
          },
          {
            "label": "Not right now / maybe later",
            "to": "graceful_exit"
          }
        ]
      },
      "curiosity_angle": {
        "label": "HAPPY WITH PROCESS — PEER INSIGHT",
        "say": "Respect that. Out of curiosity — are your cleaners taking photos after every single turn right now? And is someone actually reviewing all of them or is it more of a spot-check kind of thing?",
        "note": "If he says 'spot check,' that's the gap. Nobody can review every photo from 130+ units. The question itself plants the seed.",
        "branches": [
          {
            "label": "It's more spot-checking / we can't review everything",
            "to": "pain_resonates"
          },
          {
            "label": "We review everything / airtight process",
            "to": "test_drive_pitch"
          },
          {
            "label": "Not really taking photos consistently",
            "to": "discovery_no_photos"
          }
        ]
      },
      "referral_ask": {
        "label": "REFERRAL — WHO ELSE SHOULD I TALK TO",
        "say": "That makes total sense — and I don't want to put you in a weird spot. Who on your team would typically make the call on something like this? Would that be someone like Chris Longden or Zane on the ops side, or does that go all the way up to Ben?",
        "note": "Name specific people from your research. It shows you know the org and makes it easy for Manuel to just confirm or redirect instead of thinking of a name from scratch.",
        "branches": [
          {
            "label": "Yeah talk to Chris / Zane / Ben",
            "to": "referral_get_name"
          },
          {
            "label": "I can bring it up to them / let me ask internally",
            "to": "referral_internal_champion"
          },
          {
            "label": "I'm not sure who handles that",
            "to": "referral_general"
          }
        ]
      },
      "referral_get_name": {
        "label": "LOCK THE REFERRAL",
        "say": "Perfect — if I reach out to them, would you mind if I mentioned we spoke? Just so it's not a total cold call for them too. And what's the best way to get them — email or do they pick up the phone?",
        "note": "Getting Manuel's permission to name-drop turns your next call from cold to warm. You already have their direct numbers and emails from research — but let him tell you the preferred channel.",
        "branches": [
          {
            "label": "Sure mention me / here's how to reach them",
            "to": "book_meeting_or_exit"
          },
          {
            "label": "I'd rather bring it up myself first",
            "to": "referral_internal_champion"
          }
        ]
      },
      "referral_internal_champion": {
        "label": "INTERNAL CHAMPION PATH",
        "say": "That'd be amazing honestly. Tell you what — I can send you a quick one-pager that's super easy to forward, so you don't have to explain anything. And if they're interested I'll handle it from there. Would that make it easy?",
        "note": "Give him something to forward so you're not relying on him to pitch RapidEye. Send it within the hour. Follow up in 2-3 days.",
        "branches": [
          {
            "label": "Yeah send it over",
            "to": "email_tailor_question"
          },
          {
            "label": "Sure but no promises",
            "to": "email_tailor_question"
          }
        ]
      },
      "referral_general": {
        "label": "UNSURE WHO TO REFER TO",
        "say": "No worries at all. Usually in a company your size it's either someone on the ops side — like a Director of Operations — or whoever's managing the actual inspection and maintenance workflow. Does that ring a bell for anyone on your team?",
        "note": "Guide him to a title. You know it's likely Chris Longden or Zane Strickland but let him get there naturally.",
        "branches": [
          {
            "label": "Names someone / gives a lead",
            "to": "referral_get_name"
          },
          {
            "label": "Still not sure / can't help",
            "to": "graceful_exit"
          }
        ]
      },
      "email_tailor_question": {
        "label": "SEND EMAIL — TAILOR IT",
        "say": "Totally fair — I'll shoot you something. Quick question so it's not just another generic pitch sitting in your inbox — what would be most relevant to you? The damage detection piece, the cleaner performance tracking, or more how it would fit with Streamline and what you're already running?",
        "note": "This does two things: makes the email relevant and tells you what he actually cares about. Use his answer to personalize the follow-up. Send within 30 minutes of hanging up.",
        "branches": [
          {
            "label": "Tells you what to focus on",
            "to": "email_confirm"
          },
          {
            "label": "Just send whatever / general overview is fine",
            "to": "email_confirm"
          }
        ]
      },
      "email_confirm": {
        "label": "CONFIRM EMAIL + PLANT NEXT STEP",
        "say": "Got it — I'll send that over to your Frias email today. And hey, if anything looks interesting, I've got some time next week to walk through it live — fifteen minutes. I'll drop a couple times in the email. Really appreciate you taking my call, Manuel.",
        "note": "His email is likely Manueal@FriasProperties.com (note the possible typo from their site — confirm the address if you can). Include two specific time slots in the email. Send within 30 minutes.",
        "branches": []
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome — let's lock something in. I've got next week pulled up. How does Tuesday or Wednesday look for you — maybe early afternoon before things get crazy? Fifteen minutes is all I need.",
        "note": "Pick specific days. Early afternoon works for housekeeping managers — mornings are turnover chaos in ski markets. Get it on the calendar NOW and send the invite while you're still on the phone.",
        "branches": [
          {
            "label": "Gives a day/time / confirms",
            "to": "meeting_confirmed"
          },
          {
            "label": "Let me check and get back to you",
            "to": "meeting_followup"
          },
          {
            "label": "Can we do it in a couple weeks",
            "to": "meeting_push"
          }
        ]
      },
      "book_meeting_or_exit": {
        "label": "REFERRAL LOCKED — CLOSE",
        "say": "Really appreciate that, Manuel. I'll reach out to them and mention we chatted. And hey — if you ever want to see it yourself, the door's always open. Thanks for your time and have a good rest of your day.",
        "note": "You got the referral. Don't push for more. Call the referred contact within 24 hours while this conversation is still fresh in Manuel's mind.",
        "branches": []
      },
      "meeting_confirmed": {
        "label": "MEETING CONFIRMED",
        "say": "Perfect — I'll send the invite right now so it's locked on both our calendars. It'll come from Sam at RapidEye. Really appreciate you taking my call, Manuel. Talk to you then.",
        "note": "Stop selling immediately. Send the calendar invite within 60 seconds of hanging up. Include a brief one-line agenda so he remembers what it's about.",
        "branches": []
      },
      "meeting_followup": {
        "label": "TENTATIVE — PIN DOWN FOLLOW-UP",
        "say": "Totally — how about I shoot you the invite for Wednesday at one and you can move it if that doesn't work? That way it's on the calendar and we're not playing phone tag.",
        "note": "Anchor a specific time even if it's tentative. It's 10x easier to move a meeting than to schedule one from scratch over email.",
        "branches": [
          {
            "label": "Sure send it",
            "to": "meeting_confirmed"
          },
          {
            "label": "I'll email you back with times",
            "to": "email_confirm"
          }
        ]
      },
      "meeting_push": {
        "label": "PUSHED OUT — LOCK IT ANYWAY",
        "say": "No problem at all — I know this time of year is insane in Aspen. How about two weeks from now, same deal — early afternoon, fifteen minutes? I'll send something over so it's on the books and we don't lose track of it.",
        "note": "Even if it's two weeks out, get it on the calendar. A meeting on the calendar is 10x more likely to happen than a vague 'let's connect later.'",
        "branches": [
          {
            "label": "Gives a date / confirms",
            "to": "meeting_confirmed"
          },
          {
            "label": "Just email me",
            "to": "email_tailor_question"
          }
        ]
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand, Manuel. If anything ever changes or you get curious, I'm easy to find — Sam Parks, RapidEye. Appreciate your time. Have a good one.",
        "note": "Don't burn the bridge. Manuel's been at Frias for 17 years — he's not going anywhere. You can revisit in a few months or approach through Ben, Chris, or Zane instead.",
        "branches": []
      }
    }
  }
}