{
  "name": "Mark Kombrink",
  "title": "Founder / Owner",
  "company": "Host2Coast",
  "location": "Hilton Head Island, SC",
  "phone": "+1-843-295-9145",
  "company_phone": "+1-855-404-4678",
  "alt_phones": [],
  "flow": {
    "context": "Calling Mark Kombrink, Founder and Owner of Host2Coast — a vacation rental property management company on Hilton Head Island, SC managing roughly 224 properties. He started Host2Coast in April 2020 and grew fast, branding it as a boutique operation focused on high standards of service and home care. Mark is a member of the Lowcountry Property Managers Association and runs Hosts4Community, a philanthropy org. Their site uses a Track subdomain (host2coast.trackhs.com), which strongly suggests Track as their PMS — RapidEye integrates directly with Track. They have a SeaCrest exterior roof project running through late April 2026 that likely adds inspection complexity. Key ops team: Leigh Ann Farmer (Maintenance Coordinator / Licensed PM), Travis Petro (Property Manager focused on property standards), Jackson Kombrink (Property Manager, likely family). No direct personal overlap with Sam, but the LCPMA membership is the strongest warm-adjacent entry point and Mark's coastal lifestyle connects to Sam's fishing and surfing background.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Mark, I've been chatting with a few folks in the Lowcountry Property Managers Association — it's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Feet-up-on-the-desk energy. Don't rush. Pause after the question and let him answer. You're referencing LCPMA because he's a listed member — it should feel like a warm intro, not a pitch.",
        "branches": [
          {
            "label": "No, haven't heard of you",
            "to": "heard_name_no"
          },
          {
            "label": "Yeah / maybe / sounds familiar",
            "to": "heard_name_yes"
          },
          {
            "label": "Who is this? / What's this about?",
            "to": "who_is_this"
          },
          {
            "label": "Bad timing / busy / can't talk",
            "to": "bad_timing"
          }
        ]
      },
      "heard_name_no": {
        "label": "HAVEN'T HEARD — TRANSITION TO PAIN",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call — I was actually talking to another PM company owner down in the Lowcountry, pretty similar situation to you guys, couple hundred properties. He was telling me his team takes hundreds of turnover photos every single week, but stuff's still slipping through. A guest checks in, finds a cracked tile or a stain on the sofa, drops it in a review — and now the homeowner's calling him asking why nobody caught that before the guest walked in. Not because his people don't care — they do — but when you're flipping 50 or 60 units on a Saturday, nobody's got the bandwidth to scrutinize every single photo. We built an AI that plugs into the turnover photos your team's already taking — flags damage, missing items, staging issues — before the guest ever walks in. Would you be open to taking a look when I'm not cold calling you out of the blue?",
        "note": "Pause after 'asking why nobody caught that.' Let the pain land. Mark runs 224 properties and brands Host2Coast on high standards of home care — this should hit close to home. Don't rush through the CTA. Let silence do the work.",
        "branches": [
          {
            "label": "Yeah sure / tell me more / sounds interesting",
            "to": "warm_discovery"
          },
          {
            "label": "We already have a process for that",
            "to": "objection_have_process"
          },
          {
            "label": "Not really interested",
            "to": "objection_not_interested"
          },
          {
            "label": "No budget / not spending right now",
            "to": "objection_no_budget"
          },
          {
            "label": "Send me an email",
            "to": "objection_send_email"
          },
          {
            "label": "Bad timing / busy",
            "to": "bad_timing"
          }
        ]
      },
      "heard_name_yes": {
        "label": "HEARD THE NAME — EXPLORE",
        "say": "Oh nice — well normally we'd be working with someone like you. What'd you hear?",
        "note": "Let him talk. He might be confusing you with someone else or might have genuinely heard of RapidEye. Either way, listen first and adapt.",
        "branches": [
          {
            "label": "Describes what they heard / asks questions",
            "to": "warm_discovery"
          },
          {
            "label": "Can't really remember / vague",
            "to": "heard_name_no"
          },
          {
            "label": "Might be confusing with something else",
            "to": "heard_name_no"
          }
        ]
      },
      "who_is_this": {
        "label": "WHO IS THIS — REINTRODUCE",
        "say": "Yeah totally fair — it's Sam Parks, I'm with RapidEye. We work with a handful of vacation rental companies on their turnover inspection workflows. I've been connected with a few folks through the Lowcountry Property Managers group and your name kept coming up as the person to talk to at Host2Coast.",
        "note": "Stay calm, don't get defensive. You're reestablishing credibility. The LCPMA reference is real — he's a listed member as Founder.",
        "branches": [
          {
            "label": "Okay, what do you want?",
            "to": "heard_name_no"
          },
          {
            "label": "Not interested / sounds like a sales call",
            "to": "permission_ask"
          },
          {
            "label": "Go ahead / I'm listening",
            "to": "heard_name_no"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING — RESCHEDULE",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow, maybe around the same time?",
        "note": "Don't push. Lock a specific callback time if possible. If he gives you a day or time, write it down and honor it exactly.",
        "branches": [
          {
            "label": "Yeah try me tomorrow / gives a time",
            "to": "callback_confirmed"
          },
          {
            "label": "Just send me an email",
            "to": "objection_send_email"
          },
          {
            "label": "Don't call back / not interested",
            "to": "end_graceful"
          }
        ]
      },
      "callback_confirmed": {
        "label": "CALLBACK LOCKED",
        "say": "Perfect, I'll give you a ring then. Appreciate it, Mark.",
        "note": "Write down the exact time. Set a reminder. When you call back, lead with: Hey Mark, Sam Parks — you told me to try you back today. Treat it like a warm call, not a second cold call.",
        "branches": []
      },
      "permission_ask": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call, I'll own that. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not a fit?",
        "note": "Self-deprecating honesty disarms. If he says yes, go straight to the pain trigger. If no, go to permission rejected and split.",
        "branches": [
          {
            "label": "Sure, go ahead / 30 seconds",
            "to": "heard_name_no"
          },
          {
            "label": "No / I'm good / not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED — SPLIT",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and it's just not interesting?",
        "note": "This splits the objection into two buckets. If it's timing, you can reschedule. If it's genuine disinterest, exit gracefully. Either way you're being respectful.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / don't need it",
            "to": "last_ditch_value"
          },
          {
            "label": "What do you do exactly?",
            "to": "heard_name_no"
          }
        ]
      },
      "last_ditch_value": {
        "label": "LAST DITCH — OFFER VALUE",
        "say": "Totally respect that. If nothing else — we've been working with a few PM companies in the Hilton Head market and I've got some data on what they're doing differently with their turnover workflows heading into peak season. Happy to shoot that over if it'd be useful, no strings attached. Either way, appreciate you picking up, Mark.",
        "note": "Plant a seed. If he bites on the competitive intel angle, you've got a foot in the door. If not, exit clean. Never burn the bridge.",
        "branches": [
          {
            "label": "Sure send it over",
            "to": "email_capture"
          },
          {
            "label": "No thanks / I'm good",
            "to": "end_graceful"
          },
          {
            "label": "Actually tell me more about what you do",
            "to": "warm_discovery"
          }
        ]
      },
      "warm_discovery": {
        "label": "THEY'RE WARM — STOP PITCHING, ASK QUESTIONS",
        "say": "Yeah for sure — before I bore you with what we do, let me ask: with about 224 properties on Hilton Head, what does your turnover inspection process look like right now? Are your cleaners or PMs taking photos after every turn?",
        "note": "STOP selling. You're in discovery now. Let Mark talk. You want to learn: 1) Are they taking photos? 2) Who reviews them? 3) What falls through the cracks? The 224 number shows you did your homework. Listen for pain.",
        "branches": [
          {
            "label": "Describes their current process",
            "to": "discovery_dig_deeper"
          },
          {
            "label": "Yeah we take photos / use Breezeway or similar",
            "to": "discovery_tech_stack"
          },
          {
            "label": "We don't really have a formal process",
            "to": "discovery_no_process"
          },
          {
            "label": "Why do you ask? / What's this for?",
            "to": "pain_reframe"
          },
          {
            "label": "That's not really my area / talk to someone on my team",
            "to": "referral_ask"
          }
        ]
      },
      "discovery_dig_deeper": {
        "label": "DIG DEEPER — PROCESS DETAIL",
        "say": "Got it. And when those photos come in — who's actually reviewing them? Is that you, or is that falling on Leigh Ann or Travis and the team?",
        "note": "You're namedropping team members from research. This shows you did homework and makes the call feel less cold. Listen for whether Mark personally reviews photos or delegates it entirely.",
        "branches": [
          {
            "label": "I review them / I'm involved",
            "to": "discovery_owner_pain"
          },
          {
            "label": "My team handles it / Leigh Ann / Travis",
            "to": "discovery_team_pain"
          },
          {
            "label": "How do you know their names?",
            "to": "explain_research"
          },
          {
            "label": "Nobody really reviews all of them",
            "to": "discovery_no_review"
          },
          {
            "label": "That's more their area, you should talk to them",
            "to": "referral_ask"
          }
        ]
      },
      "discovery_tech_stack": {
        "label": "TECH STACK DISCOVERY",
        "say": "Nice. And you guys are on Track for your PMS, right? How's that been working on the inspection and turnover side?",
        "note": "You know they're on Track from the host2coast.trackhs.com subdomain. If he confirms, this is huge — RapidEye plugs directly into Track. If he corrects you, adapt and ask what they use.",
        "branches": [
          {
            "label": "Yeah we use Track / confirms",
            "to": "track_integration_hook"
          },
          {
            "label": "We use something else / corrects you",
            "to": "discovery_owner_pain"
          },
          {
            "label": "How'd you know that?",
            "to": "explain_research"
          }
        ]
      },
      "track_integration_hook": {
        "label": "TRACK INTEGRATION — NATURAL FIT",
        "say": "Oh perfect — so we actually plug right into Track. No workflow change for your team at all. The photos they're already uploading after turnovers just get analyzed automatically — flags damage, missing items, staging issues — and your team gets a report before the next guest checks in. Would you be open to seeing how that'd look with your actual properties?",
        "note": "This is your strongest selling point for this call. Zero workflow change plus existing PMS integration removes the biggest friction objection. Don't oversell — let the simplicity speak for itself.",
        "branches": [
          {
            "label": "Yeah that'd be interesting / sure",
            "to": "book_meeting"
          },
          {
            "label": "What does it cost?",
            "to": "handle_pricing"
          },
          {
            "label": "We don't really have issues with that",
            "to": "objection_have_process"
          },
          {
            "label": "Send me something on it",
            "to": "objection_send_email"
          }
        ]
      },
      "discovery_no_process": {
        "label": "NO FORMAL PROCESS — PAIN AMPLIFY",
        "say": "Yeah that's actually super common at your size. That's kind of exactly where the gap shows up — you've gone from zero to 224 properties in five years, which is incredible, but the stuff that worked when you had 50 homes just doesn't scale the same way. The owners who trust you with their property expect everything to get caught. We built something that basically gives your team a second set of eyes on every single turnover — catches what gets missed when you're moving fast. Would it make sense to show you how it works?",
        "note": "Mark started Host2Coast in April 2020 and grew to 224 properties — that's rapid growth. The scaling pain is real and specific. Frame RapidEye as the thing that lets him keep his boutique quality promise at scale.",
        "branches": [
          {
            "label": "Yeah show me / sounds useful",
            "to": "book_meeting"
          },
          {
            "label": "What does it cost?",
            "to": "handle_pricing"
          },
          {
            "label": "I don't think we need that",
            "to": "objection_not_interested"
          },
          {
            "label": "Send me something",
            "to": "objection_send_email"
          }
        ]
      },
      "discovery_owner_pain": {
        "label": "OWNER-FOCUSED PAIN — DIG IN",
        "say": "So when something does slip through — like a guest finds a broken blind or a stain nobody caught — how does that conversation go with the homeowner? I imagine with the boutique positioning you guys have built, that's a tough one.",
        "note": "This is where Mark's deepest pain lives. Host2Coast brands itself on high standards of service and home care. Every missed issue is a direct threat to his owner relationships and his brand promise. Let him talk. Listen for real stories.",
        "branches": [
          {
            "label": "Shares a story / acknowledges the pain",
            "to": "solution_pitch"
          },
          {
            "label": "It doesn't happen that often",
            "to": "gentle_challenge"
          },
          {
            "label": "Yeah it's a real problem / gets frustrated",
            "to": "solution_pitch"
          },
          {
            "label": "That's more of a team-level thing",
            "to": "referral_ask"
          }
        ]
      },
      "discovery_team_pain": {
        "label": "TEAM REVIEWS PHOTOS — BANDWIDTH PAIN",
        "say": "Got it. So how realistic is it that they're catching everything across 224 properties? Like on a big Saturday turnover day — are they actually looking at every single photo, or is it more of a spot-check situation?",
        "note": "You're gently exposing the gap without being accusatory. At 224 properties, there is no way every photo gets a careful review. Let him admit it on his own.",
        "branches": [
          {
            "label": "Admits stuff slips through",
            "to": "solution_pitch"
          },
          {
            "label": "They're pretty thorough / pushes back",
            "to": "gentle_challenge"
          },
          {
            "label": "It's a spot check / acknowledges the gap",
            "to": "solution_pitch"
          }
        ]
      },
      "discovery_no_review": {
        "label": "NO ONE REVIEWS ALL PHOTOS",
        "say": "Yeah — honestly that's the most common answer I get from PM companies at your size. The photos exist, but nobody's got time to actually go through all of them. And then when an owner calls about damage or a guest leaves a bad review, everyone's going back through photos after the fact trying to figure out what happened. That's exactly what we solve — would it make sense to show you how it works?",
        "note": "This is the most common pain point across PM companies. Don't judge, empathize. The photos exist as CYA documentation but nobody has bandwidth to review them proactively. That's the gap.",
        "branches": [
          {
            "label": "Yeah that'd be useful / sure",
            "to": "book_meeting"
          },
          {
            "label": "What does it actually do?",
            "to": "solution_pitch"
          },
          {
            "label": "Not interested right now",
            "to": "objection_not_interested"
          }
        ]
      },
      "explain_research": {
        "label": "EXPLAIN HOW YOU KNOW",
        "say": "Ha, yeah — I just did my homework before calling. You guys are listed on the Lowcountry Property Managers site, your team's on host2coast.com. I wanted to make sure I was actually talking to the right person instead of wasting your time.",
        "note": "Be transparent and casual. Don't be creepy about it. Frame it as respect for his time — you didn't call blind. Then redirect back to discovery.",
        "branches": [
          {
            "label": "Okay fair enough / appreciates it",
            "to": "discovery_owner_pain"
          },
          {
            "label": "Still skeptical / guarded",
            "to": "permission_ask"
          }
        ]
      },
      "gentle_challenge": {
        "label": "GENTLE CHALLENGE — SEACREST HOOK",
        "say": "Yeah that makes sense. I imagine with the SeaCrest roof project running right now, there's probably even more to keep eyes on than usual — construction dust, things getting shifted around, debris. Is that adding any extra inspection load for the team?",
        "note": "The SeaCrest exterior roof project runs through late April 2026. This is a time-sensitive operational pressure that increases the value of automated issue detection. If he's surprised you know about it, just say you saw it on the website.",
        "branches": [
          {
            "label": "Yeah it's been a headache / confirms extra complexity",
            "to": "solution_pitch"
          },
          {
            "label": "It's managed / not a big deal",
            "to": "solution_pitch"
          },
          {
            "label": "How do you know about that?",
            "to": "explain_research_seacrest"
          }
        ]
      },
      "explain_research_seacrest": {
        "label": "EXPLAIN SEACREST KNOWLEDGE",
        "say": "Oh I just saw the notice on your website — the roof project timeline was listed on the oceanfront rentals page. I figured that kind of thing always creates extra inspection headaches, so I thought it was worth mentioning.",
        "note": "Keep it casual. It's publicly listed on their site. This shows you read their actual website, not just a LinkedIn page. Redirect to the solution.",
        "branches": [
          {
            "label": "Yeah that's fair / continues conversation",
            "to": "solution_pitch"
          },
          {
            "label": "Seems like you really did your homework",
            "to": "solution_pitch"
          }
        ]
      },
      "pain_reframe": {
        "label": "REFRAME — WHY I'M ASKING",
        "say": "Yeah sorry — I'll give you the quick version. We work with vacation rental companies and the problem we keep hearing is this: the team takes a ton of turnover photos, but nobody has time to review them all carefully. Things get missed, guest finds it, bad review, owner calls asking why. We built an AI that reviews those photos automatically and flags issues before the guest checks in. I was just curious what that looks like for you guys at 224 properties.",
        "note": "He wants context before answering your questions. Give a quick framing and return to discovery. Don't over-pitch — keep it tight.",
        "branches": [
          {
            "label": "Got it / describes their process",
            "to": "discovery_dig_deeper"
          },
          {
            "label": "Sounds interesting / tell me more",
            "to": "warm_discovery"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "solution_pitch": {
        "label": "ONE-SENTENCE SOLUTION + CTA",
        "say": "So what we built — and I'll keep it really short — is an AI that plugs into the photos your team's already taking during turnovers. It scans every image and flags anything that's off — damage, missing items, staging that doesn't match the baseline. Your team gets a report before the next guest walks in. No workflow change, no extra steps for anyone. Would you be open to seeing how it'd actually work with your properties — maybe 20 minutes when I'm not ambushing you on the phone?",
        "note": "One sentence on the product, then straight to the CTA. Don't over-explain. If he's been sharing pain, the solution should feel like the obvious answer. Mention Track integration if he confirmed it earlier in the call.",
        "branches": [
          {
            "label": "Yeah let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "What does it cost?",
            "to": "handle_pricing"
          },
          {
            "label": "Send me something first",
            "to": "objection_send_email"
          },
          {
            "label": "We might already be covered",
            "to": "objection_have_process"
          },
          {
            "label": "Not a priority right now",
            "to": "objection_no_budget"
          },
          {
            "label": "You should talk to my team about this",
            "to": "referral_ask"
          }
        ]
      },
      "handle_pricing": {
        "label": "PRICING QUESTION",
        "say": "Yeah totally fair question. It depends on the number of properties and turnover volume, but for a company your size it's usually a few hundred bucks a month. Honestly the best way to answer that is to show you the actual ROI — most of our customers end up saving way more than that just on deposit disputes and damage they catch early. Would it make sense to walk through it together? I can pull up numbers specific to your volume.",
        "note": "Don't quote an exact price on a cold call. Anchor it as affordable relative to what they're already losing. Redirect to the meeting where you can show real ROI with their numbers.",
        "branches": [
          {
            "label": "Yeah let's look at it",
            "to": "book_meeting"
          },
          {
            "label": "Just send me the pricing",
            "to": "objection_send_email"
          },
          {
            "label": "That sounds reasonable",
            "to": "book_meeting"
          },
          {
            "label": "Not in the budget right now",
            "to": "objection_no_budget"
          }
        ]
      },
      "objection_have_process": {
        "label": "ALREADY HAVE A PROCESS — MIYAGI",
        "say": "That makes total sense — with 224 properties you'd have to have something in place already. Just so nobody from my team cold calls you again — is it that you're fully covered and happy with what you've got, or is it more that switching anything right now would just be a headache?",
        "note": "Agree first, then split. If they're happy, respect it but sell the test drive. If it's switching friction, lean hard on the fact that RapidEye layers on top — it doesn't replace anything.",
        "branches": [
          {
            "label": "We're happy with what we have",
            "to": "sell_test_drive"
          },
          {
            "label": "Switching would be a pain / too much going on",
            "to": "sell_test_drive_timing"
          },
          {
            "label": "What would be different about yours?",
            "to": "differentiator"
          }
        ]
      },
      "objection_not_interested": {
        "label": "NOT INTERESTED — MIYAGI",
        "say": "I totally get it. I should've assumed you'd be all set — otherwise you probably would've reached out to us. Just so no one from my team bugs you again — is it that this isn't a problem you're focused on right now, or is it more that you just hate cold calls?",
        "note": "Agree first, then split. If it's cold call hatred, empathize and pivot to email. If inspections aren't a priority, try to understand what IS the priority and see if RapidEye connects to it.",
        "branches": [
          {
            "label": "I just hate cold calls",
            "to": "hate_cold_calls"
          },
          {
            "label": "Inspections aren't our priority right now",
            "to": "whats_priority"
          },
          {
            "label": "Both / just not interested",
            "to": "last_ditch_value"
          }
        ]
      },
      "objection_no_budget": {
        "label": "NO BUDGET — MIYAGI",
        "say": "Totally get it. Nowadays it's harder to keep a tool, let alone buy something new — especially heading into spring when every dollar's going toward getting properties ready for summer. Is it that budget for this cycle is completely locked, or is it more that anything new has to go through the ringer before you can pull the trigger?",
        "note": "Agree, validate with seasonal context — spring prep on Hilton Head is expensive with summer peak approaching. Then split. If budget is locked, sell the test drive for future planning. If it's evaluation friction, offer to be the easy one.",
        "branches": [
          {
            "label": "Budget is totally locked",
            "to": "sell_test_drive"
          },
          {
            "label": "Anything new is a hassle to evaluate",
            "to": "sell_test_drive_timing"
          },
          {
            "label": "It's just not a priority",
            "to": "whats_priority"
          }
        ]
      },
      "hate_cold_calls": {
        "label": "HATES COLD CALLS — EMPATHIZE AND PIVOT",
        "say": "Ha — honestly, fair. I don't love making them either. Tell you what — let me send you a two-minute email with what we're doing for a couple other PM companies in your market. If it's interesting, great. If not, I'll leave you alone. What email's best for you — is it your direct one at Host2Coast?",
        "note": "Pivot to email. You're respecting his preference. Try to get his direct email — you suspect it's mk@host2coast.com or similar based on the SignalHire first-initial last-initial pattern.",
        "branches": [
          {
            "label": "Gives email / confirms",
            "to": "email_capture"
          },
          {
            "label": "Just use the website one / bookings@",
            "to": "email_capture"
          },
          {
            "label": "No thanks",
            "to": "end_graceful"
          }
        ]
      },
      "whats_priority": {
        "label": "WHAT'S THE PRIORITY — REDIRECT",
        "say": "That's fair. What is the biggest thing you're focused on heading into summer season? I'm just curious — I talk to PM owners in your market all day, and what's top of mind might be something I can actually help with. Or at the very least point you toward someone who can.",
        "note": "Genuinely curious. If he shares priorities, listen for anything RapidEye connects to — owner retention, scaling, quality control, guest complaints, damage costs. If it's truly unrelated, exit gracefully and add value where you can.",
        "branches": [
          {
            "label": "Shares a priority that RapidEye relates to",
            "to": "solution_pitch"
          },
          {
            "label": "Shares something unrelated",
            "to": "end_graceful"
          },
          {
            "label": "Just not looking for anything right now",
            "to": "last_ditch_value"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally respect that. You're probably not buying anything right now, and I get it. But the PM owners who end up moving fastest when budget frees up are the ones who already know what's first, second, and third on their list. Would you be open to just taking a look — not to buy anything — but so when the time's right you already know what's out there? If nothing else, I can show you what a couple other companies in the Hilton Head market are doing with their turnover photos. Worst case you steal some ideas and we part as friends.",
        "note": "Remove all buying pressure. The meeting has standalone value even if he never buys. Frame it as competitive intel — he should know what his peers in the market are doing.",
        "branches": [
          {
            "label": "Yeah okay / that could work",
            "to": "book_meeting"
          },
          {
            "label": "Maybe later / not right now",
            "to": "objection_send_email"
          },
          {
            "label": "No thanks",
            "to": "end_graceful"
          }
        ]
      },
      "sell_test_drive_timing": {
        "label": "SELL TEST DRIVE — ZERO CHANGE ANGLE",
        "say": "Totally makes sense. Here's the thing though — we actually layer on top of what you're already doing. It's not a rip-and-replace situation. Your team keeps doing exactly what they do now, and we just analyze the photos that are already being uploaded. Zero change for your people. Would it be worth 20 minutes to see if it even makes sense before you write it off?",
        "note": "The zero workflow change angle is the strongest counter to switching friction and evaluation fatigue. RapidEye adds, it doesn't replace. Make that crystal clear.",
        "branches": [
          {
            "label": "Yeah I guess that's fair / sure",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "objection_send_email"
          },
          {
            "label": "Still not interested right now",
            "to": "end_graceful"
          }
        ]
      },
      "differentiator": {
        "label": "WHAT MAKES YOU DIFFERENT",
        "say": "Good question. The biggest thing is we're not asking your team to do anything new. Whatever photos they're already taking — in Track, on their phones, wherever — we analyze those automatically. The AI compares turnovers against your property baseline and flags anything that's changed or off. So it's not a checklist somebody has to fill out — it's automatic. And it catches things human eyes miss when you're on photo number 400 on a Saturday afternoon.",
        "note": "Keep it simple. The differentiator is: no workflow change plus catches what humans miss at scale. Don't trash their current process — frame RapidEye as an upgrade layer on top of it.",
        "branches": [
          {
            "label": "That's interesting / tell me more",
            "to": "book_meeting"
          },
          {
            "label": "How much does it cost?",
            "to": "handle_pricing"
          },
          {
            "label": "I'd need to think about it",
            "to": "objection_send_email"
          }
        ]
      },
      "objection_send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Yeah totally fair. One quick question before I do — what would be most relevant to include so it doesn't just end up in the junk pile? Like, are you more interested in how it works technically, or more what the ROI looks like for a company managing your volume?",
        "note": "Accept the email request, then ask one qualifying question. This tells you what he actually cares about and makes your follow-up email way more effective. Also try to get his direct email address.",
        "branches": [
          {
            "label": "ROI / business case",
            "to": "email_capture"
          },
          {
            "label": "How it works / technical",
            "to": "email_capture"
          },
          {
            "label": "Just send whatever / anything is fine",
            "to": "email_capture"
          }
        ]
      },
      "email_capture": {
        "label": "GET EMAIL + PLANT CALLBACK",
        "say": "Perfect, I'll get that over to you today. What's the best email — is it your direct one at Host2Coast? And I'll plan to follow up Thursday or Friday just to make sure it actually landed. Appreciate you taking the call, Mark.",
        "note": "Try to get his direct email — likely mk@host2coast.com based on the SignalHire first-initial underscore last-initial pattern. Lock a follow-up day so you have soft permission to call back. Send the email within one hour of hanging up.",
        "branches": [
          {
            "label": "Gives direct email",
            "to": "end_email_confirmed"
          },
          {
            "label": "Use bookings@ or general email",
            "to": "end_email_confirmed"
          }
        ]
      },
      "end_email_confirmed": {
        "label": "EMAIL CONFIRMED — CLOSE",
        "say": "Got it. I'll have that in your inbox this afternoon. Talk to you later this week, Mark.",
        "note": "Send a personalized email within 1 hour. Reference the specific call, include what he asked for — ROI data or technical walkthrough — and suggest a specific meeting time. Follow up by phone on the exact day you told him.",
        "branches": []
      },
      "book_meeting": {
        "label": "BOOK THE MEETING — LOCK IT NOW",
        "say": "Awesome. Let me pull up next week — how does Tuesday or Wednesday look for you? Thinking 20 minutes, I'll share my screen and show you exactly how it'd work with your actual properties.",
        "note": "Pick a specific day. Don't say sometime next week. If he gives a day, nail down the exact time immediately. Send the calendar invite while you're still on the phone if at all possible.",
        "branches": [
          {
            "label": "Gives a day and time",
            "to": "meeting_confirmed"
          },
          {
            "label": "I'll have to check my calendar",
            "to": "meeting_pin_down"
          },
          {
            "label": "Can you send me a link to book?",
            "to": "meeting_pin_down"
          }
        ]
      },
      "meeting_confirmed": {
        "label": "MEETING BOOKED — STOP SELLING",
        "say": "Perfect, I'll send you a calendar invite right now. Really appreciate you taking my cold call, Mark. Talk to you then.",
        "note": "STOP SELLING. You got the meeting. Send the calendar invite immediately. Include a brief agenda: Quick look at how RapidEye works with your turnover workflow — 20 min. Add his email, send a short confirmation email, and do not add anything else to this call.",
        "branches": []
      },
      "meeting_pin_down": {
        "label": "PIN DOWN THE MEETING",
        "say": "Tell you what — how about I throw a couple options on your calendar and you just accept whichever works? What's the best email to send the invite to?",
        "note": "Don't let the meeting float. Send two calendar invites with specific times as soon as you hang up. Get his email. Follow up by phone if he hasn't accepted within 24 hours.",
        "branches": [
          {
            "label": "Gives email / agrees to calendar options",
            "to": "meeting_confirmed"
          },
          {
            "label": "Just email me and I'll reply with times",
            "to": "email_capture"
          }
        ]
      },
      "referral_ask": {
        "label": "REFERRAL — GET TO THE RIGHT PERSON",
        "say": "Totally makes sense — I don't want to waste your time on the operational weeds. Who on your team would be the best person to talk to about the turnover and inspection side? I know Leigh Ann handles a lot of the maintenance coordination — would she be the right person, or is there someone else who owns that workflow day to day?",
        "note": "You're namedropping Leigh Ann Farmer, the Maintenance Coordinator, based on research. If Mark confirms or gives another name like Travis Petro or Jackson Kombrink, get a direct number or ask if you can mention Mark's name. If Mark says he actually does own it, redirect back to discovery.",
        "branches": [
          {
            "label": "Yeah talk to Leigh Ann / confirms",
            "to": "referral_received"
          },
          {
            "label": "Talk to Travis / Jackson / someone else",
            "to": "referral_received"
          },
          {
            "label": "Actually I'd handle that decision myself",
            "to": "warm_discovery"
          }
        ]
      },
      "referral_received": {
        "label": "GOT A REFERRAL — LOCK IT",
        "say": "Perfect. Would you mind if I mention your name when I reach out to them? And is there a direct number or email that'd get me to them the fastest?",
        "note": "Get explicit permission to namedrop Mark. Get contact info — direct number, email, or extension. If he only gives the main line, that's fine — call 855-404-4678 and ask for them by name, saying Mark pointed you their way.",
        "branches": [
          {
            "label": "Gives contact info / says go ahead",
            "to": "referral_close"
          },
          {
            "label": "Just call the main number and ask for them",
            "to": "referral_close"
          }
        ]
      },
      "referral_close": {
        "label": "REFERRAL CONFIRMED — CLOSE",
        "say": "Really appreciate that, Mark. I'll reach out to them and keep it short. Thanks for your time — enjoy Hilton Head.",
        "note": "Call the referral within the hour while Mark might still mention it to them. Open with: Hey, Mark Kombrink pointed me your way. Treat it as a warm call. Log this in your CRM immediately.",
        "branches": []
      },
      "end_graceful": {
        "label": "EXIT GRACEFULLY",
        "say": "Totally understand. If anything ever changes or you want to see what other PM companies in the Lowcountry are doing with their turnovers, I'm easy to find — Sam Parks, RapidEye. Appreciate your time, Mark.",
        "note": "Don't burn the bridge. Add Mark to a light email follow-up sequence — not another cold call for at least 3 to 4 weeks. He might come around after peak summer season when the inspection pain is freshest. Log the call outcome and any intel you gathered.",
        "branches": []
      }
    }
  }
}