{
  "name": "Matt Tate",
  "title": "Broker/Agent",
  "company": "Coldwell Banker Mason Morse — Aspen Resort Luxury Rentals",
  "location": "Aspen, CO",
  "phone": "+1-970-379-4106",
  "company_phone": "+1-970-920-7393",
  "alt_phones": [],
  "flow": {
    "context": "Matt Tate is a broker/agent at Coldwell Banker Mason Morse's Aspen Resort Luxury Rentals division — previously a Managing Real Estate Broker, so he understands operational workflows at scale and has real internal pull. CBMM manages ~300 properties across the Roaring Fork Valley and explicitly markets pre-arrival and post-departure inspections to owners. No known inspection tech platform. Sam's in: he just got back from skiing Jackson Hole in January and works with luxury rental managers in resort markets — easy bridge to Matt's world. If Matt isn't the decision-maker, the referral target is Will Herndon (President, oversees all operations, cell 970-319-5530) or whoever runs their inspection/housekeeping workflow day-to-day.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Matt — I work with a few luxury rental managers in resort markets, actually just got back from Jackson Hole a couple weeks ago. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Relaxed, feet-up energy. You're calling a peer in the ski/resort world. Don't rush — let the Jackson Hole mention land naturally. Sound like you belong in his world.",
        "branches": [
          {
            "label": "No, I haven't",
            "to": "heard_no"
          },
          {
            "label": "Yeah / maybe / sounds familiar",
            "to": "heard_yes"
          },
          {
            "label": "Who is this? / What's this about?",
            "to": "who_is_this"
          },
          {
            "label": "Bad timing / I'm busy",
            "to": "bad_timing"
          }
        ]
      },
      "heard_no": {
        "label": "THEY HAVEN'T HEARD OF YOU",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason I'm calling — I work with a couple other property managers who run luxury portfolios pretty similar to what you guys have in Aspen. And the thing that keeps coming up is how much stuff slips through on turnovers. Like, their teams are taking photos after every checkout, but nobody actually has time to look through three hundred photos per unit and catch that a guest dinged a table leg or left a stain on a ten-thousand-dollar sofa. And in a market like Aspen where you're managing multi-million-dollar homes, one missed thing can turn into a really ugly conversation with an owner. We built a tool that plugs into whatever system your team's already using and automatically flags damage, missing items, staging issues — so nothing falls through the cracks. Would you be open to taking a look sometime when I'm not cold calling you out of the blue?",
        "note": "Full pain trigger + solution + CTA. Pause after 'ugly conversation with an owner' and let it breathe. The Aspen luxury specificity should land with Matt. The 300-photo number and $10K sofa detail make the pain visceral.",
        "branches": [
          {
            "label": "Yeah, that sounds interesting / tell me more",
            "to": "warm_discovery"
          },
          {
            "label": "We already have a process for that",
            "to": "objection_have_process"
          },
          {
            "label": "I'm not really the right person for that",
            "to": "not_right_person"
          },
          {
            "label": "Not interested / we're good",
            "to": "objection_not_interested"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          }
        ]
      },
      "heard_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — yeah, we've been working with a few property managers in the resort rental space. What'd you hear?",
        "note": "Rare path but possible. Let Matt talk. Whatever he says, bridge with: 'Yeah exactly — that's actually why I wanted to reach out to you specifically.'",
        "branches": [
          {
            "label": "Describes what they heard",
            "to": "warm_discovery"
          },
          {
            "label": "Not much / can't remember",
            "to": "heard_no"
          }
        ]
      },
      "who_is_this": {
        "label": "THEY WANT CONTEXT",
        "say": "Yeah totally — Sam Parks, I run a company called RapidEye. We work with luxury rental managers on their inspection and turnover workflows. I've been talking with a few folks in the Aspen market and your name kept coming up as someone worth reaching out to.",
        "note": "Don't over-explain. Give just enough to earn the next 15 seconds. The 'your name kept coming up' line makes it feel less cold.",
        "branches": [
          {
            "label": "Okay, what's this about?",
            "to": "pain_trigger_short"
          },
          {
            "label": "I'm busy / not a good time",
            "to": "bad_timing"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again later this week? Maybe Thursday or Friday?",
        "note": "Don't apologize. Just offer a specific callback window. If they give a time, lock it in and get off the phone quickly.",
        "branches": [
          {
            "label": "Sure, try me Thursday/Friday / gives a time",
            "to": "lock_callback"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          },
          {
            "label": "What's this about? (curious enough to keep going)",
            "to": "pain_trigger_short"
          },
          {
            "label": "No, don't call back",
            "to": "graceful_exit"
          }
        ]
      },
      "lock_callback": {
        "label": "LOCK THE CALLBACK",
        "say": "Perfect — I'll try you then. Appreciate it, Matt. Talk soon.",
        "note": "Get off the phone fast. Don't oversell the callback. Set a reminder immediately after hanging up.",
        "branches": []
      },
      "pain_trigger_short": {
        "label": "SHORT PAIN TRIGGER",
        "say": "Quick version — I work with a couple luxury rental managers running portfolios similar in size to yours. The thing they kept running into is their teams are taking photos after every turnover, but nobody has time to actually review them all. So damage gets missed, and then it's the broker or the owner who finds out three guests later. We built something that automatically catches that stuff in the photos they're already taking. Figured it'd be worth a quick conversation given you guys are running around three hundred properties across the valley.",
        "note": "Compressed pain trigger. The 300-property number shows you did homework. 'The broker or the owner who finds out' — frame the pain around Matt's world. Pause after and let him react.",
        "branches": [
          {
            "label": "That's interesting / tell me more",
            "to": "warm_discovery"
          },
          {
            "label": "We already have something for that",
            "to": "objection_have_process"
          },
          {
            "label": "I'm not the right person",
            "to": "not_right_person"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          }
        ]
      },
      "warm_discovery": {
        "label": "THEY'RE WARM — ASK QUESTIONS",
        "say": "Awesome — yeah, I don't wanna pitch you blind. Quick question: what does your inspection process look like right now after a guest checks out? Are your teams using any specific platform to document turnovers, or is it more manual?",
        "note": "STOP PITCHING. You're in discovery now. Listen for: what tools they use, who reviews photos, how damage gets caught or doesn't, and who on the team owns this workflow. Matt's answer will tell you if he's close enough to ops to be the buyer or if you need a referral.",
        "branches": [
          {
            "label": "Describes their process / tools",
            "to": "discovery_deep"
          },
          {
            "label": "We use Breezeway / Track / specific platform",
            "to": "discovery_known_tool"
          },
          {
            "label": "It's pretty manual / informal",
            "to": "discovery_manual"
          },
          {
            "label": "I don't really handle that side",
            "to": "not_right_person"
          }
        ]
      },
      "discovery_deep": {
        "label": "DIG DEEPER",
        "say": "That makes sense. So when something does get missed — like damage that doesn't surface until the next guest checks in or the owner notices — what does that look like for you? Who ends up dealing with that?",
        "note": "You're looking for the emotional cost. Does Matt personally get the call from an upset owner? Does it hurt his relationship? The pain is most real when it touches his reputation and his owners' trust.",
        "branches": [
          {
            "label": "Describes the fallout / it's a headache",
            "to": "bridge_to_meeting"
          },
          {
            "label": "It doesn't happen much / we're pretty on top of it",
            "to": "sell_test_drive"
          },
          {
            "label": "That's more Will's / the ops team's problem",
            "to": "referral_to_will"
          }
        ]
      },
      "discovery_known_tool": {
        "label": "THEY NAMED A TOOL",
        "say": "Oh nice — yeah, we actually plug right into that. So the photos your team's already uploading, we just run them through our system automatically and flag anything that looks off. No workflow change at all on your end. How's it been working for you — does someone on the team manually review every set of photos, or is it more of a spot-check thing?",
        "note": "If they name Breezeway, Track, or another PMS — this is gold. Show RapidEye integrates. Then keep discovering. You want to learn who reviews, how often, and what gets missed.",
        "branches": [
          {
            "label": "Someone reviews them / it's a lot of work",
            "to": "bridge_to_meeting"
          },
          {
            "label": "It's mostly spot-check / we trust the cleaners",
            "to": "bridge_to_meeting"
          },
          {
            "label": "It's working fine for us",
            "to": "sell_test_drive"
          }
        ]
      },
      "discovery_manual": {
        "label": "PROCESS IS MANUAL",
        "say": "Yeah — that's super common, especially when you're managing that many properties across the whole valley. That's actually where we've seen the most impact. We had a PM in New York running about two hundred luxury homes and they were doing basically the same thing — cleaners snapping photos, nobody reviewing them consistently. They plugged us in and started catching stuff same-day that used to take weeks to surface. Would you be open to seeing what that looks like? Even just a fifteen-minute walkthrough.",
        "note": "Social proof with NYC luxury PM at 200 homes. Don't oversell — bridge to the meeting. If Matt seems like he's tracking, this is the moment to lock in a demo.",
        "branches": [
          {
            "label": "Yeah, I'd be open to that",
            "to": "book_meeting"
          },
          {
            "label": "You should talk to Will / someone else",
            "to": "referral_to_will"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "sell_test_drive"
          }
        ]
      },
      "bridge_to_meeting": {
        "label": "BRIDGE TO MEETING",
        "say": "Yeah — that's exactly why I reached out. We've been helping a few other luxury PMs solve that exact problem. Would you be open to a quick fifteen-minute look? I can show you what we're doing with a PM in New York that runs about two hundred high-end homes — similar setup to yours. Worst case you steal some ideas.",
        "note": "Light CTA. 'Worst case you steal some ideas' lowers the commitment. If they say yes, go straight to booking. Don't add more selling.",
        "branches": [
          {
            "label": "Yeah, let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Who else should be on the call?",
            "to": "expand_meeting"
          },
          {
            "label": "Send me an email first",
            "to": "send_email"
          },
          {
            "label": "Let me think about it",
            "to": "sell_test_drive"
          }
        ]
      },
      "expand_meeting": {
        "label": "EXPAND THE MEETING",
        "say": "Great question — usually whoever runs the inspection or housekeeping operations day-to-day would get the most out of it. Would that be Will Herndon, or is there someone else who owns that workflow?",
        "note": "This is ideal — Matt's bought in and you're getting introduced to the real decision-maker. Drop Will's name to show you've done research. Let Matt confirm or redirect.",
        "branches": [
          {
            "label": "Yeah, Will / confirms Will",
            "to": "book_meeting_with_referral"
          },
          {
            "label": "Gives a different name",
            "to": "book_meeting_with_referral"
          },
          {
            "label": "I'll figure out who and get back to you",
            "to": "send_email"
          },
          {
            "label": "I can handle it for now",
            "to": "book_meeting"
          }
        ]
      },
      "book_meeting_with_referral": {
        "label": "BOOK WITH REFERRAL INCLUDED",
        "say": "Perfect — I've got next week pulled up. How does Tuesday or Wednesday look? I'll keep it to fifteen minutes, and I can send an invite to both of you right now so it's locked in.",
        "note": "Pick two specific days. Get the email for both attendees. Send the calendar invite while still on the phone. Once booked, STOP SELLING.",
        "branches": [
          {
            "label": "Gives a day/time",
            "to": "meeting_booked"
          },
          {
            "label": "Let me check and get back to you",
            "to": "pin_down_meeting"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome — I've got next week pulled up. How does Tuesday or Wednesday afternoon look for a quick fifteen minutes?",
        "note": "Offer two specific days. Lock it NOW. Don't leave it open-ended. Once they pick a time, confirm and send the invite immediately.",
        "branches": [
          {
            "label": "Gives a day/time",
            "to": "meeting_booked"
          },
          {
            "label": "Let me check my calendar / I'll get back to you",
            "to": "pin_down_meeting"
          }
        ]
      },
      "pin_down_meeting": {
        "label": "PIN IT DOWN",
        "say": "Totally — I'll shoot you an email at mtate@masonmorse.com with a couple time options. If one works, just click accept and we're locked in. Sound good?",
        "note": "Use his actual email to show you're prepared. This makes the follow-up concrete, not a vague 'I'll send you something.'",
        "branches": [
          {
            "label": "Sounds good",
            "to": "meeting_booked"
          },
          {
            "label": "Different email / corrects you",
            "to": "meeting_booked"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING CONFIRMED",
        "say": "Perfect — sending that invite right now. Really appreciate you taking my call, Matt. Looking forward to it.",
        "note": "STOP SELLING. Send the calendar invite immediately after hanging up. Add notes from the conversation to the invite body so you remember context.",
        "branches": []
      },
      "not_right_person": {
        "label": "NOT THE RIGHT PERSON",
        "say": "Totally fair — appreciate you telling me that. Who on your team would typically own the inspection or turnover quality side of things? Is that more of a Will Herndon conversation, or is there someone else running operations?",
        "note": "Drop Will Herndon's name to show you've done research. Matt's more likely to confirm or redirect if you give him a specific name to react to rather than asking an open-ended question.",
        "branches": [
          {
            "label": "Yeah, talk to Will / confirms Will",
            "to": "referral_to_will"
          },
          {
            "label": "Gives a different name",
            "to": "referral_other"
          },
          {
            "label": "I'm not sure / doesn't want to refer",
            "to": "soft_referral_push"
          }
        ]
      },
      "referral_to_will": {
        "label": "REFERRAL TO WILL HERNDON",
        "say": "Perfect — would it be cool if I mentioned you pointed me his way? That way it doesn't land totally cold. And is the best number for Will still the nine-seven-zero three-one-nine line, or should I try his office?",
        "note": "Asking to use Matt's name as a warm intro is huge. Confirming Will's cell number shows you're prepared and makes it frictionless for Matt to just say yes.",
        "branches": [
          {
            "label": "Yeah, go ahead / confirms number",
            "to": "referral_locked"
          },
          {
            "label": "Just email him / try the office",
            "to": "referral_locked"
          },
          {
            "label": "I can intro you directly",
            "to": "referral_intro"
          }
        ]
      },
      "referral_intro": {
        "label": "MATT OFFERS TO INTRO",
        "say": "That would be amazing — seriously appreciate that, Matt. I'll send you a quick blurb you can forward so it's easy on your end. What's the best email for you — still mtate@masonmorse.com?",
        "note": "Best possible outcome from a non-decision-maker call. Make it completely effortless — send him a short, forwardable email within 10 minutes of hanging up. Keep the forwardable portion under 4 sentences.",
        "branches": [
          {
            "label": "Confirms email",
            "to": "referral_locked"
          },
          {
            "label": "Gives different email",
            "to": "referral_locked"
          }
        ]
      },
      "referral_other": {
        "label": "REFERRAL TO SOMEONE ELSE",
        "say": "Oh great — and what's their role? Just so I can make sure I put something relevant together. And would it be okay to mention you pointed me their way?",
        "note": "Get the name, title, and permission to use Matt as the referral source. This turns your next call from cold to warm. Write down the name and title word for word.",
        "branches": [
          {
            "label": "Gives name/role and permission",
            "to": "referral_locked"
          },
          {
            "label": "Gives name but no permission to use Matt's name",
            "to": "referral_locked"
          }
        ]
      },
      "soft_referral_push": {
        "label": "SOFT PUSH FOR REFERRAL",
        "say": "No worries at all. If I can just get a name or even a title, I'll put something tailored together so it actually lands — instead of me just cold calling the main line and hoping for the best.",
        "note": "Light humor about the cold call reality. You're making it easy for Matt to help without committing to anything. If he truly can't help, don't push — exit gracefully.",
        "branches": [
          {
            "label": "Gives a name or suggestion",
            "to": "referral_locked"
          },
          {
            "label": "Try the vacation rental team / main line",
            "to": "referral_locked"
          },
          {
            "label": "Can't help / doesn't know",
            "to": "graceful_exit"
          }
        ]
      },
      "referral_locked": {
        "label": "REFERRAL SECURED",
        "say": "Awesome — really appreciate that, Matt. I'll reach out to them and keep it relevant. Thanks for taking my call — enjoy the rest of ski season out there.",
        "note": "End warm. The ski season reference keeps it personal and ties back to the opener. Log the referral name, number, and context immediately after hanging up.",
        "branches": []
      },
      "objection_not_interested": {
        "label": "NOT INTERESTED",
        "say": "Totally get it — I should've assumed you'd be all set, otherwise you probably would've reached out to us. Just so nobody from my team bugs you again — is it more that this isn't a problem you're focused on, or is it just that cold calls are the worst?",
        "note": "Agree first — surprise him by not pushing back. Then split the objection into two lanes. 'Cold calls are the worst' lets you laugh together and recover. 'Not a problem I'm focused on' opens the door to a referral.",
        "branches": [
          {
            "label": "It's just the cold call / bad timing",
            "to": "permission_recovery"
          },
          {
            "label": "We don't really have that problem",
            "to": "sell_test_drive"
          },
          {
            "label": "Not my area / talk to someone else",
            "to": "not_right_person"
          },
          {
            "label": "Hard no / just not interested",
            "to": "graceful_exit"
          }
        ]
      },
      "permission_recovery": {
        "label": "PERMISSION RECOVERY",
        "say": "Ha — yeah, totally my bad on that. Can I get thirty seconds to tell you why I called? And you can absolutely hang up on me if it's not a fit.",
        "note": "Self-deprecating humor. You're acknowledging the interruption honestly and asking for a tiny window. Most people will give you 30 seconds here because you're being real.",
        "branches": [
          {
            "label": "Fine, go ahead",
            "to": "pain_trigger_short"
          },
          {
            "label": "No, not right now",
            "to": "bad_timing"
          },
          {
            "label": "Hard no",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_have_process": {
        "label": "ALREADY HAVE A PROCESS",
        "say": "That makes total sense — with three hundred properties across the valley you'd have to have something in place. Just so I know — is it more that you're fully covered and happy with how it's working, or is it that switching anything right now would just be a headache?",
        "note": "Validate with the 300-property detail to show you know their scale. Then split. 'Fully covered and happy' is rare — most will admit it's imperfect. 'Switching is a headache' opens the door to the no-workflow-change pitch.",
        "branches": [
          {
            "label": "It's working fine / we're happy",
            "to": "sell_test_drive"
          },
          {
            "label": "Switching would be a pain",
            "to": "no_workflow_change"
          },
          {
            "label": "It's not perfect but it's what we've got",
            "to": "imperfect_process"
          }
        ]
      },
      "no_workflow_change": {
        "label": "NO WORKFLOW CHANGE PITCH",
        "say": "Yeah, that's actually the thing — we don't replace anything. Whatever your team's already doing, whatever platform they're uploading photos into, we just sit on top of it and flag stuff automatically. Zero change for your cleaners or inspectors. That's actually why the PM companies we work with tried us — because there was literally nothing to switch. Would you be open to seeing how it works? Fifteen minutes, tops.",
        "note": "This is your strongest rebuttal. RapidEye's plug-in architecture is the killer feature here. It dissolves the switching-cost objection entirely.",
        "branches": [
          {
            "label": "Okay, that's interesting",
            "to": "book_meeting"
          },
          {
            "label": "Still not the right time",
            "to": "sell_test_drive"
          },
          {
            "label": "Talk to Will / someone else about this",
            "to": "not_right_person"
          }
        ]
      },
      "imperfect_process": {
        "label": "PROCESS ISN'T PERFECT",
        "say": "Yeah — that's what I hear from basically everyone. The photos are getting taken, but reviewing every single one across hundreds of turnovers? Nobody has the bandwidth. That's literally the gap we fill. Would you be open to a quick fifteen-minute look? If nothing else, I can show you what a couple other luxury PMs in resort markets are doing with their turnover photos — worst case you steal some ideas and we part as friends.",
        "note": "They've admitted the gap exists. Bridge to the meeting with the low-commitment 'steal some ideas' offer. Don't re-pitch — just get the meeting.",
        "branches": [
          {
            "label": "Yeah, let's take a look",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Talk to someone else on our team",
            "to": "not_right_person"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally fair. You're probably not buying something like this off a cold call — I respect that. But when you guys do start looking at this kind of thing, the people who end up making the best decisions are the ones who already know what's out there. Would you be open to just taking a look — not buying anything, just so it's on your radar? Fifteen minutes, and if it's not relevant I'll leave you alone forever.",
        "note": "For warm-ish prospects who aren't ready to commit. You're selling the meeting, not the product. 'Leave you alone forever' is light humor that lowers pressure.",
        "branches": [
          {
            "label": "Okay fine, let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          },
          {
            "label": "No, not right now",
            "to": "graceful_exit"
          }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most useful to include so it's not just another generic pitch sitting in your inbox? Like, is it more about how it integrates with what you're already using, or more about what it actually catches?",
        "note": "Asking what to include keeps them engaged and gives you intel for the email. Whatever they say, use it. Include a specific meeting time suggestion in the email. Send within one hour.",
        "branches": [
          {
            "label": "Tells you what they want to see",
            "to": "email_confirmed"
          },
          {
            "label": "Just send me whatever / general overview",
            "to": "email_confirmed"
          }
        ]
      },
      "email_confirmed": {
        "label": "EMAIL FOLLOW-UP LOCKED",
        "say": "Got it — I'll send that over to mtate@masonmorse.com today. I'll include a couple time options in case you wanna hop on a quick call after you look it over. Appreciate your time, Matt.",
        "note": "Confirm the email. Send within 1 hour. Include: personalized note referencing this conversation, the specific thing they asked for, 2-3 time options, and keep it under 150 words. Follow up in 2-3 days if no response.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes, I'm easy to find — Sam Parks, RapidEye. Appreciate your time, Matt. Enjoy the rest of the season out there.",
        "note": "Don't burn the bridge. The ski season comment keeps it personal and ties back to the opener. Log this call and set a reminder to try again in 4-6 weeks with a different angle or a referral from someone else at CBMM.",
        "branches": []
      }
    }
  }
}