{
  "name": "Michelle Layne Nichols",
  "title": "Vice President of Operations",
  "company": "Carolina Designs",
  "location": "Outer Banks, NC",
  "phone": "+1-252-261-3934 ext. 6296",
  "company_phone": "+1-252-261-3934",
  "alt_phones": [],
  "flow": {
    "context": "Michelle Layne Nichols is VP of Operations at Carolina Designs — a family-owned Outer Banks vacation rental company managing 350+ homes with in-house cleaning and inspection staff. She owns the quality chain: housekeeping, inspections, turn standards, and preventing guest-facing defects. The company is a documented early adopter (first OBX firm with online booking in '97, electrolyzed cleaning products in '07, EV charger program in '23) and their brand promise centers on 'clean homes.' Monica Thibodeau is the owner and ultimate decision-maker; Evelyn McDonald runs customer service. Your best hook: you're a surfer and fisherman who knows the OBX area, you work with similar-sized East Coast PM companies, and Carolina Designs' innovation DNA makes them a natural fit for RapidEye.",
    "start": "call_start",
    "nodes": {
      "call_start": {
        "label": "CALL START",
        "say": "",
        "note": "Dialing Michelle's direct extension: (252) 261-3934 ext. 6296. If Michelle picks up, go to Opener. If someone else answers, go to Gatekeeper. If voicemail, leave a short message.",
        "branches": [
          {
            "label": "Michelle answers",
            "to": "opener"
          },
          {
            "label": "Someone else answers",
            "to": "gatekeeper"
          },
          {
            "label": "Voicemail",
            "to": "voicemail"
          }
        ]
      },
      "opener": {
        "label": "OPENER",
        "say": "Hey Michelle — I work with a few vacation rental operators out on the East Coast, and honestly I've been wanting an excuse to connect with someone in the Outer Banks. I'm a surfer and fisherman so that area's near and dear to me. It's Sam Parks with RapidEye — have you heard my name tossed around?",
        "note": "Relaxed, warm tone. Feet on the desk energy. The surf and fishing line is genuine — Sam founded both clubs in high school and travels to surf. It's a real connection to OBX, not a gimmick. Let it land naturally.",
        "branches": [
          {
            "label": "No / who?",
            "to": "not_popular"
          },
          {
            "label": "Yes / maybe",
            "to": "what_did_you_hear"
          },
          {
            "label": "Bad timing / busy",
            "to": "bad_timing"
          },
          {
            "label": "Confused / cold / who is this",
            "to": "permission_fallback"
          }
        ]
      },
      "not_popular": {
        "label": "NOT AS POPULAR",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call is —",
        "note": "Self-deprecating, light. Do not pause here — flow immediately into the pain trigger.",
        "branches": [
          {
            "label": "Continue to pain",
            "to": "pain_trigger"
          }
        ]
      },
      "what_did_you_hear": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — usually we'd be working with someone like you. What'd you hear?",
        "note": "Let them talk. If they describe something accurate, bridge to discovery. If vague or confused, bridge to pain trigger.",
        "branches": [
          {
            "label": "Describes something / vaguely positive",
            "to": "warm_discovery"
          },
          {
            "label": "Vague / wrong / confused with something else",
            "to": "pain_trigger"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again later this week? Maybe Thursday or Friday when things settle down?",
        "note": "Don't push. Offer specific days. Be easy about it.",
        "branches": [
          {
            "label": "Sure, try me later",
            "to": "bad_timing_confirmed"
          },
          {
            "label": "Don't call back",
            "to": "graceful_exit"
          }
        ]
      },
      "bad_timing_confirmed": {
        "label": "CALLBACK LOCKED",
        "say": "Perfect — I'll try you Thursday afternoon. Thanks Michelle, talk then.",
        "note": "Write down the callback time immediately. Set a reminder. Don't say anything else.",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION ASK",
        "say": "Yeah totally — I mean it is a cold call, I'll own that. Can I get 30 seconds to tell you why I reached out? And you can totally hang up on me if it's not a fit.",
        "note": "Disarming honesty. Most people will give you the 30 seconds once you own it.",
        "branches": [
          {
            "label": "Fine, go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "No / not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED — SPLIT",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and it's just not interesting?",
        "note": "Split the objection. If it's timing, pivot to callback. If it's disinterest, learn why and exit gracefully.",
        "branches": [
          {
            "label": "It's just bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / don't call",
            "to": "graceful_exit"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "So I was talking to another ops leader at a company pretty similar to yours — about 350 homes, in-house cleaning and inspection teams, big Saturday turnover days. And she was telling me that even with trained staff and solid checklists, stuff still slips through. A stain on a couch cushion, a broken drawer handle, a set of towels that didn't get restocked. And the frustrating part isn't the miss itself — it's that the guest finds it, calls in, and now her team's scrambling to fix something that should've been caught before they ever walked in the door. And when you're flipping a few hundred homes on the same day, nobody has time to actually review every photo from every unit. Does any of that sound familiar, or is your team pretty buttoned up on that?",
        "note": "PAUSE after 'does any of that sound familiar.' Silence is your friend. Let her react. The specifics — stain, drawer handle, towels — are designed to trigger a memory of the last time it happened to her. Do not rush past the pause.",
        "branches": [
          {
            "label": "Yes / that resonates / shares a story",
            "to": "solution_and_cta"
          },
          {
            "label": "We're pretty buttoned up / we handle it",
            "to": "obj_have_process"
          },
          {
            "label": "What do you do about it? / tell me more",
            "to": "solution_and_cta"
          },
          {
            "label": "Not interested / pushback",
            "to": "obj_not_interested"
          }
        ]
      },
      "solution_and_cta": {
        "label": "SOLUTION + CTA",
        "say": "Yeah so that's exactly why we built RapidEye. It plugs into the photos your team's already taking during turnovers and uses AI to flag damage, missing items, staging issues — before the guest checks in. No workflow change, it just sits on top of what you're already doing. Would you be open to taking a look sometime when I'm not cold calling you out of the blue?",
        "note": "One sentence on the solution, one sentence on the CTA. Don't over-explain how it works. You're selling the meeting, not the product.",
        "branches": [
          {
            "label": "Yeah / sure / tell me more",
            "to": "warm_discovery"
          },
          {
            "label": "Not right now / no budget",
            "to": "obj_no_budget"
          },
          {
            "label": "Send me an email",
            "to": "obj_send_email"
          },
          {
            "label": "We already have something for that",
            "to": "obj_have_process"
          }
        ]
      },
      "warm_discovery": {
        "label": "DISCOVERY — STOP PITCHING",
        "say": "Awesome — before I ramble on, let me ask: what does your turnover inspection process actually look like right now? Like when a home gets cleaned, how does your team document it and how do you know it's guest-ready?",
        "note": "STOP SELLING. You're in discovery mode. Listen for: what tools they use, where photos go, who reviews them, what falls through the cracks, what happens when something's missed. Take notes.",
        "branches": [
          {
            "label": "Describes photo/checklist process",
            "to": "discovery_process"
          },
          {
            "label": "Mentions pain / frustration",
            "to": "discovery_pain_dig"
          },
          {
            "label": "Says someone else handles that",
            "to": "referral_ask"
          }
        ]
      },
      "discovery_process": {
        "label": "DIG INTO PROCESS",
        "say": "Got it — so your team's taking photos during turns. How many of those actually get reviewed before the guest walks in? And when something does get missed — does that come back to your team, or does customer service eat it?",
        "note": "You're looking for the gap between photo volume and review capacity. Also probing the pain chain — if guest complaints hit Evelyn McDonald's customer service team, that's a second stakeholder feeling the pain. Take notes on tools mentioned (ART, Breezeway, checklists, etc.).",
        "branches": [
          {
            "label": "Admits not all get reviewed / things slip",
            "to": "innovation_bridge"
          },
          {
            "label": "Mentions customer service / guest complaints",
            "to": "innovation_bridge"
          },
          {
            "label": "Says they review everything / confident",
            "to": "season_pressure"
          }
        ]
      },
      "discovery_pain_dig": {
        "label": "DIG INTO PAIN",
        "say": "Yeah — what's been the biggest headache for you on the ops side heading into this season?",
        "note": "Open-ended question. Let her vent. Whatever she says — staffing, consistency, volume, owner complaints — connect it back to how inspection quality plays a role. Don't pitch yet, just listen and empathize.",
        "branches": [
          {
            "label": "Staffing / training / turnover",
            "to": "innovation_bridge"
          },
          {
            "label": "Volume / peak season crush",
            "to": "season_pressure"
          },
          {
            "label": "Owner complaints / guest reviews",
            "to": "innovation_bridge"
          }
        ]
      },
      "season_pressure": {
        "label": "PEAK SEASON ANGLE",
        "say": "That makes sense — especially heading into summer when you're turning over the bulk of those 350-plus homes on the same Saturday. That's actually when this matters most. The companies we work with see the biggest ROI during peak because that's when the most stuff slips through and you have the least time to catch it. Would it make sense to at least see it before things ramp up, so you're not evaluating new tools in the middle of your busiest week?",
        "note": "Create urgency around OBX seasonal timing. Peak is Memorial Day through Labor Day. If you're calling in spring, this lands hard — 'before things ramp up' creates a natural deadline. If it's off-season, adjust to 'before next season.'",
        "branches": [
          {
            "label": "That makes sense / yes",
            "to": "book_meeting"
          },
          {
            "label": "We'll figure it out / not now",
            "to": "sell_test_drive"
          },
          {
            "label": "Send me something",
            "to": "obj_send_email"
          }
        ]
      },
      "innovation_bridge": {
        "label": "INNOVATION HISTORY HOOK",
        "say": "You know what's interesting — I was reading about Carolina Designs before I called, and you guys have kind of been first movers on a lot of stuff. Online booking back in '97, the switch to electrolyzed cleaning products, the EV charger program last year. This feels like it fits that same pattern — using tech to stay ahead on quality instead of waiting for the industry to catch up. Would it make sense to carve out 20 minutes so I can show you what it actually looks like on a real property?",
        "note": "This is your strongest personalization play. The innovation timeline is from their own website — it's flattering, factual, and shows real homework. You're tying RapidEye to their identity as innovators. Adjust the examples if she mentioned a specific one during discovery.",
        "branches": [
          {
            "label": "Positive / impressed you did homework",
            "to": "book_meeting"
          },
          {
            "label": "Interested but hedging",
            "to": "book_meeting"
          },
          {
            "label": "Not right now",
            "to": "sell_test_drive"
          },
          {
            "label": "Send me an email",
            "to": "obj_send_email"
          }
        ]
      },
      "obj_no_budget": {
        "label": "OBJECTION — NO BUDGET",
        "say": "Totally get it. Nowadays it's harder to keep a tool, let alone buy something new. Just so no one from my team cold calls you again — is it that budget for this year is completely spoken for, or is it more that anything new has to go through a whole approval process with ownership?",
        "note": "Agree first — never argue with a budget objection. Then split it. If she mentions Monica by name or says 'the owner decides,' that's useful intel for the referral path. If budget is truly locked, sell the test drive.",
        "branches": [
          {
            "label": "Budget is locked / no room",
            "to": "sell_test_drive"
          },
          {
            "label": "Has to go through ownership / Monica",
            "to": "sell_test_drive_approval"
          }
        ]
      },
      "sell_test_drive_approval": {
        "label": "TEST DRIVE — APPROVAL ANGLE",
        "say": "That makes total sense. Here's what I've seen work — the ops leaders who end up getting something like this approved are the ones who already know exactly what it does and can speak to it in a five-minute conversation with their owner. Would you be open to a quick look so that if budget does open up, you already know where this lands on your priority list? Worst case you steal some ideas about what other PM companies are doing with their turnover photos and we part as friends.",
        "note": "You're positioning the demo as ammunition for her to bring to Monica — not as a buying decision. This lowers the pressure and makes Michelle the internal champion.",
        "branches": [
          {
            "label": "Sure / that makes sense",
            "to": "book_meeting"
          },
          {
            "label": "Still hesitant",
            "to": "obj_send_email"
          },
          {
            "label": "No",
            "to": "graceful_exit"
          }
        ]
      },
      "obj_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "I totally get it — I should've assumed you'd be all set. Otherwise you probably would've reached out. Just so no one from my team bugs you again — is it that inspection quality isn't really a pain point for you right now, or is it more that you just hate cold calls?",
        "note": "Agree, then split. Most people will laugh at 'hate cold calls' and soften up. If quality truly isn't a pain point, respect it and exit. If it's the cold call format, you still have an opening.",
        "branches": [
          {
            "label": "Quality isn't a focus / we're good",
            "to": "graceful_exit"
          },
          {
            "label": "I hate cold calls / laughs",
            "to": "sell_test_drive"
          },
          {
            "label": "Both / just not now",
            "to": "sell_test_drive"
          }
        ]
      },
      "obj_have_process": {
        "label": "OBJECTION — HAVE A PROCESS",
        "say": "That makes total sense — with 350-plus homes and your own in-house teams, you'd have to have something solid in place. Just curious — is it that you're fully covered and happy with how things catch everything, or is it more that switching anything up right now would just be a headache?",
        "note": "Validate their process — they built it, respect it. Then split: are they truly satisfied, or is inertia the blocker? Most ops leaders will admit their process isn't perfect if you give them permission to be honest.",
        "branches": [
          {
            "label": "We're happy / it works",
            "to": "sell_test_drive"
          },
          {
            "label": "Switching is a pain / bad timing",
            "to": "sell_test_drive"
          },
          {
            "label": "Actually... it's not perfect",
            "to": "solution_and_cta"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally fair — you're probably not buying anything from a cold call today and I respect that. But here's what I've seen: the people who end up moving on something like this are the ones who already had it on their radar before they needed it. Would you be open to a quick look — not to buy anything — just so you know what's out there? If nothing else, I can walk you through what other vacation rental companies your size on the East Coast are doing with their turnover photos. Worst case you steal some ideas.",
        "note": "Maximum low pressure. You're selling information, not a product. 'Steal some ideas' makes the meeting valuable even if they never buy. 'Other vacation rental companies your size on the East Coast' is specific enough to be credible — you work with a 600-property company on the East Coast.",
        "branches": [
          {
            "label": "Fine / sure",
            "to": "book_meeting"
          },
          {
            "label": "Send me an email instead",
            "to": "obj_send_email"
          },
          {
            "label": "No / not interested",
            "to": "graceful_exit"
          }
        ]
      },
      "obj_send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair — I'll shoot something over. One quick question so it's not just another generic pitch sitting in your inbox: would it be more helpful to see what it actually looks like on a property similar to yours, or more of a quick breakdown on the ROI side — like what it saves per turnover?",
        "note": "Accept the email. The question gives you intel on what she cares about AND keeps the conversation going for 10 more seconds. Whatever she says, tailor the email to that. Include a specific meeting time suggestion in the email.",
        "branches": [
          {
            "label": "She answers the question",
            "to": "email_confirmed"
          },
          {
            "label": "Just send whatever / doesn't matter",
            "to": "email_confirmed"
          }
        ]
      },
      "email_confirmed": {
        "label": "EMAIL FOLLOW-UP LOCKED",
        "say": "Got it — I'll send that over today. And I'll throw a couple times in there in case you want to see it live. Really appreciate your time, Michelle.",
        "note": "Send the email within 30 minutes. Include: (1) what she asked for, (2) one line referencing the innovation angle ('saw Carolina Designs has been a first mover on a lot of stuff — this feels like a natural next step'), (3) a specific meeting time for next week. Subject line should be personal, not salesy — something like 'turnover photos — Carolina Designs.'",
        "branches": []
      },
      "referral_ask": {
        "label": "REFERRAL — NOT THE RIGHT PERSON",
        "say": "That's super helpful — so who on your team is the one actually in the weeds on turnover inspections day to day? Is there a housekeeping manager or quality control lead who owns that piece?",
        "note": "Michelle is VP Ops, so she may delegate inspection specifics to a housekeeping or maintenance manager. If she names someone, get the full name and ask for an intro. If she says Monica (the owner) decides on tools, pivot to referral_to_monica.",
        "branches": [
          {
            "label": "Names someone below her",
            "to": "referral_get_name"
          },
          {
            "label": "Says Monica / ownership decides",
            "to": "referral_to_monica"
          },
          {
            "label": "Says Evelyn / customer service",
            "to": "referral_get_name"
          },
          {
            "label": "Won't give a name",
            "to": "graceful_exit"
          }
        ]
      },
      "referral_to_monica": {
        "label": "REFERRAL UP TO MONICA",
        "say": "Oh got it — so Monica would be the one to greenlight something like this? Would it make sense for me to reach out to her directly, or would it be better if I sent you something first that you could pass along? I don't want to go around you.",
        "note": "Respect the hierarchy. 'I don't want to go around you' shows respect and usually earns you a warmer intro. Monica Thibodeau is the owner, has a documented innovation track record, and is the ultimate decision-maker.",
        "branches": [
          {
            "label": "Reach out to her directly",
            "to": "referral_get_name"
          },
          {
            "label": "Send me something first",
            "to": "obj_send_email"
          },
          {
            "label": "Let me talk to her first",
            "to": "referral_followup"
          }
        ]
      },
      "referral_get_name": {
        "label": "GET THE NAME + WARM INTRO",
        "say": "That's awesome — and would you be open to me mentioning that you and I connected? Just so it's not completely cold when I reach out. If I can drop your name, it'll land a lot better than another random call.",
        "note": "Always ask permission to use their name. It warms up the next call significantly. Get the person's full name, title, and best number or email to reach them.",
        "branches": [
          {
            "label": "Sure, use my name",
            "to": "referral_confirmed"
          },
          {
            "label": "Rather you didn't",
            "to": "referral_confirmed"
          }
        ]
      },
      "referral_confirmed": {
        "label": "REFERRAL LOCKED",
        "say": "Really appreciate that, Michelle. I'll put something together that's actually relevant so it lands well. Thanks for your time — enjoy the rest of your day.",
        "note": "Write down the referral name, title, whether you can use Michelle's name, and best contact method. Follow up with the referral within 24 hours while the conversation is fresh.",
        "branches": []
      },
      "referral_followup": {
        "label": "SHE'LL TALK TO MONICA FIRST",
        "say": "That would be amazing. Would it make sense for me to follow up with you next week to see what she thought? I could try you Thursday or Friday.",
        "note": "Lock in a specific callback day. Don't leave it open-ended — 'I'll follow up sometime' means you'll never hear back.",
        "branches": [
          {
            "label": "Sure, call me back",
            "to": "referral_callback_locked"
          },
          {
            "label": "I'll reach out if interested",
            "to": "graceful_exit"
          }
        ]
      },
      "referral_callback_locked": {
        "label": "CALLBACK LOCKED — REFERRAL",
        "say": "Perfect — I'll try you Thursday afternoon. Thanks again Michelle, really appreciate it.",
        "note": "Calendar this immediately. When you call back, lead with: 'Hey Michelle, it's Sam from RapidEye — you were going to chat with Monica about the inspection stuff. How'd that go?'",
        "branches": []
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome — let me lock something in so it doesn't fall through the cracks. I've got next Tuesday and Wednesday pulled up — does morning or afternoon work better for you?",
        "note": "Give two days, let her pick. Then narrow to a specific time. Send the calendar invite WHILE on the phone. Don't let her say 'I'll check my calendar and get back to you' — that's where deals die.",
        "branches": [
          {
            "label": "Picks a time",
            "to": "meeting_confirmed"
          },
          {
            "label": "Let me check my calendar / not sure",
            "to": "book_meeting_push"
          },
          {
            "label": "Just send me an email with times",
            "to": "obj_send_email"
          }
        ]
      },
      "book_meeting_push": {
        "label": "PUSH FOR TIME",
        "say": "Totally — how about I throw a hold on Wednesday at 2? If it doesn't work you can move it, but at least we've got a placeholder so it doesn't get buried.",
        "note": "Suggest a specific time. A 'hold' feels low-commitment and easy to agree to. If she agrees, send the invite immediately before the call ends.",
        "branches": [
          {
            "label": "Sure / that works",
            "to": "meeting_confirmed"
          },
          {
            "label": "Send me an email instead",
            "to": "obj_send_email"
          }
        ]
      },
      "meeting_confirmed": {
        "label": "MEETING LOCKED",
        "say": "Perfect — sending you the invite right now. Really appreciate you taking my call, Michelle. Looking forward to showing you what we've got. Have a great rest of your day.",
        "note": "STOP SELLING. You won. Send the invite immediately. Include a brief agenda in the invite body: 'Quick look at how RapidEye works with turnover photos — 20 min, no pressure.' Don't add anything else. Don't follow up with a long email. Less is more.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes, I'm easy to find. Appreciate your time, Michelle — hope you guys have a great season out there.",
        "note": "Don't burn the bridge. 'Great season' is a nice OBX-specific touch. Log the outcome, note the reason for rejection, and move on. She may come back later — many do.",
        "branches": []
      },
      "gatekeeper": {
        "label": "GATEKEEPER — SOMEONE ELSE ANSWERS",
        "say": "Hey — could you get me over to Michelle? It's Sam.",
        "note": "First name only for both. Minimal info. Sound like you're expected. Don't explain why you're calling unless asked.",
        "branches": [
          {
            "label": "Put through / hold on",
            "to": "opener"
          },
          {
            "label": "Who's calling / what company?",
            "to": "gatekeeper_context"
          },
          {
            "label": "She's not available",
            "to": "gatekeeper_not_available"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — GIVE CONTEXT",
        "say": "Yeah — Sam Parks. I work with a few other vacation rental companies in the Outer Banks area. Would you mind letting her know I'm on the line?",
        "note": "A bit more info but still not pitching. 'Other vacation rental companies in the Outer Banks' implies you're relevant and local, not random.",
        "branches": [
          {
            "label": "Put through / hold on",
            "to": "opener"
          },
          {
            "label": "What's this about?",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "She's not available",
            "to": "gatekeeper_not_available"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "We help a couple property management companies with their inspection workflows — I sent Michelle a note and just wanted to follow up real quick. Would you mind giving her a heads up?",
        "note": "Implies prior contact. 'Inspection workflows' is specific enough to sound legitimate but not salesy. End with a redirect question — you ask the questions, you control the conversation.",
        "branches": [
          {
            "label": "Put through",
            "to": "opener"
          },
          {
            "label": "She's not available",
            "to": "gatekeeper_not_available"
          },
          {
            "label": "Rejected / take a message",
            "to": "gatekeeper_not_available"
          }
        ]
      },
      "gatekeeper_not_available": {
        "label": "GATEKEEPER — NOT AVAILABLE",
        "say": "No worries — when's usually a good time to catch her? I'll try back then.",
        "note": "Get the best callback window. Don't leave a voicemail through the gatekeeper if you can avoid it — better to call back directly. If they insist on a message: 'Just let her know Sam Parks called — she'll know what it's about.'",
        "branches": [
          {
            "label": "Gives a time to call back",
            "to": "gatekeeper_callback"
          },
          {
            "label": "Won't help / just leave a voicemail",
            "to": "gatekeeper_callback"
          }
        ]
      },
      "gatekeeper_callback": {
        "label": "GATEKEEPER — CALLBACK NOTED",
        "say": "Perfect — I'll try her then. Thanks so much, I appreciate it.",
        "note": "Log the callback time. When you call back, use the same approach but reference the prior attempt: 'Hey, I tried Michelle earlier — is she around?' Sounds more familiar the second time.",
        "branches": []
      },
      "voicemail": {
        "label": "VOICEMAIL",
        "say": "Hey Michelle — it's Sam Parks with RapidEye. I work with a few vacation rental operators on the East Coast on their inspection workflows and wanted to connect with you real quick. My number is [your number]. I'll try you again in a day or two — or feel free to call me back whenever. Thanks.",
        "note": "Keep it under 20 seconds. Sound like a peer, not a vendor. Don't pitch. Don't mention AI. Try calling back at a different time of day — if you called in the morning, try afternoon next time. OBX ops leaders are often in the field mornings.",
        "branches": []
      }
    }
  }
}