{
  "name": "Michael Wolff",
  "title": "Consultant",
  "company": "Aspen Luxury Vacation Rentals (ALVR)",
  "location": "Aspen, CO",
  "phone": "",
  "company_phone": "+1-970-205-9960",
  "alt_phones": [],
  "flow": {
    "context": "Michael Wolff is a Consultant at ALVR focused on upper-tier luxury sales and rentals — not the ops or inspection decision-maker, but embedded on the team since Spring 2021 and could route you internally. ALVR is locally owned since 2003, full-service luxury vacation rental manager in Aspen with a Marriott Homes & Villas partnership and no known inspection tooling or PMS. No direct phone number found for Michael — calling via main office line (970) 205-9960. Strongest connection: Sam was just skiing in Jackson Hole a few weeks ago and Michael lives and works in Aspen ski country. Primary goal is a referral to Tricia McIntyre (ops background, daily operations experience) or Sharon Redfield (CFO, systems buyer).",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Michael — I work with a few vacation rental managers out in ski country. I was actually just skiing in Jackson Hole a couple weeks ago. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Feet-up energy. The ski line makes this feel warm and local — don't rush past it. Pause after 'tossed around' and wait for him to respond.",
        "branches": [
          {
            "label": "Yes / maybe",
            "to": "heard_yes"
          },
          {
            "label": "No / don't think so",
            "to": "heard_no"
          },
          {
            "label": "Bad timing / busy",
            "to": "bad_timing"
          },
          {
            "label": "Who is this? / confused",
            "to": "clarify_intro"
          }
        ]
      },
      "heard_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh no kidding — well normally we'd be working with someone in your world. What'd you hear?",
        "note": "Let him talk. Whatever he says, bridge into discovery or the pain trigger based on how much he knows.",
        "branches": [
          {
            "label": "Shares something / curious",
            "to": "warm_response"
          },
          {
            "label": "Vague / not sure where",
            "to": "pain_trigger"
          }
        ]
      },
      "heard_no": {
        "label": "HAVEN'T HEARD — TRANSITION",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call — I work with a couple other luxury vacation rental companies on their turnover inspection workflows, and something keeps coming up that I wanted to run by someone at ALVR. You got a quick sec?",
        "note": "Stay vague enough to earn curiosity. Don't pitch yet — just get permission to continue.",
        "branches": [
          {
            "label": "Sure / go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "I'm not really the right person for that",
            "to": "not_my_area"
          },
          {
            "label": "Not really / busy",
            "to": "permission_fallback"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again later this week? I just need a couple minutes.",
        "note": "Don't fight it. Be easy. Try to lock a specific callback window.",
        "branches": [
          {
            "label": "Sure, try me later",
            "to": "reschedule_lock"
          },
          {
            "label": "What's this about?",
            "to": "pain_trigger"
          },
          {
            "label": "No / don't call back",
            "to": "end_graceful"
          }
        ]
      },
      "clarify_intro": {
        "label": "CLARIFY WHO YOU ARE",
        "say": "Yeah sorry — Sam Parks, I'm with a company called RapidEye. We work with vacation rental managers on their property inspection workflows. I work with a few folks in ski markets and wanted to connect with someone at ALVR. Is this a decent time?",
        "note": "Stay casual. Don't over-explain. Just enough context to reset the conversation.",
        "branches": [
          {
            "label": "OK sure, go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "I'm not the right person for that",
            "to": "not_my_area"
          },
          {
            "label": "Not a good time",
            "to": "bad_timing"
          }
        ]
      },
      "reschedule_lock": {
        "label": "LOCK CALLBACK TIME",
        "say": "When's better for you — would tomorrow afternoon work, or is later this week easier?",
        "note": "Give two options so he picks one. Get a specific day and time, not just 'sometime.'",
        "branches": [
          {
            "label": "Gives a specific time",
            "to": "reschedule_confirmed"
          },
          {
            "label": "Just call whenever / vague",
            "to": "reschedule_push"
          }
        ]
      },
      "reschedule_confirmed": {
        "label": "CALLBACK CONFIRMED",
        "say": "Perfect — I'll give you a ring then. Appreciate it, Michael. Enjoy the snow out there.",
        "note": "Write down the exact time immediately. Set a reminder. Don't sell anything else.",
        "branches": []
      },
      "reschedule_push": {
        "label": "PUSH FOR SPECIFIC TIME",
        "say": "Totally — I just don't want to catch you at another bad time. Would Thursday morning work? I'll keep it super quick.",
        "note": "One gentle push for specificity. If he resists again, accept it gracefully and try back in two days.",
        "branches": [
          {
            "label": "Commits to a time",
            "to": "reschedule_confirmed"
          },
          {
            "label": "Still vague / just try me",
            "to": "end_graceful"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "So the thing I keep hearing from guys managing luxury rentals — and I imagine it's the same in Aspen — is the photo gap on turnovers. Your cleaners or inspectors snap photos after every checkout, but nobody actually has time to go through hundreds of images carefully. So stuff slips through. A guest checks into a place that's supposed to be pristine — they're paying four or five figures a night — and there's a scratch on the dining table or a missing throw pillow. Now you've got a guest complaint on a property that's supposed to be five-star, and the homeowner wants to know how it got missed. We built something that automatically catches that stuff in the photos your team's already taking — no workflow change at all. Would that even be relevant to you, or is there someone else at ALVR who owns the inspection piece?",
        "note": "PAUSE after 'how it got missed.' Let the pain sit for a beat before the solution sentence. The last question is critical — it gives him an easy path to refer you if he's not the right person, or a way to engage if he's closer to it than his title suggests.",
        "branches": [
          {
            "label": "That's interesting / tell me more",
            "to": "warm_response"
          },
          {
            "label": "I'm not really the person for that",
            "to": "not_my_area"
          },
          {
            "label": "We already have something for that",
            "to": "objection_have_process"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "warm_response": {
        "label": "THEY'RE WARM — STOP PITCHING",
        "say": "Yeah so really quick — what does turnover look like for you guys right now? Like after a guest checks out, who's actually reviewing the property condition before the next one arrives?",
        "note": "He's engaged. Switch entirely to questions and let him talk. You're learning the workflow AND figuring out who the real internal buyer is.",
        "branches": [
          {
            "label": "Describes their process",
            "to": "discovery_deeper"
          },
          {
            "label": "I'm more on the sales side honestly",
            "to": "not_my_area"
          },
          {
            "label": "Not sure / I'd have to ask",
            "to": "referral_ask"
          }
        ]
      },
      "discovery_deeper": {
        "label": "DIG INTO WORKFLOW",
        "say": "Got it. And with the Marriott Homes and Villas partnership you guys have, I imagine the bar for condition documentation is even higher than normal. Are you using any software to manage inspections right now, or is it mostly manual — like checklists and photo uploads?",
        "note": "The Marriott partnership is real pressure — use it to surface tooling gaps. Listen for any mention of Breezeway, Track, or a PMS name.",
        "branches": [
          {
            "label": "Mostly manual / no real system",
            "to": "no_tool_cta"
          },
          {
            "label": "We use a specific tool",
            "to": "existing_tool_probe"
          },
          {
            "label": "I'm not sure what we use on that side",
            "to": "referral_ask"
          }
        ]
      },
      "no_tool_cta": {
        "label": "NO TOOL — BRIDGE TO MEETING",
        "say": "Yeah that's exactly what I keep hearing. And the thing is, nobody's going to add a new step to their workflow — your cleaners are already busy enough. That's why we built this to plug into whatever photo process you already have. Would you be open to me showing this to whoever runs ops on your side? Even just fifteen minutes — worst case they steal some ideas from what other luxury managers are doing and we part as friends.",
        "note": "Don't oversell to Michael. You're asking him to connect you, not to buy. The 'steal some ideas' framing lowers the perceived commitment.",
        "branches": [
          {
            "label": "Sure, let me connect you with someone",
            "to": "referral_ask"
          },
          {
            "label": "I could take a look myself",
            "to": "book_meeting"
          },
          {
            "label": "Send me some info first",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "sell_test_drive"
          }
        ]
      },
      "existing_tool_probe": {
        "label": "THEY HAVE A TOOL",
        "say": "Oh nice — are you guys pretty happy with it? Like does it actually catch stuff, or is it more of a documentation layer where someone still has to eyeball everything?",
        "note": "Most tools in this space are checklists, not analysis. If they name Breezeway or similar, RapidEye plugs into it — that's additive, not competitive.",
        "branches": [
          {
            "label": "It works OK / we like it",
            "to": "complement_not_replace"
          },
          {
            "label": "It's alright but stuff still slips through",
            "to": "no_tool_cta"
          },
          {
            "label": "Not sure / I don't use it personally",
            "to": "referral_ask"
          }
        ]
      },
      "complement_not_replace": {
        "label": "COMPLEMENT FRAMING",
        "say": "Totally makes sense. We actually plug into tools like that — we're not replacing anything, we're just adding an AI analysis layer on top of the photos already being uploaded. A couple of our clients run Breezeway and they just turned us on alongside it. Would whoever manages that system be open to a quick look? I can keep it super specific to what you're already running.",
        "note": "Position as additive, not competitive. Kills the switching-cost fear. Then pivot to getting a referral to the person who owns the tool.",
        "branches": [
          {
            "label": "Let me connect you with the right person",
            "to": "referral_ask"
          },
          {
            "label": "Maybe — send me something first",
            "to": "send_email"
          },
          {
            "label": "Probably not right now",
            "to": "sell_test_drive"
          }
        ]
      },
      "not_my_area": {
        "label": "NOT HIS AREA",
        "say": "Totally makes sense — I figured it might be more of an ops question. Who on your team would typically own the property condition and inspection side of things? I just want to make sure I'm talking to the right person.",
        "note": "This is the most likely path for this call. He's a sales and rental consultant. Don't make him feel like you wasted his time — make it easy and natural to hand you off.",
        "branches": [
          {
            "label": "Gives a name",
            "to": "referral_got_name"
          },
          {
            "label": "Not sure / vague",
            "to": "suggest_tricia_sharon"
          },
          {
            "label": "Try the main office / general",
            "to": "suggest_tricia_sharon"
          }
        ]
      },
      "referral_ask": {
        "label": "ASK FOR REFERRAL",
        "say": "Would you happen to know who handles that side of things? If I can get a name I'll put something tailored together so it actually lands — instead of just being another random cold email to the office.",
        "note": "Ask specifically for a name. People are more likely to give one when you explain why you need it.",
        "branches": [
          {
            "label": "Gives a name",
            "to": "referral_got_name"
          },
          {
            "label": "Doesn't have a name / not sure",
            "to": "suggest_tricia_sharon"
          },
          {
            "label": "Just email the main inbox",
            "to": "suggest_tricia_sharon"
          }
        ]
      },
      "referral_got_name": {
        "label": "GOT A NAME",
        "say": "Perfect — that's really helpful. Do you know if the best way to reach them is phone or email? And hey — would it help if I mentioned you pointed me their way? Sometimes that keeps it from feeling totally out of the blue.",
        "note": "Get the contact method AND permission to name-drop Michael. Both significantly increase your odds on the next call.",
        "branches": [
          {
            "label": "Sure you can mention me",
            "to": "referral_wrap_up"
          },
          {
            "label": "Gives contact info, no name-drop",
            "to": "referral_wrap_up"
          },
          {
            "label": "I'd rather you didn't use my name",
            "to": "referral_wrap_up"
          }
        ]
      },
      "suggest_tricia_sharon": {
        "label": "SUGGEST TRICIA OR SHARON",
        "say": "No worries at all. I did see Tricia McIntyre and Sharon Redfield on your team page — would either of them be closer to the property operations or inspection side? Just want to make sure I'm reaching the right person.",
        "note": "You've done the homework — use it. Tricia is the ops fit (former daily operations). Sharon is the systems and budget fit (CFO). See who he validates.",
        "branches": [
          {
            "label": "Yeah Tricia would be good",
            "to": "confirm_tricia"
          },
          {
            "label": "Sharon handles that kind of thing",
            "to": "confirm_sharon"
          },
          {
            "label": "Mentions someone else entirely",
            "to": "referral_got_name"
          },
          {
            "label": "Not sure / try the office",
            "to": "fallback_general_referral"
          }
        ]
      },
      "confirm_tricia": {
        "label": "TRICIA CONFIRMED",
        "say": "Awesome — I'll reach out to Tricia directly. Do you know if she's easier to catch on the phone or by email? And is there anything you think would be most relevant to lead with when I talk to her?",
        "note": "Tricia is your number one target at ALVR. Squeeze every drop of intel — her preferred channel, what she cares about, how she thinks about property ops.",
        "branches": [
          {
            "label": "Gives helpful detail",
            "to": "referral_wrap_up"
          },
          {
            "label": "Not sure / just try her",
            "to": "referral_wrap_up"
          }
        ]
      },
      "confirm_sharon": {
        "label": "SHARON CONFIRMED",
        "say": "Got it — makes sense given her role with systems and finance. Do you know if she's easier to reach by phone or email? I want to keep it relevant and not waste her time.",
        "note": "Sharon is the CFO and systems person. Frame your outreach to her around cost savings, accountability reporting, and reducing claims leakage — not operational workflow.",
        "branches": [
          {
            "label": "Gives helpful detail",
            "to": "referral_wrap_up"
          },
          {
            "label": "Not sure / just try her",
            "to": "referral_wrap_up"
          }
        ]
      },
      "fallback_general_referral": {
        "label": "NO CLEAR REFERRAL",
        "say": "Totally fair. I'll try reaching out through the team page and see who's the right fit. Hey I really appreciate you taking a minute, Michael. If it ever crosses your desk, you know where to find me. Enjoy the rest of ski season out there.",
        "note": "Don't push further. He's given what he can. Follow up with Tricia and Sharon independently using their published contact info.",
        "branches": []
      },
      "referral_wrap_up": {
        "label": "REFERRAL WRAP-UP",
        "say": "Really appreciate it, Michael. I'll reach out to them and keep it super relevant. Hey enjoy the rest of ski season — if you ever need Jackson Hole recommendations, you know where to find me.",
        "note": "End warm and human. The skiing callback ties a bow on the conversation. Log the referral name, contact method, and any intel he gave immediately after hanging up.",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not relevant?",
        "note": "Self-deprecation disarms. Most people will give 30 seconds out of curiosity or basic politeness. If he says yes, go straight to the pain trigger.",
        "branches": [
          {
            "label": "OK go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "No / really can't right now",
            "to": "permission_denied"
          }
        ]
      },
      "permission_denied": {
        "label": "PERMISSION DENIED",
        "say": "Shoot — totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it more that you already have this handled and it's just not interesting?",
        "note": "Genuine split — not a trick. If it's timing you can call back. If it's fit you can pivot to a referral ask before hanging up.",
        "branches": [
          {
            "label": "It's just bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / not my area",
            "to": "last_chance_referral"
          },
          {
            "label": "Hangs up",
            "to": "end_graceful"
          }
        ]
      },
      "last_chance_referral": {
        "label": "LAST CHANCE REFERRAL",
        "say": "Totally get it. Before I let you go — is there someone on your team who'd be closer to the property inspection and operations side? I just don't want to keep bothering the wrong person.",
        "note": "Last shot at getting a name. Keep it light and genuinely respectful. If he says no, exit clean — do not push further.",
        "branches": [
          {
            "label": "Gives a name",
            "to": "referral_got_name"
          },
          {
            "label": "Try Tricia / Sharon / someone",
            "to": "suggest_tricia_sharon"
          },
          {
            "label": "No / don't know / done",
            "to": "end_graceful"
          }
        ]
      },
      "objection_not_interested": {
        "label": "NOT INTERESTED — AGREE FIRST",
        "say": "I totally get it — I should've assumed you'd already be all set. Otherwise you probably would've reached out to us, right? Just so nobody else from my team cold calls you — is it that this isn't really a problem you guys deal with, or is it more that you hate cold calls and I just caught you off guard?",
        "note": "Agree first to break the pattern. Then split the objection to figure out if it's a real no or a reaction to the interruption. His role means he might genuinely not care about inspections — that's fine, pivot to referral.",
        "branches": [
          {
            "label": "We don't really have that problem",
            "to": "sell_test_drive"
          },
          {
            "label": "I just hate cold calls / bad timing",
            "to": "bad_timing"
          },
          {
            "label": "I'm not the right person for this",
            "to": "not_my_area"
          },
          {
            "label": "Firm no",
            "to": "end_graceful"
          }
        ]
      },
      "objection_have_process": {
        "label": "ALREADY HAVE SOMETHING",
        "say": "That totally makes sense — with a luxury portfolio like yours you'd have to have something in place. Especially with the Marriott partnership, you can't wing that. Is it more that you're fully covered and happy with how it's working, or is it that switching anything right now would just be a headache?",
        "note": "The Marriott Homes & Villas partnership raises the quality bar — use it as natural pressure. You're probing whether they're genuinely happy or just locked in by inertia.",
        "branches": [
          {
            "label": "We're happy with it",
            "to": "complement_not_replace"
          },
          {
            "label": "Switching would be a pain",
            "to": "sell_test_drive"
          },
          {
            "label": "I don't really know the details on that",
            "to": "not_my_area"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Look, I'm probably not selling anybody anything today and I totally respect that. But if nothing else, I could walk whoever runs your inspections through what other luxury PM companies in ski markets are doing with their turnover photos right now. Worst case they steal some ideas and we part as friends. Would it be worth connecting me with the right person on your side?",
        "note": "Ultra low pressure. You're not asking Michael to buy — you're asking him to make an introduction. Frame the meeting as valuable even if they never purchase.",
        "branches": [
          {
            "label": "Sure, talk to [name]",
            "to": "referral_got_name"
          },
          {
            "label": "Maybe — send me something first",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "end_graceful"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome — let me lock something in so I'm not cold calling you again. I've got next Tuesday and Thursday pulled up — which one's easier for fifteen minutes?",
        "note": "Give two options, not an open question. Lock day and time NOW. Don't leave it as 'I'll follow up.'",
        "branches": [
          {
            "label": "Picks a time",
            "to": "meeting_booked"
          },
          {
            "label": "Let me check and get back to you",
            "to": "send_email"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING CONFIRMED",
        "say": "Perfect — I'll send over a calendar invite right now so it's locked in. Really appreciate you taking my call, Michael. Talk soon.",
        "note": "Send the invite WHILE on the phone if possible. Then stop selling entirely. Don't add anything. Clean exit.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair — I'll shoot something over. One quick question so it's not just another generic pitch in your inbox — would it be more useful to see what the tech actually looks like, or would a quick case study from another luxury property manager be more relevant?",
        "note": "Accept it immediately, then tailor. The question shows you care about not wasting his time and gives you intel for the follow-up.",
        "branches": [
          {
            "label": "Tells you what to include",
            "to": "email_confirm"
          },
          {
            "label": "Just send whatever",
            "to": "email_confirm"
          }
        ]
      },
      "email_confirm": {
        "label": "CONFIRM EMAIL AND PLANT FOLLOW-UP",
        "say": "Got it — I'll send that over to your ALVR email today. And if it looks interesting, would you be open to a quick call next week to walk through it? I'll throw a time in the email so you can just say yes or no.",
        "note": "Always plant the seed for a follow-up call inside the email. Include a specific day and time suggestion so responding is effortless.",
        "branches": [
          {
            "label": "Sure / sounds good",
            "to": "email_wrap_up"
          },
          {
            "label": "We'll see / maybe",
            "to": "email_wrap_up"
          }
        ]
      },
      "email_wrap_up": {
        "label": "EMAIL WRAP-UP",
        "say": "Awesome — I'll get that over to you. Appreciate your time, Michael. Enjoy the snow.",
        "note": "Send the email within 30 minutes. Reference the call, the skiing connection, include what he asked for, and a specific follow-up CTA with day and time.",
        "branches": []
      },
      "end_graceful": {
        "label": "END GRACEFULLY",
        "say": "Totally understand. If anything ever changes, I'm easy to find. Appreciate your time, Michael — enjoy the rest of ski season.",
        "note": "Don't burn the bridge. Log the outcome and any intel. Follow up with Tricia McIntyre and Sharon Redfield directly using their published contact info.",
        "branches": []
      }
    }
  }
}