{
  "name": "Mike McGoff",
  "title": "Field Operations / Maintenance (SkyRun Steamboat)",
  "company": "SkyRun (Steamboat Springs)",
  "location": "Steamboat Springs, CO",
  "phone": "+1 (970) 315-0209",
  "company_phone": "(970) 315-0209",
  "alt_phones": [
    "+1 (970) 761-0573"
  ],
  "flow": {
    "context": "Mike McGoff is on the field ops and maintenance side at SkyRun Steamboat Springs — a locally owned franchise location with roughly 36 units and only about 2 full-time staff, owned by Megan Gutschenritter. He is listed on the Steamboat Chamber Veteran-Owned Business Program alongside the SkyRun Steamboat location. SkyRun is mid-tech-stack overhaul (Track PMS, PriceLabs, RemoteLock) and explicitly promises pre-arrival inspections and preventative maintenance to every homeowner — workflows Mike likely executes or oversees daily. Skiing overlap is the strongest connection: Sam skied Jackson Hole in January 2026, and Mike lives and works in one of Colorado's premier ski towns during peak season right now.",
    "start": "gatekeeper_open",
    "nodes": {
      "gatekeeper_open": {
        "label": "GATEKEEPER — SLIDE BY",
        "say": "Hey, could you get me over to Mike? It's Sam.",
        "note": "Say it like you know him. Don't volunteer your last name or company. Short, casual, confident.",
        "branches": [
          {
            "label": "Transferred or Mike picks up",
            "to": "opener"
          },
          {
            "label": "Who's calling? What's this about?",
            "to": "gatekeeper_context"
          },
          {
            "label": "Mike's not available right now",
            "to": "gatekeeper_unavailable"
          },
          {
            "label": "We don't have a Mike here",
            "to": "gatekeeper_no_mike"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — ADD CONTEXT",
        "say": "Yeah, I work with a few other property managers in mountain markets — ski towns like Steamboat. Would you mind letting Mike know it's Sam Parks?",
        "note": "Still casual. Don't pitch. Don't explain RapidEye. Just enough to sound legitimate and local-aware.",
        "branches": [
          {
            "label": "Transferred or Mike picks up",
            "to": "opener"
          },
          {
            "label": "What company? What do you do?",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "He's not available",
            "to": "gatekeeper_unavailable"
          },
          {
            "label": "Can you send an email instead?",
            "to": "gatekeeper_email_redirect"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "Sure — I'm with RapidEye. We help a couple property management companies with their turnover inspection workflows. I sent Mike a note — would you mind just giving him a heads up that I'm on the line?",
        "note": "Last card with the gatekeeper. If they still block, pivot to getting a direct number or a callback time.",
        "branches": [
          {
            "label": "Transferred or Mike picks up",
            "to": "opener"
          },
          {
            "label": "Still won't transfer",
            "to": "gatekeeper_blocked"
          },
          {
            "label": "He's not in today",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_unavailable": {
        "label": "GATEKEEPER — MIKE UNAVAILABLE",
        "say": "No worries at all. Do you know when he's usually around? And is there a direct line or cell I can reach him on so I don't keep tying up your front desk?",
        "note": "Get a callback time AND a direct number. If they offer Megan or Tyler instead, take it — both are high-value contacts.",
        "branches": [
          {
            "label": "Gives a callback time or direct number",
            "to": "gatekeeper_got_info"
          },
          {
            "label": "Offers Megan or Tyler instead",
            "to": "opener_alternate_contact"
          },
          {
            "label": "Won't give any info",
            "to": "gatekeeper_blocked"
          }
        ]
      },
      "gatekeeper_no_mike": {
        "label": "GATEKEEPER — NO MIKE",
        "say": "Oh interesting — is this still the SkyRun Steamboat office? I might have an old list. Who handles the maintenance and field ops side of things over there?",
        "note": "Don't panic. Small teams shuffle fast. You may get pointed to Tyler Horne or Megan Gutschenritter, both of whom are valid targets.",
        "branches": [
          {
            "label": "Gives another name or redirects",
            "to": "opener_alternate_contact"
          },
          {
            "label": "Won't help",
            "to": "gatekeeper_blocked"
          }
        ]
      },
      "gatekeeper_email_redirect": {
        "label": "GATEKEEPER — ASKED TO EMAIL",
        "say": "Totally, I can do that. What's the best email for Mike specifically? I want to make sure it actually gets to him and doesn't sit in a general inbox.",
        "note": "Try to get Mike's direct email. If they only offer steamboat@skyrun.com, take it and ask how to address it so he sees it.",
        "branches": [
          {
            "label": "Gives Mike's direct email",
            "to": "gatekeeper_got_info"
          },
          {
            "label": "Only gives general inbox",
            "to": "gatekeeper_got_info"
          }
        ]
      },
      "gatekeeper_got_info": {
        "label": "GATEKEEPER — GOT INFO",
        "say": "Perfect, really appreciate that. I'll follow up with him. Thanks for the help.",
        "note": "Log the callback time, direct number, or email immediately. Call back at the exact time they gave you.",
        "branches": []
      },
      "gatekeeper_blocked": {
        "label": "GATEKEEPER — FULLY BLOCKED",
        "say": "Totally understand. Hey, could I at least leave a quick message for Mike? Just my name and number — Sam Parks — and that it's about their turnover inspection workflow. He can call me back if it makes sense.",
        "note": "Leave your number. Don't burn the bridge. You can try the alternate number (970) 761-0573 at a different time, or call back and ask for Megan or Tyler directly.",
        "branches": []
      },
      "opener_alternate_contact": {
        "label": "OPENER — ALTERNATE CONTACT",
        "say": "Oh perfect — yeah I'd love to chat with them. I work with a few property managers in mountain markets on their inspection workflows. It's Sam Parks with RapidEye. Have they heard my name tossed around at all?",
        "note": "If you get Megan (owner, controls the P&L) or Tyler (ops lead), this is actually a win. Adjust pain framing: Megan cares about cost, owner retention, liability. Tyler cares about daily headaches and process gaps.",
        "branches": [
          {
            "label": "No, haven't heard of you",
            "to": "heard_no"
          },
          {
            "label": "Yeah actually, or maybe sounds familiar",
            "to": "heard_yes"
          },
          {
            "label": "Not a good time",
            "to": "bad_timing"
          }
        ]
      },
      "opener": {
        "label": "OPENER",
        "say": "Hey Mike — I work with a few property managers in mountain markets, ski towns like Steamboat. I was actually just out in Jackson Hole in January myself. Anyway — it's Sam Parks with RapidEye. Have you heard my name tossed around?",
        "note": "Casual. The skiing connection is real — Sam was at Jackson Hole in Jan 2026. Feet up on the desk energy. Don't rush it. Let the Jackson Hole line breathe for a second.",
        "branches": [
          {
            "label": "No, who are you?",
            "to": "heard_no"
          },
          {
            "label": "Yeah, maybe, sounds familiar",
            "to": "heard_yes"
          },
          {
            "label": "I'm busy, bad time",
            "to": "bad_timing"
          },
          {
            "label": "Flat, cold, guarded tone",
            "to": "permission_fallback"
          }
        ]
      },
      "heard_no": {
        "label": "HEARD NO",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason I'm calling — I work with a couple other property managers who are in a pretty similar spot to you guys. Small team, couple dozen units, ski season turnovers flying. The thing they kept running into was the inspection side of it. You guys promise pre-arrival inspections to every owner, right?",
        "note": "Transition into pain. The pre-arrival inspection promise is publicly on SkyRun Steamboat's website. Pause after the question. Let him confirm or react before continuing.",
        "branches": [
          {
            "label": "Yeah we do, or that's right",
            "to": "pain_trigger"
          },
          {
            "label": "Who told you that? How do you know?",
            "to": "explain_research"
          },
          {
            "label": "What is this about exactly?",
            "to": "permission_fallback"
          },
          {
            "label": "I'm not really the person for this",
            "to": "referral_not_me"
          }
        ]
      },
      "heard_yes": {
        "label": "HEARD YES",
        "say": "Oh nice — well normally we'd be working with someone like you on the maintenance side. What'd you hear?",
        "note": "Let him talk. Whatever he says, bridge to the pain trigger. If vague: 'Yeah that's the gist — basically we help with the inspection piece of turnovers.'",
        "branches": [
          {
            "label": "Vague or can't remember specifics",
            "to": "pain_trigger"
          },
          {
            "label": "Knows about RapidEye or AI inspection",
            "to": "warm_discovery"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow, maybe first thing before the day gets crazy?",
        "note": "Get a specific callback time. Log it and call back exactly then. If he pushes to know what it's about, let him pull you into the pitch.",
        "branches": [
          {
            "label": "Sure, try me tomorrow or gives a time",
            "to": "book_callback"
          },
          {
            "label": "Just tell me what it's about real quick",
            "to": "pain_trigger"
          },
          {
            "label": "Don't call me again",
            "to": "end_graceful"
          }
        ]
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean, it is a cold call. Can I get 30 seconds to tell you why I reached out? And you can totally hang up on me if it's not a fit.",
        "note": "This is the reset button. Acknowledging reality disarms people. If he gives you 30 seconds, go straight into the pain trigger. Don't waste it on fluff.",
        "branches": [
          {
            "label": "Fine, go ahead, 30 seconds",
            "to": "pain_trigger"
          },
          {
            "label": "No, not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and this just isn't interesting?",
        "note": "Splitting the objection. 'Horrible time' reopens the door for a callback. 'Not interesting' is harder but at least you learn something and can pivot.",
        "branches": [
          {
            "label": "Bad time",
            "to": "bad_timing"
          },
          {
            "label": "Not interested, don't need it",
            "to": "objection_not_interested"
          },
          {
            "label": "Hangs up",
            "to": "end_graceful"
          }
        ]
      },
      "explain_research": {
        "label": "EXPLAIN HOW YOU KNOW",
        "say": "Oh yeah — it's right on SkyRun's site actually. You guys market pre-arrival inspections and preventative maintenance as part of what owners get. That's actually what caught my eye, because that's exactly the workflow we help with. Can I tell you what I mean real quick?",
        "note": "Don't be weird about knowing their business. It's all public. Showing you did homework builds credibility, especially with a hands-on field ops person.",
        "branches": [
          {
            "label": "Yeah go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "Still skeptical or guarded",
            "to": "permission_fallback"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "So here's what I keep hearing from guys in your spot. You've got a small team — maybe two, three people — and you're turning over a few dozen properties, especially right now in ski season. Cleaners finish a unit, maybe they snap some photos, maybe they don't. And then somebody on your team is supposed to do a pre-arrival walk-through before the next guest shows up. But when you're managing maintenance tickets, dealing with lock codes, handling emergencies — the inspection piece is the thing that gets squeezed. And then a guest checks in, finds a stain on the couch or a cracked tile, and suddenly it's your problem. You're the one driving out there. And the worst part is you can't prove whether that damage was from the last guest or was already there, because nobody's got clean documentation. Sound familiar at all?",
        "note": "PAUSE. Let him react. This is designed around his reality: small team, field ops role, ski season volume, SkyRun's explicit pre-arrival inspection promise, and the fact that HE is the one physically responding to property issues. The silence after this is where the call is won or lost.",
        "branches": [
          {
            "label": "Yeah that's pretty much it, laughs, agrees",
            "to": "solution_bridge"
          },
          {
            "label": "We actually have a pretty good process",
            "to": "objection_have_process"
          },
          {
            "label": "That's not really my area",
            "to": "referral_not_me"
          },
          {
            "label": "I don't have time for this",
            "to": "objection_not_interested"
          }
        ]
      },
      "solution_bridge": {
        "label": "SOLUTION — ONE SENTENCE",
        "say": "That's exactly why we built RapidEye. It's an AI that analyzes the turnover photos your team's already taking and automatically flags damage, missing items, staging issues — so instead of someone manually reviewing every photo from every unit, you get a report that says here's what's wrong, here's what changed. Plugs right into Track since you guys are on that stack. Would you be open to seeing what it looks like? Not a pitch — just a quick look when I'm not cold calling you out of the blue.",
        "note": "One sentence on solution, then the CTA. SkyRun is confirmed on Track PMS. Referencing it shows you know their setup. Keep it tight — don't start listing features.",
        "branches": [
          {
            "label": "Yeah I'd look at that, sure",
            "to": "warm_discovery"
          },
          {
            "label": "Sounds interesting but I'm not the decision maker",
            "to": "referral_interested"
          },
          {
            "label": "Send me something, email me",
            "to": "send_email"
          },
          {
            "label": "I don't think we need that",
            "to": "objection_not_interested"
          }
        ]
      },
      "warm_discovery": {
        "label": "DISCOVERY — STOP PITCHING",
        "say": "Awesome. So I don't waste your time when we do connect — what does the inspection piece look like for you guys right now? Like after a cleaner finishes a unit, what happens before the next guest checks in?",
        "note": "STOP SELLING. You are in discovery mode now. Listen for: who does inspections, what tool they use or don't, how photos are captured, what falls through the cracks. Take notes on everything.",
        "branches": [
          {
            "label": "Describes their current process",
            "to": "discovery_deeper"
          },
          {
            "label": "We don't really have a formal process",
            "to": "discovery_no_process"
          },
          {
            "label": "We use a specific tool",
            "to": "discovery_has_tool"
          }
        ]
      },
      "discovery_deeper": {
        "label": "DISCOVERY — DIG DEEPER",
        "say": "Got it. And when something does get missed — like damage shows up after a guest checks in — what does that look like for you? Are you the one going out to the property?",
        "note": "This is where the real pain surfaces. Mike is field ops — he's likely the one physically responding. Listen for: how often it happens, what it costs in time, whether it's caused owner complaints or deposit disputes.",
        "branches": [
          {
            "label": "Yeah I'm the one who goes out, describes the pain",
            "to": "bridge_to_meeting"
          },
          {
            "label": "It doesn't happen that often honestly",
            "to": "reframe_frequency"
          },
          {
            "label": "Megan handles that, or someone else does",
            "to": "referral_interested"
          }
        ]
      },
      "discovery_no_process": {
        "label": "DISCOVERY — NO FORMAL PROCESS",
        "say": "Yeah, that's super common with smaller teams — especially in-season when everything's moving fast. Honestly that's where we see the most impact, because right now someone's trying to eyeball everything and there's no system catching what gets missed. Would it make sense to loop Megan in on a quick look at this? I could show both of you what the reports look like — takes about 15 minutes.",
        "note": "No formal process is the biggest opportunity. Bring Megan in since she's the owner and budget holder. A two-person meeting with the ops guy and the owner closes way better.",
        "branches": [
          {
            "label": "Yeah I can check with Megan",
            "to": "book_meeting"
          },
          {
            "label": "I'll talk to her and get back to you",
            "to": "send_email"
          },
          {
            "label": "I don't think she'd be interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "discovery_has_tool": {
        "label": "DISCOVERY — ALREADY USING SOMETHING",
        "say": "Oh nice — what are you guys using? I'm curious because I talk to a lot of operators in mountain markets and everyone's set up a little different.",
        "note": "Find out the specific tool. If it's Resort Cleaning, TIDY, or manual checklists, there's a clear gap. If Breezeway, the angle is AI analysis on top of what they already capture. SkyRun network has been seen using Resort Cleaning and TIDY at other locations.",
        "branches": [
          {
            "label": "Names a tool like Breezeway, Resort Cleaning, TIDY",
            "to": "handle_existing_tool"
          },
          {
            "label": "Just checklists, spreadsheets, photos in a group chat",
            "to": "discovery_no_process"
          }
        ]
      },
      "handle_existing_tool": {
        "label": "EXISTING TOOL — REFRAME",
        "say": "Oh yeah, I know them. So here's the thing — tools like that are great for scheduling and checklists. But they don't actually look at the photos. Your cleaner uploads 40 photos of a unit, and someone still has to manually review all of them to spot if something's off. That's the piece we automate. We sit on top of whatever you're already using and flag the stuff that matters. It's not a replacement — it's the layer that actually catches things.",
        "note": "Position as additive, not competitive. RapidEye analyzes what existing tools collect but don't interpret. This is a crucial distinction that removes the 'switching cost' objection.",
        "branches": [
          {
            "label": "That's interesting, I see the difference",
            "to": "bridge_to_meeting"
          },
          {
            "label": "I'd have to talk to Megan about adding anything",
            "to": "referral_interested"
          },
          {
            "label": "We're pretty happy with what we have",
            "to": "objection_have_process"
          }
        ]
      },
      "reframe_frequency": {
        "label": "REFRAME — DOESN'T HAPPEN OFTEN",
        "say": "Yeah — and honestly that might be because you're good at your job and you're catching stuff manually. The question is just how much of your time is that eating. Like if the AI could flag issues before you even drive out to a property, does that free you up for the stuff that actually needs you on-site?",
        "note": "Reframe from 'things get missed' to 'your time is being spent preventing things from getting missed.' Field ops guys take pride in their work — respect that. Don't argue with his claim.",
        "branches": [
          {
            "label": "Yeah it does take a lot of time",
            "to": "bridge_to_meeting"
          },
          {
            "label": "It's just part of the job",
            "to": "test_drive"
          },
          {
            "label": "I'd have to think about it",
            "to": "send_email"
          }
        ]
      },
      "bridge_to_meeting": {
        "label": "BRIDGE TO MEETING",
        "say": "That's exactly the kind of stuff I'd want to walk you through. I can show you what the reports look like on actual turnover photos — takes about 15 minutes and you'll know pretty quick if it's useful or not. Would it make sense to loop Megan in too, or do you want to see it first yourself?",
        "note": "Give him the option to include Megan or see it solo first. Either path works. Some field ops people want to vet something before bringing it to the owner — respect that instinct.",
        "branches": [
          {
            "label": "Yeah let's include Megan",
            "to": "book_meeting"
          },
          {
            "label": "Let me see it first then I'll bring her in",
            "to": "book_meeting"
          },
          {
            "label": "Just send me something first",
            "to": "send_email"
          }
        ]
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "Totally get it. I should've assumed you'd be all set — otherwise you probably would've reached out to us. Just so nobody from my team cold calls you again — is it that inspections really aren't a pain point for you guys, or is it more that you just hate cold calls? Because honestly I get it either way.",
        "note": "Split the objection. 'Not a pain point' means pivot to a different angle or referral. 'Hate cold calls' means the door is still open via email or a softer touch.",
        "branches": [
          {
            "label": "Not a pain point, we're fine",
            "to": "test_drive"
          },
          {
            "label": "I just hate cold calls, bad timing",
            "to": "send_email"
          },
          {
            "label": "Firmly done, not interested",
            "to": "end_graceful"
          }
        ]
      },
      "objection_have_process": {
        "label": "OBJECTION — HAVE A PROCESS",
        "say": "That makes total sense — with a few dozen units you'd have to have something in place. Just out of curiosity — is it that you're fully covered and happy with how inspections work, or is it more that switching anything right now in the middle of ski season would be a headache?",
        "note": "Split the objection. 'Happy' is harder but you can still offer a benchmark look. 'Bad timing' is a solvable timing objection — ski season ends mid-April in Steamboat.",
        "branches": [
          {
            "label": "We're happy, it works fine",
            "to": "test_drive"
          },
          {
            "label": "Yeah middle of season isn't the time to change anything",
            "to": "book_future_callback"
          },
          {
            "label": "Little of both honestly",
            "to": "test_drive"
          }
        ]
      },
      "referral_not_me": {
        "label": "REFERRAL — NOT MY AREA",
        "say": "Totally fair — who on your team would be the right person for something like this? Is that more Megan's world, or is there someone else who owns the turnover and inspection workflow day to day?",
        "note": "Mike may punt to Megan (owner) or Tyler Horne (ops). Either is a great referral. Get a name AND ask if you can mention Mike pointed you their way.",
        "branches": [
          {
            "label": "Gives a name like Megan, Tyler, or other",
            "to": "referral_got_name"
          },
          {
            "label": "I don't know or won't say",
            "to": "referral_push"
          }
        ]
      },
      "referral_interested": {
        "label": "REFERRAL — INTERESTED BUT NOT DECISION MAKER",
        "say": "That makes sense. Would it make sense to loop Megan in? I could set something up with both of you — you'd know the operational side and she'd know the business side. Does she usually handle vendor decisions like this?",
        "note": "Mike is warm but doesn't have buying authority. Get him to champion a meeting that includes Megan. Two-person meetings with the ops user and the owner close way better than either alone.",
        "branches": [
          {
            "label": "Yeah let me check with her",
            "to": "book_meeting"
          },
          {
            "label": "Just reach out to her directly",
            "to": "referral_got_name"
          },
          {
            "label": "I'll pass the info along",
            "to": "send_email"
          }
        ]
      },
      "referral_got_name": {
        "label": "REFERRAL — GOT A NAME",
        "say": "Perfect — and is it cool if I mention you pointed me their way? That way it doesn't come out of left field for them. I'll put something together that's specific to what you guys are dealing with so it actually lands.",
        "note": "Always ask to use the referral's name. This turns the next call from cold to warm. Log the name and write the personalized outreach immediately after hanging up.",
        "branches": [
          {
            "label": "Yeah that's fine, go ahead",
            "to": "end_graceful_referral"
          },
          {
            "label": "I'd rather you didn't, just call them",
            "to": "end_graceful_referral"
          }
        ]
      },
      "referral_push": {
        "label": "REFERRAL — PUSH GENTLY",
        "say": "No worries. Would Megan Gutschenritter be the right person? I know she owns the Steamboat location. Or is there someone between you and her who handles the ops tooling side?",
        "note": "Use Megan's full name — you know it from research. This signals credibility and saves time. If he confirms, ask for her direct line or email.",
        "branches": [
          {
            "label": "Yeah Megan's the one, confirms",
            "to": "referral_got_name"
          },
          {
            "label": "Gives someone else",
            "to": "referral_got_name"
          },
          {
            "label": "Won't help",
            "to": "end_graceful"
          }
        ]
      },
      "test_drive": {
        "label": "TEST DRIVE — SELL THE LOOK",
        "say": "Totally respect that. You're probably not buying anything right now, and I wouldn't expect you to off a cold call. But here's what I've found — the people who end up pulling the trigger on something like this are the ones who already saw it before they needed it. If nothing else, I could show you what other mountain-market PMs are doing with their turnover photos. Worst case you steal some ideas and we part as friends. Would you be open to a quick 15-minute look, even just to see what's out there?",
        "note": "This is the value offer. Low commitment. Position it as intel gathering, not a sales pitch. The 'steal some ideas' line works well with operators who think of themselves as practical problem-solvers.",
        "branches": [
          {
            "label": "Yeah sure, I'd look at it",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "end_graceful"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next week pulled up — would Thursday work for you? Maybe like 10 AM Mountain Time, before the day gets nuts?",
        "note": "Pick a specific day and time. Don't say 'when works for you.' If he pushes back, offer one alternative. Send the calendar invite while you're still on the phone.",
        "branches": [
          {
            "label": "That works or gives a time",
            "to": "confirm_meeting"
          },
          {
            "label": "Can't do that day, suggests another",
            "to": "confirm_meeting"
          },
          {
            "label": "I need to check with Megan first",
            "to": "confirm_meeting_pending"
          }
        ]
      },
      "confirm_meeting_pending": {
        "label": "CONFIRM — CHECKING WITH MEGAN",
        "say": "Totally. How about I pencil in Thursday at 10 as a placeholder, and if Megan can't make it we'll adjust? That way it doesn't fall off the radar. I'll send you the invite — what's your best email?",
        "note": "Don't let 'I'll check with Megan' become a dead end. Lock in the placeholder. Getting the calendar invite sent is what makes this real.",
        "branches": [
          {
            "label": "Gives email, agrees to placeholder",
            "to": "end_booked"
          },
          {
            "label": "Just email me and I'll get back to you",
            "to": "send_email"
          }
        ]
      },
      "confirm_meeting": {
        "label": "CONFIRM MEETING",
        "say": "Perfect. I'll shoot you a calendar invite right now. What's your best email — is it mike at skyrun dot com, or something different?",
        "note": "Get the direct email. Lock it in with a calendar invite immediately. Once booked, STOP SELLING. Thank him and get off the phone cleanly.",
        "branches": [
          {
            "label": "Gives email or confirms",
            "to": "end_booked"
          },
          {
            "label": "Use the general steamboat@ email",
            "to": "end_booked"
          }
        ]
      },
      "end_booked": {
        "label": "MEETING BOOKED — END CALL",
        "say": "Sent. Really appreciate you taking my call, Mike — especially in the middle of ski season. Talk to you then.",
        "note": "Short and clean. Don't keep selling. Don't add new info. Don't recap. Smile, say goodbye, send the invite immediately.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One thing before I do — what would be most useful to include? Like would it be more helpful to see what the actual inspection reports look like on real turnover photos, or more of a quick overview of how it connects to Track and fits into your current workflow?",
        "note": "Ask ONE qualifying question so the follow-up email is tailored, not generic. Whatever he picks, send that plus a specific time suggestion for a call. Get his direct email if possible.",
        "branches": [
          {
            "label": "Gives a preference or tells you what to send",
            "to": "send_email_get_address"
          },
          {
            "label": "Just send whatever, doesn't care",
            "to": "send_email_get_address"
          }
        ]
      },
      "send_email_get_address": {
        "label": "GET EMAIL ADDRESS",
        "say": "Got it. And what's the best email for you directly? I want to make sure it hits your inbox, not a shared one.",
        "note": "Push for a direct email. If he only gives steamboat@skyrun.com, take it but put his name in the subject line so whoever monitors it routes it to him.",
        "branches": [
          {
            "label": "Gives direct email",
            "to": "end_email"
          },
          {
            "label": "Use the steamboat@ address",
            "to": "end_email"
          }
        ]
      },
      "end_email": {
        "label": "END — EMAIL FOLLOW-UP",
        "say": "Perfect — I'll get that over to you today. I'll throw a couple time options in there in case you want to put 15 minutes on the calendar. Appreciate your time, Mike.",
        "note": "Send the email within 30 minutes. Include: the specific thing he asked for, one short paragraph of context, a calendar scheduling link with a specific day and time. Subject line should reference Steamboat or something from the conversation so it doesn't look mass-generated.",
        "branches": []
      },
      "book_callback": {
        "label": "BOOK A CALLBACK",
        "say": "Perfect. I'll hit you at that time. Is this the best number, or is there a direct line I should use so I don't go through the front desk again?",
        "note": "Log the exact callback time. Get a direct number if possible. Main line is (970) 315-0209, alternate is (970) 761-0573. When you call back, open with: 'Hey Mike, it's Sam Parks — you told me to try you back around now.'",
        "branches": [
          {
            "label": "Gives a time or direct number",
            "to": "end_callback"
          },
          {
            "label": "Just call the main number",
            "to": "end_callback"
          }
        ]
      },
      "book_future_callback": {
        "label": "BOOK FUTURE — POST SEASON",
        "say": "That's totally fair — middle of season is the worst time to change anything. When does ski season wind down for you guys? Like mid-April? What if I circle back then when things calm down and you've actually got headspace for it?",
        "note": "Steamboat ski season typically runs through mid-April. Get a specific month or timeframe. Put it on your calendar immediately with full context notes so the follow-up call is warm.",
        "branches": [
          {
            "label": "Yeah call me in April or May, gives a timeframe",
            "to": "end_callback"
          },
          {
            "label": "I don't know, just email me",
            "to": "send_email"
          }
        ]
      },
      "end_callback": {
        "label": "END — CALLBACK SCHEDULED",
        "say": "Done. I'll hit you up then. Enjoy the rest of ski season, Mike — appreciate it.",
        "note": "Log the callback with full context. Set a calendar reminder. When you call back, reference this conversation specifically.",
        "branches": []
      },
      "end_graceful": {
        "label": "END — GRACEFUL EXIT",
        "say": "Totally understand. If anything changes on your end, I'm easy to find — Sam Parks, RapidEye. Appreciate your time, Mike.",
        "note": "Don't burn the bridge. Log the outcome. You can try Megan or Tyler on a separate call attempt using the same main number or the alternate (970) 761-0573.",
        "branches": []
      },
      "end_graceful_referral": {
        "label": "END — GOT REFERRAL",
        "say": "Really appreciate it, Mike. I'll reach out to them and keep it relevant. Enjoy the rest of the season out there.",
        "note": "Immediately after hanging up: draft personalized outreach to the referred contact. If Mike gave permission, open with 'Mike McGoff pointed me your way.' Call within 24 hours while it's fresh. If referred to Megan, reframe pain around owner P&L, damage liability, and owner retention.",
        "branches": []
      }
    }
  }
}