{
  "name": "Nolan Walker",
  "title": "Revenue Manager; Business Development",
  "company": "Steamboat Lodging Company",
  "location": "Steamboat Springs, CO",
  "phone": "",
  "company_phone": "(970) 457-4785",
  "alt_phones": [],
  "flow": {
    "context": "Nolan Walker is Revenue Manager and Business Development lead at Steamboat Lodging Company — ~50+ luxury vacation rentals in Steamboat Springs, CO, acquired by Continuum Management Group in 2022. He spans both Colorado brands (Steamboat + Winter Park) and influences tech and ops standardization decisions. They run Streamline, Akia, Slack, and Google Workspace with no confirmed inspection photo tool, and they explicitly promise owners post-clean inspections and damage cost coverage — real financial exposure without solid documentation. Nolan's a fly fisherman who's been in Steamboat since 2015; Sam founded a fishing club in high school. Lead with fishing.",
    "start": "gatekeeper_initial",
    "nodes": {
      "gatekeeper_initial": {
        "label": "GATEKEEPER — SLIDE BY",
        "say": "Hey — could you get me over to Nolan? It's Sam.",
        "note": "SLC's main line (970-457-4785) routes to Vacation Planners / guest experience. Keep it casual. Sound like you know Nolan. Don't volunteer anything else.",
        "branches": [
          {
            "label": "Transferred to Nolan",
            "to": "opener"
          },
          {
            "label": "Asks who's calling / what it's regarding",
            "to": "gatekeeper_context"
          },
          {
            "label": "Says he's not available / not in",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — GIVE CONTEXT",
        "say": "Yeah — I work with a few other property managers out in the mountain towns. Would you mind letting Nolan know it's Sam Parks?",
        "note": "Don't pitch. Don't explain RapidEye. Dose a little more info and redirect. Stay relaxed.",
        "branches": [
          {
            "label": "Transferred to Nolan",
            "to": "opener"
          },
          {
            "label": "Pushes back / asks more",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "Says he's unavailable",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "Totally fair — we help a couple property management companies with their inspection workflows. I sent Nolan a note, just wanted to give him a heads up. Would you mind passing that along?",
        "note": "Last attempt. If they won't transfer, get Nolan's direct line or best time to reach him. Don't burn the gatekeeper — you may need them again.",
        "branches": [
          {
            "label": "Transferred to Nolan",
            "to": "opener"
          },
          {
            "label": "Offers voicemail or callback info",
            "to": "gatekeeper_voicemail"
          },
          {
            "label": "Flat refusal",
            "to": "gatekeeper_dead_end"
          }
        ]
      },
      "gatekeeper_unavailable": {
        "label": "GATEKEEPER — UNAVAILABLE",
        "say": "No worries at all. Do you know when he's usually around? I'll try him back. And is there a direct line I should use so I'm not bugging you guys every time?",
        "note": "Get a specific callback time and direct number if possible. Write it down. Be warm — this person will remember you next time you call.",
        "branches": [
          {
            "label": "Gives callback time or direct number",
            "to": "gatekeeper_voicemail"
          },
          {
            "label": "Won't give info",
            "to": "gatekeeper_dead_end"
          }
        ]
      },
      "gatekeeper_voicemail": {
        "label": "VOICEMAIL / CALLBACK PLAN",
        "say": "Perfect, I appreciate that. I'll try him back then. Thanks for your help.",
        "note": "Log the callback time. Do NOT leave a voicemail on the first attempt — call back at the suggested time instead. After 2 failed attempts, leave a brief VM: 'Hey Nolan, it's Sam Parks — I work with a few PM companies on their inspection workflows. Thought it'd be worth a quick conversation. I'll try you again Thursday.'",
        "branches": []
      },
      "gatekeeper_dead_end": {
        "label": "GATEKEEPER — DEAD END",
        "say": "Totally understand. Appreciate you. Have a good one.",
        "note": "Don't push further. Try calling back at a different time (early morning or end of day bypasses gatekeepers). Also consider reaching Nolan through David Taylor on the Owner Team as an alternate path in.",
        "branches": []
      },
      "opener": {
        "label": "OPENER — FISHING CONNECTION",
        "say": "Hey Nolan — this might be a weird way to start a call, but I saw you're into fly fishing up in Steamboat. I actually started a fishing club back in high school and I've been dying to get out on the Yampa. Anyway — it's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Smile. Sound like you're calling someone you loosely know. Feet-up-on-desk energy. The fishing line is genuine — if he bites and wants to talk fishing, chat for 15 seconds then transition: 'Well the reason I'm calling...' Don't rush past it.",
        "branches": [
          {
            "label": "Yes / thinks he's heard of RapidEye",
            "to": "heard_yes"
          },
          {
            "label": "No / hasn't heard of you",
            "to": "heard_no"
          },
          {
            "label": "Caught at a bad time / in a rush",
            "to": "bad_timing"
          },
          {
            "label": "Skeptical / 'What is this about?'",
            "to": "permission_fallback"
          }
        ]
      },
      "heard_yes": {
        "label": "HEARD YES — EXPLORE",
        "say": "Oh nice — well usually we'd be working with someone in your spot. What'd you hear?",
        "note": "Let him talk. He might be confusing you with someone else — that's fine. Whatever he says, bridge into: 'Yeah that's in the right ballpark. The reason I wanted to reach you specifically...' then go to pain trigger.",
        "branches": [
          {
            "label": "Shares what he heard / asks questions",
            "to": "pain_trigger"
          },
          {
            "label": "Vague / not sure where he heard it",
            "to": "pain_trigger"
          }
        ]
      },
      "heard_no": {
        "label": "HEARD NO — TRANSITION TO REASON",
        "say": "Ha — well I guess I'm not as popular as I thought. Well the reason for my call is —",
        "note": "Say this with a smile in your voice. Self-deprecating, light. Flow straight into the pain trigger without a long pause.",
        "branches": [
          {
            "label": "Continue",
            "to": "pain_trigger"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING — SCHEDULE CALLBACK",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow? Or is there a better day this week?",
        "note": "Get a specific day and time. Don't accept 'sure, whenever.' Pin it: 'How about Thursday around 10? That way I'm not guessing.' If he gives a time, log it and call exactly then.",
        "branches": [
          {
            "label": "Gives a time / agrees to callback",
            "to": "gatekeeper_voicemail"
          },
          {
            "label": "Not interested at all",
            "to": "permission_rejected"
          },
          {
            "label": "Actually gives you a few minutes now",
            "to": "pain_trigger"
          }
        ]
      },
      "permission_fallback": {
        "label": "PERMISSION — ASK FOR 30 SECONDS",
        "say": "Yeah totally — I mean it is a cold call, I'll be honest with you. Can I get 30 seconds to tell you why I reached out, and if it's not relevant you can totally hang up on me?",
        "note": "Admitting it's a cold call actually builds trust. If he gives you 30 seconds, go straight to pain trigger and be concise — you promised 30 seconds.",
        "branches": [
          {
            "label": "Gives permission / 'Sure, go ahead'",
            "to": "pain_trigger"
          },
          {
            "label": "Rejects / 'Not interested'",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED — SPLIT",
        "say": "Shoot — totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it more that you already know what we do and it's just not interesting?",
        "note": "This is a save attempt, not a push. 'Horrible time' reopens the callback path. 'Not interesting' opens the door to clarify what you actually do. Give him two doors.",
        "branches": [
          {
            "label": "Bad timing — try again later",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / knows enough",
            "to": "sell_test_drive"
          },
          {
            "label": "Hard no / hangs up",
            "to": "graceful_exit"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER — THE PROBLEM",
        "say": "So I've been working with another property manager in a pretty similar setup to you guys — luxury portfolio, around 50 homes, full-service, big promise to owners that they'll catch damage and keep everything guest-ready between stays. Their problem was that post-clean inspections were happening, photos were getting taken, but nobody actually had time to review all of them carefully. Stuff would slip through — scuffed hardwood, a missing throw, staging slightly off — and it'd turn into a guest complaint or an owner calling upset. And the kicker was they were covering damage costs for owners, same as you guys do, but they couldn't even prove when something happened because the photo documentation was basically a mess. We built a tool that analyzes the turnover photos your team's already taking and automatically flags damage, missing items, staging issues — plugs right into your existing workflow. Would you be open to taking a look at that when I'm not cold calling you out of the blue?",
        "note": "PAUSE after 'out of the blue.' Let Nolan respond. The damage coverage promise is SLC's real financial exposure — he knows this as Revenue Manager. If he reacts to any specific part (photos, damage costs, owner complaints), follow that thread. Do NOT keep pitching after the CTA.",
        "branches": [
          {
            "label": "Interested / asks questions / 'Tell me more'",
            "to": "warm_response"
          },
          {
            "label": "Not interested / we're all set",
            "to": "objection_not_interested"
          },
          {
            "label": "No budget / not buying right now",
            "to": "objection_no_budget"
          },
          {
            "label": "We already have something for that",
            "to": "objection_have_vendor"
          }
        ]
      },
      "warm_response": {
        "label": "WARM — STOP PITCHING, START ASKING",
        "say": "Appreciate that, Nolan. I'm curious — what does your inspection process look like right now after cleans? Are your guys taking photos through Streamline or is it something separate?",
        "note": "You know they're on Streamline. Naming it shows you did homework and builds instant credibility. Listen for: what tool captures photos, whether inspections are a dedicated step or part of cleaning, who reviews photos, and what falls through the cracks.",
        "branches": [
          {
            "label": "Describes their current process",
            "to": "discovery_deep"
          },
          {
            "label": "Surprised you know about Streamline / asks how you know",
            "to": "discovery_streamline_react"
          },
          {
            "label": "Says it's not really his area / someone else handles it",
            "to": "referral_ask"
          }
        ]
      },
      "discovery_deep": {
        "label": "DISCOVERY — DIG INTO PROCESS",
        "say": "Got it. And when your team's doing those post-clean inspections and staging checks — who's actually reviewing the photos? Is that someone in the office, or is it more on the Property Care guys to flag stuff in the moment?",
        "note": "You're mapping their workflow. SLC goes cleaners → inspectors/stagers → Property Care → office. Find where the bottleneck is. If nobody reviews photos systematically, that's the gap. If someone does but it takes forever, that's also the gap. Tailor your pitch to wherever the pain lives.",
        "branches": [
          {
            "label": "Office reviews / someone triages photos",
            "to": "discovery_volume"
          },
          {
            "label": "Field team flags in real-time / no formal photo review",
            "to": "discovery_volume"
          },
          {
            "label": "Admits it's a weak spot / things slip through",
            "to": "book_meeting"
          }
        ]
      },
      "discovery_streamline_react": {
        "label": "STREAMLINE REACTION — BUILD CREDIBILITY",
        "say": "Ha — yeah, I do my homework. I know you guys are running Streamline with Akia on the guest messaging side. One thing I keep hearing from other Streamline shops is that the task modules are great for scheduling cleans and checklists, but the actual photo review piece — catching real issues in those images — that's where stuff falls through. Is that something you've run into?",
        "note": "Naming their exact stack (Streamline + Akia) signals you're not a generic caller. You're positioning as someone who understands their world. If he confirms the gap, bridge to booking. If he pushes back, ask what they do differently.",
        "branches": [
          {
            "label": "Confirms — photo review is a gap",
            "to": "book_meeting"
          },
          {
            "label": "Says they handle it differently",
            "to": "discovery_deep"
          },
          {
            "label": "Impressed but cautious / wants to know more",
            "to": "discovery_volume"
          }
        ]
      },
      "discovery_volume": {
        "label": "DISCOVERY — SCALE PRESSURE",
        "say": "Makes sense. And you guys have grown from what, around 40 homes to over 50 now — as you keep adding properties through biz dev, how are you thinking about scaling that inspection piece? Does it just mean hiring more people, or are you looking at ways to make it more efficient?",
        "note": "This hits Nolan's biz dev role directly. Every new property he signs adds inspection load to the operations team. If he mentions Continuum's centralization or standardization across brands, that's a huge opening — the tool could serve both Steamboat and Winter Park portfolios.",
        "branches": [
          {
            "label": "Mentions growth challenge / scaling concern",
            "to": "continuum_thread"
          },
          {
            "label": "Says they have it handled",
            "to": "sell_test_drive"
          },
          {
            "label": "Mentions Continuum / Winter Park standardization",
            "to": "continuum_thread"
          }
        ]
      },
      "continuum_thread": {
        "label": "CONTINUUM / MULTI-BRAND ANGLE",
        "say": "That's actually really interesting — because if there's a world where this works for both the Steamboat and Winter Park portfolios, that's a much bigger impact with basically the same ramp-up. We've seen that with other multi-brand operators — once you prove it out with one team, rolling it to the next is plug and play. Would it make sense to loop in whoever's thinking about ops standardization at Continuum, or does that decision sit with you for the Colorado brands?",
        "note": "You know Nolan spans both CO brands and Continuum centralizes ops support. If he owns the decision, book the meeting. If someone at Continuum corporate needs involvement, get that name — it's a door into the entire portfolio, not just Colorado.",
        "branches": [
          {
            "label": "He can evaluate / owns the decision",
            "to": "book_meeting"
          },
          {
            "label": "Someone at Continuum needs to be involved",
            "to": "referral_continuum"
          },
          {
            "label": "Not ready to involve anyone else yet",
            "to": "sell_test_drive"
          }
        ]
      },
      "referral_continuum": {
        "label": "REFERRAL — CONTINUUM CONTACT",
        "say": "Totally makes sense — who on the Continuum side would be the right person to loop in? I'd rather put something tailored together for them than just send a generic pitch that goes nowhere.",
        "note": "Get a specific name and title. If he gives you someone at Continuum corporate, that's a door into the entire multi-brand portfolio. Ask if Nolan would make an intro or if you should reach out cold and mention his name.",
        "branches": [
          {
            "label": "Gives a name / offers to intro",
            "to": "book_meeting"
          },
          {
            "label": "Vague / not sure who exactly",
            "to": "book_meeting"
          },
          {
            "label": "Doesn't want to refer up",
            "to": "sell_test_drive"
          }
        ]
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "Totally get it. I probably should've assumed you'd be all set — otherwise you would've reached out to us. Just so nobody on my team cold calls you again — is it that this isn't really a problem you're focused on right now, or is it more that you just hate cold calls? Honestly either one's fair.",
        "note": "Agree first, then split. 'Not a problem' opens the door to reframe around what he IS focused on. 'Hate cold calls' is actually easier — the product might be fine, the channel is the issue. Offer email as an alternative.",
        "branches": [
          {
            "label": "Not a priority right now / focused on other things",
            "to": "sell_test_drive"
          },
          {
            "label": "Hates cold calls / prefers email",
            "to": "send_email"
          },
          {
            "label": "Genuinely not a fit",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_no_budget": {
        "label": "OBJECTION — NO BUDGET",
        "say": "Totally get it. Especially post-acquisition — I'm sure every dollar gets a lot of scrutiny through Continuum. Just so no one from my team bugs you again — is it that budget for this kind of thing is completely locked down, or is it more that anything new you want to try puts you through the ringer with approvals?",
        "note": "The Continuum/acquisition reference shows you understand their corporate reality. 'Locked down' = potentially a true dead end for now, but you can still sell the test drive for future budget cycles. 'Approval ringer' = there IS budget, the process is painful — pilot framing works.",
        "branches": [
          {
            "label": "Budget is fully locked / no room",
            "to": "sell_test_drive"
          },
          {
            "label": "Approval process is painful / takes forever",
            "to": "sell_test_drive"
          },
          {
            "label": "Hard no",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_have_vendor": {
        "label": "OBJECTION — HAVE A VENDOR",
        "say": "That makes total sense — with 50-plus properties you'd have to have something in place. Is it that you're fully covered and happy with how it's working, or is it more that switching anything right now would be a headache you don't need?",
        "note": "Listen carefully for which tool they name. If it's Breezeway, Properly, Turno, or a Streamline built-in module — those handle task management and checklists, NOT photo analysis. RapidEye doesn't replace them, it layers on top. That distinction is critical.",
        "branches": [
          {
            "label": "Happy with current tool / names a specific tool",
            "to": "sell_test_drive_vendor"
          },
          {
            "label": "Not thrilled / switching is the real issue",
            "to": "sell_test_drive"
          },
          {
            "label": "Hard pass",
            "to": "graceful_exit"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Look — you're probably not buying anything from a cold call, and I totally respect that. But if nothing else, I could walk you through what a couple other PM companies in the mountain markets are doing with their turnover photos. Worst case you steal some ideas and we part as friends. Would you be open to 20 minutes sometime this week or next?",
        "note": "You're selling the meeting, not the product. The value is the peer intel — what similar operators are doing. That's worth 20 minutes even if he never buys. If he says yes, lock it in immediately. If he says 'send me something first,' accept it gracefully.",
        "branches": [
          {
            "label": "Open to a meeting",
            "to": "book_meeting"
          },
          {
            "label": "Send me an email first",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "graceful_exit"
          }
        ]
      },
      "sell_test_drive_vendor": {
        "label": "SELL TEST DRIVE — THEY HAVE A VENDOR",
        "say": "Totally fair. And just so you know — we're not trying to replace whatever you're using for task management or checklists. We actually layer on top of tools like that. We just analyze the photos that are already being captured and flag what humans miss. But I don't need to pitch you on that right now. Would you be open to a quick look so you can see the difference? Even just to benchmark what you've got against what's possible with AI on those photos.",
        "note": "Key reframe: RapidEye is additive, not a replacement. If they use Breezeway or Streamline tasks, those handle scheduling and checklists — RapidEye handles what's IN the photos. This removes the switching-cost objection entirely.",
        "branches": [
          {
            "label": "Open to seeing it",
            "to": "book_meeting"
          },
          {
            "label": "Send info first",
            "to": "send_email"
          },
          {
            "label": "Still not interested",
            "to": "graceful_exit"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next week pulled up — how does Tuesday or Wednesday look for you? I'm thinking 20 minutes, mid-morning your time.",
        "note": "Offer two specific days. Don't say 'when works for you' — that creates decision fatigue. Send the calendar invite while still on the phone. If he hesitates: 'I'll shoot the invite now and if something comes up, just move it — zero pressure.'",
        "branches": [
          {
            "label": "Agrees to a time",
            "to": "meeting_booked"
          },
          {
            "label": "Wants to check calendar / get back to you",
            "to": "send_email"
          },
          {
            "label": "Changed his mind / not ready",
            "to": "sell_test_drive"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING BOOKED — CLOSE WARM",
        "say": "Perfect — I'll shoot that invite over right now. And seriously, I appreciate you taking a cold call. If you do get out on the Yampa this season, let me know — I'll be out in Colorado at some point. Talk soon, Nolan.",
        "note": "Stop selling immediately. Send the invite within 60 seconds. Add a brief personalized note in the invite body referencing something specific from the call. The fishing callback makes the ending human and memorable.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL — ACCEPT AND QUALIFY",
        "say": "Totally fair. One question before I do — what would be most useful to include so it actually lands and doesn't just sit in your inbox? Like, would a quick case study from a similar-sized mountain market operator be helpful, or is it more about seeing how it plugs into Streamline specifically?",
        "note": "This question does two things: (1) it tells you what Nolan actually cares about, and (2) it makes the email feel requested, not generic. Whatever he says, include that exact thing. Send within 1 hour with a specific meeting time suggestion at the end.",
        "branches": [
          {
            "label": "Tells you what to include",
            "to": "send_email_close"
          },
          {
            "label": "Just send whatever / generic",
            "to": "send_email_close"
          }
        ]
      },
      "send_email_close": {
        "label": "EMAIL CLOSE",
        "say": "Got it — I'll get that over to you today. And Nolan, I appreciate the time. If you ever need a fishing buddy when I'm out in Steamboat, you know where to find me.",
        "note": "Send within 1 hour. Include: (1) the specific content he asked for, (2) a 2-sentence summary of what RapidEye does, (3) two specific meeting time options, (4) a brief fishing reference to stay memorable. Follow up in 3 business days if no reply. Subject line should reference something from the call, not a generic pitch subject.",
        "branches": []
      },
      "referral_ask": {
        "label": "REFERRAL — NOT HIS AREA",
        "say": "Totally makes sense — I figured with your revenue and biz dev focus this might sit with someone else day-to-day. Who on your team typically owns the inspection and turnover quality piece? Would that be David Taylor, or someone else?",
        "note": "You know David Taylor is Owner Relations Manager and likely closer to daily inspection ops. Dropping his name shows you know the org and earns credibility. If Nolan confirms David or names someone else, get the intro.",
        "branches": [
          {
            "label": "Confirms David / gives a name",
            "to": "referral_get_name"
          },
          {
            "label": "Not sure / vague answer",
            "to": "referral_get_name"
          },
          {
            "label": "Actually he is the right person after all",
            "to": "warm_response"
          }
        ]
      },
      "referral_get_name": {
        "label": "REFERRAL — GET THE INTRO",
        "say": "Perfect. Would you be cool if I mentioned your name when I reach out to them? I'd rather it land as a warm intro than another random cold call. And if there's a direct line or email, that'd save me from bugging your front desk again.",
        "note": "Get: (1) the person's full name and title, (2) direct contact info if possible, (3) permission to use Nolan's name. If he offers to make the intro himself, that's gold — accept immediately and follow up same day.",
        "branches": [
          {
            "label": "Gives name + info / offers to make intro",
            "to": "referral_close"
          },
          {
            "label": "Says just call the main line and ask",
            "to": "referral_close"
          }
        ]
      },
      "referral_close": {
        "label": "REFERRAL — CLOSE AND THANK",
        "say": "Really appreciate that, Nolan. I'll reach out to them and put something specific together so it actually makes sense for how you guys operate. And hey — if anything crosses your desk on the revenue or biz dev side where better inspection data would help, I'm easy to find. Enjoy the rest of your day.",
        "note": "Call the referral the same day or next morning while Nolan's name is fresh. Open with: 'Hey [name], Nolan Walker suggested I reach out — it's Sam Parks with RapidEye.' That changes the call from cold to warm instantly. Also add Nolan to a 60-day check-in so you stay on his radar.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand, Nolan. If anything changes, I'm easy to find. Appreciate you taking the call — enjoy the rest of your season up there.",
        "note": "Don't burn this bridge. Nolan is connected across Continuum's multi-brand portfolio and has been in Steamboat since 2015 — he knows everyone. Add him to a 90-day follow-up. Send a LinkedIn connection request with a short personal note about fishing, not a pitch. Next touch should be value-driven (industry insight, article, peer data), not another ask.",
        "branches": []
      }
    }
  }
}