{
  "name": "Patrick L. Avinger",
  "title": "CFO, Associate Broker",
  "company": "Young's Suncoast Realty & Vacation Rentals",
  "location": "Gulf Shores, AL",
  "phone": "+1-251-968-2826",
  "company_phone": "+1-251-968-7158",
  "alt_phones": [],
  "flow": {
    "context": "Patrick Avinger is CFO and Associate Broker at Young's Suncoast Realty & Vacation Rentals — a 250+ unit vacation rental and property management company in Gulf Shores, AL with 50 years of history. As CFO he controls the budget and is the ROI gatekeeper for any new tools. The company explicitly brands itself around thorough post-clean property inspections via Property Care Specialists and runs an in-house maintenance team with 10 preventative visits per year and 24/7 emergency coverage. No known use of Breezeway or Matterport. If Patrick isn't the operational decision-maker, referral targets are Jordan Bodenhamer (Qualifying Broker / Director of Biz Dev, hands-on ops background) or David Bodenhamer (Partner/Owner). Sam's best angle is industry and geographic proximity — working with other Gulf Coast vacation rental operators on inspection workflows.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Patrick — I work with a couple other vacation rental companies along the Gulf Coast. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Feet-up energy. Sound like you're calling someone you were told to call. Pause and let him answer. Don't rush past the question.",
        "branches": [
          {
            "label": "No, I haven't",
            "to": "heard_no"
          },
          {
            "label": "Yeah / maybe / sounds familiar",
            "to": "heard_yes"
          },
          {
            "label": "Now's not a good time",
            "to": "bad_timing"
          },
          {
            "label": "Who is this? / What's this about?",
            "to": "permission_fallback"
          }
        ]
      },
      "heard_no": {
        "label": "HASN'T HEARD OF SAM",
        "say": "Oh — guess I'm not as popular as I thought. Well, the reason for my call is — I've been working with a few other property managers running two-fifty-plus units in beach markets, and one thing that keeps coming up is how much money slips through the cracks on damage between turnovers. Stuff that doesn't get caught in inspection photos, security deposit windows close, and suddenly the owner's asking why their couch has a tear nobody flagged. We built a tool that plugs into whatever you're already using for inspections and catches that stuff automatically with AI — no workflow change. Would you be open to taking a look when I'm not cold calling you out of the blue?",
        "note": "Patrick is the CFO — lead with the financial pain: money slipping through cracks, deposit windows closing, owner complaints. Pause after 'nobody flagged.' Let him react before you pitch the solution.",
        "branches": [
          {
            "label": "Sure / tell me more",
            "to": "discovery_cfo"
          },
          {
            "label": "We already have a process for that",
            "to": "objection_have_process"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          },
          {
            "label": "We don't have budget for that",
            "to": "objection_no_budget"
          },
          {
            "label": "Send me an email",
            "to": "objection_send_email"
          },
          {
            "label": "That's not really my area / someone else handles that",
            "to": "referral_redirect"
          }
        ]
      },
      "heard_yes": {
        "label": "HAS HEARD OF SAM",
        "say": "Oh nice — well normally we'd be working with someone in your position. What'd you hear?",
        "note": "Rare but great. Let him talk. Whatever he says, bridge to discovery.",
        "branches": [
          {
            "label": "Tells you what they heard",
            "to": "discovery_cfo"
          },
          {
            "label": "I haven't really / was being polite",
            "to": "heard_no"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow or later this week?",
        "note": "Don't push. Just lock in a callback window. Keep it light.",
        "branches": [
          {
            "label": "Sure, try me [day/time]",
            "to": "callback_locked"
          },
          {
            "label": "What's this about first?",
            "to": "heard_no"
          },
          {
            "label": "No, don't call back",
            "to": "end_graceful"
          }
        ]
      },
      "callback_locked": {
        "label": "CALLBACK LOCKED",
        "say": "Perfect — I'll try you then. Appreciate it, Patrick.",
        "note": "Write down the exact day and time immediately. Set a reminder. Don't oversell on the way out.",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call. Can I get thirty seconds to tell you why I reached out, and you can totally hang up on me if it's not a fit?",
        "note": "Disarm by owning the cold call. Most people will give you 30 seconds out of curiosity once you've been honest about it.",
        "branches": [
          {
            "label": "Sure, go ahead",
            "to": "heard_no"
          },
          {
            "label": "No / not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and this just isn't interesting?",
        "note": "Give him a face-saving way to re-engage. Most people pick 'bad timing' which reopens the door.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / don't call again",
            "to": "end_graceful"
          },
          {
            "label": "What do you do exactly?",
            "to": "heard_no"
          }
        ]
      },
      "discovery_cfo": {
        "label": "DISCOVERY — CFO ANGLE",
        "say": "Appreciate that. So — you guys are doing the post-clean inspections with your Property Care Specialists, right? I'm curious, when damage does get missed between turnovers, how does that typically surface on the financial side? Is it the owner calling you, or do you catch it internally first?",
        "note": "You KNOW they do post-clean inspections from their website — use that specificity to show you've done homework. Patrick is CFO so route toward financial impact: chargebacks, deposit disputes, owner retention. Let him talk.",
        "branches": [
          {
            "label": "Owners catch it / it's a problem",
            "to": "discovery_deep_financial"
          },
          {
            "label": "We catch most of it internally",
            "to": "discovery_deep_process"
          },
          {
            "label": "It's not really a big issue for us",
            "to": "minimize_handle"
          },
          {
            "label": "Someone else handles that / I'm not close to ops",
            "to": "referral_redirect"
          }
        ]
      },
      "discovery_deep_financial": {
        "label": "DEEP DISCOVERY — FINANCIAL IMPACT",
        "say": "Yeah, that's exactly what I hear from other CFOs in this space. When the owner catches it first, it's a totally different conversation than when you flag it proactively. How many units are you guys at now — still around two-fifty?",
        "note": "Validate his pain, then get him talking about scale. You already know the answer is roughly 250+ but asking builds rapport and gets him engaged. The bigger the number, the stronger your case.",
        "branches": [
          {
            "label": "Confirms ~250+ and keeps talking",
            "to": "bridge_to_meeting"
          },
          {
            "label": "Gives a number but seems guarded",
            "to": "bridge_to_meeting"
          },
          {
            "label": "Asks what you actually do",
            "to": "solution_pitch"
          }
        ]
      },
      "discovery_deep_process": {
        "label": "DEEP DISCOVERY — PROCESS",
        "say": "That's solid — a lot of companies your size can't say that. What does the actual workflow look like? Are your inspectors uploading photos into a system, or is it more of a visual walkthrough and move on?",
        "note": "He says they catch it — dig into HOW. If it's manual review, that's your opening. If it's a tool, find out which one. At 250+ units the volume is always the problem even if they won't admit it yet.",
        "branches": [
          {
            "label": "Photos into a system / we use a tool",
            "to": "tech_stack_probe"
          },
          {
            "label": "Visual check / manual / clipboard",
            "to": "manual_process_bridge"
          },
          {
            "label": "Not sure on the details",
            "to": "referral_redirect"
          }
        ]
      },
      "tech_stack_probe": {
        "label": "TECH STACK PROBE",
        "say": "Got it — and is anyone actually reviewing all of those photos, or is it more like they exist in case there's a dispute later?",
        "note": "This is the photo fatigue question. At 250+ units nobody is reviewing every photo from every turnover. That gap is exactly what RapidEye fills. Let him answer honestly.",
        "branches": [
          {
            "label": "Nobody reviews them all / it's a lot",
            "to": "bridge_to_meeting"
          },
          {
            "label": "We have a team that reviews them",
            "to": "bridge_to_meeting_light"
          },
          {
            "label": "Good question / I'm not sure",
            "to": "referral_redirect"
          }
        ]
      },
      "manual_process_bridge": {
        "label": "MANUAL PROCESS — BRIDGE TO VALUE",
        "say": "That's actually really common at companies your size. The thing I keep hearing is — the inspections happen, the cleaners are good, but at two-fifty-plus units you can't catch everything visually. Especially the stuff that changes gradually — wear on furniture, small wall damage, things that add up over a season. That's exactly what we automate. Would you be open to a fifteen-minute look so I can show you what it actually catches?",
        "note": "Bridge from their manual process to RapidEye's value. 'What it actually catches' is more compelling than 'a demo.' Keep it short.",
        "branches": [
          {
            "label": "Sure / could be interesting",
            "to": "book_meeting"
          },
          {
            "label": "Maybe, but send me something first",
            "to": "objection_send_email"
          },
          {
            "label": "We're fine with our process",
            "to": "objection_have_process"
          },
          {
            "label": "I'd need to loop someone else in",
            "to": "referral_include"
          }
        ]
      },
      "minimize_handle": {
        "label": "THEY MINIMIZE THE PROBLEM",
        "say": "That's great — honestly, with fifty years of operations you guys probably have a tighter handle on this than most. Out of curiosity though — when something does slip through, what's the typical dollar amount you're eating? I ask because one of the PMs I work with in a similar beach market thought the same thing, and when they actually tracked it, it was about eight to twelve grand a month in unrecovered damage across three hundred units.",
        "note": "Don't argue. Validate their 50-year track record — it's their pride. Then introduce a peer benchmark with a specific dollar figure. The number should make him curious enough to do his own math.",
        "branches": [
          {
            "label": "Hmm, I don't know the exact number",
            "to": "bridge_to_meeting"
          },
          {
            "label": "We track it and it's not that bad",
            "to": "bridge_to_meeting_light"
          },
          {
            "label": "Still not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "solution_pitch": {
        "label": "ONE-SENTENCE SOLUTION",
        "say": "Yeah — so in a nutshell, we built an AI that looks at the photos your team is already taking during turnovers and flags damage, missing items, staging issues — automatically. No new hardware, no new workflow, it just plugs into whatever system you're using. The PMs I work with are catching stuff their inspectors were missing, and recovering damage costs they used to eat.",
        "note": "One breath. Don't go deeper unless he asks. Then pivot to CTA or discovery.",
        "branches": [
          {
            "label": "That's interesting / tell me more",
            "to": "discovery_cfo"
          },
          {
            "label": "What does it cost?",
            "to": "pricing_deflect"
          },
          {
            "label": "We'd need to talk to ops about that",
            "to": "referral_redirect"
          },
          {
            "label": "Send me info",
            "to": "objection_send_email"
          }
        ]
      },
      "pricing_deflect": {
        "label": "PRICING QUESTION",
        "say": "Totally fair question — it depends on unit count and what you're integrating with, but for a company your size it's usually a fraction of what you'd recover in damage costs. Honestly the best way to answer that is a fifteen-minute call where I can show you the actual ROI math based on your numbers. Would you be open to that this week or next?",
        "note": "Don't quote a price on a cold call. Reframe pricing as ROI and bridge to the meeting. Patrick is a CFO — he'll respect the ROI framing more than a raw number.",
        "branches": [
          {
            "label": "Sure, let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "Just give me a ballpark",
            "to": "pricing_push"
          },
          {
            "label": "Send me the info",
            "to": "objection_send_email"
          }
        ]
      },
      "pricing_push": {
        "label": "PRICING PUSH",
        "say": "I hear you — I don't want to throw out a number without context because it'd be meaningless. What I can tell you is we're not enterprise pricing — we work mostly with independent operators in the hundred to five hundred unit range. The math usually works out to pennies per turnover. But the real number that matters is what you're losing right now in unrecovered damage. That's what I'd walk you through. Fair enough?",
        "note": "Hold the line. Don't quote a price. Redirect to the meeting. 'Pennies per turnover' gives him enough to know it's not crazy without anchoring a number.",
        "branches": [
          {
            "label": "Alright, let's talk",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "objection_send_email"
          },
          {
            "label": "Not right now",
            "to": "sell_test_drive"
          }
        ]
      },
      "bridge_to_meeting": {
        "label": "BRIDGE TO MEETING",
        "say": "Yeah — so that's exactly why I called. At two-fifty-plus units, no one's reviewing every photo from every turnover. What we do is automate that — AI looks at every image and flags what's off. No extra work for your team. Would you be open to a quick fifteen minutes this week? I can show you what it looks like on real properties.",
        "note": "Keep it tight. He's warm — don't oversell. Go straight to the CTA. If he wants to include ops people, that's even better.",
        "branches": [
          {
            "label": "Sure / sounds good",
            "to": "book_meeting"
          },
          {
            "label": "I'd want to include someone from ops",
            "to": "referral_include"
          },
          {
            "label": "Send me info first",
            "to": "objection_send_email"
          },
          {
            "label": "Not right now / we're busy",
            "to": "sell_test_drive"
          }
        ]
      },
      "bridge_to_meeting_light": {
        "label": "BRIDGE TO MEETING — LIGHTER TOUCH",
        "say": "Look, I'm not gonna pretend I know your operation better than you do — you've been at this a lot longer than I have. What I can tell you is the other PMs I work with along the Gulf Coast all thought they had it covered too, until they saw what the AI was flagging that their teams weren't. Would you be open to fifteen minutes just to see it? If it's not relevant, I'll be the first to tell you.",
        "note": "He's skeptical but not hostile. Use peer proof and low-commitment CTA. 'I'll be the first to tell you' lowers his guard and builds trust.",
        "branches": [
          {
            "label": "Sure, why not",
            "to": "book_meeting"
          },
          {
            "label": "Maybe — who else on the Gulf Coast?",
            "to": "social_proof_handle"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          },
          {
            "label": "Send me something",
            "to": "objection_send_email"
          }
        ]
      },
      "social_proof_handle": {
        "label": "SOCIAL PROOF QUESTION",
        "say": "I can't name names without their permission — you'd appreciate that if you were on their end — but I can tell you we're working with companies in beach markets running anywhere from two hundred to six hundred units. Similar setup to you — in-house maintenance, post-clean inspections, the whole nine. That's actually why your name came up.",
        "note": "Don't fabricate names. Be honest about confidentiality — a CFO will respect that. 'Your name came up' creates intrigue without being dishonest.",
        "branches": [
          {
            "label": "Fair enough / let's talk",
            "to": "book_meeting"
          },
          {
            "label": "Still not sure",
            "to": "sell_test_drive"
          }
        ]
      },
      "objection_have_process": {
        "label": "OBJECTION — HAVE A PROCESS",
        "say": "That makes total sense — with two-fifty-plus properties you'd have to have something dialed in. I wouldn't expect anything less from a company that's been at this for fifty years.",
        "note": "Agree first. Compliment their track record genuinely. Then pause and let them respond before moving to the split.",
        "branches": [
          {
            "label": "(Pause — let them respond)",
            "to": "process_split"
          }
        ]
      },
      "process_split": {
        "label": "SPLIT — PROCESS OBJECTION",
        "say": "Just so I know — is it that you're fully covered and there's genuinely zero gap in what gets caught between turnovers, or is it more that what you have works well enough and changing anything right now would just be a headache?",
        "note": "Most people will admit there's a gap or that switching is the real issue. If they say 'works well enough,' that's your opening — 'well enough' isn't 'great.'",
        "branches": [
          {
            "label": "There's always room for improvement / some gap",
            "to": "sell_test_drive"
          },
          {
            "label": "We're fully covered / no gap",
            "to": "sell_test_drive_light"
          },
          {
            "label": "Switching would be a headache",
            "to": "no_switch_handle"
          }
        ]
      },
      "no_switch_handle": {
        "label": "NO SWITCHING HEADACHE",
        "say": "Totally get that — and the good news is we're not replacing anything you're using. We plug into your existing workflow. Your team keeps doing exactly what they're doing, and we just layer on top. That's actually why PMs like it — there's literally nothing to switch. Would you be open to a quick look just to see how it works?",
        "note": "Key differentiator: RapidEye doesn't replace their process, it augments it. No workflow change means no switching cost. This is the strongest rebuttal for 'switching is a headache.'",
        "branches": [
          {
            "label": "Sure / I'd look at that",
            "to": "book_meeting"
          },
          {
            "label": "Send me info",
            "to": "objection_send_email"
          },
          {
            "label": "Not right now",
            "to": "sell_test_drive"
          }
        ]
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "I totally get it. I should've assumed you'd be all set — otherwise you probably would've reached out to us.",
        "note": "Agree and lower your status slightly. Creates a pattern interrupt — he expects you to push back. Pause and let him respond.",
        "branches": [
          {
            "label": "(Pause — let them respond)",
            "to": "interest_split"
          }
        ]
      },
      "interest_split": {
        "label": "SPLIT — INTEREST OBJECTION",
        "say": "Just so nobody from my team cold calls you again — is it that catching damage between turnovers genuinely isn't a problem you guys deal with, or is it more that you just hate cold calls and I caught you off guard?",
        "note": "Most people will admit to the cold call thing. That reopens the conversation with the pressure off.",
        "branches": [
          {
            "label": "I just hate cold calls / bad timing",
            "to": "sell_test_drive"
          },
          {
            "label": "It's genuinely not a problem",
            "to": "sell_test_drive_light"
          },
          {
            "label": "Both / just not interested",
            "to": "end_graceful"
          }
        ]
      },
      "objection_no_budget": {
        "label": "OBJECTION — NO BUDGET",
        "say": "Totally get it. Nowadays it's harder to keep a tool, let alone buy something new.",
        "note": "Agree. Don't argue budget with a CFO — he knows his numbers better than you. Pause and let him respond, then move to the split.",
        "branches": [
          {
            "label": "(Pause — let them respond)",
            "to": "budget_split"
          }
        ]
      },
      "budget_split": {
        "label": "SPLIT — BUDGET OBJECTION",
        "say": "Just curious — is it that budget for this kind of thing is completely locked for the year, or is it more that anything new has to go through a pretty serious approval process with the partners?",
        "note": "If it's the approval process, you can help him build the internal case. If budget is truly locked, sell the test drive so he's ready when it opens. Mentioning 'the partners' shows you know the org structure.",
        "branches": [
          {
            "label": "Budget is locked / end of year",
            "to": "sell_test_drive"
          },
          {
            "label": "Approval process / would need to run it by David or Jordan",
            "to": "approval_handle"
          },
          {
            "label": "We just don't spend on stuff like this",
            "to": "sell_test_drive_light"
          }
        ]
      },
      "approval_handle": {
        "label": "APPROVAL PROCESS HANDLE",
        "say": "That's exactly why it'd make sense to take a look now — the people who end up buying this are the ones who already know what's on their list when budget opens up. If I could show you and the team the ROI math — what it costs versus what you'd recover in damage — that's usually what gets it through. Would you and maybe Jordan or David be open to a quick fifteen minutes?",
        "note": "Name-drop Jordan Bodenhamer and David Bodenhamer naturally — they're the operational and ownership decision-makers Patrick would logically loop in. CFOs respond to 'ROI math' framing.",
        "branches": [
          {
            "label": "Sure, let me check with them",
            "to": "book_meeting_with_referral"
          },
          {
            "label": "Let me talk to them first and get back to you",
            "to": "objection_send_email"
          },
          {
            "label": "Not right now",
            "to": "sell_test_drive"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Look — you're probably not buying anything right now, and I totally respect that. But if nothing else, I could walk you through what other property management companies in Gulf Coast beach markets are doing with their turnover photos to recover damage costs. Worst case you steal some ideas and we part as friends. Would you be open to fifteen minutes this week?",
        "note": "Low-pressure value offer. Frame the meeting as valuable even if he never buys. 'Steal some ideas and part as friends' is disarming for a CFO who's used to being sold to.",
        "branches": [
          {
            "label": "Alright, sure",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "objection_send_email"
          },
          {
            "label": "No thanks / not right now",
            "to": "end_graceful"
          }
        ]
      },
      "sell_test_drive_light": {
        "label": "TEST DRIVE — LAST ATTEMPT",
        "say": "Totally fair. If anything changes — especially heading into summer when your turnover volume spikes — I'm easy to find. Would it be alright if I shot you a quick email with some context so you have it if it ever becomes relevant?",
        "note": "Gulf Shores peak season is summer. Plant the seed for seasonal pain when turnover volume and damage risk are highest. Get permission to email so you have a follow-up path.",
        "branches": [
          {
            "label": "Sure, send it over",
            "to": "confirm_email"
          },
          {
            "label": "No thanks",
            "to": "end_graceful"
          }
        ]
      },
      "objection_send_email": {
        "label": "OBJECTION — SEND ME AN EMAIL",
        "say": "Totally fair. One question before I do — what would be most relevant to include so it's not just another generic pitch sitting in your inbox?",
        "note": "Don't just accept 'send me an email' and hang up. Ask what matters to HIM. His answer tells you what he actually cares about and gives you intel for the email.",
        "branches": [
          {
            "label": "Gives direction (pricing, ROI, case study, etc.)",
            "to": "confirm_email_tailored"
          },
          {
            "label": "Just send whatever / general info",
            "to": "confirm_email"
          }
        ]
      },
      "confirm_email_tailored": {
        "label": "CONFIRM EMAIL — TAILORED",
        "say": "Perfect — I'll put that together and send it to pavinger at youngssuncoast dot com. And just so it doesn't get buried — would it be crazy if I suggested we block fifteen minutes next week to walk through it live? That way you can ask questions instead of reading a PDF.",
        "note": "Confirm the email address, then make one more run at the meeting. Having his confirmed email gives you a follow-up path regardless of the answer.",
        "branches": [
          {
            "label": "Sure, let's book it",
            "to": "book_meeting"
          },
          {
            "label": "Let me read the email first",
            "to": "end_email_sent"
          },
          {
            "label": "No, just the email",
            "to": "end_email_sent"
          }
        ]
      },
      "confirm_email": {
        "label": "CONFIRM EMAIL — GENERAL",
        "say": "Got it — I'll send something over to pavinger at youngssuncoast dot com. I'll include what we're seeing with other beach-market PMs on damage recovery — figured that'd be the most relevant for someone in your seat. If anything jumps out, just hit reply. Appreciate your time, Patrick.",
        "note": "Confirm email address aloud. Tailor the email to his CFO lens — ROI, damage recovery dollars, not feature lists. Include a specific meeting time suggestion in the email. Follow up in 3 business days.",
        "branches": []
      },
      "end_email_sent": {
        "label": "END — EMAIL FOLLOW-UP",
        "say": "Sounds good — I'll get that over to you today. Appreciate the time, Patrick.",
        "note": "Send the email within 30 minutes. Include a specific day and time suggestion for a follow-up call in the email body. Follow up in 3 business days if no reply.",
        "branches": []
      },
      "referral_redirect": {
        "label": "REFERRAL — NOT HIS AREA",
        "say": "That's helpful to know. Who on your team would typically own the inspection or turnover workflow? Would that be more on Jordan's side or someone in ops?",
        "note": "Name-drop Jordan Bodenhamer casually since she's the Qualifying Broker and Director of Biz Dev with hands-on property management background. If he gives you David Bodenhamer or a property manager name like DeAnn Duhon or Linda Tresler, take it.",
        "branches": [
          {
            "label": "Yeah, Jordan would be the one",
            "to": "referral_jordan"
          },
          {
            "label": "Talk to David / the Bodenhamers",
            "to": "referral_david"
          },
          {
            "label": "Gives another name (DeAnn, Linda, etc.)",
            "to": "referral_other"
          },
          {
            "label": "I'm not sure / figure it out yourself",
            "to": "referral_ask_general"
          }
        ]
      },
      "referral_jordan": {
        "label": "REFERRAL — JORDAN BODENHAMER",
        "say": "Perfect — would you mind if I mentioned you pointed me her way? And honestly, would it make sense to include you on the call too since you'd be the one evaluating the financial side anyway?",
        "note": "Try to keep Patrick looped in — he's the budget holder. Having him on the call with Jordan makes the meeting far more productive and decision-ready.",
        "branches": [
          {
            "label": "Sure, include me",
            "to": "book_meeting_with_referral"
          },
          {
            "label": "Just reach out to her directly",
            "to": "referral_contact_info"
          },
          {
            "label": "Let me check with her first",
            "to": "end_referral_pending"
          }
        ]
      },
      "referral_david": {
        "label": "REFERRAL — DAVID BODENHAMER",
        "say": "Makes sense — David's been running things there a long time. Would you mind if I mentioned your name when I reach out? And same question — would it make sense to loop you in since you'd be looking at the financial side anyway?",
        "note": "David is the partner/owner-operator. Same play — try to keep Patrick on the meeting invite so you have the CFO and the owner together.",
        "branches": [
          {
            "label": "Sure, include me",
            "to": "book_meeting_with_referral"
          },
          {
            "label": "Just call David directly",
            "to": "referral_contact_info"
          },
          {
            "label": "Let me talk to him first",
            "to": "end_referral_pending"
          }
        ]
      },
      "referral_other": {
        "label": "REFERRAL — OTHER NAME",
        "say": "Awesome — and what's their role? I just want to make sure I put something relevant together so it actually lands with them and doesn't waste their time.",
        "note": "Get the name, role, and ideally a direct number or email. Then ask if Patrick should be included on the call too as the financial decision-maker.",
        "branches": [
          {
            "label": "Gives name and role",
            "to": "referral_contact_info"
          },
          {
            "label": "Vague / doesn't want to share more",
            "to": "end_referral_pending"
          }
        ]
      },
      "referral_ask_general": {
        "label": "REFERRAL — GENERAL ASK",
        "say": "No worries — typically it'd be whoever oversees property inspections or the turnover process. Maybe one of the property managers? If I can get a name I'll put something tailored together so it actually lands and doesn't waste their time.",
        "note": "Guide him to think about who manages inspections operationally. DeAnn Duhon (Crystal Tower PM) or Linda Tresler (Boardwalk PM) are strong candidates. Accept any name he gives.",
        "branches": [
          {
            "label": "Gives a name",
            "to": "referral_contact_info"
          },
          {
            "label": "I'll have someone reach out to you",
            "to": "end_referral_pending"
          },
          {
            "label": "Just call the main office",
            "to": "end_referral_pending"
          }
        ]
      },
      "referral_contact_info": {
        "label": "GET REFERRAL CONTACT INFO",
        "say": "Perfect — do you have a direct number or email for them? I want to make sure I reach out the right way and mention you sent me their direction.",
        "note": "Lock down the contact info before hanging up. Then try to book a joint meeting if possible. If he won't give info, you already have Jordan's numbers and David's numbers from research.",
        "branches": [
          {
            "label": "Gives contact info",
            "to": "book_meeting_with_referral"
          },
          {
            "label": "Just call the office / look them up",
            "to": "end_referral_pending"
          }
        ]
      },
      "referral_include": {
        "label": "WANTS TO INCLUDE OPS PEOPLE",
        "say": "Love that — who would make sense to pull in? I want to make sure we're covering the right stuff for the right people.",
        "note": "He's warm AND wants to involve ops people. This is ideal — get the names and book a group meeting. He's pre-selling internally for you.",
        "branches": [
          {
            "label": "Jordan / David / names someone specific",
            "to": "book_meeting_with_referral"
          },
          {
            "label": "Let me figure that out and get back to you",
            "to": "objection_send_email"
          }
        ]
      },
      "book_meeting_with_referral": {
        "label": "BOOK MEETING — WITH REFERRAL",
        "say": "Great — I've got next week pulled up. What day works best for you and the team? I can do morning or afternoon — just need about fifteen minutes.",
        "note": "Lock in a day and time NOW. Don't leave it open-ended. Send the calendar invite while on the phone and include Patrick plus the referral name on the invite.",
        "branches": [
          {
            "label": "Gives a day/time",
            "to": "meeting_booked"
          },
          {
            "label": "I'll check schedules and get back to you",
            "to": "calendar_pin_referral"
          }
        ]
      },
      "calendar_pin_referral": {
        "label": "PIN CALENDAR — REFERRAL",
        "say": "Totally — I'll shoot you an email at pavinger at youngssuncoast dot com with a couple time options. If one works for the group, just click accept and forward it to whoever needs to be on. Sound good?",
        "note": "Don't let him off without a concrete follow-up path. Send calendar options within 10 minutes of hanging up. Include a brief agenda so whoever he forwards it to knows what it's about.",
        "branches": [
          {
            "label": "Sounds good",
            "to": "end_email_sent"
          },
          {
            "label": "Sure",
            "to": "end_email_sent"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome — I've got next week pulled up. How's Tuesday or Wednesday afternoon look? Just need about fifteen minutes.",
        "note": "Pick specific days. Lock it in NOW. Don't say 'whenever works for you.' Send the invite while still on the phone.",
        "branches": [
          {
            "label": "Gives a day/time",
            "to": "meeting_booked"
          },
          {
            "label": "Let me check my calendar and get back to you",
            "to": "calendar_pin"
          }
        ]
      },
      "calendar_pin": {
        "label": "PIN THE CALENDAR",
        "say": "Totally — I'll shoot you an email at pavinger at youngssuncoast dot com with a couple time options. If one works, just click accept. Sound good?",
        "note": "Don't let him off without a follow-up mechanism. Send calendar invite options within 10 minutes of hanging up.",
        "branches": [
          {
            "label": "Sounds good",
            "to": "end_email_sent"
          },
          {
            "label": "Sure",
            "to": "end_email_sent"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING BOOKED",
        "say": "Perfect — I'll send the invite over right now. Really appreciate you taking my call, Patrick. Talk to you then.",
        "note": "STOP SELLING. Send the calendar invite immediately. Prep the ROI math before the meeting — he's a CFO, come with hard numbers on damage recovery and cost per turnover. Include any referral names on the invite.",
        "branches": []
      },
      "end_referral_pending": {
        "label": "END — REFERRAL PENDING",
        "say": "Appreciate that, Patrick. I'll keep an eye out — and if it's easier, they can reach me directly. I'll shoot you a quick email with my info so you have it. Thanks for your time.",
        "note": "Send a follow-up email within 30 minutes. Include context for whoever he's referring you to so he can forward it easily. Follow up in 2-3 business days. You already have Jordan's direct numbers (251-948-0408, 251-223-7564) and David's (251-968-2820, 251-979-1020) from research if he doesn't follow through.",
        "branches": []
      },
      "end_graceful": {
        "label": "END — GRACEFUL",
        "say": "Totally understand. If anything changes — especially heading into summer season — I'm easy to find. Appreciate your time, Patrick.",
        "note": "Don't burn the bridge. Gulf Shores peak season is summer when turnover volume and damage risk spike. Log the call, note his objections, and set a follow-up reminder for 60-90 days or pre-summer outreach.",
        "branches": []
      }
    }
  }
}