{
  "name": "Randy Walker",
  "title": "CEO / Founder",
  "company": "Dunes Properties / Charleston Coast Vacations",
  "location": "Charleston, SC",
  "phone": "+1-888-250-8730",
  "company_phone": "800-476-8444",
  "alt_phones": [
    "+1-800-476-8444",
    "+1-843-881-5600",
    "+1-800-476-8444"
  ],
  "flow": {
    "context": "Randy Walker is the founder and CEO of Dunes Properties / Charleston Coast Vacations — a 35-year-old Charleston-area company with ~183 beach vacation rentals across Folly Beach, Isle of Palms, Wild Dunes, Sullivan's Island, and Kiawah. Critical operational fact: they explicitly do NOT employ cleaners or maintenance staff — everything is outsourced to third-party vendors, making quality verification between turns a structural handoff problem. They run on TrackHS as their PMS, which RapidEye integrates with directly. In March 2025, Randy stayed on as CEO while appointing Layne Kipp as COO with an explicit mandate around 'operational excellence and company-wide efficiencies.' Trustpilot sits at 2.1/5 with recurring guest complaints about property condition and cleanliness. Sam's strongest angle: RapidEye plugs directly into Track with zero workflow change, they already work with similar-sized coastal PM companies, and Sam's surfing background gives natural rapport with someone who built a career around beach properties.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Randy — I've been working with a few other vacation rental managers along the Charleston coast, and your name keeps coming up. It's Sam Parks with RapidEye. Have you heard my name tossed around?",
        "note": "Feet up energy. Don't rush it. Pause after the question and let him answer. You're not selling yet — you're just a guy who's heard his name.",
        "branches": [
          {
            "label": "Yes / maybe",
            "to": "heard_name_yes"
          },
          {
            "label": "No / who?",
            "to": "heard_name_no"
          },
          {
            "label": "Bad timing / busy",
            "to": "bad_timing"
          },
          {
            "label": "Gatekeeper or assistant answers",
            "to": "gatekeeper_initial"
          }
        ]
      },
      "heard_name_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone in your role. What'd you hear?",
        "note": "Let them talk. Whatever they say, use it to steer into the pain trigger or straight to discovery if they're already warm.",
        "branches": [
          {
            "label": "Describes what they heard / asks what you do",
            "to": "pain_trigger"
          },
          {
            "label": "They're curious and open",
            "to": "warm_response"
          }
        ]
      },
      "heard_name_no": {
        "label": "HAVEN'T HEARD THE NAME",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call is —",
        "note": "Keep it light, self-deprecating. Transition immediately into the pain trigger. Don't linger here.",
        "branches": [
          {
            "label": "They're listening",
            "to": "pain_trigger"
          },
          {
            "label": "They push back / 'what is this about'",
            "to": "permission_fallback"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again later this week? Maybe Thursday or Friday?",
        "note": "Respect their time. Get a specific callback window. Don't try to squeeze in a pitch right now.",
        "branches": [
          {
            "label": "Gives a time / says fine",
            "to": "bad_timing_lock"
          },
          {
            "label": "Says don't call back",
            "to": "end_graceful"
          },
          {
            "label": "Actually go ahead — what's up?",
            "to": "pain_trigger"
          }
        ]
      },
      "bad_timing_lock": {
        "label": "LOCK CALLBACK",
        "say": "Perfect — I'll try you then. Appreciate it, Randy.",
        "note": "Write down the exact day and time. Add it to your calendar immediately. This is a warm callback now — don't forget it.",
        "branches": []
      },
      "gatekeeper_initial": {
        "label": "GATEKEEPER — SLIDE BY",
        "say": "Hey — could you get me through to Randy? It's Sam.",
        "note": "Say it like you know him. First name only for both of you. Don't offer details unless asked. Pause and wait.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Asks who you are / what it's about",
            "to": "gatekeeper_context"
          },
          {
            "label": "He's not available",
            "to": "gatekeeper_voicemail"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — CONTEXT",
        "say": "Yeah — I work with a few other vacation rental companies in the Charleston area. Would you mind letting him know it's Sam Parks?",
        "note": "Don't pitch the gatekeeper. Don't explain RapidEye. Just dose information one piece at a time and end with a redirect question.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Pushes harder / what company",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "He's not available / take a message",
            "to": "gatekeeper_voicemail"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "Totally — it's Sam Parks with RapidEye. We help a couple other property management companies with their inspection workflows. I actually sent him a note already — would you mind giving him a heads up that I called?",
        "note": "This is your last push. If they still block, ask for the best time to call back or ask if Liz Bernthal or Layne Kipp would be better to reach.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Takes a message / says to email",
            "to": "gatekeeper_redirect"
          },
          {
            "label": "Suggests someone else",
            "to": "referral_transition"
          }
        ]
      },
      "gatekeeper_voicemail": {
        "label": "GATEKEEPER — UNAVAILABLE",
        "say": "Got it — is there a better time to catch him? Also, would Liz Bernthal or Layne Kipp be someone I should try in the meantime?",
        "note": "Try to get a callback window AND a secondary contact. Liz is VP Vacation Rentals, Layne is the new COO. Both are strong alternates.",
        "branches": [
          {
            "label": "Gives a time",
            "to": "bad_timing_lock"
          },
          {
            "label": "Transfers to Liz or Layne",
            "to": "opener"
          },
          {
            "label": "Dead end",
            "to": "gatekeeper_redirect"
          }
        ]
      },
      "gatekeeper_redirect": {
        "label": "GATEKEEPER — LEAVE TRAIL",
        "say": "No worries at all. I'll shoot him an email at rwalker@dunesproperties.com — and if he mentions it, just let him know Sam Parks called. Appreciate your help.",
        "note": "Confirm the email if they react. You're planting the seed so when you call back your name has been heard. Send a short tailored email immediately after hanging up.",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call, I'll be honest. Can I get 30 seconds to tell you why I reached out? And you can totally hang up on me if it's not a fit.",
        "note": "Disarming honesty. Most people will give you 30 seconds if you acknowledge the cold call. Smile through it.",
        "branches": [
          {
            "label": "Fine, go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "No / not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and it's just not interesting?",
        "note": "This split question often reopens the conversation. If it's timing you get a callback. If it's disinterest you learn why and might get a referral.",
        "branches": [
          {
            "label": "It's just bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / don't need it",
            "to": "not_interested"
          },
          {
            "label": "Actually, what do you do?",
            "to": "pain_trigger"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER — THE PROBLEM",
        "say": "So I work with another vacation rental company in a pretty similar spot to you guys — about 200 beach properties, and they outsource all their cleaning to third-party crews, same model as you. The thing that kept burning them was this: cleaner finishes a turn, marks the unit ready, and nobody's actually verifying that before the guest walks in. So a guest shows up, there's a stain on the sofa or a broken screen door or towels missing — and now it's a review problem, an owner phone call, sometimes a refund. They were basically running blind between when the cleaner left and when the guest arrived. Especially across multiple beach markets with different crews at each one.",
        "note": "PAUSE HERE. Let Randy react. Do NOT rush to the solution. The outsourced vendor model is HIS model — he chose it deliberately. This should hit home. If he engages with the problem go to warm_response. If he objects handle it.",
        "branches": [
          {
            "label": "Yeah that's real / we deal with that",
            "to": "warm_response"
          },
          {
            "label": "Asks what you do / how you solve it",
            "to": "solution_and_cta"
          },
          {
            "label": "We've got that handled",
            "to": "has_process"
          },
          {
            "label": "Not interested / not a priority",
            "to": "not_interested"
          },
          {
            "label": "We don't have budget for that",
            "to": "no_budget"
          }
        ]
      },
      "warm_response": {
        "label": "THEY'RE WARM — STOP PITCHING",
        "say": "Yeah I figured — with 180-plus properties and third-party crews across Folly, IOP, Wild Dunes... that verification gap has to show up somewhere. What does that process look like for you guys right now? Like when a cleaner finishes a turn, how does your team actually know the unit's guest-ready?",
        "note": "STOP SELLING. Ask questions. Let Randy talk. He's the CEO so he may describe it at a high level or name someone who owns it. Either is good. Listen for what system they use, who reviews, and where things break.",
        "branches": [
          {
            "label": "Describes process / cleaners send photos",
            "to": "discovery_photo_workflow"
          },
          {
            "label": "Admits gaps / it's a known issue",
            "to": "discovery_pain_deep"
          },
          {
            "label": "Delegates — says Liz or someone else handles it",
            "to": "referral_transition"
          },
          {
            "label": "Says they spot-check / trust their directors",
            "to": "discovery_track_angle"
          }
        ]
      },
      "discovery_photo_workflow": {
        "label": "DISCOVERY — PHOTO WORKFLOW",
        "say": "Got it — so your cleaners are sending photos after turns. Who's actually reviewing those? Is that your area directors, or is that flowing through Track somehow?",
        "note": "You know they use TrackHS. If he confirms photos go through Track or any system that's your integration hook. If nobody's reviewing them consistently that's your gap.",
        "branches": [
          {
            "label": "Nobody's really reviewing them consistently",
            "to": "solution_and_cta"
          },
          {
            "label": "Directors review / property managers check",
            "to": "discovery_scale_problem"
          },
          {
            "label": "Mentions Track or another tool",
            "to": "discovery_track_angle"
          }
        ]
      },
      "discovery_pain_deep": {
        "label": "DISCOVERY — PAIN IS REAL",
        "say": "Appreciate you being straight with me. Where does it hurt the most — is it the guest-facing stuff hitting reviews, or is it more the owner side, like damage getting missed between guests and you're eating the cost?",
        "note": "CEO cares about both but will lean one direction. Reviews equal brand and acquisition problem. Owner damage equals financial and retention problem. Either way RapidEye addresses it. Listen and mirror back what he says.",
        "branches": [
          {
            "label": "Reviews / guest experience",
            "to": "solution_and_cta"
          },
          {
            "label": "Owner damage / cost",
            "to": "solution_and_cta"
          },
          {
            "label": "Both",
            "to": "solution_and_cta"
          }
        ]
      },
      "discovery_scale_problem": {
        "label": "DISCOVERY — SCALE CHALLENGE",
        "say": "Makes sense. So Mark's reviewing Folly, Fran's got IOP and Wild Dunes — are they personally eyeballing every set of turnover photos on a Saturday in July? With back-to-back checkouts stacking up across the portfolio?",
        "note": "Name-dropping the area directors shows you did your homework. The point is that human review does not scale on peak turn days. 183 properties with tight 10am-to-4pm windows. Let him arrive at 'no they can't catch everything' on his own.",
        "branches": [
          {
            "label": "Acknowledges they can't catch everything",
            "to": "solution_and_cta"
          },
          {
            "label": "Says it works well enough",
            "to": "has_process"
          },
          {
            "label": "Asks how you know his directors' names",
            "to": "research_acknowledge"
          }
        ]
      },
      "research_acknowledge": {
        "label": "ACKNOWLEDGE RESEARCH",
        "say": "Ha — I did my homework before calling. I know you've been building this since '89 and you've got a really strong team across these markets. That's actually why I called you directly instead of just hitting the general line. The companies I work with that look most like yours are the ones getting the most out of what we built.",
        "note": "Don't be weird about it. Own the fact that you researched them. It's flattering not creepy. Transition to the solution naturally.",
        "branches": [
          {
            "label": "Appreciates it / keeps talking",
            "to": "solution_and_cta"
          },
          {
            "label": "Still skeptical",
            "to": "sell_test_drive"
          }
        ]
      },
      "discovery_track_angle": {
        "label": "DISCOVERY — TRACK INTEGRATION",
        "say": "That's actually perfect — I know you guys are on Track. We plug directly into TrackHS, so whatever photos or data your teams are already putting into the system, we analyze automatically. No new app, no workflow change for your cleaners or your directors. That's kind of the whole point — we don't want to add work, we want to catch what's getting missed in photos people are already taking.",
        "note": "The Track integration is your biggest differentiator for this account. It removes the 'we'd have to change everything' objection before it comes up. Keep it simple — plug in and analyze what is already there.",
        "branches": [
          {
            "label": "That's interesting / tell me more",
            "to": "solution_and_cta"
          },
          {
            "label": "We'd need to talk to our Track rep or IT",
            "to": "book_meeting"
          },
          {
            "label": "Still not sure we need it",
            "to": "sell_test_drive"
          }
        ]
      },
      "solution_and_cta": {
        "label": "SOLUTION + CTA",
        "say": "So what we built — RapidEye plugs into Track and automatically analyzes the turnover photos your teams are already collecting. It catches damage, missing items, staging issues, furniture that's been moved — and flags it before the guest checks in. No workflow change, no new app for your crews. Would you be open to taking a look at what that actually looks like? I could walk you through it in 20 minutes when I'm not cold calling you out of the blue.",
        "note": "One sentence on what it does then CTA. Don't oversell. Don't list features. The meeting is the product right now. Pause and let him respond.",
        "branches": [
          {
            "label": "Yeah let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "I'd need to loop in Liz or Layne or someone",
            "to": "referral_transition"
          },
          {
            "label": "Not right now / not interested",
            "to": "sell_test_drive"
          }
        ]
      },
      "not_interested": {
        "label": "NOT INTERESTED — AGREE",
        "say": "Totally get it. I should've assumed you'd be all set — otherwise you probably would've reached out to us. Just so no one from my team cold calls you again — is it that this isn't really a problem you're focused on right now, or is it more that you just hate cold calls?",
        "note": "Agree first then split the objection. The split separates the emotional reaction from the logical position. Most people will clarify and that reopens the door.",
        "branches": [
          {
            "label": "It's not a priority / we're fine",
            "to": "not_interested_reframe"
          },
          {
            "label": "I just hate cold calls",
            "to": "sell_test_drive"
          },
          {
            "label": "Both / just not interested",
            "to": "end_graceful"
          }
        ]
      },
      "not_interested_reframe": {
        "label": "NOT INTERESTED — REFRAME",
        "say": "Totally fair. You know, the other manager I mentioned — he said the same thing until he had a weekend where three guests posted about cleanliness issues and two owners called the same Monday morning. He wasn't looking for a solution until the problem got loud enough. I'm not saying that's you, but if nothing else, would it be worth 15 minutes just to see what other PM companies your size are doing with their turnover photos? Worst case you steal some ideas and we part as friends.",
        "note": "The Trustpilot data suggests condition complaints ARE happening at Dunes. Do NOT mention Trustpilot directly — that would be confrontational. Let the peer story do the work. The offer of value is see what others are doing — worth their time even if they never buy.",
        "branches": [
          {
            "label": "Fine I'll take a look",
            "to": "book_meeting"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "end_graceful"
          }
        ]
      },
      "has_process": {
        "label": "HAVE A PROCESS — AGREE",
        "say": "That makes total sense — with 183 properties you'd have to have something in place, otherwise things would fall apart. Just so I'm not wasting your time — is it that you're fully covered and happy with how it's working, or is it more that switching anything right now would just be a headache?",
        "note": "Agree and validate. Then split: happy versus switching is painful. If they're happy respect it and probe gently. If switching is the blocker that's where the no-workflow-change angle lands hard.",
        "branches": [
          {
            "label": "We're happy / it works fine",
            "to": "has_process_happy"
          },
          {
            "label": "Switching would be a pain",
            "to": "has_process_no_switch"
          },
          {
            "label": "It's not perfect but it's what we have",
            "to": "solution_and_cta"
          }
        ]
      },
      "has_process_happy": {
        "label": "HAPPY WITH PROCESS",
        "say": "Love to hear it — honestly that's rare. Most companies your size are duct-taping something together. Out of curiosity, are your third-party cleaners submitting photos through Track after every turn, or is it more of a spot-check system your directors run?",
        "note": "You're not challenging — you're genuinely curious. If they describe photos in Track pivot to the integration angle. If it's spot-checks that's the gap you fill.",
        "branches": [
          {
            "label": "Photos through Track",
            "to": "discovery_track_angle"
          },
          {
            "label": "Spot checks / director walkthroughs",
            "to": "discovery_scale_problem"
          },
          {
            "label": "Not sure — Liz or someone else handles that",
            "to": "referral_transition"
          }
        ]
      },
      "has_process_no_switch": {
        "label": "SWITCHING IS THE PAIN",
        "say": "That's actually the main reason I called you specifically. We plug directly into Track — there's no new app, no new workflow for your cleaners, no new login for your directors. We just analyze what's already flowing through your system. That's why the companies on Track are the easiest ones for us to work with. Would you be open to a quick look just to see how it connects?",
        "note": "This is your kill shot for this objection. They are on Track. You integrate with Track. Zero workflow change. Make it feel effortless.",
        "branches": [
          {
            "label": "That's interesting / okay",
            "to": "book_meeting"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          },
          {
            "label": "I'd need to talk to my team first",
            "to": "referral_transition"
          }
        ]
      },
      "no_budget": {
        "label": "NO BUDGET — AGREE",
        "say": "Totally get it. Nowadays it's harder to keep a tool than buy something new. Just so I'm not spinning my wheels — is it that budget for this kind of thing is completely locked, or is it more that anything new has to go through a process with you and Layne?",
        "note": "Name-dropping Layne Kipp the new COO shows you know the org. Her mandate is explicitly operational excellence and efficiencies — she could be your internal champion if budget is the real blocker.",
        "branches": [
          {
            "label": "Budget is locked / can't spend right now",
            "to": "sell_test_drive"
          },
          {
            "label": "It's more of an approval process",
            "to": "no_budget_process"
          },
          {
            "label": "Reacts to Layne mention / asks how you know",
            "to": "research_acknowledge"
          }
        ]
      },
      "no_budget_process": {
        "label": "BUDGET — APPROVAL PROCESS",
        "say": "Makes sense. Here's what usually works — let me walk you through it for 20 minutes, no commitment, and if it's interesting you'd have something concrete to bring to Layne. The companies I work with that move fastest are the ones where the CEO already knows what it does before it hits the ops review. Would next week work?",
        "note": "Position the meeting as giving Randy ammo for an internal conversation not as a buying step. CEOs like to be informed before their COO brings them something new.",
        "branches": [
          {
            "label": "Okay let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Send me an email first",
            "to": "send_email"
          },
          {
            "label": "Talk to Layne directly",
            "to": "referral_transition"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally hear you — you're probably not buying anything off a cold call, and I respect that. But when budget does free up or when summer season ramps and turnovers start stacking up, the people who move fastest are the ones who already know what's on their list. If nothing else, I could walk you through what some of the other Charleston-area PM companies are doing with their turnover photos. Twenty minutes. Worst case you steal some ideas and we part as friends.",
        "note": "This is your last real push before accepting the no. The seasonal pressure angle is real — Charleston peak season means tight turnovers and more failure risk. The 'steal some ideas' framing makes the meeting valuable even if they never buy.",
        "branches": [
          {
            "label": "Okay fine let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          },
          {
            "label": "Not now maybe later",
            "to": "end_graceful"
          },
          {
            "label": "Talk to someone else on my team",
            "to": "referral_transition"
          }
        ]
      },
      "referral_transition": {
        "label": "REFERRAL — WHO OWNS THIS",
        "say": "Totally makes sense — you've got a lot going on. Who on your team would be the right person to look at this? Is that more Liz Bernthal on the vacation rental side, or Layne on the ops side?",
        "note": "Give him names so he doesn't have to think. Liz as VP Vacation Rentals owns the inspection workflow. Layne as COO owns operational efficiency. Either is a strong next call. If he gives you a name ask for their direct line or a warm intro.",
        "branches": [
          {
            "label": "Liz Bernthal",
            "to": "referral_get_contact"
          },
          {
            "label": "Layne Kipp",
            "to": "referral_get_contact"
          },
          {
            "label": "Someone else",
            "to": "referral_get_contact"
          },
          {
            "label": "Just email me and I'll forward it",
            "to": "send_email"
          }
        ]
      },
      "referral_get_contact": {
        "label": "REFERRAL — GET THE INTRO",
        "say": "Perfect. Would you mind shooting them a quick note or giving them a heads up that I'll be reaching out? That way when I call it's not totally cold. And if I can get their direct line I'll put something tailored together so it actually lands and doesn't waste their time.",
        "note": "A warm intro from the CEO is gold. Even if he just says yeah I'll mention it that changes the next call entirely. Get the direct line or email and confirm the name spelling.",
        "branches": [
          {
            "label": "Gives contact info or agrees to intro",
            "to": "referral_confirm"
          },
          {
            "label": "Just call the main line",
            "to": "referral_confirm"
          }
        ]
      },
      "referral_confirm": {
        "label": "REFERRAL — LOCKED",
        "say": "Really appreciate that, Randy. I'll reach out to them this week and mention you pointed me their way. And seriously — thanks for taking my call. Not everyone picks up.",
        "note": "End warm. You now have a named referral from the CEO. Call the referred person within 24 hours while the intro is fresh. Lead that next call with 'Randy pointed me your way.'",
        "branches": []
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next week pulled up — how does Tuesday or Wednesday look? I only need about 20 minutes.",
        "note": "Give two day options not open-ended. Once he picks one nail down the time. Get it on the calendar NOW and send the invite while still on the phone if possible.",
        "branches": [
          {
            "label": "Picks a day and time",
            "to": "book_meeting_locked"
          },
          {
            "label": "Next week is bad — suggests another time",
            "to": "book_meeting_adjust"
          },
          {
            "label": "Let me check and get back to you",
            "to": "send_email"
          }
        ]
      },
      "book_meeting_adjust": {
        "label": "ADJUST MEETING TIME",
        "say": "Works for me. What day and time are best on your end? I'll make it work.",
        "note": "Be flexible. Any meeting is better than no meeting. Lock whatever time they offer.",
        "branches": [
          {
            "label": "Gives a day and time",
            "to": "book_meeting_locked"
          },
          {
            "label": "Still vague / just email me",
            "to": "send_email"
          }
        ]
      },
      "book_meeting_locked": {
        "label": "MEETING LOCKED",
        "say": "Perfect — I'll send over a calendar invite to rwalker@dunesproperties.com right now. It'll be short I promise — just a screen share so you can see what it actually looks like with your kind of portfolio. Really appreciate you taking my call, Randy.",
        "note": "STOP SELLING. The meeting is booked. Confirm the email. Send the invite immediately after hanging up. Keep it friendly and short. Don't add more pitch — you already won.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most relevant to include? Like is it more about how it connects to Track, or more about what we're catching for companies with third-party cleaning crews? I want to send you something actually useful, not a generic pitch deck.",
        "note": "Always ask what to include. It tells you their priority AND keeps the conversation going for 30 more seconds. Whatever they say mirror it in the email. Include a specific time suggestion in the email.",
        "branches": [
          {
            "label": "Tells you what they want to see",
            "to": "send_email_confirm"
          },
          {
            "label": "Just send whatever / general info",
            "to": "send_email_confirm"
          }
        ]
      },
      "send_email_confirm": {
        "label": "CONFIRM EMAIL SEND",
        "say": "Got it — I'll get that over to you today. If it's interesting I'll suggest a couple times to hop on a quick call. If not, no sweat at all. Appreciate your time, Randy.",
        "note": "Send the email within one hour. Personalize it with everything from this call — reference Track, their outsourced model, whatever he reacted to. Include two specific time options for a follow-up. Follow up in 3 business days if no response.",
        "branches": []
      },
      "end_graceful": {
        "label": "END — GRACEFUL EXIT",
        "say": "Totally understand. If anything changes — especially heading into peak season when turnovers start stacking up — I'm easy to find. Appreciate your time, Randy.",
        "note": "Don't burn the bridge. Charleston peak season creates turnover pressure that makes this more relevant later. Note the outcome in your CRM and set a callback for 60 to 90 days.",
        "branches": []
      }
    }
  }
}