{
  "name": "Rebecca Daigle",
  "title": "Property Maintenance Review Coordinator",
  "company": "Crown Vacation Rentals (Napa Vacation Condos)",
  "location": "Napa Valley, CA",
  "phone": "+1-707-255-0880",
  "company_phone": "(707) 256-2130",
  "alt_phones": [],
  "flow": {
    "context": "Rebecca Daigle is the Property Maintenance Review Coordinator at Crown Realty Property Management, the parent company behind Crown Vacation Rentals (Napa Vacation Condos) in Napa Valley. Her title is a bullseye — she reviews maintenance photos and triages issues, which is literally what RapidEye automates. Crown uses Streamline for their PMS (owner portal confirmed at ownerx.streamlinevrs.com). Her likely chain of command is Janett Sanchez (Maintenance Director), Fernanda Navarro (Operations Manager), and Danielle Gularte (President). No direct phone or email found — calling the main Napa office at 707-255-0880. Sam has regular SF access via his aunt, putting him about an hour from Napa.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Rebecca — I work with a few property management companies out in the Napa and Wine Country area on their inspection workflows. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Relaxed tone. Feet-up energy. You're nearby — you're in SF regularly. Don't rush the opener. Let her process who you are.",
        "branches": [
          {
            "label": "Yes / Maybe",
            "to": "yes_heard"
          },
          {
            "label": "No / Who?",
            "to": "no_heard"
          },
          {
            "label": "Busy / bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Suspicious / guarded",
            "to": "permission_fallback"
          }
        ]
      },
      "yes_heard": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone exactly in your kind of role. What did you hear?",
        "note": "Rare but great. Let her talk. Whatever she says, bridge into discovery or pain trigger.",
        "branches": [
          {
            "label": "Describes what they heard",
            "to": "warm_response"
          },
          {
            "label": "Vague / can't remember",
            "to": "pain_trigger"
          }
        ]
      },
      "no_heard": {
        "label": "HAVEN'T HEARD OF YOU",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason I'm calling you specifically — I saw your title, Property Maintenance Review Coordinator, and honestly that's the exact person I wanted to talk to. Can I tell you real quick why I reached out?",
        "note": "Her title IS the hook. Nobody else at this company has a title this perfectly matched to RapidEye. Make her feel that.",
        "branches": [
          {
            "label": "Sure / go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "Not interested",
            "to": "permission_fallback"
          },
          {
            "label": "I'm busy",
            "to": "bad_timing"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow, maybe in the morning? Or is there a better day this week?",
        "note": "Pin a specific callback time. Don't accept vague 'call me later.' Get a day and rough time.",
        "branches": [
          {
            "label": "Gives a time",
            "to": "callback_confirmed"
          },
          {
            "label": "Just email me",
            "to": "send_email"
          },
          {
            "label": "Don't call back",
            "to": "permission_rejected"
          }
        ]
      },
      "callback_confirmed": {
        "label": "CALLBACK LOCKED",
        "say": "Perfect, I'll try you then. It's Sam Parks, RapidEye — I'll shoot you a quick note so you know who's calling. Appreciate it, Rebecca.",
        "note": "Write down the exact time immediately. Send a brief email so your name is familiar on the callback. Log in CRM.",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call, I'll own that. Can I get 30 seconds to tell you why I reached out? You can totally hang up on me if it's not a fit.",
        "note": "Disarming honesty. Most people grant 30 seconds when you name it as a cold call and give them an out.",
        "branches": [
          {
            "label": "Fine, go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "No / still not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and it's just not interesting?",
        "note": "Split the objection. Most people reveal it's timing, which reopens the door to a callback.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / don't need it",
            "to": "not_right_person_check"
          },
          {
            "label": "Hard no / hangs up",
            "to": "graceful_end"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "So I work with another property management company in a pretty similar spot to you guys. They've got cleaners and inspectors snapping photos after every turnover, uploading them into the system, and then someone on the team — honestly, a person in a role a lot like yours — has to sit there and actually eyeball every single one. Hundreds of photos a week. And stuff still slips through. A stain on a couch nobody caught, a cracked tile behind a door, a missing remote that turns into a guest complaint. Then it's a fire drill — emergency maintenance call, owner's upset, bad review. Sound familiar at all?",
        "note": "PAUSE after 'sound familiar.' Do not fill the silence. This is literally her daily life — reviewing maintenance photos and triaging issues. Let the pain land.",
        "branches": [
          {
            "label": "Yes / that's exactly what happens",
            "to": "warm_response"
          },
          {
            "label": "Somewhat / asks questions",
            "to": "warm_response"
          },
          {
            "label": "Not really our issue",
            "to": "have_process"
          },
          {
            "label": "Not interested",
            "to": "not_interested"
          }
        ]
      },
      "warm_response": {
        "label": "THEY'RE WARM — ASK QUESTIONS",
        "say": "Yeah, that's what we keep hearing. So let me ask you — what does that review process actually look like for you right now? Like when turnover photos come in, what are you doing with them?",
        "note": "She's engaged. STOP PITCHING. Ask questions and listen. She's a coordinator — she knows the details of the workflow better than anyone. Mirror her language back.",
        "branches": [
          {
            "label": "Describes their current process",
            "to": "discovery_volume"
          },
          {
            "label": "Asks what RapidEye does first",
            "to": "brief_pitch"
          },
          {
            "label": "Gets guarded again",
            "to": "not_interested"
          }
        ]
      },
      "discovery_volume": {
        "label": "DISCOVERY — VOLUME AND TOOLS",
        "say": "Got it. And roughly how many turnovers are you guys processing in a given week? And are those photos coming through Streamline, or do you use something else for the inspection side?",
        "note": "You know they use Streamline for their owner portal. See if she confirms it for operations too, or if they have a separate inspection tool. The volume question sizes the opportunity and shows you understand scale.",
        "branches": [
          {
            "label": "Gives volume / confirms Streamline",
            "to": "discovery_pain"
          },
          {
            "label": "Mentions Breezeway or another tool",
            "to": "discovery_pain"
          },
          {
            "label": "Not sure on specifics",
            "to": "discovery_pain"
          }
        ]
      },
      "discovery_pain": {
        "label": "DISCOVERY — BIGGEST HEADACHE",
        "say": "Makes sense. So when you're going through all those photos — what's the thing that frustrates you most? Is it the sheer volume and time it takes, or is it more that stuff gets missed no matter how careful you are?",
        "note": "Let her vent. Whatever she says becomes your ammunition for the solution pitch. Write down her exact words.",
        "branches": [
          {
            "label": "Volume / time consuming",
            "to": "pitch_solution"
          },
          {
            "label": "Things get missed / inconsistency",
            "to": "pitch_solution"
          },
          {
            "label": "Both / other frustration",
            "to": "pitch_solution"
          }
        ]
      },
      "brief_pitch": {
        "label": "BRIEF PITCH — THEY ASKED",
        "say": "Fair enough — quick version. We built an AI that looks at the photos your team is already taking during turnovers and automatically flags damage, missing items, staging issues — basically does the review part for you so you're not eyeballing every single photo. Plugs right into tools you're already using, no workflow change. We're working with a few PM companies now — one running about 600 properties on the East Coast. But honestly I'd rather hear more about how you guys handle it — what's the biggest headache with your current process?",
        "note": "She asked, so answer concisely, then immediately pivot back to discovery. Do not monologue.",
        "branches": [
          {
            "label": "Asks follow-up questions",
            "to": "discovery_volume"
          },
          {
            "label": "Sounds interesting",
            "to": "discovery_volume"
          },
          {
            "label": "We're good with our process",
            "to": "have_process"
          }
        ]
      },
      "pitch_solution": {
        "label": "ONE-SENTENCE SOLUTION + CTA",
        "say": "Yeah, that's exactly why we built this. So basically — RapidEye is an AI that looks at every photo your team takes during turnovers and flags the stuff that a human would miss or just doesn't have time to catch. Damage, missing items, staging problems — it catches it automatically. Plugs into what you're already using, no new workflow to learn. Would you be open to taking a look sometime when I'm not cold calling you out of the blue?",
        "note": "One solution sentence, one CTA. Then STOP talking. Let her respond. Do not keep selling.",
        "branches": [
          {
            "label": "Yeah / sure / sounds good",
            "to": "book_meeting"
          },
          {
            "label": "Maybe / sounds interesting but...",
            "to": "sell_test_drive"
          },
          {
            "label": "I'd need to check with my boss",
            "to": "referral_up"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "No budget / not right now",
            "to": "no_budget"
          }
        ]
      },
      "not_interested": {
        "label": "NOT INTERESTED — MIYAGI",
        "say": "Totally get it. I should have assumed you'd be all set — otherwise you probably would have reached out to us. Just so nobody from my team cold calls you again — is it that this isn't really a problem you deal with, or is it more that you just hate cold calls? Because honestly I get it either way.",
        "note": "Agree first — surprise her by not pushing back. Then split the objection. Most people will soften.",
        "branches": [
          {
            "label": "Hate cold calls / timing thing",
            "to": "sell_test_drive"
          },
          {
            "label": "Not a problem we have",
            "to": "not_right_person_check"
          },
          {
            "label": "Opens up a little",
            "to": "warm_response"
          },
          {
            "label": "Hard no",
            "to": "graceful_end"
          }
        ]
      },
      "have_process": {
        "label": "ALREADY HAVE A PROCESS",
        "say": "That totally makes sense — with your team's setup you'd have to have something in place already. Is it more that you're fully covered and happy with how it works, or is it that switching anything right now would just be a headache?",
        "note": "They have SOME process. Find out if it's actually working or just tolerated. A review coordinator likely has strong opinions about gaps in the current workflow — let her reveal them.",
        "branches": [
          {
            "label": "Happy with current process",
            "to": "value_offer"
          },
          {
            "label": "It works but has gaps",
            "to": "warm_response"
          },
          {
            "label": "Switching would be a pain",
            "to": "sell_test_drive"
          }
        ]
      },
      "no_budget": {
        "label": "NO BUDGET — MIYAGI",
        "say": "Totally get it. Nowadays it's harder to keep a tool than to buy something new, honestly. Just so I know — is it that budget for anything like this is completely off the table right now, or is it more that anything new has to go through a whole approval chain before you can even look at it?",
        "note": "Split the objection. If it's an approval chain, that reveals who the real buyer is and opens the referral path.",
        "branches": [
          {
            "label": "Budget is locked / not happening",
            "to": "sell_test_drive"
          },
          {
            "label": "Would need approval from above",
            "to": "referral_up"
          },
          {
            "label": "Opens up",
            "to": "warm_response"
          }
        ]
      },
      "referral_up": {
        "label": "REFERRAL — WHO DECIDES",
        "say": "That makes total sense — you wouldn't be the one writing checks off a cold call. So if something like this were going to get looked at, who on your team typically makes that call? Would that be Janett on the maintenance side, or does it go up to Fernanda or someone else?",
        "note": "You know Janett Sanchez is Maintenance Director and Fernanda Navarro is Operations Manager. Drop names naturally — it shows you did homework and makes it feel less random. If she seems uncomfortable with name-drops, back off.",
        "branches": [
          {
            "label": "Confirms Janett or Fernanda",
            "to": "referral_ask_intro"
          },
          {
            "label": "Names someone else",
            "to": "referral_ask_intro"
          },
          {
            "label": "Not sure / doesn't want to say",
            "to": "referral_soft_ask"
          }
        ]
      },
      "referral_ask_intro": {
        "label": "ASK FOR INTRO OR DIRECT LINE",
        "say": "Perfect. Would it make sense for me to put something together specifically for them? And would you be open to making a quick intro, or just pointing me to the best way to reach them directly? That way it actually lands and isn't just another cold call.",
        "note": "You want either a warm intro email or a direct number. Either is gold. Don't push too hard — she's being generous by helping you.",
        "branches": [
          {
            "label": "Will intro / gives contact info",
            "to": "referral_confirmed"
          },
          {
            "label": "Just reach out directly",
            "to": "referral_confirmed"
          },
          {
            "label": "Not comfortable with that",
            "to": "send_email"
          }
        ]
      },
      "referral_soft_ask": {
        "label": "SOFT REFERRAL ASK",
        "say": "No worries at all. If I were going to reach out to someone on the ops or maintenance side, is there a best way to do that? I just want to make sure it's relevant and not a waste of anyone's time.",
        "note": "Softer approach. Even getting the right department, extension, or process helps. She might say 'just call the main line and ask for Janett' — that's a win.",
        "branches": [
          {
            "label": "Gives guidance or name",
            "to": "referral_confirmed"
          },
          {
            "label": "Just call the main line",
            "to": "referral_confirmed"
          },
          {
            "label": "Can't help",
            "to": "send_email"
          }
        ]
      },
      "referral_confirmed": {
        "label": "REFERRAL LOCKED",
        "say": "Really appreciate that, Rebecca. I'll put something tailored together so it actually makes sense for them. And honestly — if this ever does come back around to your desk for the review side, I'd love to show you what it looks like. I think you'd find it pretty interesting given what you do every day. Thanks for taking my call.",
        "note": "Thank her genuinely. She just gave you a warm path. Follow up SAME DAY with both her and the referral contact. Note everything she said in CRM.",
        "branches": []
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Look, you're probably not buying anything off a cold call — I totally respect that. But here's what I've found. When budget opens up or something breaks in the current process, the people who move fast are the ones who already know what's out there. Would you be open to just a quick 15-minute look? Worst case, you see what other PM companies in Wine Country are doing with their turnover photos and steal some ideas. We part as friends.",
        "note": "Low pressure. The meeting has value even if she never buys. 'Steal some ideas' makes it feel safe and non-committal.",
        "branches": [
          {
            "label": "Sure / why not",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Need to involve someone else",
            "to": "referral_up"
          },
          {
            "label": "No thanks",
            "to": "graceful_end"
          }
        ]
      },
      "value_offer": {
        "label": "VALUE OFFER — MARKET INTEL",
        "say": "Totally fair. Here's what I'd offer though — we work with PM companies across a few different markets, and honestly what operators in Wine Country and Napa are doing with their inspection workflows is changing pretty fast right now. Even if what you have works, would it be worth 15 minutes just to see what's out there? No pitch — just what we're seeing across the industry.",
        "note": "She says she's happy — don't argue. Offer market intel and peer benchmarking instead. A process-oriented person like a review coordinator is usually curious about how others do it.",
        "branches": [
          {
            "label": "Sure / sounds useful",
            "to": "book_meeting"
          },
          {
            "label": "Send me info",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "graceful_end"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next week pulled up — how does Tuesday or Wednesday afternoon look for you? Thinking 15, 20 minutes tops. I'll walk you through what we're doing and you can tell me if it even makes sense for how you guys work.",
        "note": "Give two options. Pin a day and time NOW. Do not leave it open-ended. Send the calendar invite while still on the phone if you can.",
        "branches": [
          {
            "label": "Picks a time",
            "to": "meeting_locked"
          },
          {
            "label": "Need to check calendar",
            "to": "meeting_follow_up"
          },
          {
            "label": "Send me times by email",
            "to": "send_email"
          }
        ]
      },
      "meeting_locked": {
        "label": "MEETING CONFIRMED",
        "say": "Perfect — I'll send you an invite right now. What's the best email for you? And if anyone else should be on it — like whoever handles the maintenance side or your ops lead — feel free to loop them in. Really appreciate you taking my call, Rebecca.",
        "note": "Get her email address. Crown PM email pattern is firstname@crownpm.com or firstinitial+lastname@crownpm.com. Suggest adding Janett or Fernanda to expand the meeting footprint. Then STOP SELLING. Send the invite immediately after hanging up.",
        "branches": []
      },
      "meeting_follow_up": {
        "label": "NEED TO CHECK CALENDAR",
        "say": "Totally — what's the best email to send you a couple time options? I'll keep it short, just a few slots and a one-liner on what we'd cover.",
        "note": "Get the email. Send options within the hour. Include exactly 3 specific time slots so it's easy for her to pick.",
        "branches": [
          {
            "label": "Gives email",
            "to": "meeting_locked"
          },
          {
            "label": "Use the general inbox",
            "to": "send_email"
          }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most useful to include so it's not just another generic pitch? Are you more curious about how it works with the photos you're already taking, or more about the kind of stuff it actually catches?",
        "note": "Accept it, then ask ONE question to tailor the email. Her email is likely rebecca@crownpm.com or rdaigle@crownpm.com based on company patterns.",
        "branches": [
          {
            "label": "Tells you what to include",
            "to": "email_confirmed"
          },
          {
            "label": "Just send whatever",
            "to": "email_confirmed"
          }
        ]
      },
      "email_confirmed": {
        "label": "EMAIL DETAILS LOCKED",
        "say": "Got it — I'll send that over today. What's the best email? Is it rebecca at crownpm dot com? And I'll drop in a couple time suggestions in case you want to dig in after reading it. Appreciate your time, Rebecca.",
        "note": "Confirm the email address. Include 2-3 specific time options in the email. Follow up in 2 business days if no response. Log everything in CRM.",
        "branches": []
      },
      "not_right_person_check": {
        "label": "CHECK IF RIGHT PERSON",
        "say": "Totally fair. And I may be off base here — is the maintenance review and inspection photo stuff something that runs through your role, or does that sit more with someone else on the maintenance or ops side?",
        "note": "Her title says 'review coordinator' so she SHOULD be close. But she might not own decisions or the workflow might have changed. Feel it out without being pushy.",
        "branches": [
          {
            "label": "That's my area",
            "to": "sell_test_drive"
          },
          {
            "label": "That's someone else",
            "to": "referral_up"
          },
          {
            "label": "Doesn't want to engage",
            "to": "graceful_end"
          }
        ]
      },
      "graceful_end": {
        "label": "END GRACEFULLY",
        "say": "Totally understand. If anything ever changes or you want to take a look down the road, I'm easy to find — Sam Parks, RapidEye. Appreciate your time, Rebecca. Have a good one.",
        "note": "Don't burn the bridge. Log everything she said in CRM. You still have other contacts at Crown — Janett, Fernanda, Danielle, Ryan. Use anything Rebecca told you to warm up the next call.",
        "branches": []
      }
    }
  }
}