{
  "name": "Rick Elliott",
  "title": "President/Owner",
  "company": "Elliott Beach Rentals",
  "location": "Myrtle Beach, SC",
  "phone": "",
  "company_phone": "+1-843-273-1223",
  "alt_phones": [],
  "flow": {
    "context": "Rick Elliott is the President/Owner of Elliott Beach Rentals — a legacy Myrtle Beach vacation rental and property management operation running since 1959 under the Elliott Realty umbrella. He is the ultimate decision-maker on budget, brand direction, and vendor relationships across what appears to be a large portfolio with in-house housekeeping and maintenance teams and multiple offices in North Myrtle Beach and Myrtle Beach. No inspection photo platform was found in their tech stack. His COO Brandon Cox (tenured since 2008, promoted to COO Jan 2024) is the natural referral if Rick delegates operations-level conversations; Kyle Thomas is Guest Services Manager. Strongest angle for Sam: East Coast PM traction as social proof and the reputation-protection frame for a sixty-plus-year-old brand — call the main office at 843-273-1223 and ask for Rick if no direct line is available.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Rick — I've been working with a couple other vacation rental companies out on the East Coast, and honestly Elliott Beach keeps coming up as one of the top operators down in Myrtle Beach. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Feet up energy. Smile. Sound like a peer calling a peer, not a vendor pitching a prospect. Let the compliment about Elliott Beach land naturally — he built this brand his whole life.",
        "branches": [
          {
            "label": "No / haven't heard of you",
            "to": "they_say_no"
          },
          {
            "label": "Yes / maybe",
            "to": "they_say_yes"
          },
          {
            "label": "Busy / bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Who is this? / Pushback",
            "to": "permission_fallback"
          }
        ]
      },
      "they_say_no": {
        "label": "THEY SAY NO",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call — I work with a few property management companies on their turnover and inspection workflows. Wanted to run something by you real quick.",
        "note": "Self-deprecating laugh then pivot. Don't rush past this — let the pause after 'real quick' do its job. He'll either give you a green light or push back.",
        "branches": [
          {
            "label": "OK go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "Not a good time",
            "to": "bad_timing"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "they_say_yes": {
        "label": "THEY SAY YES",
        "say": "Oh nice — well usually we'd be working with somebody like you. What'd you hear?",
        "note": "Rare but great. Let them talk. Whatever they say, bridge into discovery. Do NOT launch into a pitch.",
        "branches": [
          {
            "label": "Shares what they heard",
            "to": "warm_engaged"
          },
          {
            "label": "Vague / not sure actually",
            "to": "pain_trigger"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again later this week? Maybe Thursday afternoon?",
        "note": "Suggest a specific day and general time. Be breezy about it. If he counters with a different day, take it immediately.",
        "branches": [
          {
            "label": "Gives a better time",
            "to": "reschedule_set"
          },
          {
            "label": "Just send me an email",
            "to": "send_email_request"
          },
          {
            "label": "Don't call back",
            "to": "end_graceful"
          }
        ]
      },
      "reschedule_set": {
        "label": "RESCHEDULE LOCKED",
        "say": "Perfect — I'll give you a ring then. Really appreciate it, Rick. Talk soon.",
        "note": "Log the exact callback time in CRM immediately. Do not add anything else — get off the phone.",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION ASK",
        "say": "Yeah totally fair — it is a cold call, I'll be straight with you. Can I get 30 seconds to tell you why I reached out? And you can totally hang up on me if it's not a fit.",
        "note": "Honesty disarms. Asking for 30 seconds shows you respect his time. The hang-up line gives him control, which paradoxically makes him more likely to listen.",
        "branches": [
          {
            "label": "Fine, go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "No / not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I just caught you at a horrible time, or is it that you already know what we do and this just isn't interesting?",
        "note": "This is your last shot. The 'so nobody bugs you again' line reframes it as doing HIM a favor. The split question reopens the door.",
        "branches": [
          {
            "label": "Bad timing actually",
            "to": "bad_timing"
          },
          {
            "label": "Not interested at all",
            "to": "end_graceful"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "So I was talking with another vacation rental company owner — beach market, been around for decades, runs his own housekeeping and maintenance crew in-house — and the thing that kept nagging at him was that his inspectors caught most issues during turnovers. Most. But the stuff that slipped through — a stain on a couch, a cracked tile, a missing remote — that's what showed up in the Google reviews. Guest checks in, finds something that should've been flagged, and suddenly there's a one-star review sitting under a brand he spent his whole career building. And the part that really got him — his team was already taking photos every single turnover. The evidence was right there in their system. Nobody just had the bandwidth to go through every shot across every property.",
        "note": "STOP TALKING after this. Let the silence sit. Rick has spent decades building Elliott Beach Rentals — the reputation angle will hit. Do not rush into the solution. Wait for his reaction.",
        "branches": [
          {
            "label": "That resonates / shares own version",
            "to": "warm_engaged"
          },
          {
            "label": "We handle that pretty well",
            "to": "objection_have_process"
          },
          {
            "label": "Not interested / so what",
            "to": "objection_not_interested"
          },
          {
            "label": "What do you do about it?",
            "to": "solution_bridge"
          }
        ]
      },
      "warm_engaged": {
        "label": "DISCOVERY — PROCESS",
        "say": "Yeah — I figured that might ring a bell. So I'm curious, Rick — what does your inspection process actually look like right now after a turnover? Is your housekeeping crew taking photos, or do you have separate inspectors, or how does that work?",
        "note": "You are in discovery mode. Stop pitching entirely. Ask and LISTEN. Rick is an owner — he has opinions and he knows his operation. Let him talk.",
        "branches": [
          {
            "label": "Describes their process",
            "to": "discovery_scale_season"
          },
          {
            "label": "Why do you ask?",
            "to": "solution_bridge"
          },
          {
            "label": "Brandon handles all that",
            "to": "delegates_down"
          }
        ]
      },
      "discovery_scale_season": {
        "label": "DISCOVERY — SCALE AND SEASON",
        "say": "Got it — that makes sense. And with summer coming up, how many turnovers are you guys cranking through in a peak week? I imagine with the Myrtle Beach season it gets pretty wild.",
        "note": "Anchor to seasonal pressure. Myrtle Beach peak is June through August. This makes the problem time-sensitive and real. Whatever number he gives, acknowledge it.",
        "branches": [
          {
            "label": "Shares volume / acknowledges it's a lot",
            "to": "discovery_pain_depth"
          },
          {
            "label": "It's manageable",
            "to": "solution_bridge"
          },
          {
            "label": "Brandon would know the numbers",
            "to": "delegates_down"
          }
        ]
      },
      "discovery_pain_depth": {
        "label": "DISCOVERY — DIG DEEPER",
        "say": "Wow, that's a serious volume. So when something does slip through — a guest finds damage that wasn't caught — what does that look like on your end? Is it your guest services team scrambling, or does it come all the way up to you?",
        "note": "This ties the pain to Rick personally. As an owner, guest complaints that hit reviews or cause refunds are his problem. Let him connect the dots himself.",
        "branches": [
          {
            "label": "Explains the fallout / clearly a pain point",
            "to": "solution_bridge"
          },
          {
            "label": "Kyle or guest services handles it",
            "to": "solution_bridge"
          },
          {
            "label": "It doesn't happen often",
            "to": "solution_bridge"
          }
        ]
      },
      "solution_bridge": {
        "label": "ONE-SENTENCE SOLUTION",
        "say": "Makes total sense. So real quick — what we built is an AI that plugs into the photos your team's already taking during turnovers and automatically flags damage, missing items, staging issues — catches the stuff that's easy to miss when you're doing hundreds of turns a week. No workflow change for your crew. It just reads what they're already capturing.",
        "note": "One breath. Do not oversell. Do not list features. Go straight to CTA after this.",
        "branches": [
          {
            "label": "That's interesting / tell me more",
            "to": "soft_cta"
          },
          {
            "label": "We don't need that",
            "to": "objection_not_interested"
          },
          {
            "label": "What does it cost?",
            "to": "soft_cta"
          },
          {
            "label": "Talk to Brandon about this",
            "to": "delegates_down"
          }
        ]
      },
      "soft_cta": {
        "label": "SOFT CTA",
        "say": "Would you be open to seeing what that actually looks like? Not right now obviously — when I'm not cold calling you out of the blue. I could walk you through what a couple other East Coast property managers are doing with their turnover photos. Worst case you steal some ideas and we part as friends.",
        "note": "Low pressure. The value proposition is the meeting itself, not the product. 'Steal some ideas' makes it feel like he wins either way.",
        "branches": [
          {
            "label": "Sure, set it up",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email_request"
          },
          {
            "label": "Not right now / no budget",
            "to": "objection_no_budget"
          },
          {
            "label": "Loop in Brandon Cox",
            "to": "delegates_down"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Perfect. I've got next week pulled up — how does Tuesday or Wednesday afternoon look? Even fifteen, twenty minutes is plenty.",
        "note": "Give two options. Lock a specific day and time. Send the invite while still on the phone if possible.",
        "branches": [
          {
            "label": "Picks a time",
            "to": "meeting_locked"
          },
          {
            "label": "Let me check and get back to you",
            "to": "send_email_request"
          },
          {
            "label": "Include Brandon too",
            "to": "meeting_locked_with_brandon"
          }
        ]
      },
      "meeting_locked": {
        "label": "MEETING CONFIRMED",
        "say": "Done — I'll shoot you a calendar invite right now. Really appreciate you taking my call, Rick. Looking forward to it.",
        "note": "Stop selling immediately. Confirm and get off the phone. Send the calendar invite within 60 seconds of hanging up.",
        "branches": []
      },
      "meeting_locked_with_brandon": {
        "label": "MEETING WITH BRANDON TOO",
        "say": "Love that — I'll include Brandon on the invite too. What's the best email for both of you? I'll send it over right now.",
        "note": "Owner plus COO on the same call is the ideal outcome. Get both email addresses. Don't fumble this by adding more talk.",
        "branches": [
          {
            "label": "Gives email(s)",
            "to": "meeting_locked"
          },
          {
            "label": "I'll forward it to him",
            "to": "meeting_locked"
          }
        ]
      },
      "send_email_request": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most useful to include so it's not just another generic pitch sitting in your inbox?",
        "note": "Their answer tells you exactly what they care about. Listen carefully and tailor the email to whatever they say.",
        "branches": [
          {
            "label": "Tells you what to include",
            "to": "email_confirm_address"
          },
          {
            "label": "Just send general info",
            "to": "email_confirm_address"
          }
        ]
      },
      "email_confirm_address": {
        "label": "CONFIRM EMAIL",
        "say": "Got it — I'll put something together and get it over to you today. What's the best email? Is it rick at elliottbeachrentals dot com or a different one?",
        "note": "Confirm the address. Suggest a plausible pattern. Include a specific meeting time suggestion in the email — don't leave it open-ended.",
        "branches": [
          {
            "label": "Confirms or gives email",
            "to": "email_sent_end"
          }
        ]
      },
      "email_sent_end": {
        "label": "EMAIL CONFIRMED — END",
        "say": "Perfect. I'll have that in your inbox this afternoon. Appreciate your time, Rick — talk soon.",
        "note": "Send the email within the hour. Lead with the specific thing he asked about. End the email with a concrete time suggestion for a 15-minute call.",
        "branches": []
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "Totally get it. I should've assumed you'd be all set — otherwise you probably would've reached out to us. Just so nobody from my team cold calls you again — is it that inspections just aren't really a pain point for you guys right now, or is it more that you just hate cold calls? Honestly, I get it either way.",
        "note": "Agree first. Surprise him by not pushing back. The split question keeps the door open without being pushy.",
        "branches": [
          {
            "label": "Inspections aren't a problem",
            "to": "split_not_interested_deeper"
          },
          {
            "label": "Just hate cold calls",
            "to": "sell_test_drive"
          },
          {
            "label": "Hard no / wants off the phone",
            "to": "end_graceful"
          }
        ]
      },
      "split_not_interested_deeper": {
        "label": "DIG INTO NOT INTERESTED",
        "say": "That's great — honestly most companies I talk to feel pretty good about it until peak season hits and volume doubles overnight. Look, I'm definitely not trying to sell you anything today. But if you ever wanted to see what other operators in your market are doing with their turnover photos — even just to benchmark — happy to show you. No strings at all.",
        "note": "Reframe around competitive intelligence. Rick is an owner who has been in this market for decades — he wants to know what the competition is doing. Mentioning 'your market' is intentional.",
        "branches": [
          {
            "label": "OK maybe / sure why not",
            "to": "book_meeting"
          },
          {
            "label": "Not right now",
            "to": "end_graceful"
          },
          {
            "label": "Talk to Brandon about it",
            "to": "delegates_down"
          }
        ]
      },
      "objection_no_budget": {
        "label": "OBJECTION — NO BUDGET",
        "say": "Totally get it — nowadays it's harder to keep a tool, let alone bring on something new. Just so I know — is it that budget for this year is completely locked down, or is it more that anything new you try to bring in has to go through a whole approval process?",
        "note": "Agree and split. Don't argue about money. You're learning how their buying process works, which is intel for the follow-up.",
        "branches": [
          {
            "label": "Budget is locked",
            "to": "sell_test_drive"
          },
          {
            "label": "Approval process is tough",
            "to": "sell_test_drive"
          },
          {
            "label": "We're just not spending on this",
            "to": "end_graceful"
          }
        ]
      },
      "objection_have_process": {
        "label": "OBJECTION — HAVE A PROCESS",
        "say": "That makes total sense — with the number of properties you guys manage, you'd have to have something dialed in at this point. Is it that you're fully covered and everything's working great, or is it more that switching or adding anything right now would just be a headache?",
        "note": "Validate what they have. The split reveals whether they're genuinely happy or just change-averse. Both are useful intel.",
        "branches": [
          {
            "label": "Everything works fine",
            "to": "split_have_process_fine"
          },
          {
            "label": "Switching would be a pain",
            "to": "sell_test_drive"
          },
          {
            "label": "We use a specific tool",
            "to": "sell_test_drive"
          }
        ]
      },
      "split_have_process_fine": {
        "label": "PROCESS WORKS — DIG DEEPER",
        "say": "That's awesome — honestly most companies aren't that buttoned up. Out of curiosity, are your inspectors reviewing photos manually after every turn, or have you guys automated any of that?",
        "note": "'Everything's fine' usually has cracks underneath. The manual vs. automated question plants the seed that there's a level above where they are now. Listen carefully.",
        "branches": [
          {
            "label": "Manual / mostly manual",
            "to": "reframe_pain"
          },
          {
            "label": "We have it automated",
            "to": "end_graceful"
          },
          {
            "label": "Brandon would know the details",
            "to": "delegates_down"
          }
        ]
      },
      "reframe_pain": {
        "label": "REFRAME AROUND VOLUME",
        "say": "Got it — and that probably works until volume spikes, right? The companies I work with were in a similar spot. Photos were getting taken every turn, but peak season hits and suddenly you've got a hundred turnovers in a day and nobody's got time to review every shot. That's exactly where stuff slips through. Would it be worth taking fifteen minutes to see how other companies have handled that? Even just as a benchmark.",
        "note": "Tie it back to seasonal volume. Myrtle Beach summers are intense. This reframe makes the pain feel inevitable, not theoretical.",
        "branches": [
          {
            "label": "OK that's fair / sure",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email_request"
          },
          {
            "label": "Talk to Brandon about it",
            "to": "delegates_down"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Look — you're probably not buying anything from a cold call today, and I totally respect that. But when budget does free up or you're planning for next season, the people who move fastest are the ones who already know what's on their list. Would you be open to just taking a look — fifteen minutes, no pitch, just show you what it does — so it's on your radar when the time's right?",
        "note": "Remove all buying pressure. Future-frame it. The meeting is the only goal. If he still says no, gracefully offer email as a fallback.",
        "branches": [
          {
            "label": "OK fine / set it up",
            "to": "book_meeting"
          },
          {
            "label": "Just send me info",
            "to": "send_email_request"
          },
          {
            "label": "Not interested at all",
            "to": "end_graceful"
          },
          {
            "label": "Brandon should see this instead",
            "to": "delegates_down"
          }
        ]
      },
      "delegates_down": {
        "label": "REFERRAL — DELEGATES TO OPS",
        "say": "Totally makes sense — Brandon Cox, right? He's your COO? Would you mind if I reached out to him directly, or would it be better coming from you as a quick intro?",
        "note": "Name-drop Brandon to show you've done your homework. A warm intro from the owner is gold — push gently for that. If Rick seems surprised you know Brandon's name, just say 'I saw he runs ops for you guys.'",
        "branches": [
          {
            "label": "Yeah reach out to Brandon directly",
            "to": "referral_get_contact"
          },
          {
            "label": "I'll introduce you to him",
            "to": "referral_warm_intro"
          },
          {
            "label": "Someone else handles it actually",
            "to": "referral_ask_other"
          }
        ]
      },
      "referral_get_contact": {
        "label": "GET BRANDON'S CONTACT",
        "say": "Perfect — I really appreciate that. Do you happen to know the best way to get ahold of him? Direct line or email?",
        "note": "Get whatever you can — email, extension, direct line. Even a confirmed spelling of the email is a win. If he doesn't know, ask if the main office can transfer you.",
        "branches": [
          {
            "label": "Gives contact info",
            "to": "referral_confirmed"
          },
          {
            "label": "Just call the main number and ask",
            "to": "referral_confirmed"
          }
        ]
      },
      "referral_warm_intro": {
        "label": "WARM INTRO FROM RICK",
        "say": "That would be amazing — I really appreciate it. I can shoot you a quick two-liner to forward his way so it's easy on your end. What's the best email to send that to?",
        "note": "This is the best possible referral outcome. Get Rick's email, send a concise forwardable note within the hour. Keep it to 3 sentences max.",
        "branches": [
          {
            "label": "Gives his email",
            "to": "referral_confirmed"
          },
          {
            "label": "I'll just mention it to him",
            "to": "referral_confirmed"
          }
        ]
      },
      "referral_ask_other": {
        "label": "REFERRAL — DIFFERENT PERSON",
        "say": "Got it — who on your team usually owns the turnover and inspection side of things? Just want to make sure I'm reaching the right person so I'm not wasting anybody's time.",
        "note": "Get a name and title. Even if it's not Brandon, any named referral from the owner is extremely valuable. If he mentions Kyle Thomas (Guest Services), that's also a strong contact.",
        "branches": [
          {
            "label": "Gives a name",
            "to": "referral_get_contact"
          },
          {
            "label": "Not sure / figure it out yourself",
            "to": "end_graceful"
          }
        ]
      },
      "referral_confirmed": {
        "label": "REFERRAL LOCKED",
        "say": "Really appreciate it, Rick. I'll keep it short and relevant when I reach out — no spam, I promise. Thanks for your time today.",
        "note": "You got the referral. Stop talking. Follow up within the hour. When you call Brandon, open with 'Rick pointed me your way.'",
        "branches": []
      },
      "end_graceful": {
        "label": "END GRACEFULLY",
        "say": "Totally understand, Rick. If anything ever comes up on the inspection or turnover side, I'm easy to find — Sam Parks, RapidEye. Really appreciate your time.",
        "note": "Do not burn this bridge. Be genuine. Log the call, note the outcome, and set a follow-up task for 60-90 days. Rick is the owner — even a 'no' today is useful intel for approaching Brandon separately.",
        "branches": []
      }
    }
  }
}