{
  "name": "Seth Reeves",
  "title": "Head of Hosts",
  "company": "Stay Duvet",
  "location": "Charleston, SC",
  "phone": "",
  "company_phone": "(843) 628-5327",
  "alt_phones": [
    "+1-843-628-3401",
    "+1-843-640-5837",
    "+1-843-306-8068",
    "+1-843-429-8611"
  ],
  "flow": {
    "context": "Seth Reeves is Head of Hosts at Stay Duvet — he's the first person owners meet and the one selling and defending their quality promises: pre/post-stay inspections, the Clean Duvet Guarantee, hotel-level standards. Stay Duvet is Charleston's largest STR operator with 200–360+ properties across downtown Charleston, Folly Beach, Isle of Palms, Kiawah, and Seabrook — won Best PM Company 2024 from Charleston City Paper. They built proprietary owner-facing software (likely tied to FeatherPMS, a productized spin-off of their internal tools) and run in-house housekeeping and maintenance teams. Recent BBB and Vrbo reviews flag cleanliness and maintenance gaps slipping through — exactly the class of inspection misses Seth has to answer for during owner retention conversations. No strong personal connection to Sam — lead with East Coast PM industry proximity and peer-pain framing around the gap between the inspection promise and what's actually caught at scale.",
    "start": "gatekeeper_open",
    "nodes": {
      "gatekeeper_open": {
        "label": "GATEKEEPER — SLIDE BY",
        "say": "Hey — could you get me through to Seth? It's Sam.",
        "note": "Say nothing else. Sound like you belong. If they ask who you are or what it's about, move to the next gatekeeper node.",
        "branches": [
          {
            "label": "Transferred to Seth",
            "to": "opener"
          },
          {
            "label": "Asks who's calling / what company",
            "to": "gatekeeper_context"
          },
          {
            "label": "Seth's not available / voicemail",
            "to": "voicemail"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — CONTEXT",
        "say": "Yeah — I work with a few other property managers in the Charleston area. Would you mind letting Seth know it's Sam Parks?",
        "note": "Still casual. Don't pitch RapidEye. Don't explain what you do. Let the industry proximity do the work.",
        "branches": [
          {
            "label": "Transferred to Seth",
            "to": "opener"
          },
          {
            "label": "Asks what it's regarding",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "Offers to take a message",
            "to": "voicemail"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "Sure — we help a couple other property management companies similar to Stay Duvet with their inspection workflows. I sent Seth a note and just wanted to follow up. Would you mind putting me through?",
        "note": "This is your last card. If they won't transfer, take whatever they give you — message, voicemail, callback time.",
        "branches": [
          {
            "label": "Transferred to Seth",
            "to": "opener"
          },
          {
            "label": "Takes a message / sends to voicemail",
            "to": "voicemail"
          },
          {
            "label": "Hard no — won't connect",
            "to": "graceful_exit"
          }
        ]
      },
      "voicemail": {
        "label": "VOICEMAIL",
        "say": "Hey Seth, it's Sam Parks with RapidEye. I work with a few property managers on the East Coast running a similar model to you guys — high-touch, inspections every stay, couple hundred homes. Had something specific I wanted to run by you about how they're handling the photo review side at scale. My number's [your number]. I'll try you again if I don't hear back. Thanks man.",
        "note": "Keep it under 20 seconds. Sound like a peer leaving a casual message, not a rep reading a script. Log the attempt and plan a callback in 2 days.",
        "branches": []
      },
      "opener": {
        "label": "OPENER — HEARD THE NAME",
        "say": "Hey Seth — I've been working with a few other property managers on the East Coast, pretty similar setup to what you guys are running at Stay Duvet. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Feet up on the desk. Not chipper. Pause after the question and let him answer. You're sounding like a warm referral, not a cold caller.",
        "branches": [
          {
            "label": "Yes / maybe / sounds familiar",
            "to": "heard_name_yes"
          },
          {
            "label": "No / who? / doesn't ring a bell",
            "to": "heard_name_no"
          },
          {
            "label": "Bad timing / in the middle of something",
            "to": "bad_timing"
          }
        ]
      },
      "heard_name_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone in your exact role. What'd you hear?",
        "note": "Let him talk. If he has real context, transition to warm discovery. If it's vague or he's being polite, bridge to the pain trigger.",
        "branches": [
          {
            "label": "Has real context / positive",
            "to": "warm_response"
          },
          {
            "label": "Vague / just being polite",
            "to": "pain_trigger"
          }
        ]
      },
      "heard_name_no": {
        "label": "HAVEN'T HEARD OF YOU",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call —",
        "note": "Pause briefly. Read his energy. If he's giving you space to keep going, move straight to the pain trigger. If he sounds impatient or guarded, go to the permission fallback.",
        "branches": [
          {
            "label": "Giving you space / listening",
            "to": "pain_trigger"
          },
          {
            "label": "Sounds rushed or skeptical",
            "to": "permission_fallback"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow? Or is later this week better?",
        "note": "Offer two options. Don't ask 'when works for you' — that's too open-ended. Lock a specific day.",
        "branches": [
          {
            "label": "Suggests a time / agrees to callback",
            "to": "bad_timing_locked"
          },
          {
            "label": "Not interested / don't call back",
            "to": "graceful_exit"
          }
        ]
      },
      "bad_timing_locked": {
        "label": "CALLBACK LOCKED",
        "say": "Perfect — I'll try you then. Appreciate it, Seth.",
        "note": "Log the callback time immediately. When you call back, open with: 'Hey Seth, it's Sam Parks — you told me to try you back today.'",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call. Can I get 30 seconds to tell you why I reached out? And you can totally hang up on me if it's not a fit.",
        "note": "Disarm with honesty. The self-deprecation buys goodwill. Most people will give you the 30 seconds.",
        "branches": [
          {
            "label": "Ok go ahead / sure",
            "to": "pain_trigger"
          },
          {
            "label": "No thanks / not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED — LAST CHANCE",
        "say": "Shoot — totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it more that you already know what we do and it's just not interesting?",
        "note": "You're splitting the rejection. 'Horrible time' reopens the door for a callback. 'Not interesting' is the real no — but even then, you've earned respect by not pushing.",
        "branches": [
          {
            "label": "It's a bad time",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / not relevant",
            "to": "graceful_exit"
          },
          {
            "label": "Actually, what is it?",
            "to": "pain_trigger"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER — THE PROBLEM",
        "say": "I work with another property manager on the East Coast — about 250 homes, high-touch model, very similar to you guys. Promising owners inspections before and after every stay, hotel-level standards, the whole thing. The problem they kept hitting was that at that volume, the turnover photos were piling up way faster than anyone could actually review them. A stained sofa, a cracked tile, a missing set of dishes — and the owner found out before the team did. That's when the retention conversation gets real uncomfortable. We built something that automatically reads the turnover photos your team's already taking and flags damage, staging issues, missing items — zero workflow change for your cleaners. Would you be open to taking a look when I'm not cold calling you out of the blue?",
        "note": "PAUSE after 'out of the blue.' Do not fill the silence. This pain is tailored to Seth's exact role — he sells the inspection promise to owners and has to defend it when things slip. Let him react.",
        "branches": [
          {
            "label": "Interested / tell me more / how does that work",
            "to": "warm_response"
          },
          {
            "label": "We already have a process for that",
            "to": "objection_have_process"
          },
          {
            "label": "Not interested / we're all set",
            "to": "objection_not_interested"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          },
          {
            "label": "Mentions their own software or dashboard",
            "to": "proprietary_system"
          },
          {
            "label": "I'm not the right person for this",
            "to": "referral_ask"
          }
        ]
      },
      "warm_response": {
        "label": "THEY'RE WARM — STOP PITCHING",
        "say": "Yeah? What part of that resonated with you?",
        "note": "STOP PITCHING. Ask questions. Let Seth talk. Listen for: specific pain (owner complaints, photo volume, missed damage, cleaner accountability, redo cleans). Follow up on whatever he shares. If he wants to jump straight to a demo, let him.",
        "branches": [
          {
            "label": "Shares specific pain or details",
            "to": "discovery_process"
          },
          {
            "label": "Asks how it works / product questions",
            "to": "discovery_process"
          },
          {
            "label": "Wants to see it / let's set up a call",
            "to": "book_meeting"
          }
        ]
      },
      "discovery_process": {
        "label": "DISCOVERY — CURRENT PROCESS",
        "say": "That makes sense. So when your team does a turnover right now — what does the photo documentation and review piece actually look like? Are your cleaners taking photos through a specific app, or is it more ad hoc?",
        "note": "You're mapping their workflow: who takes photos, where do they go, who reviews them, what falls through the cracks. If he mentions their proprietary dashboard, FeatherPMS, or any internal tool, go to the proprietary system branch. Don't name FeatherPMS unless he does.",
        "branches": [
          {
            "label": "Describes a manual or ad hoc process",
            "to": "discovery_owner_retention"
          },
          {
            "label": "Mentions their own software / dashboard / internal tool",
            "to": "proprietary_system"
          },
          {
            "label": "Says they don't really have a formal photo process",
            "to": "discovery_owner_retention"
          },
          {
            "label": "Has heard enough — wants to see it",
            "to": "book_meeting"
          }
        ]
      },
      "discovery_owner_retention": {
        "label": "DISCOVERY — OWNER RETENTION ANGLE",
        "say": "Got it. And when something does slip through — a stain, some damage, missing items — how does that usually surface? Does the owner catch it, or does the guest flag it first?",
        "note": "This question makes the pain tangible. If he admits owners are finding issues before the team, you've hit the nerve. Stay Duvet has BBB and Vrbo reviews flagging exactly this — but do NOT bring those up unless he does. If he mentions recent complaints or public reviews himself, it's a strong signal to book.",
        "branches": [
          {
            "label": "Admits the gap / owners find things first",
            "to": "book_meeting"
          },
          {
            "label": "Says it's rare or well-handled",
            "to": "objection_not_interested"
          },
          {
            "label": "Mentions recent complaints or review issues",
            "to": "book_meeting"
          },
          {
            "label": "Asks about pricing or cost",
            "to": "objection_no_budget"
          }
        ]
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED (AGREE)",
        "say": "Totally get it. I should've assumed you'd be all set — honestly, with 200-plus homes and the standards you guys hold, you'd have to have something dialed in.",
        "note": "Agree first. Don't push. You're neutralizing the reflex, not arguing. Complimenting their operation disarms defensiveness.",
        "branches": [
          {
            "label": "Softens a bit / pauses",
            "to": "objection_not_interested_split"
          },
          {
            "label": "Firm no / clearly done",
            "to": "referral_ask"
          }
        ]
      },
      "objection_not_interested_split": {
        "label": "OBJECTION — NOT INTERESTED (SPLIT)",
        "say": "Just so no one from my team cold calls you again — is it that inspection quality isn't really a pain point for you right now, or is it more that you just hate getting cold calls?",
        "note": "Give him a face-saving out. If he picks 'hate cold calls,' he hasn't rejected the product — that's an opening. If he says it's not a priority, pivot to a referral to whoever does own it.",
        "branches": [
          {
            "label": "Not a priority / not my area",
            "to": "referral_ask"
          },
          {
            "label": "Just hates cold calls / bad timing",
            "to": "sell_test_drive"
          },
          {
            "label": "Actually, it is a headache...",
            "to": "warm_response"
          }
        ]
      },
      "objection_have_process": {
        "label": "OBJECTION — HAVE A PROCESS (AGREE)",
        "say": "That makes total sense — at your scale you'd have to. Especially with the Clean Duvet Guarantee and inspections every stay, you can't wing that.",
        "note": "Acknowledge their competence. Referencing their guarantee by name shows you've done your homework without being creepy about it. You're a peer who understands their model, not a vendor guessing.",
        "branches": [
          {
            "label": "Opens up about their process",
            "to": "objection_have_process_split"
          },
          {
            "label": "Firm — we're good",
            "to": "referral_ask"
          }
        ]
      },
      "objection_have_process_split": {
        "label": "OBJECTION — HAVE A PROCESS (SPLIT)",
        "say": "Just out of curiosity — is it that you're fully covered and the photos are catching everything at this point, or is it more that you've got something in place and switching anything right now would be a headache?",
        "note": "Most people admit gaps when given the split. 'Fully covered' is rare at 200+ homes. If they say switching is hard, position RapidEye as an add-on layer, not a replacement.",
        "branches": [
          {
            "label": "Fully covered and happy",
            "to": "graceful_exit"
          },
          {
            "label": "Has gaps / switching is the issue",
            "to": "book_meeting"
          },
          {
            "label": "Open to seeing a comparison",
            "to": "book_meeting"
          }
        ]
      },
      "objection_no_budget": {
        "label": "OBJECTION — NO BUDGET (AGREE)",
        "say": "Totally get it. Nowadays it's harder to keep a tool, let alone buy something new.",
        "note": "Agree. Don't counter with pricing or ROI numbers — that comes later. You're handling the reaction to the interruption, not negotiating a deal.",
        "branches": [
          {
            "label": "Softens / explains the budget situation",
            "to": "objection_no_budget_split"
          },
          {
            "label": "Hard no / completely shut",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_no_budget_split": {
        "label": "OBJECTION — NO BUDGET (SPLIT)",
        "say": "Just so I know — is budget for this year completely spoken for, or is it more that anything new has to go through the ringer to get approved?",
        "note": "If budget is locked, plant the seed for next cycle via the test drive. If approval is the blocker, offer to help him build the internal case — that's what the meeting is for.",
        "branches": [
          {
            "label": "Budget is locked / spoken for",
            "to": "sell_test_drive"
          },
          {
            "label": "Approval process is the pain",
            "to": "sell_test_drive"
          },
          {
            "label": "Hard no on spend",
            "to": "graceful_exit"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally hear you. Look — you're probably not buying anything right now and I respect that. But when the time does come, the people who move fast are the ones who already know what's on their list. If nothing else, I could walk you through what a couple other high-touch PM companies running a similar volume to you are doing with their turnover photos right now. Worst case you steal some ideas and we part as friends.",
        "note": "You're selling the meeting, not the product. The value proposition is: see what your peers are doing. Even if he never buys, the meeting is worth his time.",
        "branches": [
          {
            "label": "Sure / that could work",
            "to": "book_meeting"
          },
          {
            "label": "Just send me something",
            "to": "send_email"
          },
          {
            "label": "Talk to someone else on my team",
            "to": "referral_ask"
          }
        ]
      },
      "proprietary_system": {
        "label": "THEIR PROPRIETARY SOFTWARE",
        "say": "That's actually really common with the bigger operators — a lot of them have built their own tools. The piece we sit on top of is specifically the photo analysis layer. Your team's already taking photos during turnovers — we just read what's in those photos and flag issues automatically. It's not replacing anything, it's an add-on. How does the photo review piece work in your system right now?",
        "note": "Stay Duvet built proprietary owner dashboards — possibly related to FeatherPMS. Don't name FeatherPMS unless Seth does. The key message: RapidEye is an analysis layer that plugs in on top of whatever they already use. End with a question to keep discovery going.",
        "branches": [
          {
            "label": "Interested in the add-on concept",
            "to": "book_meeting"
          },
          {
            "label": "Says their system already handles photo review",
            "to": "objection_have_process_split"
          },
          {
            "label": "Curious — asks more about how it works",
            "to": "warm_response"
          }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One question before I do — what would be most relevant to include so it's not just another generic pitch sitting in your inbox?",
        "note": "This question makes the email actually useful. Listen for what he cares about — owner retention, cost of redo cleans, integration with their system, specific property types. Whatever he says, include it in the email and reference it in the subject line.",
        "branches": [
          {
            "label": "Tells you what to include / specific interest",
            "to": "send_email_confirmed"
          },
          {
            "label": "Just send whatever / doesn't care",
            "to": "send_email_confirmed"
          }
        ]
      },
      "send_email_confirmed": {
        "label": "EMAIL CONFIRMED",
        "say": "Got it — I'll put something together and get it over to you today. I'll drop in a couple time slots in case you want to take a closer look after. What's the best email — is it seth at stayduvet?",
        "note": "Confirm the email address. Send within the hour. Include a specific meeting time suggestion in the email. Reference whatever he said to tailor it. Follow up by phone in 3 days if no reply.",
        "branches": []
      },
      "referral_ask": {
        "label": "REFERRAL — WHO OWNS THIS",
        "say": "Totally understand — you might not be the right person for this. Who on your team would typically own the inspection workflow or the turnover quality side? I know you guys have a pretty big ops team at this point.",
        "note": "You know from research: Charlene Lambert (GM/Home Care) most likely owns inspections and turnover quality. Anne O'Donnell (Head of Guest Experience) owns guest escalations when issues are missed. Robert Lambert (Chief Engineer) owns maintenance triage. Michael Gates (CEO) is the executive sponsor. Let Seth offer the name first — only prompt if he seems stuck.",
        "branches": [
          {
            "label": "Gives a name or suggests someone",
            "to": "referral_get_name"
          },
          {
            "label": "Says try the main line / not helpful",
            "to": "graceful_exit"
          }
        ]
      },
      "referral_get_name": {
        "label": "REFERRAL — GET THE DETAILS",
        "say": "Perfect — really appreciate that, Seth. I'll put something tailored together so it actually lands with them. Is email the best way to reach them, or should I just call in and ask for them?",
        "note": "Get: full name, title, and best contact method. If he names Charlene Lambert, you have routing through team@stayduvet.com and (843) 628-5327. If he names Anne O'Donnell, same routing. Log the referral and mention Seth's name when you call the new contact.",
        "branches": []
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next Tuesday and Thursday pulled up — which one works better for a quick 15 minutes? I promise it'll be the most painless vendor call you've had all month.",
        "note": "Pick two specific days. Don't say 'sometime next week.' Lock the time while on the phone. Send the calendar invite before you hang up.",
        "branches": [
          {
            "label": "Accepts a time",
            "to": "meeting_booked"
          },
          {
            "label": "Suggests a different day or time",
            "to": "meeting_booked"
          },
          {
            "label": "Not ready to commit / send me something first",
            "to": "send_email"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING BOOKED — WRAP UP",
        "say": "Perfect — I'll send over the invite right now so it's locked in. Really appreciate you taking my call, Seth. Talk soon.",
        "note": "Send the calendar invite immediately while still on the phone. Stop selling. Get off the phone. Do not add 'one more thing.' You won.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand, Seth. If anything changes on your end, I'm easy to find. Appreciate you taking my call.",
        "note": "Don't burn the bridge. He may come around next quarter, or refer you later. Log the outcome and set a re-engagement reminder for 60 days.",
        "branches": []
      }
    }
  }
}