{
  "name": "Sheila Kurzweil",
  "title": "Guest Services Manager",
  "company": "Retreatia",
  "location": "Steamboat Springs, CO",
  "phone": "+1-800-848-1960",
  "company_phone": "(970) 871-6253",
  "alt_phones": [
    "+1-970-871-6253",
    "+1-970-691-0251",
    "+1-970-871-6253"
  ],
  "flow": {
    "context": "Sheila Kurzweil is Guest Services Manager at Retreatia, a ~250-unit vacation rental manager in Steamboat Springs, CO (77% condos). Her team is the one fielding calls when an inspection miss becomes a guest complaint — stains, damage, missing items, unit not ready. Retreatia publicly promises 'inspection after every guest' with a dedicated inspection team separate from cleaning, runs on TRACK (TrackHS) as their PMS, and is currently hiring a Housekeeping Supervisor and Owner Liaison — signals that QA volume is straining the team. They also run a damage waiver program capped at $3,000 per stay. No direct shared connection with Sam found — strongest angle is skiing (Sam skied Jackson Hole in January, Steamboat is a ski town) and working with other PM companies in mountain/resort markets.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Sheila — this is Sam Parks with RapidEye. I work with a few other property managers in mountain resort markets on their inspection workflows. Have you heard my name tossed around at all?",
        "note": "Feet up on the desk energy. You're not selling — you're checking if she's heard of you. Pause and let her respond. Don't rush past the question.",
        "branches": [
          {
            "label": "No / Who? / Doesn't ring a bell",
            "to": "no_heard"
          },
          {
            "label": "Yes / Maybe / Sounds familiar",
            "to": "yes_heard"
          },
          {
            "label": "Bad timing / I'm busy / Can't talk",
            "to": "bad_timing"
          },
          {
            "label": "What is this about? / Are you selling something?",
            "to": "what_is_this"
          }
        ]
      },
      "no_heard": {
        "label": "NOT HEARD — TRANSITION TO REASON",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call is — I work with a couple other guest services and ops leads at companies pretty similar to Retreatia, and your name came up as the person who'd probably know this world best. Mind if I take like 30 seconds to tell you why I reached out?",
        "note": "She said no — that's fine. Sound unbothered. The 'your name came up' is vague on purpose. You're asking for permission without begging.",
        "branches": [
          {
            "label": "Sure / Go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "I'm really busy / Not a good time",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / No thanks",
            "to": "not_interested_early"
          }
        ]
      },
      "yes_heard": {
        "label": "YES HEARD — EXPLORE",
        "say": "Oh no kidding — well normally we'd be working with someone exactly in your seat. What did you hear?",
        "note": "Rare but great. Let her talk. Whatever she says, mirror it back and transition to discovery.",
        "branches": [
          {
            "label": "She shares something she heard",
            "to": "warm_discovery"
          },
          {
            "label": "Not much / Just the name",
            "to": "pain_trigger"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow, maybe mid-morning? I know guest services in Steamboat during ski season is basically a war zone.",
        "note": "Acknowledge the season. She's probably slammed with guest issues right now. Suggesting a specific time shows you respect her schedule. Don't push.",
        "branches": [
          {
            "label": "Yeah try me tomorrow / Gives a time",
            "to": "book_callback"
          },
          {
            "label": "Just email me",
            "to": "send_email"
          },
          {
            "label": "Not interested at all",
            "to": "not_interested_early"
          }
        ]
      },
      "what_is_this": {
        "label": "WHAT IS THIS — PERMISSION ASK",
        "say": "Yeah totally fair — it is a cold call, I'll own that. Can I get 30 seconds to tell you why I reached out? And you can absolutely hang up on me if it's not a fit.",
        "note": "She's pattern-matching you to a telemarketer. Owning the cold call disarms that. The 'hang up on me' line gives her control, which paradoxically makes her stay.",
        "branches": [
          {
            "label": "Fine / Go ahead / 30 seconds",
            "to": "pain_trigger"
          },
          {
            "label": "No / I'm not interested",
            "to": "not_interested_early"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER — THE PROBLEM",
        "say": "So here's why I called you specifically. I was talking to a guest services manager at another resort-market company — similar size to you guys, around 200 condos — and she was telling me that no matter how good their inspection team is, stuff still slips through. A cleaner marks the unit ready, the inspector checks it off, and then the guest checks in at 4 PM and calls her team because there's a stain on the couch or a broken coffee maker or the hot tub cover is off. And now it's her problem — her team's running around trying to fix it, the guest is frustrated, and if it hits a review, ownership hears about it. With 250 units and 77% condos, I imagine your team sees some version of that pretty regularly.",
        "note": "PAUSE HERE. Do not keep talking. You just described her daily life — let her react. The specifics (250 units, 77% condos, 4 PM check-in chaos) show you did your homework. The peer story makes it safe for her to agree.",
        "branches": [
          {
            "label": "Yeah that happens / That's accurate / Sighs",
            "to": "pain_acknowledged"
          },
          {
            "label": "We actually have a pretty good process",
            "to": "have_process"
          },
          {
            "label": "That's not really my area / I don't handle inspections",
            "to": "wrong_person"
          },
          {
            "label": "Asks a question / Wants to know more",
            "to": "solution_bridge"
          }
        ]
      },
      "pain_acknowledged": {
        "label": "PAIN ACKNOWLEDGED — SOLUTION BRIDGE",
        "say": "Yeah — and the worst part is it's not even that the inspection team is doing a bad job. It's that you're asking humans to visually check hundreds of units and catch everything. Especially during high-turnover weekends in ski season. So what we built — we plug into TRACK, which I know you guys are on, and we automatically analyze the photos your cleaners and inspectors are already taking. AI flags the damage, the missing items, the staging issues — before the guest ever walks in. Your team gets a report instead of a phone call.",
        "note": "One breath. You named their PMS (TRACK) which shows you know their stack. Don't oversell. Pause after 'phone call' and let her react.",
        "branches": [
          {
            "label": "That's interesting / Tell me more",
            "to": "warm_discovery"
          },
          {
            "label": "How does that actually work?",
            "to": "explain_briefly"
          },
          {
            "label": "We already have something for that",
            "to": "have_vendor"
          },
          {
            "label": "I'd need to talk to someone else about this",
            "to": "referral_up"
          },
          {
            "label": "What does it cost?",
            "to": "cost_deflect"
          }
        ]
      },
      "have_process": {
        "label": "THEY HAVE A PROCESS — AGREE AND SPLIT",
        "say": "That makes total sense — with 250 units you'd have to have something dialed in, otherwise you couldn't operate. I should have assumed that. Just so nobody from my team bugs you again — is it that you're fully covered and nothing slips through, or is it more that the process works but you're always hiring and training people to keep it working?",
        "note": "You agreed with her. Now split the objection. The second option maps to their Housekeeping Supervisor hiring — they ARE struggling to keep the process staffed. Let her pick.",
        "branches": [
          {
            "label": "Things do slip through / It's a staffing challenge",
            "to": "pain_acknowledged"
          },
          {
            "label": "We're pretty well covered honestly",
            "to": "fully_covered"
          },
          {
            "label": "It's more of a bandwidth thing",
            "to": "bandwidth_pain"
          }
        ]
      },
      "bandwidth_pain": {
        "label": "BANDWIDTH PAIN — CONNECT TO HIRING",
        "say": "That's actually exactly what I keep hearing in mountain markets right now — especially heading into spring when you're turning over seasonal staff. I noticed you guys are hiring a Housekeeping Supervisor right now, and that role basically owns QA inspections. If that position's open, your existing team is probably absorbing that workload. That's actually the gap we fill — we're not replacing your people, we're catching the stuff that slips when your team is stretched.",
        "note": "You referenced their actual job posting. This is dangerously specific. If she confirms the pain, move to CTA.",
        "branches": [
          {
            "label": "Yeah we are stretched / That's fair",
            "to": "soft_cta"
          },
          {
            "label": "How did you know about the hiring?",
            "to": "explain_research"
          },
          {
            "label": "That's not really how it works here",
            "to": "soft_cta"
          }
        ]
      },
      "explain_research": {
        "label": "EXPLAIN RESEARCH — STAY CASUAL",
        "say": "Ha — it's public on Indeed. I do my homework before I call someone. I'm not gonna waste your time with a generic pitch. That's actually why I called you and not a random number at the front desk — your team is the one that feels it when something gets missed.",
        "note": "She might be impressed or slightly creeped out. Keep it light. The point is: you're not a telemarketer, you researched her specifically.",
        "branches": [
          {
            "label": "Fair enough / Okay",
            "to": "soft_cta"
          },
          {
            "label": "That's a little creepy (joking or serious)",
            "to": "lighten_research"
          }
        ]
      },
      "lighten_research": {
        "label": "LIGHTEN THE RESEARCH COMMENT",
        "say": "Ha — I promise I'm not that weird. I just figure if I'm gonna interrupt your day, I should at least know what I'm talking about. Would you be open to a quick look at what we do — maybe 15 minutes when you're not getting cold called out of the blue?",
        "note": "Self-deprecating humor. Transition straight to CTA.",
        "branches": [
          {
            "label": "Sure / When?",
            "to": "book_meeting"
          },
          {
            "label": "Email me first",
            "to": "send_email"
          },
          {
            "label": "Not right now",
            "to": "not_now_soft"
          }
        ]
      },
      "fully_covered": {
        "label": "FULLY COVERED — TEST DRIVE PITCH",
        "say": "Love to hear that — seriously. Most companies your size can't say that. Totally respect it. Only reason I'd still suggest a quick look is — a couple of the PM companies we work with thought the same thing, and then when they saw what the AI was catching in their own photos, they found stuff their inspectors had been walking past for months. Not because the inspectors were bad — just because human eyes miss patterns over time. Would you be open to seeing it? Worst case you confirm your process is airtight and we part as friends.",
        "note": "You complimented her. You're not arguing. The 'worst case' framing makes it low-risk for her to say yes.",
        "branches": [
          {
            "label": "Okay sure / I'd look at it",
            "to": "book_meeting"
          },
          {
            "label": "I really don't think we need it",
            "to": "graceful_exit"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          }
        ]
      },
      "solution_bridge": {
        "label": "SOLUTION BRIDGE — SHE'S CURIOUS",
        "say": "So basically — your cleaners and inspectors are already taking photos during turnovers, right? We plug into TRACK and automatically analyze those photos with AI. It flags damage, missing items, staging problems, anything that changed since last time. Instead of your guest services team finding out from the guest, you find out from the report before check-in. No workflow change for your field team — they just keep doing what they're doing.",
        "note": "Keep it simple. She asked — answer clearly, then pause. Don't stack features.",
        "branches": [
          {
            "label": "That's interesting / I like that",
            "to": "warm_discovery"
          },
          {
            "label": "We don't really take photos that way",
            "to": "photo_workflow"
          },
          {
            "label": "Who else uses this?",
            "to": "social_proof"
          },
          {
            "label": "I'd need to loop someone else in",
            "to": "referral_up"
          }
        ]
      },
      "explain_briefly": {
        "label": "EXPLAIN BRIEFLY — HOW IT WORKS",
        "say": "Pretty simple — your cleaners and inspectors are already taking photos after every turnover, right? We sit on top of TRACK and analyze those photos automatically. AI compares what the unit looks like now versus what it's supposed to look like — flags damage, missing items, furniture that moved, stains, anything off. Your team gets a report before the guest checks in instead of a complaint after.",
        "note": "She asked a tactical question — answer it cleanly. Then pivot to discovery or CTA.",
        "branches": [
          {
            "label": "Makes sense / Interesting",
            "to": "warm_discovery"
          },
          {
            "label": "We use a different process for photos",
            "to": "photo_workflow"
          },
          {
            "label": "What does it cost?",
            "to": "cost_deflect"
          },
          {
            "label": "I'd need to talk to ops about this",
            "to": "referral_up"
          }
        ]
      },
      "photo_workflow": {
        "label": "PHOTO WORKFLOW — ADAPT",
        "say": "Got it — what does your process look like right now? Like after a cleaner finishes a unit, what happens before the next guest checks in?",
        "note": "Don't assume. Let her describe it. Whatever she says, map RapidEye to the photo capture point that already exists. If they do video walkthroughs, mention that RapidEye handles video too.",
        "branches": [
          {
            "label": "She describes their process",
            "to": "warm_discovery"
          },
          {
            "label": "I'm not sure / That's more housekeeping's thing",
            "to": "referral_up"
          }
        ]
      },
      "warm_discovery": {
        "label": "DISCOVERY — ASK QUESTIONS",
        "say": "That's really helpful. Mind if I ask — when something does get missed and a guest calls in, what does that look like for your team? Like is it your people running out to the unit, or are you coordinating with maintenance, or both?",
        "note": "STOP PITCHING. You're in discovery. Ask about her world. Follow-up questions: How many guest complaints per week trace back to unit condition? What happens when damage is found after checkout — who proves it? Does the $3,000 damage waiver cover you, or do you eat costs above that? How does your team communicate with the inspection team when something's off?",
        "branches": [
          {
            "label": "She opens up about guest complaint flow",
            "to": "deepen_discovery"
          },
          {
            "label": "It varies / It depends",
            "to": "deepen_discovery"
          },
          {
            "label": "She's getting antsy / Wants to wrap up",
            "to": "soft_cta"
          }
        ]
      },
      "deepen_discovery": {
        "label": "DEEPER DISCOVERY — DAMAGE AND OWNERS",
        "say": "That makes sense. One more question — when there is damage after a guest stays, how do you guys document it for the owner? I know you run that damage waiver program capped at three grand — does that cover most situations, or do you end up eating costs or having disputes with owners about what was pre-existing?",
        "note": "This connects guest services pain to owner relations pain. If she mentions owner disputes or documentation gaps, that's a huge buying signal. Retreatia's Owner Liaison role includes 'routine inspections' — there's tension between guest services and owner relations here.",
        "branches": [
          {
            "label": "Damage documentation is a headache / Disputes happen",
            "to": "damage_pain_cta"
          },
          {
            "label": "We handle it fine / The waiver covers it",
            "to": "soft_cta"
          },
          {
            "label": "That's more of an owner relations question",
            "to": "referral_owner_relations"
          }
        ]
      },
      "damage_pain_cta": {
        "label": "DAMAGE DOCUMENTATION PAIN — CTA",
        "say": "That's literally the other half of what we solve. Every turnover creates a timestamped visual record — AI-tagged, searchable. So when an owner asks 'when did this happen,' you've got proof. No more he-said-she-said. Look — I don't want to keep you on a cold call. Would you be open to a 15-minute look at this? I can show you exactly what it catches using photos from a condo setup really similar to yours.",
        "note": "You've found real pain. Close for the meeting now. Be specific with the time ask.",
        "branches": [
          {
            "label": "Sure / Let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "I'd need to include someone else",
            "to": "referral_up"
          }
        ]
      },
      "social_proof": {
        "label": "SOCIAL PROOF — WHO USES THIS",
        "say": "Right now we're working with a PM company in New York running about 200 luxury homes, another on the East Coast with around 600 units, and a group in Dubai. The condo-heavy portfolios like yours are actually the best fit because you've got repeatable layouts — the AI gets really accurate really fast when the baseline is consistent across units.",
        "note": "Don't namedrop unless asked. The '77% condos = repeatable layouts' point is specific to Retreatia and shows you understand why this works for them.",
        "branches": [
          {
            "label": "Interesting / Tell me more",
            "to": "soft_cta"
          },
          {
            "label": "Those are pretty different markets from Steamboat",
            "to": "market_fit"
          },
          {
            "label": "How long have you been around?",
            "to": "company_age"
          }
        ]
      },
      "market_fit": {
        "label": "MARKET FIT — ADDRESS STEAMBOAT SPECIFICS",
        "say": "Totally fair — and honestly, the mountain-market angle is part of why I called. Your turnover spikes are seasonal and extreme. Ski season you're probably flipping units back-to-back, and that's when stuff gets missed because everyone's moving fast. The AI doesn't get tired on a Saturday turnover day when you've got 80 units flipping.",
        "note": "Acknowledge the difference, then pivot to why seasonal markets need this MORE. Steamboat ski season is the highest-pressure window.",
        "branches": [
          {
            "label": "That's true / Saturdays are brutal",
            "to": "soft_cta"
          },
          {
            "label": "We manage it okay",
            "to": "soft_cta"
          }
        ]
      },
      "company_age": {
        "label": "COMPANY AGE — HANDLE HONESTLY",
        "say": "We're early stage — started building this at Carnegie Mellon. My co-founder has four patents in AI and computer vision, previously at Rivian and Lucid. We're not a PowerPoint — we're live with paying customers processing real turnover photos every day. But I'll be honest, we're not a giant corporation. The upside for you is we build for our customers right now, not a feature request queue with 500 companies ahead of you.",
        "note": "Honesty builds trust. She asked because she's evaluating risk. Acknowledge it, then flip it to an advantage. CMU + patents + paying customers = credible.",
        "branches": [
          {
            "label": "Okay / Fair enough",
            "to": "soft_cta"
          },
          {
            "label": "We'd need something more established",
            "to": "graceful_exit"
          }
        ]
      },
      "have_vendor": {
        "label": "HAVE A VENDOR — AGREE AND SPLIT",
        "say": "That makes total sense — I'd be surprised if you didn't have something in place with your portfolio size. Just so nobody from my team bugs you again — is it that you're fully happy with what you've got, or is it more that switching anything right now would be a headache?",
        "note": "Don't fight the objection. Split it. If it's 'happy,' explore what tool. If it's 'switching is hard,' position as an add-on, not a replacement.",
        "branches": [
          {
            "label": "We're happy with our process",
            "to": "fully_covered"
          },
          {
            "label": "Switching would be a pain",
            "to": "addon_not_replacement"
          },
          {
            "label": "It's more that we just don't want to add anything",
            "to": "not_now_soft"
          }
        ]
      },
      "addon_not_replacement": {
        "label": "ADD-ON POSITIONING",
        "say": "Totally get that — and we're not asking you to rip anything out. We literally sit on top of what you already use. Your team keeps doing exactly what they do. We just read the photos they're already taking and surface what they missed. Zero workflow change. That's actually what made the other companies say yes — there was nothing to switch.",
        "note": "This is the key differentiator for Sheila. She doesn't want to change her team's process. RapidEye doesn't require it.",
        "branches": [
          {
            "label": "Okay that's different / Interesting",
            "to": "soft_cta"
          },
          {
            "label": "I'd still need to run it by someone",
            "to": "referral_up"
          }
        ]
      },
      "referral_up": {
        "label": "REFERRAL — GET THE RIGHT PERSON",
        "say": "Totally makes sense — who on your team would typically own a decision like this? Would that be someone on the ops side, or more like Viktorija?",
        "note": "You dropped the GM's name (Viktorija Hristovska) naturally. If Sheila confirms or corrects, you've got your next call. Ask for the name, then ask if Sheila would be open to a quick intro or if you should reach out directly.",
        "branches": [
          {
            "label": "Yeah Viktorija / That would be our GM",
            "to": "get_referral_intro"
          },
          {
            "label": "It would be [someone else] / Names another person",
            "to": "get_referral_intro"
          },
          {
            "label": "I'm not sure / I'd have to check",
            "to": "get_referral_soft"
          }
        ]
      },
      "referral_owner_relations": {
        "label": "REFERRAL TO OWNER RELATIONS",
        "say": "That makes sense — is that like your Owner Liaison team? I know you guys have a dedicated group that handles owner relationships and property inspections. Would it make sense for me to reach out to someone on that side, or would you want to loop them in together?",
        "note": "Retreatia has a formal Owner Relations / Owner Liaison function that does routine inspections. If she names Kat Goodhand or someone else, take the name.",
        "branches": [
          {
            "label": "Yeah let me connect you / Names someone",
            "to": "get_referral_intro"
          },
          {
            "label": "Just reach out to them directly",
            "to": "get_referral_soft"
          },
          {
            "label": "I can handle it / Let me see it first",
            "to": "soft_cta"
          }
        ]
      },
      "get_referral_intro": {
        "label": "GET REFERRAL — WARM INTRO",
        "say": "That'd be amazing. If you could shoot them a quick note or even just a heads up that I'll be reaching out, that way it doesn't land as another cold call. I'll put something tailored together — not a generic pitch deck, actual examples relevant to your condo portfolio. What's the best way to get that to them?",
        "note": "Lock down the name, email, and ideally a warm intro. Offer to make it easy for Sheila — she just has to forward or mention your name.",
        "branches": [
          {
            "label": "She gives name/email or agrees to intro",
            "to": "confirm_referral"
          },
          {
            "label": "Just call the main line / Email info@retreatia.com",
            "to": "get_referral_soft"
          }
        ]
      },
      "get_referral_soft": {
        "label": "REFERRAL — SOFTER APPROACH",
        "say": "Got it — would it be cool if I mentioned your name when I reach out? Just so they know I'm not coming completely out of left field.",
        "note": "Even a soft name-drop helps. If she says yes, your next call opens with 'Sheila mentioned I should reach out.'",
        "branches": [
          {
            "label": "Sure / That's fine",
            "to": "confirm_referral"
          },
          {
            "label": "I'd rather you didn't / Just reach out cold",
            "to": "confirm_referral"
          }
        ]
      },
      "confirm_referral": {
        "label": "CONFIRM REFERRAL DETAILS",
        "say": "Really appreciate that, Sheila. Just to make sure I don't butcher anything — who's the best person, and what's the best email or number to reach them? I'll keep it short and relevant.",
        "note": "Get the name and contact info. Write it down. Repeat it back. Then wrap up warmly.",
        "branches": [
          {
            "label": "She gives details",
            "to": "end_warm"
          },
          {
            "label": "She doesn't have details handy",
            "to": "end_warm"
          }
        ]
      },
      "cost_deflect": {
        "label": "COST QUESTION — DEFLECT TO MEETING",
        "say": "Honestly it depends on the setup — number of units, how you're capturing photos, what you want flagged. Rather than throw a number out of context, could I show you what it actually does first? That way you'd know what you're even pricing against. Usually takes about 15 minutes.",
        "note": "Never quote price on a cold call. Deflect to the demo where you can anchor value first. The 15-minute framing keeps it low-commitment.",
        "branches": [
          {
            "label": "Okay / Fair",
            "to": "book_meeting"
          },
          {
            "label": "Just ballpark me",
            "to": "cost_ballpark"
          },
          {
            "label": "Send me pricing",
            "to": "send_email"
          }
        ]
      },
      "cost_ballpark": {
        "label": "COST BALLPARK — STILL DEFLECT",
        "say": "I really don't want to give you a number that's wrong and have you judge us on it. What I can tell you is it's a fraction of what a missed damage claim costs or what you're paying an extra inspector. Can I show you the product and then give you an honest number based on your actual setup?",
        "note": "Hold the line. If she insists a third time, offer to include pricing in the follow-up email. But push for the meeting.",
        "branches": [
          {
            "label": "Fine / Show me",
            "to": "book_meeting"
          },
          {
            "label": "Email me with pricing",
            "to": "send_email"
          }
        ]
      },
      "soft_cta": {
        "label": "SOFT CTA — ASK FOR THE MEETING",
        "say": "Look — I know I caught you in the middle of your day, and I don't want to keep selling on a cold call. Would you be open to taking a 15-minute look at this when I'm not ambushing you? Worst case you see what other PM companies are doing with their turnover photos and you steal some ideas.",
        "note": "This is your go-to close. Low friction. 'Steal some ideas' makes it valuable even if she doesn't buy. If she says yes, go to book_meeting immediately.",
        "branches": [
          {
            "label": "Sure / Yeah I'd look at it",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "I need to check with someone else first",
            "to": "referral_up"
          },
          {
            "label": "Not right now / Maybe later",
            "to": "not_now_soft"
          },
          {
            "label": "Not interested",
            "to": "graceful_exit"
          }
        ]
      },
      "not_interested_early": {
        "label": "NOT INTERESTED — EARLY OBJECTION",
        "say": "Totally get it — I should've assumed you'd be all set, otherwise you probably would've reached out. Just so nobody from my team cold calls you again — is it that inspections aren't really a pain point for you right now, or is it more that you just hate cold calls? Both are valid.",
        "note": "She's reacting to the interruption, not the product. Split the objection. If it's about cold calls, she might still take a meeting via email. If it's about the topic, ask who WOULD care.",
        "branches": [
          {
            "label": "I just hate cold calls / Bad timing",
            "to": "pivot_to_email"
          },
          {
            "label": "Inspections aren't my thing / Not my area",
            "to": "wrong_person"
          },
          {
            "label": "We're just not looking for anything",
            "to": "not_now_soft"
          }
        ]
      },
      "wrong_person": {
        "label": "WRONG PERSON — PIVOT TO REFERRAL",
        "say": "Totally fair — I appreciate you telling me that. Who on your team would be the right person to talk to about inspection workflows and property condition? I know you guys have a dedicated inspection team separate from cleaning — is there someone who runs that side?",
        "note": "She may point you to housekeeping leadership, ops, or the GM (Viktorija). Get a name. Don't waste time pitching the wrong person.",
        "branches": [
          {
            "label": "She names someone",
            "to": "get_referral_intro"
          },
          {
            "label": "Try the main line / I'm not sure",
            "to": "get_referral_soft"
          },
          {
            "label": "She won't help",
            "to": "graceful_exit"
          }
        ]
      },
      "pivot_to_email": {
        "label": "PIVOT TO EMAIL",
        "say": "Ha — honestly, I hate making them too. Would it be cool if I sent you a quick email instead? That way you can look at it when you're not being interrupted. What would be most useful to include so it's not just another generic vendor pitch?",
        "note": "She's open to hearing from you — just not by phone. Ask what to include so your email is tailored. This also confirms her email.",
        "branches": [
          {
            "label": "Sure / Send it over",
            "to": "send_email"
          },
          {
            "label": "She tells you what to include",
            "to": "send_email"
          }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL — LOCK IT DOWN",
        "say": "Totally fair. One question before I do — what would be most relevant to include? I don't want to send you a generic deck. Would it be more helpful to see how it works with TRACK, or examples of what we catch in condo turnovers, or both?",
        "note": "Ask ONE question to tailor the email. Then confirm her email (k-sheila@retreatia.com from research — verify). Include a specific meeting time suggestion in the email. Send within 10 minutes of hanging up.",
        "branches": [
          {
            "label": "She tells you what to include",
            "to": "confirm_email_address"
          },
          {
            "label": "Just send whatever / I'll take a look",
            "to": "confirm_email_address"
          }
        ]
      },
      "confirm_email_address": {
        "label": "CONFIRM EMAIL",
        "say": "Perfect — I'll get that over today. Is the best email for you k-sheila at retreatia dot com, or is there a different one?",
        "note": "You're verifying the inferred email pattern. If she corrects it, you now have verified email for future outreach. If she confirms, great.",
        "branches": [
          {
            "label": "That's right / Confirms",
            "to": "end_email"
          },
          {
            "label": "Gives a different email",
            "to": "end_email"
          }
        ]
      },
      "end_email": {
        "label": "END — EMAIL PROMISED",
        "say": "Got it. I'll have that in your inbox by end of day. And I'll suggest a couple times to chat in there — no pressure, just so it's easy to grab 15 minutes if anything catches your eye. Really appreciate you taking my call, Sheila.",
        "note": "Send the email within 10 minutes. Include: brief pain recap, 1-2 screenshots of what RapidEye catches, TRACK integration mention, two specific time options for a call. Follow up 2 days later if no reply.",
        "branches": []
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next week pulled up — how does Tuesday or Wednesday look for you? I'm flexible on time, just need about 15 minutes.",
        "note": "Pick a specific day. If she's vague, suggest a time: 'How about Tuesday at 10 AM Mountain Time?' Get it locked. Send the calendar invite WHILE on the phone if possible.",
        "branches": [
          {
            "label": "She picks a day/time",
            "to": "confirm_meeting"
          },
          {
            "label": "Let me check my calendar / I'll get back to you",
            "to": "nail_down_meeting"
          },
          {
            "label": "Next week is crazy / Pushes further out",
            "to": "push_further"
          }
        ]
      },
      "confirm_meeting": {
        "label": "CONFIRM MEETING DETAILS",
        "say": "Perfect — I'll send over a calendar invite right now. It'll be from sam@rapideye.ai. I'll keep it to 15 minutes, show you what we're catching for other condo-heavy managers, and you can tell me if it's relevant. If it's not, totally cool — no hard feelings. Really appreciate you giving me a shot, Sheila.",
        "note": "Stop selling. Lock the meeting, send the invite, get off the phone. Confirm her email one more time if you haven't. Add to CRM immediately.",
        "branches": []
      },
      "nail_down_meeting": {
        "label": "NAIL DOWN THE MEETING",
        "say": "Totally — tell you what, I'll send over a couple time options by email and you can just click whichever works. What's the best email for you?",
        "note": "If she won't commit to a time on the phone, bridge to email with specific time slots. Still better than 'I'll follow up sometime.' Get the email confirmed.",
        "branches": [
          {
            "label": "Gives email / Agrees",
            "to": "confirm_email_address"
          },
          {
            "label": "Just call me back",
            "to": "book_callback"
          }
        ]
      },
      "push_further": {
        "label": "PUSH FURTHER OUT",
        "say": "No worries at all — how about the week after? I know ski season is intense. I'd rather catch you when you can actually focus for 15 minutes.",
        "note": "Don't accept 'sometime later.' Push to a specific week. If she still won't commit, bridge to email.",
        "branches": [
          {
            "label": "Picks a time",
            "to": "confirm_meeting"
          },
          {
            "label": "Just email me",
            "to": "send_email"
          }
        ]
      },
      "book_callback": {
        "label": "BOOK CALLBACK",
        "say": "Done — I'll try you again at that time. And I'll shoot you a quick email beforehand so you know it's me and not another random call. Thanks for being cool about this, Sheila.",
        "note": "Confirm the day and time. Put it in your calendar with a reminder. Send a brief pre-call email the morning of.",
        "branches": []
      },
      "not_now_soft": {
        "label": "NOT NOW — SELL THE TEST DRIVE",
        "say": "Totally respect that. And look — you're probably not buying anything right now, especially mid-season. But the people who end up using us are usually the ones who saw it early and already knew what it did when the budget conversation came up. Would you be open to just a 15-minute look? Not for now — just so it's on your radar.",
        "note": "This is the 'sell the test drive' play. You're not asking her to buy. You're asking her to be informed. The seasonal timing angle is real — she's busy NOW but budget conversations happen in shoulder season.",
        "branches": [
          {
            "label": "Okay / Fine / Sure",
            "to": "book_meeting"
          },
          {
            "label": "Email me and I'll think about it",
            "to": "send_email"
          },
          {
            "label": "Really not interested",
            "to": "graceful_exit"
          }
        ]
      },
      "end_warm": {
        "label": "END — WARM CLOSE",
        "say": "Really appreciate your time, Sheila. I know cold calls aren't anyone's favorite thing, so thanks for hearing me out. I'll follow up on everything we talked about. Have a good rest of your day — stay warm out there in Steamboat.",
        "note": "Keep it light and human. The Steamboat reference is a small touch that shows you're paying attention. Log everything immediately.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand, Sheila. No hard feelings at all. If anything ever changes or you get curious, I'm easy to find — Sam Parks at RapidEye. Appreciate your time and hope the rest of ski season goes smooth for you guys.",
        "note": "Don't burn the bridge. She might Google you later or mention your name to a colleague. Stay classy. Log the outcome and set a 90-day follow-up reminder.",
        "branches": []
      },
      "gatekeeper": {
        "label": "GATEKEEPER",
        "say": "Hey — could you get me through to Sheila? It's Sam.",
        "note": "Nothing else. No title, no company name, no reason. Just first name familiarity. Wait for them to respond.",
        "branches": [
          {
            "label": "Who's calling? / What's this about?",
            "to": "gatekeeper_context"
          },
          {
            "label": "She's not available / She's busy",
            "to": "gatekeeper_busy"
          },
          {
            "label": "Transferred through",
            "to": "opener"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — CONTEXT",
        "say": "Yeah — I work with a few other property managers in Steamboat. Would you mind letting her know it's Sam Parks?",
        "note": "Dose information. Don't pitch the gatekeeper. Don't say 'RapidEye' yet. If they push harder, go to gatekeeper_social_proof.",
        "branches": [
          {
            "label": "Transferred through",
            "to": "opener"
          },
          {
            "label": "What company? / Can I tell her what it's regarding?",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "She's not available",
            "to": "gatekeeper_busy"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "Sure — we help a few property management companies with their inspection workflows. I sent her a note about it. Would you mind giving her a heads up?",
        "note": "Third dose. If they still block, ask for voicemail or offer to call back. Never get adversarial with the gatekeeper.",
        "branches": [
          {
            "label": "Transferred through",
            "to": "opener"
          },
          {
            "label": "Let me take a message / I'll pass it along",
            "to": "gatekeeper_message"
          },
          {
            "label": "She's not available / Try back later",
            "to": "gatekeeper_busy"
          }
        ]
      },
      "gatekeeper_message": {
        "label": "GATEKEEPER — LEAVE MESSAGE",
        "say": "That'd be great — it's Sam Parks, S-A-M P-A-R-K-S. Number is [your number]. If you could just let her know I work with some other PM companies in the area on inspection workflows, that'd be perfect. When's a good time to try back?",
        "note": "Leave a clear, short message. Get a callback time. Then CALL BACK at that time.",
        "branches": [
          {
            "label": "They give a time",
            "to": "book_callback"
          },
          {
            "label": "They just say they'll pass it along",
            "to": "book_callback"
          }
        ]
      },
      "gatekeeper_busy": {
        "label": "GATEKEEPER — SHE'S BUSY",
        "say": "No worries — when's a better time to catch her? I know you guys are probably slammed with ski season right now.",
        "note": "Acknowledge the season. Get a specific time. Be friendly — this person might be the one who tells Sheila about your call.",
        "branches": [
          {
            "label": "Try back at [time]",
            "to": "book_callback"
          },
          {
            "label": "I'm not sure / Just try again",
            "to": "book_callback"
          },
          {
            "label": "Would you like her voicemail?",
            "to": "gatekeeper_message"
          }
        ]
      }
    }
  }
}