{
  "name": "Sheldon Arnold",
  "title": "Senior General Manager (Belize)",
  "company": "Vacasa",
  "location": "San Diego, CA",
  "phone": "+1-503-345-9399",
  "company_phone": "800-544-0300",
  "alt_phones": [
    "+1-800-544-0300",
    "+1-800-863-8415",
    "+1-850-299-9469",
    "+1-208-203-3377"
  ],
  "flow": {
    "context": "Sheldon Arnold is Senior General Manager at Vacasa running the Belize market — an international operation with humidity, hurricanes, insects, and high property-condition variance across a remote portfolio. He owns local inspection outcomes, turnover quality, and vendor coordination for a market where contractor availability is likely limited. Vacasa was acquired by Casago (closed May 2025) and is mid-integration, pushing local autonomy to GMs like Sheldon while cutting corporate headcount. Vacasa's field app already collects post-cleaning photos for inspection approval — massive photo volume, but review is manual. Sam's strongest angle: he surfs and recently traveled to El Salvador (Central America, close to Belize) — coastal/tropical lifestyle overlap. No shared school or direct mutual connection found.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Sheldon — this is gonna sound random, but I was actually just down in Central America not too long ago, surfing in El Salvador, and someone mentioned you're the guy running things for Vacasa out in Belize. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Sound like you're calling a friend of a friend. Relaxed. Feet up. The El Salvador surfing trip is real — Central America connection to Belize is natural. Don't over-explain.",
        "branches": [
          {
            "label": "No, haven't heard of you",
            "to": "no_heard"
          },
          {
            "label": "Yes / maybe / what's this about?",
            "to": "yes_heard"
          },
          {
            "label": "Bad timing / busy right now",
            "to": "bad_timing"
          },
          {
            "label": "Who gave you my number? / How'd you get this?",
            "to": "how_got_number"
          }
        ]
      },
      "no_heard": {
        "label": "NOT HEARD — TRANSITION TO PAIN",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call — I work with a few other property managers who run international markets, and they keep running into the same thing. Figured it was worth a shot reaching out.",
        "note": "Laugh it off, stay light. Transition immediately into the pain trigger. Don't pause too long here.",
        "branches": [
          {
            "label": "Okay, go ahead / what's up?",
            "to": "pain_trigger"
          },
          {
            "label": "I'm really busy right now",
            "to": "bad_timing"
          },
          {
            "label": "Not interested",
            "to": "not_interested_early"
          }
        ]
      },
      "yes_heard": {
        "label": "YES HEARD — EXPLORE",
        "say": "Oh nice — well normally we'd be working with someone in your exact spot. What'd you hear?",
        "note": "Let them talk. Whatever they say, use it to steer into pain. If they're vague, say 'Yeah that's the gist — we help property managers catch stuff in their turnover photos automatically. Figured with Belize being such a unique market it'd be worth connecting.'",
        "branches": [
          {
            "label": "They describe something / vague recognition",
            "to": "pain_trigger"
          },
          {
            "label": "They confused you with someone else",
            "to": "pain_trigger"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — I know I'm catching you out of the blue. Would it be a terrible idea if I tried you again tomorrow, maybe same time? Or is there a better window?",
        "note": "Don't push. Lock a callback. If they give a time, treat it like a booked meeting.",
        "branches": [
          {
            "label": "Gives a callback time",
            "to": "book_callback"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          },
          {
            "label": "No, what's this about? Give me the quick version",
            "to": "pain_trigger"
          },
          {
            "label": "Don't call back / not interested",
            "to": "not_interested_early"
          }
        ]
      },
      "how_got_number": {
        "label": "HOW GOT NUMBER",
        "say": "Yeah totally fair question — I work with a few property management companies on their inspection workflows, and your name came up as the person running the Belize operation for Vacasa. Figured I'd reach out directly rather than go through a bunch of channels.",
        "note": "Be honest and direct. Don't dodge the question. Then pivot to why you're calling.",
        "branches": [
          {
            "label": "Okay, what do you want?",
            "to": "pain_trigger"
          },
          {
            "label": "I'm not interested",
            "to": "not_interested_early"
          },
          {
            "label": "Who specifically mentioned me?",
            "to": "who_mentioned"
          }
        ]
      },
      "who_mentioned": {
        "label": "WHO MENTIONED",
        "say": "Honestly, I've been talking to a few folks in the Vacasa and Casago world — your name kept coming up as the person who actually owns the day-to-day in Belize. The reason I'm calling is pretty specific though, can I get 30 seconds?",
        "note": "Don't fabricate a name. Stay vague but honest. Redirect to the pitch quickly.",
        "branches": [
          {
            "label": "Okay go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "Still skeptical / not interested",
            "to": "permission_fallback"
          }
        ]
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call, I'm not gonna pretend otherwise. Can I get 30 seconds to tell you why I reached out, and if it's not relevant you can totally hang up on me?",
        "note": "This is your reset button. Owning the cold call disarms them. If they give you 30 seconds, go straight to pain trigger and be concise.",
        "branches": [
          {
            "label": "Fine, 30 seconds",
            "to": "pain_trigger"
          },
          {
            "label": "No, not interested at all",
            "to": "hard_no_split"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "So I work with another GM who runs an international market — similar setup to yours, tropical properties, remote from HQ, small local team. Their biggest headache was the turnover photos. Their cleaners were submitting photos after every stay — hundreds of them — and nobody had time to actually look through every single one. Stuff was slipping through. Humidity damage, missing items, a broken screen door that sat there for three guest stays before anyone caught it. And then the homeowner finds out from a guest review instead of from the team. In a market like Belize where you've got salt air, storms, insects — I imagine the property condition variance is pretty intense.",
        "note": "PAUSE here. Let him react. Do NOT pitch yet. The goal is to get him talking about his version of this pain. The tropical/Belize specifics — humidity, storms, insects — come from the research. Make it feel like you understand his world.",
        "branches": [
          {
            "label": "Yeah, that's real / we deal with that",
            "to": "warm_discovery"
          },
          {
            "label": "We actually handle that pretty well",
            "to": "handle_well"
          },
          {
            "label": "What exactly do you do?",
            "to": "one_sentence_solution"
          },
          {
            "label": "That's more of a corporate decision",
            "to": "referral_up"
          },
          {
            "label": "We already have something for that",
            "to": "have_vendor"
          }
        ]
      },
      "warm_discovery": {
        "label": "WARM — ASK QUESTIONS",
        "say": "Yeah I figured — what does your inspection process look like right now in Belize? Like after a cleaner finishes a turnover, are they submitting photos through the Vacasa app, or is it a different workflow for your market?",
        "note": "STOP PITCHING. He's warm. Ask questions. You know Vacasa has a field app with post-cleaning photo submissions — reference it naturally. Learn his specific workflow. Key things to discover: (1) How photos are reviewed, (2) Who approves 'ready for guest', (3) What falls through the cracks, (4) How many properties/turnovers, (5) Biggest pain point.",
        "branches": [
          {
            "label": "Describes their photo/inspection process",
            "to": "dig_deeper"
          },
          {
            "label": "Yeah we use the app / submit photos",
            "to": "dig_deeper"
          },
          {
            "label": "It's pretty manual / we eyeball it",
            "to": "dig_deeper_manual"
          }
        ]
      },
      "dig_deeper": {
        "label": "DIG DEEPER",
        "say": "Got it — so when those photos come in, who's actually reviewing them? Is that you, is it Kaprie, or is it more of a spot-check thing where you trust the cleaners and hope nothing slips?",
        "note": "Mentioning Kaprie Dawson (Local Operations Manager, Belize) shows you've done homework. Don't force it — if it doesn't land naturally, just ask 'who on your team reviews them?' Key insight to get: is review happening consistently or is it a bottleneck?",
        "branches": [
          {
            "label": "Describes review process / names who does it",
            "to": "transition_to_solution"
          },
          {
            "label": "We don't really review them all",
            "to": "transition_to_solution_gap"
          },
          {
            "label": "Wait, how do you know about Kaprie?",
            "to": "explain_research"
          }
        ]
      },
      "dig_deeper_manual": {
        "label": "DIG DEEPER — MANUAL PROCESS",
        "say": "Yeah that's what I hear from most folks in markets like yours — especially when you're running a lean team in an international location. How many properties are you turning over in a given week out there?",
        "note": "Get the volume. This helps you frame the solution in terms of scale. Even 20-30 properties with tropical conditions means high damage frequency.",
        "branches": [
          {
            "label": "Gives a number / describes volume",
            "to": "transition_to_solution_gap"
          },
          {
            "label": "It varies / seasonal",
            "to": "transition_to_solution_gap"
          }
        ]
      },
      "explain_research": {
        "label": "EXPLAIN RESEARCH",
        "say": "Ha — yeah I just did my homework before calling. Vacasa's local ops pages mention the Belize team. I wasn't trying to be creepy, I just wanted to make sure I was talking to the right person.",
        "note": "Keep it light. Laugh it off. Then redirect to the conversation.",
        "branches": [
          {
            "label": "Okay fair enough, continue",
            "to": "transition_to_solution"
          },
          {
            "label": "Still guarded",
            "to": "transition_to_solution"
          }
        ]
      },
      "transition_to_solution": {
        "label": "BRIDGE TO SOLUTION",
        "say": "That makes sense. So here's why I called — we built something that basically plugs into the photos your team's already taking and automatically flags damage, missing items, staging issues. No workflow change, no new app — it just reads the photos that are already flowing through and tells you what's wrong before the next guest checks in.",
        "note": "One sentence. Don't oversell. Reference that it works with EXISTING photos — this is critical for Vacasa since they already collect post-cleaning photos via their field app.",
        "branches": [
          {
            "label": "That's interesting, tell me more",
            "to": "expand_solution"
          },
          {
            "label": "How does that work exactly?",
            "to": "expand_solution"
          },
          {
            "label": "We'd need corporate approval for that",
            "to": "referral_up"
          },
          {
            "label": "I don't think we need that",
            "to": "objection_dont_need"
          },
          {
            "label": "What does it cost?",
            "to": "cost_deflect"
          }
        ]
      },
      "transition_to_solution_gap": {
        "label": "BRIDGE TO SOLUTION — GAP FOUND",
        "say": "Yeah, that's exactly what I keep hearing — the photos exist, but nobody has bandwidth to actually go through them all. Especially when you're juggling turnover day logistics, vendor coordination, guest issues. So we built something that does that automatically. It reads the turnover photos your team's already submitting and flags damage, missing items, condition changes — before the next guest walks in.",
        "note": "Mirror back the gap they described. Then one-sentence solution. Pause and let them react.",
        "branches": [
          {
            "label": "That's interesting / tell me more",
            "to": "expand_solution"
          },
          {
            "label": "How does it actually work?",
            "to": "expand_solution"
          },
          {
            "label": "We'd need to run that by corporate",
            "to": "referral_up"
          },
          {
            "label": "I don't think that's a priority right now",
            "to": "objection_not_priority"
          }
        ]
      },
      "expand_solution": {
        "label": "EXPAND SOLUTION",
        "say": "Yeah so basically — your cleaners finish a turnover, submit their photos like they normally do. Our system compares those photos against a baseline of what the property should look like. If a couch cushion is torn, a lamp is missing, there's water damage on the ceiling — it catches it and flags it immediately with the specific issue and location. We're working with a PM company in New York doing this across 200 luxury homes, another on the East Coast with 600 properties. For a market like Belize where you've got tropical wear and tear constantly, it'd basically give you an extra set of eyes on every single turnover without adding headcount.",
        "note": "Social proof (NYC 200 homes, East Coast 600 properties). Tie it back to his specific market. Don't go longer than this — move to CTA.",
        "branches": [
          {
            "label": "That sounds useful / I'd want to see it",
            "to": "book_meeting"
          },
          {
            "label": "How does it integrate with our systems?",
            "to": "integration_question"
          },
          {
            "label": "I'd need to loop in my boss / corporate",
            "to": "referral_up"
          },
          {
            "label": "What's the cost?",
            "to": "cost_deflect"
          },
          {
            "label": "Send me some info",
            "to": "send_email"
          }
        ]
      },
      "handle_well": {
        "label": "THEY HANDLE IT WELL",
        "say": "That's great — honestly, most people I talk to don't say that, so I'm curious. What's your process look like? Are you doing a full photo review after every turnover, or is it more of a spot-check system?",
        "note": "Don't argue. Be genuinely curious. Most people who say 'we handle it well' still have gaps when you dig. Ask questions and listen for cracks.",
        "branches": [
          {
            "label": "Describes a solid process",
            "to": "acknowledge_and_pivot"
          },
          {
            "label": "Describes something with gaps",
            "to": "transition_to_solution_gap"
          }
        ]
      },
      "acknowledge_and_pivot": {
        "label": "ACKNOWLEDGE AND PIVOT",
        "say": "That's legit — sounds like you've built a solid system. The reason I still think it'd be worth a quick look is that we're seeing even the best-run teams miss stuff at volume. Not because the people are bad, but because human eyes reviewing hundreds of photos will always have blind spots. Would you be open to a 15-minute look just to see what the tech does? Worst case you confirm your process is airtight and we part as friends.",
        "note": "Respect their process. Position the meeting as validation, not replacement. Low pressure.",
        "branches": [
          {
            "label": "Sure, I'd take a look",
            "to": "book_meeting"
          },
          {
            "label": "Not right now",
            "to": "objection_not_priority"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          }
        ]
      },
      "one_sentence_solution": {
        "label": "WHAT DO YOU DO",
        "say": "Yeah — short version: we built an AI that automatically analyzes turnover photos and flags damage, missing items, condition changes. Plugs into whatever your team's already using, no new workflow. The reason I reached out to you specifically is that Belize seems like the kind of market where property condition swings fast — tropical wear and tear, storms, all of it — and catching stuff early saves you a ton of headaches with homeowners.",
        "note": "They asked, so answer directly. But keep it tight and pivot to a question or CTA.",
        "branches": [
          {
            "label": "That's interesting",
            "to": "warm_discovery"
          },
          {
            "label": "We'd need corporate to approve that",
            "to": "referral_up"
          },
          {
            "label": "Not interested",
            "to": "not_interested_early"
          },
          {
            "label": "How does it integrate?",
            "to": "integration_question"
          }
        ]
      },
      "integration_question": {
        "label": "INTEGRATION QUESTION",
        "say": "Good question. We plug into whatever PMS or ops platform you're using — I know Vacasa has its own field app and HomeCare Hub internally, and I know Casago's been rolling out Breezeway and Guesty across the network. We can connect to any of those. The photos your cleaners are already submitting just flow through our system on the backend. No new app for your field team.",
        "note": "Show you know their stack. HomeCare Hub and field app are Vacasa's proprietary tools. Breezeway and Guesty are the Casago network tools. Don't pretend you know which one Belize specifically uses — let him clarify.",
        "branches": [
          {
            "label": "Good to know / sounds doable",
            "to": "book_meeting"
          },
          {
            "label": "I'd need to check with our tech team",
            "to": "referral_up_tech"
          },
          {
            "label": "We're in the middle of switching systems right now",
            "to": "system_transition"
          }
        ]
      },
      "system_transition": {
        "label": "SYSTEM TRANSITION",
        "say": "Yeah, that makes total sense — with the Casago acquisition, I imagine there's a lot of tooling stuff in flux right now. Honestly, that might actually be good timing. When you're migrating systems anyway, layering in something like this is way easier than bolting it on after everything's locked in. Would it make sense to loop in whoever's running that migration so we can at least be on the radar?",
        "note": "The Casago acquisition and system migration is real and current. Use it as a reason TO talk, not a reason to wait. Try to get a referral to whoever is managing the tech integration.",
        "branches": [
          {
            "label": "Yeah let me connect you with someone",
            "to": "get_referral_name"
          },
          {
            "label": "It's too chaotic right now",
            "to": "objection_timing"
          },
          {
            "label": "Let me think about it / send me info",
            "to": "send_email"
          }
        ]
      },
      "referral_up": {
        "label": "REFERRAL UP",
        "say": "Totally get that — with the Casago acquisition and everything shifting, I'm sure nothing gets approved without going through a few layers. Who on your side would typically own a decision like this? Would that be someone like Bob Milne on the ops side, or is it more of a tech call with Carlos's team?",
        "note": "You know Bob Milne (SVP Ops) and Carlos Corzo (CTO). Drop names naturally — it shows you've done homework and gives Sheldon an easy person to point to. If he names someone else, that's even better intel.",
        "branches": [
          {
            "label": "Names a specific person",
            "to": "get_referral_name"
          },
          {
            "label": "It'd be Bob / ops team",
            "to": "referral_bob"
          },
          {
            "label": "It'd be the tech team / Carlos",
            "to": "referral_tech"
          },
          {
            "label": "I honestly don't know",
            "to": "referral_unknown"
          },
          {
            "label": "I can bring it up internally",
            "to": "internal_champion"
          }
        ]
      },
      "referral_up_tech": {
        "label": "REFERRAL UP — TECH",
        "say": "Makes sense — would that be Carlos Corzo's team, or is there a separate ops-tech group that handles integrations for the field tools?",
        "note": "Carlos Corzo is CTO. Name-drop naturally. Get the right contact.",
        "branches": [
          {
            "label": "Yeah Carlos / his team",
            "to": "referral_tech"
          },
          {
            "label": "Names someone else",
            "to": "get_referral_name"
          },
          {
            "label": "I'm not sure who handles that",
            "to": "referral_unknown"
          }
        ]
      },
      "referral_bob": {
        "label": "REFERRAL TO BOB MILNE",
        "say": "Perfect — would you be willing to shoot Bob a quick note or intro? Even just a heads up that we connected. That way when I reach out it's not completely cold. If I can get a warm intro, I'll put something tailored together so it actually lands.",
        "note": "Push for the warm intro. It's way more effective than cold-emailing Bob. If Sheldon won't intro, ask for Bob's best contact method.",
        "branches": [
          {
            "label": "Yeah I can do that",
            "to": "book_meeting_referral"
          },
          {
            "label": "Just reach out to him directly",
            "to": "get_contact_info"
          },
          {
            "label": "I'd rather not",
            "to": "send_email"
          }
        ]
      },
      "referral_tech": {
        "label": "REFERRAL TO TECH TEAM",
        "say": "Got it — would you mind giving Carlos's team a heads up that we talked? Even just a quick note saying 'hey this guy Sam reached out about photo analysis for turnovers.' That way it doesn't land cold in his inbox.",
        "note": "Same play — push for warm intro. If not, get contact info.",
        "branches": [
          {
            "label": "Yeah I can mention it",
            "to": "book_meeting_referral"
          },
          {
            "label": "Just email him directly",
            "to": "get_contact_info"
          },
          {
            "label": "I'd rather you just send me info first",
            "to": "send_email"
          }
        ]
      },
      "referral_unknown": {
        "label": "REFERRAL — UNKNOWN",
        "say": "No worries — if you had to guess, what level of person would own something like this? Like is it a VP-level ops call, or more of a regional thing where your boss would greenlight a pilot?",
        "note": "Figure out the org structure. Learn the altitude of the decision. Then ask for a specific name.",
        "branches": [
          {
            "label": "Names someone or describes the level",
            "to": "get_referral_name"
          },
          {
            "label": "Honestly not sure",
            "to": "offer_to_help_navigate"
          }
        ]
      },
      "offer_to_help_navigate": {
        "label": "HELP NAVIGATE",
        "say": "Totally fair — tell you what, would it make sense if I sent you a quick one-pager you could forward to whoever makes sense? That way you're not on the hook for anything, and if someone bites, I'll take it from there.",
        "note": "Make it easy for him. Remove friction. A forwardable asset is low-commitment.",
        "branches": [
          {
            "label": "Yeah send it over",
            "to": "send_email"
          },
          {
            "label": "Sure",
            "to": "send_email"
          }
        ]
      },
      "internal_champion": {
        "label": "INTERNAL CHAMPION",
        "say": "That'd be huge honestly. If you're open to it, I could send you a quick summary of what we talked about — something you could forward along or bring up in your next ops call. Would that be helpful?",
        "note": "He's willing to champion internally. Make it easy. Send him ammo. Follow up in 3-5 days.",
        "branches": [
          {
            "label": "Yeah send it over",
            "to": "send_email_champion"
          },
          {
            "label": "Let me think about it",
            "to": "send_email"
          }
        ]
      },
      "get_referral_name": {
        "label": "GET THE NAME",
        "say": "That's super helpful — and what's their name? If I can get a name, I'll put something tailored together so it actually lands instead of being another generic cold email.",
        "note": "Always ask for the name. People will give it if you've earned enough trust.",
        "branches": [
          {
            "label": "Gives a name",
            "to": "book_meeting_referral"
          },
          {
            "label": "Won't give a name",
            "to": "send_email"
          }
        ]
      },
      "get_contact_info": {
        "label": "GET CONTACT INFO",
        "say": "Appreciate that — do you happen to have their direct email or number? Or should I just go through the main Vacasa line?",
        "note": "Try for direct contact info. If not, you already have email patterns and HQ phone from research.",
        "branches": [
          {
            "label": "Gives contact info",
            "to": "book_meeting_referral"
          },
          {
            "label": "Just go through the main line",
            "to": "book_meeting_referral"
          }
        ]
      },
      "not_interested_early": {
        "label": "NOT INTERESTED — EARLY",
        "say": "Yeah totally — I mean it is a cold call, can't blame you. Can I get 30 seconds to tell you why I reached out? If it's not relevant you can totally hang up on me.",
        "note": "This is the permission fallback. Don't accept 'not interested' on the first pass — it's a reaction to the interruption, not a rejection of the product.",
        "branches": [
          {
            "label": "Fine, go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "No, really not interested",
            "to": "hard_no_split"
          }
        ]
      },
      "hard_no_split": {
        "label": "HARD NO — SPLIT",
        "say": "Totally hear you — just so nobody from my team bugs you again, is it that this isn't a problem you're dealing with in Belize, or is it more that I just caught you at a terrible time?",
        "note": "Split the objection. You're trying to figure out if it's real disinterest or just bad timing. Either answer gives you useful intel.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "reschedule"
          },
          {
            "label": "Not a problem we have",
            "to": "graceful_exit"
          },
          {
            "label": "I just don't take cold calls",
            "to": "graceful_exit"
          },
          {
            "label": "Actually, tell me more",
            "to": "pain_trigger"
          }
        ]
      },
      "have_vendor": {
        "label": "HAVE A VENDOR / PROCESS",
        "say": "That makes total sense — with the number of properties you're managing in Belize, you'd have to have something in place. Especially post-acquisition with Casago, I'm sure there's been a push to standardize. Just so I know — is it that you're fully covered and happy with how it's working, or is it more that switching anything right now during the integration would be a headache?",
        "note": "Split the objection. Reference the Casago acquisition naturally. If they're 'happy,' dig into what specifically works. If it's about switching pain, position as an add-on, not a replacement.",
        "branches": [
          {
            "label": "We're happy with what we have",
            "to": "happy_vendor_response"
          },
          {
            "label": "It's more about the timing / integration",
            "to": "timing_objection"
          },
          {
            "label": "A bit of both",
            "to": "timing_objection"
          }
        ]
      },
      "happy_vendor_response": {
        "label": "HAPPY WITH VENDOR",
        "say": "Respect that. Out of curiosity — is someone actually reviewing all the turnover photos that come in, or is it more of a checklist-based system where the cleaner checks the boxes and you trust it?",
        "note": "Dig one layer deeper. Most 'happy' responses crumble when you ask about the actual review mechanism. If photos aren't being reviewed by a human every time, there's a gap.",
        "branches": [
          {
            "label": "Admits there's a gap / not full review",
            "to": "transition_to_solution_gap"
          },
          {
            "label": "We do review everything",
            "to": "acknowledge_and_pivot"
          },
          {
            "label": "Doesn't want to continue",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_dont_need": {
        "label": "DON'T NEED IT",
        "say": "Totally fair — and honestly, the best-run teams are usually the hardest sell because things are working. The only reason I'd push back gently is that the managers I work with who thought they were covered were still finding that stuff slipped through at volume. Not a people problem — just a math problem. Hundreds of photos, human eyes, something always gets missed. Would you be open to a 15-minute look just to see how it compares to what you're doing now?",
        "note": "Reframe as a math problem, not a people problem. Don't insult their process. Position the meeting as a benchmark.",
        "branches": [
          {
            "label": "Sure, I'd take a quick look",
            "to": "book_meeting"
          },
          {
            "label": "Not right now",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_not_priority": {
        "label": "NOT A PRIORITY",
        "say": "Totally get it — you've got a hundred things going on, especially with the Casago transition. You're probably not buying anything right now, and I respect that. But when things do settle down, the people who move fastest are the ones who already know what's on their shortlist. Would you be open to a 15-minute look — not to buy anything, just so it's on your radar when the dust settles?",
        "note": "Sell the test drive. Reference the Casago transition as validation of why they're busy. Position the meeting as future-proofing, not a buying decision.",
        "branches": [
          {
            "label": "Yeah that could work",
            "to": "book_meeting"
          },
          {
            "label": "Maybe after things settle",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_timing": {
        "label": "TIMING OBJECTION",
        "say": "Yeah, I hear you — the middle of a migration is chaos. What if we just put 15 minutes on the calendar for after things calm down a bit? Like sometime in the next month or two? That way you're not dealing with it now, but you've got it locked in.",
        "note": "Push the meeting out to accommodate timing. Even a meeting 6 weeks from now is a win.",
        "branches": [
          {
            "label": "Yeah let's do that",
            "to": "book_meeting"
          },
          {
            "label": "Just email me and I'll circle back",
            "to": "send_email"
          },
          {
            "label": "No",
            "to": "graceful_exit"
          }
        ]
      },
      "cost_deflect": {
        "label": "COST QUESTION",
        "say": "Good question — honestly it depends on portfolio size and volume of turnovers, but the short answer is it's a fraction of what a single missed damage incident costs you. For a market like Belize where you've got tropical wear and tear, the ROI math is pretty straightforward. I'd rather walk you through it properly than throw out a number on a cold call — would you be open to a quick 15-minute look where I can show you exactly how it'd work for your setup?",
        "note": "Don't quote price on a cold call. Deflect to the meeting. The goal is always to book the meeting, not sell the product.",
        "branches": [
          {
            "label": "Sure, let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "Just ballpark me",
            "to": "cost_ballpark"
          },
          {
            "label": "Send me pricing info",
            "to": "send_email"
          }
        ]
      },
      "cost_ballpark": {
        "label": "COST BALLPARK",
        "say": "For a portfolio your size, you're probably looking at a few hundred bucks a month range — but it really depends on the setup. I'd rather show you what it does first so the price has context. Can we grab 15 minutes this week?",
        "note": "Give a vague range if pressed, then immediately redirect to booking. Don't let the call become a pricing negotiation.",
        "branches": [
          {
            "label": "Okay let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Send me info first",
            "to": "send_email"
          },
          {
            "label": "That's too much / no budget",
            "to": "no_budget"
          }
        ]
      },
      "no_budget": {
        "label": "NO BUDGET",
        "say": "Totally get it — nowadays it's harder to keep a tool, let alone buy something new. Especially mid-acquisition with Casago, I'm sure budgets are locked down. Just so I know — is it that budget for this kind of thing is completely off the table, or is it more that anything you try to buy right now has to go through a ton of approval layers?",
        "note": "Split the objection. Budget vs. process. If it's approval layers, get the name of the approver. If budget is truly dead, plant the seed for later and send a follow-up.",
        "branches": [
          {
            "label": "It's the approval process",
            "to": "referral_up"
          },
          {
            "label": "Budget is truly locked",
            "to": "plant_seed"
          },
          {
            "label": "Both",
            "to": "plant_seed"
          }
        ]
      },
      "plant_seed": {
        "label": "PLANT THE SEED",
        "say": "Totally respect that. Tell you what — I'll shoot you a quick email with a summary of what we do. No pressure at all. When budgets open up or the Casago dust settles, at least you'll know we exist and can reach out. Sound fair?",
        "note": "Don't burn the bridge. Send a clean follow-up. Set a reminder to re-engage in 60-90 days.",
        "branches": [
          {
            "label": "Yeah sure, send it over",
            "to": "send_email"
          },
          {
            "label": "Okay",
            "to": "send_email"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome — I've got next week pulled up. How does Tuesday or Wednesday look for you? I'm flexible on time, especially with the Belize time zone.",
        "note": "Pick specific days. Accommodate time zones — Belize is CST (UTC-6). Lock the meeting NOW. Don't let it go to 'I'll check my calendar and get back to you.'",
        "branches": [
          {
            "label": "Picks a day/time",
            "to": "confirm_meeting"
          },
          {
            "label": "Let me check my calendar and get back to you",
            "to": "pin_down"
          },
          {
            "label": "Can you send me a calendar link?",
            "to": "confirm_meeting"
          }
        ]
      },
      "pin_down": {
        "label": "PIN DOWN THE MEETING",
        "say": "Totally — how about I send over an invite for Wednesday at 10 AM your time, and if it doesn't work you can just move it? That way we've got something on the books.",
        "note": "Always propose a specific time. Don't leave it open-ended. Sending the invite while on the phone is ideal.",
        "branches": [
          {
            "label": "Sure that works",
            "to": "confirm_meeting"
          },
          {
            "label": "Gives alternative time",
            "to": "confirm_meeting"
          },
          {
            "label": "Just send me an email first",
            "to": "send_email"
          }
        ]
      },
      "confirm_meeting": {
        "label": "CONFIRM MEETING",
        "say": "Perfect — I'll send that invite over right now. It'll be a quick 15 minutes, I'll show you exactly how it works with turnover photos, and worst case you steal some ideas. Really appreciate you taking my call, Sheldon.",
        "note": "STOP SELLING. Confirm and get off the phone. Send the invite immediately after hanging up. Add a short agenda in the invite body.",
        "branches": []
      },
      "book_meeting_referral": {
        "label": "CONFIRM REFERRAL PATH",
        "say": "That's huge — really appreciate it. I'll send you a quick note you can forward along, and I'll reach out to them directly too so you're not doing all the work. Thanks for pointing me in the right direction, Sheldon.",
        "note": "Send two things: (1) a forwardable email to Sheldon, (2) a direct outreach to the person he named. Reference Sheldon by name in the outreach. Follow up with Sheldon in 3-5 days.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair — one quick question before I do. What would be most useful to include so it's not just another generic pitch sitting in your inbox? Like are you more curious about how it works technically, or is it more about what other managers in similar markets are seeing?",
        "note": "Ask what to include. It re-engages them and makes the follow-up actually relevant. Include a specific time suggestion in the email. Follow up in 3 days if no response.",
        "branches": [
          {
            "label": "Tells you what to include",
            "to": "confirm_email"
          },
          {
            "label": "Just send whatever / the basics",
            "to": "confirm_email"
          }
        ]
      },
      "send_email_champion": {
        "label": "SEND EMAIL — CHAMPION VERSION",
        "say": "Perfect — I'll put together a quick summary of what we talked about. Something short enough that you could forward it in an email or bring up in a team call. I'll include a couple examples from other managers too. What's the best email — is it sheldon.arnold@vacasa.com?",
        "note": "Confirm email. Send a concise, forwardable summary within 1 hour. Include a clear next step and specific time suggestion for a follow-up call with the decision maker.",
        "branches": [
          {
            "label": "Confirms email",
            "to": "confirm_email_champion"
          },
          {
            "label": "Gives different email",
            "to": "confirm_email_champion"
          }
        ]
      },
      "confirm_email": {
        "label": "CONFIRM EMAIL SEND",
        "say": "Got it — I'll get that over to you today. And if it makes sense after you look at it, maybe we grab 15 minutes next week? I'll suggest a couple times in the email. Appreciate your time, Sheldon.",
        "note": "Always suggest a specific follow-up time in the email. Don't just send info and hope. Follow up in 3 days.",
        "branches": []
      },
      "confirm_email_champion": {
        "label": "CONFIRM CHAMPION EMAIL",
        "say": "Awesome — I'll get that to you today. Really appreciate you being open to passing it along. I'll follow up in a few days to see if it went anywhere. Thanks Sheldon.",
        "note": "Follow up in 3-5 days. If no response, try calling again with 'Hey I sent that info over last week — did you get a chance to pass it along?'",
        "branches": []
      },
      "book_callback": {
        "label": "BOOK CALLBACK",
        "say": "Perfect — I'll try you at the same time tomorrow then. Appreciate it, Sheldon. Talk soon.",
        "note": "Set a calendar reminder for the exact callback time. When you call back, open with 'Hey Sheldon, it's Sam Parks — you told me to try you back today.' Treat it as a warm call.",
        "branches": []
      },
      "reschedule": {
        "label": "RESCHEDULE",
        "say": "Totally — when would be a better time to catch you? I can work around your schedule.",
        "note": "Get a specific day and time. If they're vague, suggest something concrete: 'How about Thursday morning?'",
        "branches": [
          {
            "label": "Gives a time",
            "to": "book_callback"
          },
          {
            "label": "Just email me",
            "to": "send_email"
          },
          {
            "label": "Don't call back",
            "to": "graceful_exit"
          }
        ]
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand, Sheldon. If anything changes or you ever want to see what other managers in international markets are doing with their turnover photos, I'm easy to find. Appreciate your time.",
        "note": "Don't burn the bridge. Stay warm. Add to a 90-day re-engagement list. Note the objection reason for future attempts.",
        "branches": []
      }
    }
  }
}