{
  "name": "Stephanie Stevenson",
  "title": "General Manager, Steamboat Springs",
  "company": "Moving Mountains",
  "location": "Steamboat Springs, CO",
  "phone": "+1-970-870-9359",
  "company_phone": "(877) 624-2538",
  "alt_phones": [
    "+1-970-870-9359",
    "+1-970-445-2300",
    "+1-970-547-2122",
    "+1-970-870-9487"
  ],
  "flow": {
    "context": "Stephanie Stevenson is the General Manager of Moving Mountains' Steamboat Springs market — their HQ and operational benchmark. She owns guest readiness, owner satisfaction, and local P&L for the flagship location. Moving Mountains manages ~250 luxury vacation rentals across Steamboat, Vail, Beaver Creek, and Breckenridge. They run Breezeway for ops and Track as their PMS, with dedicated QA inspector roles in every market. They just took investment from StayTerra (May 2025) and have been acquiring companies (Triumph Mountain Properties, Paragon Lodging) — meaning Stephanie is absorbing new properties and standardizing across a growing portfolio. Sam skied Jackson Hole in January 2026 — Steamboat is a natural skiing connection, and Moving Mountains is exactly the kind of high-touch luxury operator where a single missed stain costs a five-star review.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER — SKIING CONNECTION",
        "say": "Hey Stephanie — I was actually just out in Jackson Hole last month skiing, and I've been meaning to reach out to some folks in Steamboat. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Feet up on the desk. Relaxed. The skiing mention is real — Sam was in Jackson Hole Jan 2026. Steamboat is her world. Sound like a peer, not a pitch.",
        "branches": [
          {
            "label": "No, I haven't heard of you",
            "to": "no_heard"
          },
          {
            "label": "Yes / maybe / sounds familiar",
            "to": "yes_heard"
          },
          {
            "label": "Who is this? / What's this about?",
            "to": "who_is_this"
          },
          {
            "label": "I'm busy / bad time",
            "to": "bad_timing"
          }
        ]
      },
      "no_heard": {
        "label": "HAVEN'T HEARD — TRANSITION TO PAIN",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call is — I work with a few other luxury property managers, and one thing that keeps coming up, especially with folks running 100-plus homes in ski markets, is this inspection bottleneck. Like, your QA team is taking photos after every turnover, your housekeepers are snapping pictures, but nobody actually has time to review all of them before the next guest walks in. And when something slips — a stain on a couch in a home that's renting for a thousand-plus a night — it's not just a bad review, it's a call from an owner. We built an AI that plugs into Breezeway and actually analyzes those photos automatically — flags damage, missing items, staging issues — before the guest arrives. Would you be open to taking a look sometime when I'm not cold calling you out of the blue?",
        "note": "Pause after 'call from an owner.' Let her react. She manages the HQ market — she feels the owner pressure directly. Reference Breezeway by name since they use it. Don't oversell the tech.",
        "branches": [
          {
            "label": "That's interesting / tell me more",
            "to": "warm_discovery"
          },
          {
            "label": "We already have a process for that",
            "to": "have_process"
          },
          {
            "label": "Not interested",
            "to": "not_interested"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          },
          {
            "label": "I'm not the right person for this",
            "to": "not_right_person"
          },
          {
            "label": "What does it cost / how does it work?",
            "to": "how_it_works"
          }
        ]
      },
      "yes_heard": {
        "label": "THEY'VE HEARD OF US",
        "say": "Oh nice — well normally we'd be working with someone like you, especially running the Steamboat market. What'd you hear?",
        "note": "Let her talk. She may have heard from another PM company or seen something online. Listen and adapt.",
        "branches": [
          {
            "label": "Vague / not sure where",
            "to": "yes_vague"
          },
          {
            "label": "Heard something specific",
            "to": "yes_specific"
          },
          {
            "label": "Actually no, I was just being polite",
            "to": "no_heard"
          }
        ]
      },
      "yes_vague": {
        "label": "VAGUE RECOGNITION — BRIDGE TO PAIN",
        "say": "Yeah, we've been popping up with a few property managers in ski country. The short version is — we help luxury operators like you guys catch damage and staging issues automatically from the photos your team is already taking in Breezeway. No workflow change. The AI just reviews what your QA team and housekeepers are already shooting. Would you be open to seeing how it works?",
        "note": "Keep it brief. She gave you a soft opening — don't overload it. Get to the CTA fast.",
        "branches": [
          {
            "label": "Sure, I'd take a look",
            "to": "book_meeting"
          },
          {
            "label": "Tell me more first",
            "to": "warm_discovery"
          },
          {
            "label": "We're pretty covered on that",
            "to": "have_process"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          }
        ]
      },
      "yes_specific": {
        "label": "HEARD SOMETHING SPECIFIC",
        "say": "Oh that's great to hear. Yeah, that's exactly what we do. Given you're running the flagship market for Moving Mountains — especially with all the growth you guys have had — I'd love to show you what it looks like on properties similar to yours. Would you be open to a quick look sometime this week or next?",
        "note": "Mirror whatever she said back. If she names a specific company or person, note it for follow-up. Move to booking.",
        "branches": [
          {
            "label": "Sure, let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "What exactly does it do?",
            "to": "how_it_works"
          },
          {
            "label": "I'd need to loop in someone else",
            "to": "loop_someone"
          }
        ]
      },
      "who_is_this": {
        "label": "WHO IS THIS — REFRAME",
        "say": "Yeah totally fair — it is a cold call. I'm Sam Parks with RapidEye. Can I get 30 seconds to tell you why I reached out? And you can totally hang up on me if it's not a fit.",
        "note": "Permission-based fallback. Don't get defensive. 30-second ask lowers the wall.",
        "branches": [
          {
            "label": "Sure, go ahead",
            "to": "permission_granted"
          },
          {
            "label": "No, I'm not interested",
            "to": "not_interested"
          },
          {
            "label": "Make it quick",
            "to": "permission_granted"
          }
        ]
      },
      "permission_granted": {
        "label": "30-SECOND PITCH",
        "say": "So I work with a few luxury vacation rental managers — one in New York doing about 200 homes, another on the East Coast with 600. The thing they all had in common is their teams were taking hundreds of turnover photos every week, but nobody had time to actually look at all of them before the next guest checked in. Stuff was getting missed — damage, missing items, staging problems — and it was costing them in guest complaints and owner disputes. We built an AI that plugs right into their existing workflow — in your case Breezeway and Track — and automatically flags issues from those photos. No extra steps for your team. Would you be open to taking a look?",
        "note": "This is the compressed version. Hit the pain, the proof, the solution, and the CTA in 30 seconds. She gave you the window — use it efficiently.",
        "branches": [
          {
            "label": "That's interesting / tell me more",
            "to": "warm_discovery"
          },
          {
            "label": "We already handle that",
            "to": "have_process"
          },
          {
            "label": "Not interested",
            "to": "not_interested"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow or later this week? When's less crazy?",
        "note": "Don't pitch into resistance. Get a specific callback time. If she gives you one, lock it down and call back exactly then.",
        "branches": [
          {
            "label": "Try me [specific time]",
            "to": "lock_callback"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          },
          {
            "label": "What's this about? (curiosity)",
            "to": "permission_granted"
          },
          {
            "label": "Don't call back",
            "to": "end_graceful"
          }
        ]
      },
      "lock_callback": {
        "label": "LOCK CALLBACK TIME",
        "say": "Perfect — I'll call you right at that time. And just so you have context when I do, it's Sam Parks, RapidEye — we help luxury property managers catch damage and issues from their turnover photos automatically. Talk to you then, Stephanie.",
        "note": "Repeat the time back. Put it in your calendar immediately. When you call back, reference this conversation: 'Hey Stephanie, it's Sam — you told me to try you back at this time.'",
        "branches": []
      },
      "warm_discovery": {
        "label": "WARM — ASK QUESTIONS",
        "say": "Awesome. So I don't want to pitch you on stuff that doesn't matter — can I ask, what does your inspection process look like right now in Steamboat? Like, are your QA folks doing walkthroughs after housekeeping and taking photos, or is it more of a checklist situation?",
        "note": "STOP PITCHING. She's warm. Ask questions. You know they have QA specialists (Anna Calhoon manages QA in Steamboat). Let her describe the workflow in her own words. Listen for pain signals.",
        "branches": [
          {
            "label": "Describes QA photo process",
            "to": "discovery_photos"
          },
          {
            "label": "Describes checklist process",
            "to": "discovery_checklists"
          },
          {
            "label": "Says it's working fine",
            "to": "discovery_working"
          },
          {
            "label": "Mentions a specific pain / problem",
            "to": "discovery_pain_surfaced"
          }
        ]
      },
      "discovery_photos": {
        "label": "THEY TAKE PHOTOS — DIG DEEPER",
        "say": "Got it. And when those photos come in — is someone on your team actually reviewing every single one before the guest arrives? Or is it more like they're there for documentation if something goes wrong after the fact?",
        "note": "This is the key question. Most teams take photos but nobody reviews them all in real time. If she admits the gap, that's the opening.",
        "branches": [
          {
            "label": "Admits not all get reviewed",
            "to": "discovery_gap_confirmed"
          },
          {
            "label": "Says someone reviews them all",
            "to": "discovery_thorough"
          },
          {
            "label": "Says it's mostly for documentation",
            "to": "discovery_gap_confirmed"
          }
        ]
      },
      "discovery_checklists": {
        "label": "CHECKLIST PROCESS — FIND THE GAP",
        "say": "Makes sense. And the checklist — is that through Breezeway? And do your QA folks attach photos to each item, or is it more pass-fail on each line?",
        "note": "You know they use Breezeway. Checklists without photo verification are the biggest miss vector. Probe for whether photos are attached and reviewed.",
        "branches": [
          {
            "label": "Yes Breezeway, photos attached",
            "to": "discovery_photos"
          },
          {
            "label": "Checklist only, limited photos",
            "to": "discovery_gap_confirmed"
          },
          {
            "label": "Mix of both",
            "to": "discovery_gap_confirmed"
          }
        ]
      },
      "discovery_working": {
        "label": "SAYS IT'S WORKING — VALIDATE AND PROBE",
        "say": "That's great — honestly, that's rare. Most folks I talk to are drowning. What about as you guys keep growing? I know you've added a bunch of homes in the last year or two. Is your QA team scaling with that, or is it getting stretched?",
        "note": "She may be guarding. Reference their growth (22 homes added in 2024, StayTerra investment, acquisitions). Growth strains QA — she knows this.",
        "branches": [
          {
            "label": "Admits growth is creating strain",
            "to": "discovery_gap_confirmed"
          },
          {
            "label": "Stays firm it's handled",
            "to": "have_process"
          },
          {
            "label": "Mentions specific growing pain",
            "to": "discovery_pain_surfaced"
          }
        ]
      },
      "discovery_gap_confirmed": {
        "label": "GAP CONFIRMED — CONNECT TO SOLUTION",
        "say": "Yeah, that's exactly what I keep hearing. And especially with luxury homes — when you're promising owners detailed pre-arrival inspections and the guest is paying a thousand-plus a night — the margin for error is basically zero. That's exactly what we built RapidEye for. It sits on top of Breezeway, analyzes every photo your team uploads, and flags anything that looks off — damage, missing items, staging that doesn't match the baseline. Your QA team doesn't change anything they're doing. They just start getting alerts on the stuff that actually needs attention. Would it make sense to show you what that looks like on a few of your Steamboat properties?",
        "note": "Now you can pitch — she told you the problem first. Reference their specific promises (detailed pre-arrival inspections) and price point. Make the CTA property-specific.",
        "branches": [
          {
            "label": "Yes, let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "How does it actually work?",
            "to": "how_it_works"
          },
          {
            "label": "I'd need to loop someone in",
            "to": "loop_someone"
          },
          {
            "label": "What does it cost?",
            "to": "cost_question"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          }
        ]
      },
      "discovery_pain_surfaced": {
        "label": "PAIN SURFACED — MIRROR AND BRIDGE",
        "say": "Yeah — that's real. And that's honestly the exact thing that got us started building this. The property manager we first worked with in New York was dealing with the same thing — 200 luxury homes, photos coming in from every turnover, and stuff still slipping through. Within the first week of using RapidEye, the AI caught a cracked countertop that three people had walked past. Would it make sense to show you what it'd look like plugged into your Breezeway setup?",
        "note": "Mirror her exact words back before bridging. Use the NYC case study — it's real traction with luxury homes. Keep it story-driven, not feature-driven.",
        "branches": [
          {
            "label": "Yes, I'd see that",
            "to": "book_meeting"
          },
          {
            "label": "Tell me more about how it works",
            "to": "how_it_works"
          },
          {
            "label": "Who else are you working with?",
            "to": "social_proof"
          },
          {
            "label": "I need to check with my team",
            "to": "loop_someone"
          }
        ]
      },
      "discovery_thorough": {
        "label": "SAYS EVERY PHOTO IS REVIEWED — REFRAME",
        "say": "That's impressive — honestly wish more teams were that disciplined. The thing I keep hearing though is even when someone's reviewing every photo, when you're doing it dozens of times a day, your eyes start glazing over. The AI doesn't get tired. It catches the same stuff on turnover number fifty that it does on turnover number one. Even if your process is solid, it's basically a safety net that costs less than one missed damage claim. Worth a look?",
        "note": "Don't argue with her. Validate, then reframe from 'replacement' to 'safety net.' The AI-doesn't-get-tired angle works well with operators who take pride in their process.",
        "branches": [
          {
            "label": "Fair point, I'd take a look",
            "to": "book_meeting"
          },
          {
            "label": "We really are covered",
            "to": "have_process"
          },
          {
            "label": "Send me info",
            "to": "send_email"
          }
        ]
      },
      "have_process": {
        "label": "OBJECTION — HAVE A PROCESS",
        "say": "That makes total sense — with 250-plus homes across four markets, you'd have to have something locked in. Just so nobody from my team bugs you again — is it that you're fully covered and happy with how it's working, or is it more that switching anything right now would be a headache, especially with everything going on with StayTerra and the integrations?",
        "note": "Acknowledge their scale. Reference StayTerra investment — she knows they're in a change period. Split the objection to find the real issue. The 'so nobody bugs you' line gives her a reason to keep talking.",
        "branches": [
          {
            "label": "We're happy with our process",
            "to": "truly_covered"
          },
          {
            "label": "It's more the timing / too much change",
            "to": "timing_objection"
          },
          {
            "label": "Actually, it's not perfect...",
            "to": "discovery_gap_confirmed"
          },
          {
            "label": "What do you know about StayTerra?",
            "to": "stayterra_pivot"
          }
        ]
      },
      "not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "I totally get it — I should have assumed you'd be all set, otherwise you probably would have reached out. Just so no one from my team cold calls you again — is it that inspection quality isn't something you're focused on right now, or is it more that you just hate cold calls? Because honestly, I get it either way.",
        "note": "Agree first. Split the objection. Most people will admit it's the cold call, not the topic — which opens the door back up.",
        "branches": [
          {
            "label": "I just hate cold calls",
            "to": "hate_cold_calls"
          },
          {
            "label": "We're genuinely not focused on this",
            "to": "truly_covered"
          },
          {
            "label": "It's both",
            "to": "hate_cold_calls"
          },
          {
            "label": "Don't call again",
            "to": "end_graceful"
          }
        ]
      },
      "hate_cold_calls": {
        "label": "HATES COLD CALLS — SELL THE TEST DRIVE",
        "say": "Ha — honestly, same. I don't love making them either. Look, you're probably not buying anything from a cold call today, and I totally respect that. But if nothing else, I could walk you through what a couple other luxury PM companies in ski markets are doing with their turnover photos. Worst case, you steal some ideas and we part as friends. Would you be open to that?",
        "note": "Lower the stakes completely. You're not selling — you're sharing industry intel. GM-level people care about what their competitors are doing.",
        "branches": [
          {
            "label": "Sure, why not",
            "to": "book_meeting"
          },
          {
            "label": "Just email me",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "end_graceful"
          }
        ]
      },
      "truly_covered": {
        "label": "TRULY COVERED — PLANT THE SEED",
        "say": "Honestly respect that. You guys clearly run a tight ship — I've heard that about Moving Mountains. Look, if anything changes — busy season hits, you add another batch of homes, QA gets stretched — I'm easy to find. Sam Parks, RapidEye. I really appreciate you taking my call, Stephanie.",
        "note": "Don't push a dead objection. Leave with class. She'll remember the call if/when things get painful.",
        "branches": []
      },
      "timing_objection": {
        "label": "TIMING / TOO MUCH CHANGE",
        "say": "Yeah, that makes total sense. Post-investment there's always a million things being re-evaluated at once. Here's what I'd say — the folks who get the most out of this are the ones who evaluate it before they need it, so when budget does open up or when someone asks 'what tools should we standardize across markets,' you already know what's out there. Would you be open to a quick look — no commitment, just so it's on your radar?",
        "note": "StayTerra investment means they're likely evaluating tools company-wide. Position RapidEye as something to have in her back pocket for that conversation.",
        "branches": [
          {
            "label": "That's fair, let's do a quick look",
            "to": "book_meeting"
          },
          {
            "label": "Maybe in a few months",
            "to": "future_followup"
          },
          {
            "label": "Send me something for now",
            "to": "send_email"
          }
        ]
      },
      "stayterra_pivot": {
        "label": "STAYTERRA QUESTION — USE AS LEVERAGE",
        "say": "Just what's public — that they invested, and that part of the value they're bringing is technology and data solutions. Which honestly is one reason I reached out now rather than later. If there's going to be a push to standardize ops tooling across markets, having something like RapidEye already evaluated puts you ahead of the curve. Would it make sense to take a look so you have it in your back pocket?",
        "note": "She might be surprised you know about StayTerra. That's fine — it shows you did homework. Don't oversell the connection, just position timing.",
        "branches": [
          {
            "label": "That's smart, let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "I'd need to run that up the chain",
            "to": "loop_someone"
          },
          {
            "label": "Send me info",
            "to": "send_email"
          }
        ]
      },
      "how_it_works": {
        "label": "HOW IT WORKS",
        "say": "Yeah so the simple version — your QA team and housekeepers are already taking photos during turnovers in Breezeway, right? RapidEye connects to Breezeway, pulls those photos automatically, and runs them through our AI. It compares each photo against a baseline of what that property is supposed to look like — catches damage, missing items, furniture that's been moved, staging issues. Then it generates an inspection report and flags anything that needs attention before the guest checks in. Your team doesn't change a single thing about what they're doing. They just get better output from the photos they're already taking.",
        "note": "Keep it concrete. She's a GM — she doesn't need deep technical details. Breezeway integration is the key point. If she asks about Track, mention we integrate with both.",
        "branches": [
          {
            "label": "That's cool — what does it cost?",
            "to": "cost_question"
          },
          {
            "label": "How long does it take to set up?",
            "to": "setup_question"
          },
          {
            "label": "I'd want to see it",
            "to": "book_meeting"
          },
          {
            "label": "I'd need to loop in our ops team",
            "to": "loop_someone"
          }
        ]
      },
      "cost_question": {
        "label": "COST QUESTION",
        "say": "Totally fair question. It depends on portfolio size and volume, but I'd rather show you exactly what it looks like on your properties first so you can see the value before we talk numbers. That way the conversation is grounded in what it'd actually do for your Steamboat homes. Can we set up 20 minutes this week?",
        "note": "Don't give pricing on a cold call. Redirect to the meeting where you can demo value first. If she presses hard, say 'it's a fraction of what one missed damage claim costs on a luxury home.'",
        "branches": [
          {
            "label": "Sure, let's set it up",
            "to": "book_meeting"
          },
          {
            "label": "Just give me a ballpark",
            "to": "cost_pressed"
          },
          {
            "label": "Send me info with pricing",
            "to": "send_email"
          }
        ]
      },
      "cost_pressed": {
        "label": "COST PRESSED — GIVE RANGE",
        "say": "Honestly, for a portfolio your size, it's a fraction of what one missed damage claim costs you on a luxury home. We're not talking enterprise software pricing — it's built for operators. But I really think it'd make more sense to see it first. How about 20 minutes next Tuesday or Wednesday?",
        "note": "Anchor to the cost of a miss, not a monthly fee. Then redirect to booking. Don't get stuck in a pricing negotiation on a cold call.",
        "branches": [
          {
            "label": "Okay, let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Email me details",
            "to": "send_email"
          }
        ]
      },
      "setup_question": {
        "label": "SETUP QUESTION",
        "say": "Super fast — since you're already on Breezeway and Track, the integration is basically plug-and-play. We connect to your Breezeway account, pull the photos your team is already uploading, and the AI starts analyzing immediately. No new hardware, no app to install, no training for your housekeepers or QA team. Honestly the hardest part is picking which properties to start with. Can we set up 20 minutes so I can show you the actual setup?",
        "note": "Reference their exact stack — Breezeway and Track. The 'no workflow change' point is critical for a GM who doesn't want to disrupt her team.",
        "branches": [
          {
            "label": "Let's set it up",
            "to": "book_meeting"
          },
          {
            "label": "Who else would need to be involved?",
            "to": "loop_someone"
          }
        ]
      },
      "social_proof": {
        "label": "SOCIAL PROOF REQUEST",
        "say": "Yeah — so we're working with a property manager in New York doing about 200 luxury homes, another on the East Coast with around 600 properties, and an operator in Dubai with about 100. The New York one is probably the closest comparison to you guys — high-end homes, demanding guests, owners who notice everything. Within the first week, the AI caught stuff that three sets of eyes had missed.",
        "note": "Use real traction numbers. The NYC luxury comp is strongest for Moving Mountains. Don't name-drop clients without permission — keep it general but specific enough to be credible.",
        "branches": [
          {
            "label": "Impressive — let's set up a call",
            "to": "book_meeting"
          },
          {
            "label": "Are you working with anyone in ski markets?",
            "to": "ski_market_proof"
          },
          {
            "label": "Send me a case study",
            "to": "send_email"
          }
        ]
      },
      "ski_market_proof": {
        "label": "SKI MARKET QUESTION",
        "say": "We're actively talking to a few other operators in Colorado ski towns right now — I won't name names since they'd probably say the same thing about me sharing theirs. But the use case is identical — seasonal peaks, luxury homes, high turnover volume compressed into a few days, and QA teams that are stretched thin during the busy weeks. That's actually where the AI helps most — it doesn't slow down when volume spikes. Worth a look?",
        "note": "Be honest — don't fabricate ski market clients. But frame the pipeline and the use case fit. Seasonal volume spikes are a real pain point for ski market GMs.",
        "branches": [
          {
            "label": "Yeah, let's take a look",
            "to": "book_meeting"
          },
          {
            "label": "Send me info",
            "to": "send_email"
          }
        ]
      },
      "loop_someone": {
        "label": "NEEDS TO LOOP SOMEONE IN",
        "say": "Totally makes sense. Who on your team would you want in the room? Would it be someone like your operations director or your QA manager? I want to make sure I'm showing the right stuff to the right people.",
        "note": "You know Lisa Riniker is Director of Operations and Anna Calhoon is Housekeeping & QA Manager in Steamboat. If she names either, confirm you know the role. If she names Chad Rowe (COO), that's even better — that's the executive buyer.",
        "branches": [
          {
            "label": "Names a specific person",
            "to": "loop_named"
          },
          {
            "label": "Says she'll figure it out",
            "to": "loop_vague"
          },
          {
            "label": "Says to talk to someone else instead",
            "to": "referral_redirect"
          }
        ]
      },
      "loop_named": {
        "label": "PERSON NAMED — BOOK WITH BOTH",
        "say": "Perfect — that makes total sense. Why don't we get something on the calendar with both of you? I've got next week pulled up — does Tuesday or Wednesday work? I'll keep it to 20 minutes.",
        "note": "Lock the meeting now with both names. If she names Anna Calhoon or Lisa Riniker, that's ideal — include them on the invite. Send the calendar invite while on the phone if possible.",
        "branches": [
          {
            "label": "Gives a time",
            "to": "confirm_meeting"
          },
          {
            "label": "Let me check and get back to you",
            "to": "send_email_with_time"
          }
        ]
      },
      "loop_vague": {
        "label": "VAGUE ON WHO — OFFER TO HELP",
        "say": "No problem. Would it help if I sent you a quick summary you could forward to whoever makes sense? And then we could set something up once you've got the right folks? I just don't want it to get lost in the shuffle — how about I follow up Thursday if I haven't heard back?",
        "note": "Give her a specific follow-up date. The 'lost in the shuffle' framing is real — GMs are busy. Set the next action clearly.",
        "branches": [
          {
            "label": "Yeah send me something",
            "to": "send_email"
          },
          {
            "label": "Let me just set it up now",
            "to": "book_meeting"
          }
        ]
      },
      "referral_redirect": {
        "label": "REDIRECTED TO SOMEONE ELSE",
        "say": "Got it — that's really helpful. Who would that be? Just so I can put something tailored together that actually makes sense for them.",
        "note": "Get the name and title. If she says Lisa Riniker, Chad Rowe, Anna Calhoon, or Liz Piazza — you have research on all of them. Ask for direct contact info if she'll share it.",
        "branches": [
          {
            "label": "Gives name and contact info",
            "to": "referral_secured"
          },
          {
            "label": "Gives name but no contact",
            "to": "referral_name_only"
          },
          {
            "label": "Says just call the main line",
            "to": "referral_main_line"
          }
        ]
      },
      "referral_secured": {
        "label": "REFERRAL SECURED WITH CONTACT",
        "say": "That's perfect, really appreciate that. And would it be okay if I mentioned you pointed me their way? That goes a long way.",
        "note": "Always ask permission to use her name. A warm referral from the Steamboat GM is gold. Send a tailored email to the referral within the hour.",
        "branches": [
          {
            "label": "Sure, go ahead",
            "to": "end_referral_thanks"
          },
          {
            "label": "Rather you didn't",
            "to": "end_referral_thanks"
          }
        ]
      },
      "referral_name_only": {
        "label": "GOT NAME, NO CONTACT",
        "say": "Great — I'll track them down. And is it cool if I mention you pointed me their way?",
        "note": "Use the firstname@movingmountains.com email pattern to reach them. Reference Stephanie by name in your outreach if she approves.",
        "branches": [
          {
            "label": "Sure / fine",
            "to": "end_referral_thanks"
          },
          {
            "label": "Just reach out on your own",
            "to": "end_referral_thanks"
          }
        ]
      },
      "referral_main_line": {
        "label": "REFERRED TO MAIN LINE",
        "say": "Got it — I'll give them a ring. Thanks for pointing me in the right direction, Stephanie. Really appreciate your time.",
        "note": "Call the Steamboat office at 970-870-9359. When you call, say 'Hey, Stephanie Stevenson suggested I reach out to [name].' That's your warm intro.",
        "branches": []
      },
      "not_right_person": {
        "label": "NOT THE RIGHT PERSON",
        "say": "Totally hear you — who on your team would typically own the inspection or QA workflow? I know you guys have a pretty built-out ops team in Steamboat.",
        "note": "She may punt to Anna Calhoon (QA Manager), Lisa Riniker (Director of Operations), or Chad Rowe (COO). All are valid targets. Get a name.",
        "branches": [
          {
            "label": "Names someone specific",
            "to": "referral_redirect"
          },
          {
            "label": "Doesn't know / not sure",
            "to": "referral_probe"
          },
          {
            "label": "Nobody is looking at this",
            "to": "truly_covered"
          }
        ]
      },
      "referral_probe": {
        "label": "PROBE FOR REFERRAL",
        "say": "No worries. Would it be more of an operations director type, or more of someone on the QA or housekeeping side? Just trying to figure out the right altitude so I don't waste anyone's time.",
        "note": "Guide her to the right level. If she says ops director, that's Lisa Riniker. If she says QA/housekeeping, that's Anna Calhoon. If she says COO-level, that's Chad Rowe.",
        "branches": [
          {
            "label": "Operations / director level",
            "to": "referral_redirect"
          },
          {
            "label": "QA / housekeeping level",
            "to": "referral_redirect"
          },
          {
            "label": "Really can't help",
            "to": "end_graceful"
          }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most relevant to include so it's not just another generic vendor pitch sitting in your inbox? Like, is it more about how it works technically, or more about what it's actually caught for other luxury operators?",
        "note": "Tailor the email based on her answer. Always include a specific time suggestion in the email: 'Would next Tuesday at 2pm MT work for a quick look?' Send within 30 minutes of hanging up.",
        "branches": [
          {
            "label": "Tells you what to include",
            "to": "send_email_confirm"
          },
          {
            "label": "Just send whatever",
            "to": "send_email_confirm"
          }
        ]
      },
      "send_email_confirm": {
        "label": "CONFIRM EMAIL DETAILS",
        "say": "Perfect — I'll get that over to you today. And just so it doesn't sit in your inbox forever — would it be cool if I followed up Thursday or Friday if I haven't heard back? That way I'm not being annoying but I'm also not just disappearing.",
        "note": "Lock a follow-up date. Use stephanie@movingmountains.com based on the firstname@ pattern. Subject line should reference this call: 'Following up — Sam from RapidEye (re: turnover photos)'",
        "branches": [
          {
            "label": "Sure, that works",
            "to": "end_email_thanks"
          },
          {
            "label": "I'll reach out if interested",
            "to": "end_email_thanks"
          }
        ]
      },
      "send_email_with_time": {
        "label": "EMAIL WITH TIME SUGGESTION",
        "say": "Perfect — I'll send something over with a couple time options. And if I don't hear back by Thursday, I'll give you a quick ring just to make sure it landed. Sound good?",
        "note": "Include 2-3 specific time slots in the email. Follow up exactly when you said you would.",
        "branches": [
          {
            "label": "Sounds good",
            "to": "end_email_thanks"
          },
          {
            "label": "I'll get back to you",
            "to": "end_email_thanks"
          }
        ]
      },
      "future_followup": {
        "label": "FUTURE FOLLOW-UP",
        "say": "Totally respect that. When would make more sense — like after ski season wraps, or more like when you're gearing up for next winter? I just want to time it right.",
        "note": "Ski season context matters. If she says after season, note it and call back in April/May. If she says before next winter, call in September/October. Lock a specific timeframe.",
        "branches": [
          {
            "label": "Gives a timeframe",
            "to": "lock_future"
          },
          {
            "label": "Just call back in a few months",
            "to": "lock_future"
          }
        ]
      },
      "lock_future": {
        "label": "LOCK FUTURE FOLLOW-UP",
        "say": "Got it — I'll put that in my calendar and reach out then. And I'll shoot you a quick email now just so you have my info if anything changes before then. Really appreciate your time, Stephanie.",
        "note": "Put the callback date in your CRM immediately. Send a brief email today so she has your contact info. Reference the conversation when you call back.",
        "branches": []
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next week pulled up — does Tuesday or Wednesday work better? I'll keep it to 20 minutes, I promise.",
        "note": "Pick a day. Be specific. Don't say 'when works for you' — give options. 20 minutes is the right frame for a first look.",
        "branches": [
          {
            "label": "Picks a day",
            "to": "confirm_meeting"
          },
          {
            "label": "Different week",
            "to": "alt_meeting_time"
          },
          {
            "label": "Let me check my calendar and get back",
            "to": "send_email_with_time"
          }
        ]
      },
      "alt_meeting_time": {
        "label": "ALTERNATE TIME",
        "say": "No problem — what week looks better? I'm flexible.",
        "note": "Let her pick. Whatever she says, lock it immediately.",
        "branches": [
          {
            "label": "Gives a time",
            "to": "confirm_meeting"
          },
          {
            "label": "Send me times via email",
            "to": "send_email_with_time"
          }
        ]
      },
      "confirm_meeting": {
        "label": "CONFIRM MEETING",
        "say": "Perfect — I'll send over a calendar invite right now so it's locked in. It'll be from Sam Parks at RapidEye. And if there's anyone else on your team you want in the room — like your QA manager or ops director — feel free to forward it. I'll make sure to show stuff that's relevant to whoever's there. Really appreciate you taking my call, Stephanie.",
        "note": "Send the invite IMMEDIATELY — while still on the phone if possible. Include a brief agenda in the invite body. Stop selling. The meeting is booked. Hang up clean.",
        "branches": []
      },
      "end_graceful": {
        "label": "END — GRACEFUL EXIT",
        "say": "Totally understand. If anything changes down the road — busy season hits, you're evaluating new tools, whatever — I'm easy to find. Sam Parks, RapidEye. Really appreciate your time, Stephanie.",
        "note": "Don't burn the bridge. She may come back when things get painful. Log the call and set a 90-day follow-up reminder.",
        "branches": []
      },
      "end_referral_thanks": {
        "label": "END — REFERRAL SECURED",
        "say": "Really appreciate that, Stephanie. I'll reach out to them and make sure it's relevant. Thanks for taking my call — enjoy the rest of ski season out there.",
        "note": "Send the referral outreach within the hour. Mention Stephanie by name if she approved it. Follow up with Stephanie after you connect with the referral to close the loop.",
        "branches": []
      },
      "end_email_thanks": {
        "label": "END — EMAIL FOLLOW-UP SET",
        "say": "Perfect. I'll get that over to you today. Really appreciate your time, Stephanie. Talk soon.",
        "note": "Send the email within 30 minutes. Use stephanie@movingmountains.com. Include a specific meeting time suggestion. Set a follow-up reminder for the exact date you said you'd call back.",
        "branches": []
      },
      "gatekeeper": {
        "label": "GATEKEEPER — SOMEONE ELSE ANSWERS",
        "say": "Hey — could you get me through to Stephanie? It's Sam.",
        "note": "Don't pitch the gatekeeper. Don't explain what RapidEye is. Say Sam like you know her. If they ask what it's regarding, move to gatekeeper_context.",
        "branches": [
          {
            "label": "Transfers you / puts you through",
            "to": "opener"
          },
          {
            "label": "She's not available",
            "to": "gatekeeper_unavailable"
          },
          {
            "label": "What's this regarding?",
            "to": "gatekeeper_context"
          },
          {
            "label": "Can I take a message?",
            "to": "gatekeeper_message"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — CONTEXT REQUEST",
        "say": "Yeah, I work with a few other property managers in Steamboat. Would you mind letting her know it's Sam Parks?",
        "note": "Keep it vague and local. 'Property managers in Steamboat' sounds like a peer connection, not a sales call. Don't say the company name unless pushed.",
        "branches": [
          {
            "label": "Transfers you",
            "to": "opener"
          },
          {
            "label": "She's busy / in a meeting",
            "to": "gatekeeper_unavailable"
          },
          {
            "label": "What company are you with?",
            "to": "gatekeeper_company"
          },
          {
            "label": "Can I take a message?",
            "to": "gatekeeper_message"
          }
        ]
      },
      "gatekeeper_company": {
        "label": "GATEKEEPER — COMPANY ASKED",
        "say": "RapidEye — we help a couple other property management companies in the area with their inspection workflows. I sent her a note — would you mind giving her a heads up that I'm on the line?",
        "note": "Social proof framing. 'Sent her a note' implies prior contact. End with a redirect question to keep control.",
        "branches": [
          {
            "label": "Transfers you",
            "to": "opener"
          },
          {
            "label": "She's not available",
            "to": "gatekeeper_unavailable"
          },
          {
            "label": "I'll take a message",
            "to": "gatekeeper_message"
          }
        ]
      },
      "gatekeeper_unavailable": {
        "label": "GATEKEEPER — NOT AVAILABLE",
        "say": "No worries — when's she usually back at her desk? I'll try her then.",
        "note": "Get a specific time. Don't leave a voicemail if you can avoid it — call back at the time they give you. If they insist on a message, go to gatekeeper_message.",
        "branches": [
          {
            "label": "Gives a time",
            "to": "lock_callback"
          },
          {
            "label": "Not sure / varies",
            "to": "gatekeeper_message"
          },
          {
            "label": "I can take a message",
            "to": "gatekeeper_message"
          }
        ]
      },
      "gatekeeper_message": {
        "label": "GATEKEEPER — LEAVE MESSAGE",
        "say": "Sure — just let her know Sam Parks called, from RapidEye. My number is [give number]. And if you could mention I work with a few property managers in Steamboat on their inspection workflows — that'd be great. Appreciate it.",
        "note": "Keep the message brief and curiosity-inducing. Don't pitch through the gatekeeper. Plan to call back regardless — don't rely on the callback.",
        "branches": []
      }
    }
  }
}