{
  "name": "Steven Goodwin",
  "title": "Co-Owner; leads Revenue Management, Guest Marketing & Guest Services",
  "company": "iTrip Charleston",
  "location": "Charleston, SC",
  "phone": "+1-843-303-9225",
  "company_phone": "(843) 630-6060",
  "alt_phones": [
    "+1-843-630-6060"
  ],
  "flow": {
    "context": "Steven Goodwin co-owns iTrip Charleston Beaches & Hilton Head with his wife Sarah — roughly 108 Charleston-area vacation rentals across Folly Beach, Isle of Palms, Kiawah, and downtown. He leads revenue management, guest marketing, and guest services, meaning he owns the downstream pain when turnover quality misses become guest complaints, refund requests, and damaged reviews. Their cleaners are outsourced vendors capturing photos in FlipStream (iTrip's proprietary turnover app) with iTrip staff doing a separate QA step — textbook RapidEye fit. Steven is also President of the iTrip Franchise Association (100+ destinations, 2,200+ properties system-wide) and just oversaw the Humand internal-platform rollout in late 2024, making him the ideal champion for a franchise-wide ops tool. Strongest angle: frame RapidEye as the next scalable rollout — same playbook as Humand but for turnover QA.",
    "start": "gatekeeper_initial",
    "nodes": {
      "gatekeeper_initial": {
        "label": "GATEKEEPER — SLIDE BY",
        "say": "Hey, could you get me through to Steven? It's Sam.",
        "note": "Megan Corn is likely the Office Manager who answers. Don't pitch, don't explain. Say it like you know him. Casual tone, like you're returning a call.",
        "branches": [
          {
            "label": "Put through to Steven",
            "to": "opener"
          },
          {
            "label": "Who's calling / what's this about?",
            "to": "gatekeeper_context"
          },
          {
            "label": "He's not available / not in",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — CONTEXT",
        "say": "Yeah — I work with a few other vacation rental operators on the East Coast. Would you mind letting Steven know it's Sam Parks?",
        "note": "Don't pitch RapidEye. Don't explain what you do. Just enough info to sound legit and relevant. If it's Megan, she coordinates with ops daily — she'll recognize the relevance.",
        "branches": [
          {
            "label": "Put through",
            "to": "opener"
          },
          {
            "label": "More questions / what company",
            "to": "gatekeeper_social_proof"
          },
          {
            "label": "He's not available",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "Totally — it's Sam Parks with RapidEye. We help a couple property management companies with their turnover inspection workflows. I sent Steven a note — would you mind giving him a heads up I'm on the line?",
        "note": "This is the last escalation. If they still block you, pivot to voicemail or callback. Don't argue or oversell.",
        "branches": [
          {
            "label": "Put through",
            "to": "opener"
          },
          {
            "label": "Still can't / won't connect",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_unavailable": {
        "label": "GATEKEEPER — NOT AVAILABLE",
        "say": "No worries at all. When's the best time to try him back? And could I leave a quick voicemail?",
        "note": "Get a callback window if possible. If they offer voicemail, take it. If they suggest someone else — Hunter Ray or Sarah Goodwin — take that referral.",
        "branches": [
          {
            "label": "Offers voicemail",
            "to": "voicemail"
          },
          {
            "label": "Gives callback time",
            "to": "gatekeeper_callback"
          },
          {
            "label": "Suggests someone else (Hunter, Sarah)",
            "to": "referral_from_gatekeeper"
          }
        ]
      },
      "gatekeeper_callback": {
        "label": "GATEKEEPER — CALLBACK LOCKED",
        "say": "Perfect, I'll try him then. Appreciate the help — and who am I speaking with, by the way?",
        "note": "Get their name. If it's Megan, you now have an internal contact to reference next time: 'Megan told me to try back today.' Log the callback time immediately.",
        "branches": []
      },
      "referral_from_gatekeeper": {
        "label": "GATEKEEPER — REDIRECTED",
        "say": "Oh, that'd be great actually. What's their name and the best way to reach them? Could you transfer me over?",
        "note": "If they suggest Hunter Ray (Ops Manager), he's actually a great contact for day-to-day inspection pain. If Sarah Goodwin, she's the co-owner focused on homeowner satisfaction. Take either.",
        "branches": [
          {
            "label": "Transferred to someone else",
            "to": "opener"
          },
          {
            "label": "Given name/number for later",
            "to": "gatekeeper_callback"
          }
        ]
      },
      "voicemail": {
        "label": "VOICEMAIL",
        "say": "Hey Steven, it's Sam Parks — I work with a few vacation rental operators on the East Coast on their turnover inspection workflows. Had something specific for you and the iTrip team. My number's [your number]. Again, Sam Parks. Talk soon.",
        "note": "Under 20 seconds. Don't explain RapidEye. Create just enough curiosity that he might Google you or pick up next time. Call back in 2 days.",
        "branches": []
      },
      "opener": {
        "label": "OPENER — HEARD THE NAME",
        "say": "Hey Steven — I've been working with a few vacation rental operators on the East Coast, and your name kept coming up through some iTrip folks. It's Sam Parks with RapidEye — have you heard my name tossed around?",
        "note": "Feet-up energy. Sound like a peer, not a salesperson. Steven runs the franchise association — 'through some iTrip folks' is plausible and flattering. Pause after the question and let him answer completely.",
        "branches": [
          {
            "label": "Yes / maybe / sounds familiar",
            "to": "heard_name_yes"
          },
          {
            "label": "No, I haven't",
            "to": "heard_name_no"
          },
          {
            "label": "Bad timing / busy / in a meeting",
            "to": "bad_timing"
          },
          {
            "label": "Hostile / who is this / how'd you get my number",
            "to": "permission_fallback"
          }
        ]
      },
      "heard_name_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone in your position. What'd you hear?",
        "note": "Let them talk. If they know something real, you're warm — go to discovery. If it's vague or polite ('oh maybe'), treat it like a soft no and transition to the pain trigger.",
        "branches": [
          {
            "label": "Shares something specific",
            "to": "warm_discovery"
          },
          {
            "label": "Vague / just being polite",
            "to": "pain_trigger"
          }
        ]
      },
      "heard_name_no": {
        "label": "HAVEN'T HEARD — TRANSITION TO PAIN",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call is —",
        "note": "Deliver this lightly, almost laughing at yourself. Then go straight into the pain trigger without a long pause. The self-deprecation buys you about 10 more seconds of attention.",
        "branches": [
          {
            "label": "Listening / continues",
            "to": "pain_trigger"
          },
          {
            "label": "Tries to cut off / not interested",
            "to": "permission_fallback"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow, maybe in the morning?",
        "note": "Give a specific day and time suggestion. Don't say 'sometime.' If he pushes back on that too, it's probably not just timing — shift to the permission fallback.",
        "branches": [
          {
            "label": "Agrees to callback time",
            "to": "bad_timing_callback"
          },
          {
            "label": "Pushes back / just not interested",
            "to": "permission_fallback"
          }
        ]
      },
      "bad_timing_callback": {
        "label": "CALLBACK SCHEDULED",
        "say": "Perfect — I'll try you then. Appreciate it, Steven.",
        "note": "Log the callback immediately. Set a reminder. When you call back, open with: 'Hey Steven, it's Sam Parks — you told me to try you back today.'",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally — I mean it is a cold call. Can I get 30 seconds to tell you why I reached out? And you can totally hang up on me if it's not a fit.",
        "note": "Disarming honesty. If he says yes, you've earned 30 seconds — make the pain trigger count. If he says no, go to the diagnostic. Don't grovel.",
        "branches": [
          {
            "label": "Grants 30 seconds / go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "Still says no / not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED — DIAGNOSE",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it more that you already know what we do and it's just not interesting?",
        "note": "This is a diagnostic, not a pitch. You're splitting the objection into two manageable pieces. 'Horrible time' means try again later. 'Not interesting' might still reveal something useful.",
        "branches": [
          {
            "label": "Bad time — call back later",
            "to": "bad_timing_callback"
          },
          {
            "label": "Not interested / we're covered",
            "to": "end_gracefully"
          },
          {
            "label": "Opens up slightly / asks what you do",
            "to": "pain_trigger"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER — THE PROBLEM",
        "say": "So I was talking to another vacation rental operator running a pretty similar setup to you guys — outsourced cleaning crews, staff doing inspections after, turnover photos flowing into their system. And they kept hitting this wall. On a busy Saturday in summer they've got 30 or 40 units flipping at once, and somebody on the team is supposed to be reviewing a hundred-plus photos per turnover. But nobody's actually catching the scuffed baseboard or the missing throw blanket until a guest checks in and calls at 9 PM. And then it's the guest services team — your team — issuing the credit, managing the review, and trying to keep the owner from losing confidence. And the worst part? The photo was sitting right there in FlipStream the whole time. Someone just didn't catch it.",
        "note": "PAUSE after 'someone just didn't catch it.' Let it land. Steven leads guest services — this is HIS pain. The FlipStream name-drop shows you know their stack. Watch for a sigh, a 'yeah,' or him jumping in with his own story.",
        "branches": [
          {
            "label": "Engaged — shares own pain / says 'yeah exactly'",
            "to": "pain_resonates"
          },
          {
            "label": "Asks what you do / how you solve it",
            "to": "solution_and_cta"
          },
          {
            "label": "'We already handle that with FlipStream'",
            "to": "flipstream_objection"
          },
          {
            "label": "Not interested / we're fine",
            "to": "objection_not_interested"
          }
        ]
      },
      "pain_resonates": {
        "label": "PAIN RESONATES — LET THEM TALK",
        "say": "Yeah — and I'd imagine with beach properties it's even worse, right? Sand, salt air, stuff wears faster, and guests expect perfection because they're paying vacation prices.",
        "note": "He's opening up. Keep pulling the thread. Charleston beach properties mean accelerated wear plus high guest expectations. Let him vent. The more he talks about his own pain, the more he'll want the solution. Don't interrupt.",
        "branches": [
          {
            "label": "Keeps sharing / agrees",
            "to": "solution_and_cta"
          },
          {
            "label": "Asks what you do about it",
            "to": "solution_and_cta"
          }
        ]
      },
      "solution_and_cta": {
        "label": "SOLUTION + CTA",
        "say": "So what we built is an AI that plugs into the turnover photos your team's already taking — in FlipStream or wherever — and automatically flags damage, missing items, staging issues. No workflow change, nothing new for your cleaners to learn. It just catches the stuff humans miss when they're reviewing 40 turnovers at once. Would you be open to seeing how it works sometime when I'm not cold calling you out of the blue?",
        "note": "One sentence on the solution, straight to the CTA. Don't oversell. The FlipStream mention is key — it tells him this isn't a rip-and-replace. If he's warm, stop talking and let him respond.",
        "branches": [
          {
            "label": "Open to meeting / sounds interesting",
            "to": "book_meeting"
          },
          {
            "label": "How does it work with FlipStream specifically?",
            "to": "flipstream_detail"
          },
          {
            "label": "Not interested right now",
            "to": "objection_not_interested"
          },
          {
            "label": "No budget for new tools",
            "to": "objection_no_budget"
          },
          {
            "label": "Send me an email",
            "to": "objection_send_email"
          }
        ]
      },
      "flipstream_detail": {
        "label": "FLIPSTREAM INTEGRATION DETAIL",
        "say": "Yeah great question — so FlipStream's doing the job assignment, the photo capture, the coordination piece. What it doesn't do is actually analyze those photos. Your team's still the ones eyeballing everything. We layer on top — the photos come in from the turnover, our AI scans every image, and if there's a chip in the countertop or a missing coffee maker that was there last month, it flags it before the guest ever walks in. Same photos your people are already taking. We just make them work harder.",
        "note": "Don't trash FlipStream — it's iTrip's proprietary system and Steven may have helped shape it. Position RapidEye as a complement, not a replacement. This is the 'we make your existing workflow smarter' pitch.",
        "branches": [
          {
            "label": "That makes sense / interested",
            "to": "franchise_angle"
          },
          {
            "label": "Open to seeing it",
            "to": "book_meeting"
          },
          {
            "label": "Need to think about it",
            "to": "sell_test_drive"
          }
        ]
      },
      "flipstream_objection": {
        "label": "OBJECTION — WE USE FLIPSTREAM",
        "say": "Oh totally — and FlipStream's great for managing the turnover workflow, assigning crews, getting the photos captured. I'm not trying to replace any of that. The gap I keep hearing about is what happens after those photos land. FlipStream gets them organized. But somebody on your team still has to look at every single photo and decide if something's wrong. That's the piece we automate.",
        "note": "He might be proud of FlipStream — it's iTrip's own tool. Validate it first, then reframe the gap. The issue isn't photo capture, it's photo analysis at scale. Don't position it as FlipStream vs. RapidEye.",
        "branches": [
          {
            "label": "Intrigued / didn't think of it that way",
            "to": "solution_and_cta"
          },
          {
            "label": "We're fine with our process",
            "to": "objection_have_process"
          },
          {
            "label": "Tell me more about that",
            "to": "flipstream_detail"
          }
        ]
      },
      "warm_discovery": {
        "label": "WARM — DISCOVERY QUESTIONS",
        "say": "Nice — so I'm curious, with a hundred-plus properties turning over, what does your inspection process actually look like right now? Are your cleaners doing the photo documentation in FlipStream, or is that a separate person?",
        "note": "STOP PITCHING. He's warm. Ask questions and learn. Key things to uncover: who takes photos, who reviews them, how many turnovers on a peak Saturday, what falls through cracks. Steven leads guest services — ask about complaint patterns next.",
        "branches": [
          {
            "label": "Shares their process in detail",
            "to": "discovery_dig_deeper"
          },
          {
            "label": "Asks what RapidEye does first",
            "to": "solution_and_cta"
          },
          {
            "label": "Starts to disengage / short answers",
            "to": "objection_not_interested"
          }
        ]
      },
      "discovery_dig_deeper": {
        "label": "DISCOVERY — DIG DEEPER",
        "say": "That's really helpful. And on the guest services side — when something does slip through and a guest calls in about it — what does that typically look like for your team? How often is that happening?",
        "note": "Connect the inspection gap to his specific domain — guest services. If he gives you a frequency ('a few times a week,' 'every busy weekend'), that's gold for the demo. You're building the business case in his own words.",
        "branches": [
          {
            "label": "Shares complaint frequency or examples",
            "to": "franchise_angle"
          },
          {
            "label": "It's not a huge issue for us",
            "to": "solution_and_cta"
          },
          {
            "label": "Ready to see a demo",
            "to": "book_meeting"
          }
        ]
      },
      "franchise_angle": {
        "label": "FRANCHISE EXPANSION ANGLE",
        "say": "That's exactly what we keep hearing. And honestly — one thing that made me want to talk to you specifically is the franchise association piece. If this works for Charleston, this is the kind of thing that could roll out to every iTrip destination. You've already done it with Humand for internal comms — this would be the same play but for turnover QA.",
        "note": "This is unique to Steven. He's president of the franchise association AND he oversaw the Humand rollout in late 2024. Framing RapidEye as 'the next Humand-style rollout' speaks directly to his role. This turns a local sale into a franchise-wide opportunity — and appeals to his ego as the guy who brings scalable tools to the network.",
        "branches": [
          {
            "label": "Interested in franchise-wide potential",
            "to": "book_meeting"
          },
          {
            "label": "Let's start with just Charleston",
            "to": "book_meeting"
          },
          {
            "label": "That's a bigger conversation / intriguing",
            "to": "book_meeting"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "I totally get it. I should've assumed you'd be all set — otherwise you probably would've reached out to us. Just so nobody from my team cold calls you again — is it that this just isn't a problem you're focused on right now, or is it more that you just hate getting cold calls?",
        "note": "Agree first — surprise him by not pushing back. Then split the objection. 'Not a problem' tells you his priorities. 'Hate cold calls' means the pain might still exist, he just hates the medium. Either answer gives you a path.",
        "branches": [
          {
            "label": "Just hate cold calls / bad medium",
            "to": "sell_test_drive"
          },
          {
            "label": "Not a priority right now",
            "to": "sell_test_drive"
          },
          {
            "label": "Hard no / please stop calling",
            "to": "referral_ask"
          }
        ]
      },
      "objection_have_process": {
        "label": "OBJECTION — WE HAVE A PROCESS",
        "say": "That makes total sense — with a hundred-plus properties you'd have to have something solid in place. Just so I know — is it that your current process catches everything and you're happy with it, or is it more that adding anything new right now would just be a headache?",
        "note": "Split the objection. Very few people are truly happy with their inspection process. If 'switching is a headache,' the door opens to 'no switching required — we layer on top of what you already do.'",
        "branches": [
          {
            "label": "It's more the headache of adding something",
            "to": "sell_test_drive_no_change"
          },
          {
            "label": "We're happy with what we have",
            "to": "sell_test_drive"
          },
          {
            "label": "Hard no",
            "to": "referral_ask"
          }
        ]
      },
      "sell_test_drive_no_change": {
        "label": "SELL TEST DRIVE — NO WORKFLOW CHANGE",
        "say": "Totally get that. And honestly that's the whole design — there's zero workflow change on your end. Your cleaners keep taking photos exactly the way they do now, your team keeps using FlipStream. We just run in the background and surface the stuff that would've been missed. Would you be open to just seeing it? Fifteen minutes, and if it's not a fit, at least you know what's out there.",
        "note": "The 'no workflow change' angle is critical for an operator who doesn't want disruption. Steven runs multiple teams — he doesn't want another thing to manage. Emphasize the invisible, additive nature of the integration.",
        "branches": [
          {
            "label": "Agrees to meeting",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "objection_send_email"
          },
          {
            "label": "Not right now",
            "to": "end_gracefully"
          }
        ]
      },
      "objection_no_budget": {
        "label": "OBJECTION — NO BUDGET",
        "say": "Totally get it. Nowadays it's hard enough to keep a tool, let alone buy something new. Just so I understand — is it that budget for this cycle is completely locked, or is it more that anything new has to go through the ringer to get approved?",
        "note": "Split the objection. If budget is truly locked, sell the test drive for future planning. If it's about approval, ask who else needs to be involved — might be Sarah as co-owner, or even iTrip corporate if there's a franchise-level budget.",
        "branches": [
          {
            "label": "Budget is locked / can't spend right now",
            "to": "sell_test_drive"
          },
          {
            "label": "Approval process is painful / need Sarah or corporate",
            "to": "sell_test_drive_approval"
          }
        ]
      },
      "sell_test_drive_approval": {
        "label": "SELL TEST DRIVE — MULTI-STAKEHOLDER",
        "say": "Makes sense — and if Sarah or anyone else needs to weigh in, I'm happy to include them. A lot of times the people who end up moving on something like this are the ones who already know what's on their shortlist when budget does open up. Would it make sense to do a quick look so you and Sarah can evaluate it together?",
        "note": "Steven and Sarah co-own the franchise. If he defers to Sarah, offer to loop her in. A two-person meeting dramatically increases close rate. If he mentions corporate/franchise-level approval, lean into the franchise association angle.",
        "branches": [
          {
            "label": "Agrees to include Sarah",
            "to": "book_meeting"
          },
          {
            "label": "Let me talk to Sarah first",
            "to": "objection_send_email"
          },
          {
            "label": "Not right now",
            "to": "end_gracefully"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "You're probably not buying anything right now, and I totally respect that. But honestly — if nothing else, I could walk you through what a few other property management companies in the Charleston market are doing with their turnover photos. Worst case you steal some ideas and we part as friends. Would you be open to that?",
        "note": "The offer of value: the meeting is worth his time even if he never buys. Mentioning 'Charleston market' is intentional — he's competing with Stay Duvet, Island Realty, Sewee, and others. He'll want to know what competitors are doing.",
        "branches": [
          {
            "label": "Agrees to look / okay fine",
            "to": "book_meeting"
          },
          {
            "label": "Still no / not right now",
            "to": "referral_ask"
          },
          {
            "label": "Maybe in a few months",
            "to": "end_gracefully"
          }
        ]
      },
      "objection_send_email": {
        "label": "OBJECTION — SEND ME AN EMAIL",
        "say": "Totally fair. One question before I do — what would be most relevant to include so it's not just another generic pitch sitting in your inbox? Is it more the FlipStream integration piece, the cost side, or how it actually catches stuff?",
        "note": "Accept the email request, then ask what to include. Two benefits: you learn what he cares about, and the tailored email actually gets read. Include a specific time suggestion in the email for a follow-up call.",
        "branches": [
          {
            "label": "Tells you what to focus on",
            "to": "send_email_close"
          },
          {
            "label": "Just send whatever / general overview",
            "to": "send_email_close"
          }
        ]
      },
      "send_email_close": {
        "label": "SEND EMAIL — LOCK FOLLOW-UP",
        "say": "Got it — I'll send that over today. And just so it doesn't get buried, I'll suggest a couple times next week in case you want to jump on a quick call after you look at it. What email's best — is it the itripchs one or the itrip.net one?",
        "note": "Get the direct email address. The 'itripchs or itrip.net' question shows you've done homework and makes it a choice instead of a request. Send the email within 2 hours. Follow up in 48 hours if no reply.",
        "branches": []
      },
      "referral_ask": {
        "label": "REFERRAL — NOT THE RIGHT FIT",
        "say": "Totally understand. Last thing — if you're not the right person for this, who on your team would typically own the inspection and turnover QA piece? Would that be Hunter on the ops side, or someone else?",
        "note": "You already know Hunter Ray is Ops Manager. Dropping his name shows homework and makes it easy for Steven to confirm or redirect. If he gives you Hunter, you now have a warm internal referral.",
        "branches": [
          {
            "label": "Gives you Hunter / another name",
            "to": "referral_received"
          },
          {
            "label": "I'm the right person, just not now",
            "to": "end_gracefully"
          },
          {
            "label": "No referral / not interested",
            "to": "end_gracefully"
          }
        ]
      },
      "referral_received": {
        "label": "REFERRAL — GOT A NAME",
        "say": "Perfect — I really appreciate that. I'll reach out to them and mention you pointed me their way. Thanks for your time, Steven.",
        "note": "You now have a warm intro. When you call the referral, open with 'Steven Goodwin suggested I reach out to you.' Log the name, email, and any context Steven gave you. Send Steven a short thank-you email within the hour.",
        "branches": []
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome — let's lock something in. I've got next Tuesday and Thursday pulled up — does morning or afternoon work better for you?",
        "note": "Give two days, let him pick. Once he picks a day, narrow to a time: 'How's 10 AM?' Send the calendar invite WHILE ON THE PHONE. If he wants to include Sarah or Hunter, get their emails now and CC them.",
        "branches": [
          {
            "label": "Picks a day/time",
            "to": "meeting_booked"
          },
          {
            "label": "Needs to check calendar / get back to me",
            "to": "meeting_followup"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING BOOKED — CLOSE",
        "say": "Perfect — I'll send the invite right now so it's on both our calendars. Really appreciate you taking my call, Steven. Talk soon.",
        "note": "STOP SELLING. Send the invite immediately. Add a brief agenda in the invite body: '15 min — quick look at how AI photo analysis layers into your FlipStream turnover workflow.' If he mentioned Sarah, CC her. Confirm the invite was received before hanging up if possible.",
        "branches": []
      },
      "meeting_followup": {
        "label": "MEETING — NEEDS TO CHECK CALENDAR",
        "say": "No problem at all — I'll shoot you an email with a couple time options and you can grab whichever works. What's the best email to send that to?",
        "note": "Get the direct email. Send the scheduling options within 30 minutes. Follow up in 24 hours if no response. If he doesn't book within 48 hours, call back and reference the conversation.",
        "branches": []
      },
      "end_gracefully": {
        "label": "END GRACEFULLY",
        "say": "Totally understand. If anything changes — especially heading into summer when turnovers really ramp up — I'm easy to find. Appreciate your time, Steven.",
        "note": "Don't burn the bridge. The summer season mention plants a seed — Charleston's peak turnover season is when QA pain is worst. Log the call, set a follow-up reminder for 4-6 weeks, and send a brief 'good talking to you' email referencing one thing from the conversation.",
        "branches": []
      }
    }
  }
}