{
  "name": "Tara Nieslanik",
  "title": "Property Manager",
  "company": "Luxury Estate Managers of Aspen (LEMA)",
  "location": "Aspen, CO",
  "phone": "+1-402-440-7682",
  "company_phone": "+1-970-920-1776",
  "alt_phones": [],
  "flow": {
    "context": "Tara Nieslanik is a Property Manager at Luxury Estate Managers of Aspen (LEMA), a premium, confidentiality-focused estate/property management firm in Aspen, CO. She relocated from Nebraska and has a competitive sports background up to the professional level — described as goal-oriented and teamwork-driven. Key org detail: Britton Nieslanik (VP) shares her last name — likely family — and Sarah Korpela is President. LEMA's tech stack and unit count are unknown; they market meticulous care across high-value homes. No strong personal connection to Sam, so lead with industry proximity in the Aspen luxury market. Sam was just skiing Jackson Hole in January — light ski-town rapport is available if needed.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Tara — I've been talking with a few property managers in the Aspen luxury market. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "You're calling her direct cell (402 area code — Nebraska number). Feet-up energy. Casual, peer-to-peer. Don't rush. Let the 'heard my name' question hang.",
        "branches": [
          {
            "label": "No / Who? / Don't think so",
            "to": "not_heard_name"
          },
          {
            "label": "Yes / Maybe / Sounds familiar",
            "to": "heard_name"
          },
          {
            "label": "Bad timing / I'm busy / Can't talk",
            "to": "bad_timing"
          },
          {
            "label": "Who is this? / What company?",
            "to": "clarify_who"
          }
        ]
      },
      "not_heard_name": {
        "label": "NOT HEARD — PAIN TRIGGER",
        "say": "Ha — guess I'm not as popular as I thought. Well, the reason for my call — I work with a few other property managers who run luxury homes, pretty similar setup to what you guys do at LEMA. And the thing I keep hearing is the same headache — after every turnover or walkthrough there's this pile of photos, and somebody's gotta go through every single one to make sure nothing got missed. A scratch on a countertop, a stain on the upholstery, a missing remote — and in Aspen with the caliber of homes you're managing, if something slips through, you're the one hearing about it from the homeowner.",
        "note": "PAUSE HERE. Let the pain land. Wait for her to react before continuing. If she jumps in, let her talk. If silence, continue to the solution and CTA.",
        "branches": [
          {
            "label": "She reacts / Yeah that's real / Mmhm",
            "to": "deliver_solution_cta"
          },
          {
            "label": "Silence — continue",
            "to": "deliver_solution_cta"
          },
          {
            "label": "We already have a process for that",
            "to": "objection_have_process"
          },
          {
            "label": "I'm not really the right person for this",
            "to": "not_right_person"
          },
          {
            "label": "Not interested / We're all set",
            "to": "objection_not_interested"
          }
        ]
      },
      "deliver_solution_cta": {
        "label": "SOLUTION + CTA",
        "say": "We built a tool that plugs into whatever you're already using and flags that stuff automatically — damage, missing items, condition changes — so you're not eyeballing two hundred photos hoping you don't miss something. Would you be open to taking a look sometime when I'm not cold calling you out of the blue?",
        "note": "One sentence on the solution, then straight to the CTA. Keep it light. 'When I'm not cold calling you' disarms and gets a smile.",
        "branches": [
          {
            "label": "Yeah / Sure / That could be interesting",
            "to": "warm_discovery"
          },
          {
            "label": "How does it work? / Tell me more",
            "to": "warm_discovery"
          },
          {
            "label": "We already have a process",
            "to": "objection_have_process"
          },
          {
            "label": "I'm not the right person",
            "to": "not_right_person"
          },
          {
            "label": "Not interested / No thanks",
            "to": "objection_not_interested"
          },
          {
            "label": "Send me an email",
            "to": "send_email"
          }
        ]
      },
      "heard_name": {
        "label": "HEARD NAME — EXPLORE",
        "say": "Oh nice — well normally we'd be working with someone like you. What'd you hear?",
        "note": "Let her talk. Whatever she says, bridge into discovery or the pain trigger depending on her energy.",
        "branches": [
          {
            "label": "Shares what she heard",
            "to": "warm_discovery"
          },
          {
            "label": "Not sure / Can't remember exactly",
            "to": "not_heard_name"
          },
          {
            "label": "Someone mentioned you / Got an email",
            "to": "warm_discovery"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING — RESCHEDULE",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow or later this week? When's less hectic?",
        "note": "Lock a specific callback day and time. Don't accept 'sometime next week.' Get a real answer.",
        "branches": [
          {
            "label": "Gives a time / Sure try Thursday",
            "to": "lock_callback"
          },
          {
            "label": "Just tell me what it's about quick",
            "to": "not_heard_name"
          },
          {
            "label": "Don't call back / Not interested",
            "to": "graceful_exit"
          }
        ]
      },
      "clarify_who": {
        "label": "CLARIFY — RE-INTRO",
        "say": "Yeah totally — Sam Parks, I'm with a company called RapidEye. We work with a bunch of property management teams that run high-end homes. I've been chatting with a few folks in the Aspen market and your name came up. Have you heard of us at all?",
        "note": "Re-anchor calmly. Don't rush or sound flustered. Sound unbothered.",
        "branches": [
          {
            "label": "No / What do you do?",
            "to": "not_heard_name"
          },
          {
            "label": "Oh okay / Go ahead",
            "to": "not_heard_name"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "warm_discovery": {
        "label": "WARM — ASK QUESTIONS",
        "say": "Nice — so just to make sure I'm not wasting your time, can I ask a couple quick questions? What does your process look like right now when you're checking on your properties — like after a turnover or a regular walkthrough, how are you guys documenting condition?",
        "note": "STOP PITCHING. She's warm. Ask questions and listen. You want to learn: (1) how they document condition, (2) who reviews photos, (3) what falls through the cracks, (4) whether this is STR turnover or estate walkthroughs. LEMA may be more estate management than pure STR.",
        "branches": [
          {
            "label": "Describes process (photos, checklists, etc.)",
            "to": "discovery_deepen"
          },
          {
            "label": "Our cleaners / team takes photos",
            "to": "discovery_photo_review"
          },
          {
            "label": "I'm not sure I'm the right person",
            "to": "not_right_person"
          },
          {
            "label": "Why do you ask? / What's this about?",
            "to": "restate_value"
          }
        ]
      },
      "discovery_deepen": {
        "label": "DIG DEEPER — WHO REVIEWS",
        "say": "Got it — and who on the team is actually reviewing those photos? Is it you going through them, or does someone else check after they come in?",
        "note": "Map the workflow. If she reviews photos herself, the pain is personal. If it rolls up to Britton or Sarah, you may need to go there.",
        "branches": [
          {
            "label": "I review them / It's on the PMs",
            "to": "discovery_pain_confirm"
          },
          {
            "label": "It varies / Everyone chips in",
            "to": "discovery_pain_confirm"
          },
          {
            "label": "Sarah or Britton handles that",
            "to": "referral_to_leadership"
          }
        ]
      },
      "discovery_photo_review": {
        "label": "PHOTO REVIEW PROCESS",
        "say": "Yeah that's what I hear from most teams. So when those photos come in — how many are you looking at per property? And what happens when something does get missed? Does the homeowner catch it, or does it come up at the next check-in?",
        "note": "Get her to say the pain out loud. In luxury Aspen, a missed scratch on a custom table is a five-figure conversation with an owner.",
        "branches": [
          {
            "label": "Admits things slip through / Yeah it happens",
            "to": "pain_acknowledged"
          },
          {
            "label": "We're pretty thorough / Not a big issue",
            "to": "objection_have_process"
          },
          {
            "label": "It's a lot of photos / Overwhelming",
            "to": "pain_acknowledged"
          }
        ]
      },
      "discovery_pain_confirm": {
        "label": "CONFIRM THE PAIN — VOLUME",
        "say": "So you're personally going through these after each check — how many properties are you managing right now? And in peak season, how often are you doing walkthroughs across all of them?",
        "note": "Get a number. Volume makes the pain real. Even 10 properties with regular walkthroughs and 30-50 photos each is hundreds of photos a week. Aspen peak season (ski and summer) means compressed timelines.",
        "branches": [
          {
            "label": "Gives a number / It's a lot in season",
            "to": "pain_acknowledged"
          },
          {
            "label": "Not that many / It's manageable",
            "to": "soft_pitch_cta"
          },
          {
            "label": "We do more estate management than STR turnovers",
            "to": "pivot_estate_management"
          }
        ]
      },
      "pain_acknowledged": {
        "label": "PAIN CONFIRMED — BRIDGE TO CTA",
        "say": "Yeah that's exactly what I keep hearing. The photos are there but nobody has time to really go through every single one — and with the homes you're managing in Aspen, a missed issue doesn't stay small for long. That's literally what we built RapidEye for — it runs through those photos automatically and flags anything that looks off. No workflow change on your end. Would it make sense to hop on a quick call this week so I can show you what it actually looks like? I could walk you through what a couple other luxury PM teams are doing with it.",
        "note": "Pitch the meeting, not the product. 'What other luxury PM teams are doing' is the value offer — she gets intel even if she never buys. If she wants to involve leadership, that's a win too.",
        "branches": [
          {
            "label": "Yeah let's do it / Sure",
            "to": "book_meeting"
          },
          {
            "label": "I'd need to loop in Britton or Sarah",
            "to": "referral_to_leadership"
          },
          {
            "label": "Can you send me something first?",
            "to": "send_email"
          },
          {
            "label": "I don't think we need that",
            "to": "objection_not_interested"
          }
        ]
      },
      "pivot_estate_management": {
        "label": "PIVOT — ESTATE MANAGEMENT ANGLE",
        "say": "Oh totally — and that actually might be even more relevant. A lot of the estate management teams we talk to are doing regular walkthroughs and seasonal check-ins on homes where the owners might not be there for months, right? Same challenge though — you're documenting condition every time, taking photos, and someone has to verify nothing's changed between visits. Especially with vendors coming through, maintenance work happening — things shift and nobody catches it until the owner shows up. Does that sound like what you deal with?",
        "note": "LEMA is estate management first, not a pure STR operator. Pivot the use case to ongoing condition monitoring, seasonal inspections, and vendor accountability. Same tech, different framing. This might resonate more than turnover language.",
        "branches": [
          {
            "label": "Yeah that's more what we do",
            "to": "pain_acknowledged"
          },
          {
            "label": "We have that covered",
            "to": "objection_have_process"
          },
          {
            "label": "You should talk to Sarah or Britton about that",
            "to": "referral_to_leadership"
          }
        ]
      },
      "restate_value": {
        "label": "RESTATE VALUE SIMPLY",
        "say": "Good question — basically we work with property management teams who are already taking photos during walkthroughs or turnovers. Our software goes through those photos automatically and catches stuff that gets missed — damage, missing items, condition changes. It's been a big deal for teams managing luxury homes because the stakes are higher when something slips. I was curious how you guys handle that at LEMA.",
        "note": "Keep it plain. She asked what it's about — tell her, then redirect with a question to get her talking.",
        "branches": [
          {
            "label": "Oh interesting / Okay",
            "to": "warm_discovery"
          },
          {
            "label": "We don't really have that problem",
            "to": "objection_have_process"
          },
          {
            "label": "You should talk to someone else",
            "to": "not_right_person"
          }
        ]
      },
      "objection_have_process": {
        "label": "OBJECTION — HAVE A PROCESS",
        "say": "That totally makes sense — with the caliber of homes you manage, you'd have to have something solid in place. Just so nobody from my team bugs you again — is it more that you're fully happy with how it's working and nothing's slipping through, or is it that switching up anything right now would just be a headache?",
        "note": "Miyagi method. Agree first, then split. If she says 'it works,' she might still reveal friction. If she says 'switching is hard,' that's a timing objection you can work with.",
        "branches": [
          {
            "label": "It works fine / We're good",
            "to": "soft_pitch_cta"
          },
          {
            "label": "Switching would be a pain / Timing isn't great",
            "to": "sell_test_drive"
          },
          {
            "label": "I mean stuff does slip through sometimes",
            "to": "pain_acknowledged"
          },
          {
            "label": "I really don't have time for this",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "Totally get it — I should've assumed you'd be all set, otherwise you probably would've reached out to us. Just so nobody from my team cold calls you again — is it that this just isn't a problem you're focused on right now, or is it more that cold calls are just the worst and I caught you at a bad moment?",
        "note": "Agree, don't fight. Split the objection. If it's the cold call itself, you can recover. If it's genuinely not relevant, try a referral or exit gracefully.",
        "branches": [
          {
            "label": "It's just not relevant to us",
            "to": "last_ditch_value"
          },
          {
            "label": "Yeah cold calls are annoying / Bad timing",
            "to": "permission_fallback"
          },
          {
            "label": "I'm not the right person for this",
            "to": "not_right_person"
          },
          {
            "label": "Please don't call again",
            "to": "graceful_exit"
          }
        ]
      },
      "permission_fallback": {
        "label": "PERMISSION FALLBACK",
        "say": "Yeah totally fair — I mean it is a cold call, I get it. Can I get just thirty seconds to tell you why I actually reached out? And you can totally hang up on me if it's not a fit.",
        "note": "This is your lifeline. If she gives 30 seconds, go straight to a tight version of the pain trigger in not_heard_name. Be quick and land the pain fast.",
        "branches": [
          {
            "label": "Fine / Go ahead / Thirty seconds",
            "to": "not_heard_name"
          },
          {
            "label": "No / I really can't right now",
            "to": "graceful_exit"
          }
        ]
      },
      "not_right_person": {
        "label": "NOT THE RIGHT PERSON — REFERRAL",
        "say": "Totally hear you — and I appreciate you telling me that instead of just sitting through a pitch. When it comes to how you guys handle inspections or condition tracking across your properties, who would be the best person to talk to? Would that be more of a Britton or Sarah thing?",
        "note": "Tara and Britton share the last name Nieslanik — likely family. Drop Britton's first name casually to signal you know the team. If she gives you Sarah (President) or Britton (VP), ask for a warm intro. This is actually a great outcome — a PM referring you up to leadership.",
        "branches": [
          {
            "label": "Talk to Britton / Sarah",
            "to": "get_warm_intro"
          },
          {
            "label": "Gives another name",
            "to": "get_warm_intro"
          },
          {
            "label": "I don't know / Just email the office",
            "to": "send_email"
          },
          {
            "label": "I can mention it to them",
            "to": "internal_champion"
          }
        ]
      },
      "get_warm_intro": {
        "label": "GET THE WARM INTRO",
        "say": "Perfect — would you be able to give them a quick heads up that I'll be reaching out? That way it's not another random cold call for them. And honestly if there's anything specific you think would make it land better — like something you guys have been dealing with — that'd help me put together something actually useful instead of a generic pitch.",
        "note": "Turn Tara into an internal champion. If she shares a pain point, you have insider intel for the call to Britton/Sarah. Get the referral name confirmed, and try to learn when she'll mention it to them.",
        "branches": [
          {
            "label": "Sure I'll mention it / Yeah I can do that",
            "to": "confirm_referral_details"
          },
          {
            "label": "Just call them / Here's their number",
            "to": "confirm_referral_details"
          },
          {
            "label": "I'm not sure they'd be interested",
            "to": "soft_pitch_cta"
          }
        ]
      },
      "internal_champion": {
        "label": "INTERNAL CHAMPION",
        "say": "That would honestly be amazing. If you mention it to them, I'll follow up with a quick email so they have something to look at. Would it be cool if I sent you a one-pager you could forward along? Sometimes that's way easier than trying to explain what some random guy pitched you on the phone.",
        "note": "Make it easy for her. Give her a tool — the one-pager or email — so she doesn't have to sell it internally. She offered to champion; remove all friction.",
        "branches": [
          {
            "label": "Yeah send it over / Sure",
            "to": "confirm_referral_details"
          },
          {
            "label": "I'll just tell them to call you",
            "to": "confirm_referral_details"
          }
        ]
      },
      "confirm_referral_details": {
        "label": "CONFIRM REFERRAL DETAILS",
        "say": "Awesome — I'll reach out to them this week. I've got tara at luxuryema dot com for you — is that the best email to send the info to? And should I be reaching out to Britton or Sarah first — or both?",
        "note": "Confirm her email. Get clarity on who to call. You already have Britton's direct line (970-948-9896) and Sarah's (970-379-4705). If she says Britton, that's probably the easier path since they're likely family.",
        "branches": [
          {
            "label": "Confirms email and referral target",
            "to": "end_referral_positive"
          },
          {
            "label": "Just email them directly / Gives their info",
            "to": "end_referral_positive"
          }
        ]
      },
      "referral_to_leadership": {
        "label": "REFERRAL TO BRITTON OR SARAH",
        "say": "That makes total sense — this is probably more of a Britton or Sarah decision. Would it make sense for me to reach out to them directly? And if you could give them a heads up, that'd honestly go a long way so I'm not just cold calling them out of nowhere.",
        "note": "Britton Nieslanik (VP) shares Tara's last name — likely family. If Tara suggests Britton, ask: 'Would Sarah want to be looped in too, or is Britton the one who'd own this?' Get both names if possible.",
        "branches": [
          {
            "label": "Yeah reach out to Britton / Sarah",
            "to": "get_warm_intro"
          },
          {
            "label": "I'll mention it to them",
            "to": "internal_champion"
          },
          {
            "label": "Just email them",
            "to": "send_email"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Totally get it — you're probably not switching anything right now and I respect that. But here's what I've seen work — the people who end up loving this are the ones who saw it before peak season hit, so when budget opens up they already know what's on their list. Would you be open to just taking a look? Fifteen minutes, I'll show you how it works, worst case you steal some ideas for your own process and we part as friends.",
        "note": "Low pressure. Position the meeting as intelligence gathering, not a buying decision. 'Before peak season' is a timing lever — Aspen has ski season and summer season, both high-intensity.",
        "branches": [
          {
            "label": "Okay sure / Yeah I guess",
            "to": "book_meeting"
          },
          {
            "label": "I'd need to involve Britton or Sarah",
            "to": "referral_to_leadership"
          },
          {
            "label": "Just send me an email",
            "to": "send_email"
          },
          {
            "label": "No I'm good",
            "to": "graceful_exit"
          }
        ]
      },
      "soft_pitch_cta": {
        "label": "SOFT CTA — SOCIAL PROOF",
        "say": "Totally respect that. Look — if nothing else, I could walk you through what a couple other luxury property management teams are doing with their documentation. We work with a group in New York managing about two hundred high-end homes and another East Coast company with around six hundred. Worst case you get some ideas for your own process. Would a quick fifteen minutes be worth it?",
        "note": "Social proof play. NYC (200 luxury homes) and East Coast (600 properties) are real traction. In luxury PM, what peers are doing matters. If she bites, book it. If not, try referral or exit clean.",
        "branches": [
          {
            "label": "Okay that could be interesting",
            "to": "book_meeting"
          },
          {
            "label": "I'd want Britton or Sarah involved",
            "to": "referral_to_leadership"
          },
          {
            "label": "Send me something and I'll look at it",
            "to": "send_email"
          },
          {
            "label": "I'll pass / Not right now",
            "to": "graceful_exit"
          }
        ]
      },
      "last_ditch_value": {
        "label": "LAST DITCH — VALUE OFFER",
        "say": "Totally hear you. I won't take any more of your time. One thing — we put together a quick breakdown of how a few luxury property managers are handling their inspection workflows differently. Happy to send it over, no pitch attached. If it's useful, great. If not, no hard feelings. Cool if I shoot that to your email?",
        "note": "Last play before exit. Pure value, zero commitment. If she says yes, you have an email thread and a reason to follow up. If she says no, exit gracefully.",
        "branches": [
          {
            "label": "Sure send it over",
            "to": "confirm_email_exit"
          },
          {
            "label": "No thanks / I'm good",
            "to": "graceful_exit"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome — let me pull up my calendar. How does Thursday look for you? I could do morning or afternoon — what's better on your end?",
        "note": "Pick a specific day. Give two options. Lock it NOW. Once she picks, confirm it back and say you'll send the invite immediately. If she wants to include Britton or Sarah, offer to send the invite to all of them.",
        "branches": [
          {
            "label": "Gives a day/time",
            "to": "meeting_confirmed"
          },
          {
            "label": "Let me check / I'll get back to you",
            "to": "pin_down_meeting"
          },
          {
            "label": "Send me an invite and I'll confirm",
            "to": "pin_down_meeting"
          }
        ]
      },
      "pin_down_meeting": {
        "label": "PIN DOWN THE MEETING",
        "say": "Tell you what — I'll shoot over an invite for Thursday at ten. If that doesn't work, just let me know and we'll move it around. Sound fair? And is tara at luxuryema dot com the best email for the invite?",
        "note": "Don't leave it open-ended. It's easier to move a meeting than to schedule one from scratch. Confirm her email and send the invite before hanging up.",
        "branches": [
          {
            "label": "Okay sounds good",
            "to": "meeting_confirmed"
          },
          {
            "label": "I really need to check first",
            "to": "confirm_email_exit"
          }
        ]
      },
      "meeting_confirmed": {
        "label": "MEETING BOOKED — WRAP UP",
        "say": "Perfect — sending that over right now. Tara, really appreciate you taking my call. Even if it turns out it's not a fit, I think you'll get some useful stuff out of it. Talk soon.",
        "note": "STOP SELLING. You got the meeting. Be grateful, be brief, hang up. Send the calendar invite immediately. If she mentioned Britton or Sarah, include them on the invite or follow up with them separately within 24 hours.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair — I'll send something over. One quick question before I do though — what would be most useful to include so it's not just another generic email sitting in your inbox? Like is it more about how it actually works, or would you rather see what results other luxury teams are getting?",
        "note": "Accept the email ask but use the question to learn what she cares about. Then ask: 'And should I copy Britton or Sarah on it, or just send it to you?' This might get you another contact.",
        "branches": [
          {
            "label": "Tells you what to include / Just send whatever",
            "to": "ask_copy_leadership"
          },
          {
            "label": "Copy Britton or Sarah too",
            "to": "confirm_email_exit"
          }
        ]
      },
      "ask_copy_leadership": {
        "label": "ASK ABOUT COPYING LEADERSHIP",
        "say": "Got it — I'll tailor it. And should I copy Britton or Sarah on it too, or just send it your way?",
        "note": "This is a subtle play to get the email in front of decision-makers. If she says yes, you just got a warm email intro to the VP or President.",
        "branches": [
          {
            "label": "Yeah copy them / Sure add Britton",
            "to": "confirm_email_exit"
          },
          {
            "label": "Just me is fine",
            "to": "confirm_email_exit"
          }
        ]
      },
      "confirm_email_exit": {
        "label": "CONFIRM EMAIL AND EXIT",
        "say": "Perfect — I'll put something together and send it to tara at luxuryema dot com. I'll follow up later this week to make sure it landed. Appreciate your time, Tara — talk soon.",
        "note": "Confirm the email. State you'll follow up — sets expectation for a second touch. Send the email within 30 minutes with specific meeting time suggestion. Note everything she said in CRM.",
        "branches": []
      },
      "lock_callback": {
        "label": "LOCK CALLBACK TIME",
        "say": "Perfect — I'll try you then. Is this the best number to reach you on? And just so you know who's calling — it's Sam Parks, RapidEye. Talk to you soon, Tara.",
        "note": "Confirm the number (402-440-7682). Repeat your name so she recognizes it next time. Put the callback in your calendar immediately with notes on this attempt.",
        "branches": []
      },
      "end_referral_positive": {
        "label": "REFERRAL CONFIRMED — EXIT",
        "say": "Really appreciate it, Tara. I'll reach out to them this week and send you that info too. Thanks for taking my call — talk soon.",
        "note": "You got a referral — that's a win. Send Tara the follow-up email within 30 minutes. Call Britton (970-948-9896) or Sarah (970-379-4705) within 24-48 hours. Open that call with: 'I was chatting with Tara and she suggested I give you a call.' That turns the next call into a warm call.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes down the road, I'm easy to find — Sam Parks with RapidEye. Appreciate your time, Tara.",
        "note": "Don't burn the bridge. Log the outcome in CRM. Consider a non-pushy follow-up email in 1-2 weeks. If you close other Aspen PMs, circle back — social proof in a small market travels fast.",
        "branches": []
      }
    }
  }
}