{
  "name": "Tim Baker",
  "title": "Executive Director, Beaver Creek Resort Company",
  "company": "Vail Resorts Hospitality (Vail–Beaver Creek Resort Properties / VBCRP)",
  "location": "Vail, CO",
  "phone": "+1-970-845-5858",
  "company_phone": "+1-970-754-5750",
  "alt_phones": [],
  "flow": {
    "context": "Tim Baker is Executive Director of Beaver Creek Resort Company — the local operating entity for Beaver Creek under the Vail Resorts umbrella. He sits on the Vail Valley Means Business board of directors, meaning he's deeply wired into the valley and likely influences cross-department decisions around guest experience and quality standards. The parent org (VBCRP) manages ~380 vacation rental residences and 40+ community associations with in-house housekeeping and routine inspections — no known ops platform or PMS publicly disclosed. Strongest connection: Sam skied Jackson Hole last month, Tim runs one of Colorado's premier ski resorts. Calling BCRC office at (970) 845-5858.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Tim — bit of a random one, but I was just out at Jackson Hole last month skiing and I've been working with a few property managers in ski resort markets on their inspection workflows. It's Sam Parks with RapidEye — have you heard my name tossed around at all?",
        "note": "Feet up energy. The skiing connection is real — you were at Jackson Hole in January. Sound like a peer, not a pitch. Pause after the question and let him answer.",
        "branches": [
          {
            "label": "Yes / Maybe / Sounds familiar",
            "to": "heard_yes"
          },
          {
            "label": "No / Who?",
            "to": "heard_no"
          },
          {
            "label": "Bad timing / I'm busy",
            "to": "bad_timing"
          },
          {
            "label": "Someone else answers (gatekeeper)",
            "to": "gatekeeper_initial"
          }
        ]
      },
      "heard_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone in your position. What'd you hear?",
        "note": "Let him talk. Whatever he says, bridge to pain trigger. Don't correct him if he's off — just steer.",
        "branches": [
          {
            "label": "Describes what they heard",
            "to": "pain_trigger"
          },
          {
            "label": "Vague / 'not much'",
            "to": "pain_trigger"
          }
        ]
      },
      "heard_no": {
        "label": "HAVEN'T HEARD — TRANSITION",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason for my call is pretty specific to what you guys are doing over at Beaver Creek —",
        "note": "Keep it light. The self-deprecating line disarms. Transition straight into pain trigger without a long pause.",
        "branches": [
          {
            "label": "Lets you continue",
            "to": "pain_trigger"
          },
          {
            "label": "Pushes back / 'what is this about?'",
            "to": "permission_fallback"
          },
          {
            "label": "Says bad timing",
            "to": "bad_timing"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again later this week? Maybe Thursday or Friday?",
        "note": "Don't fight it. Suggest specific days. If he gives you a time, lock it in and get off the phone.",
        "branches": [
          {
            "label": "Gives a time / 'sure, try me later'",
            "to": "bad_timing_locked"
          },
          {
            "label": "Says don't call back",
            "to": "permission_rejected"
          },
          {
            "label": "Asks what it's about first",
            "to": "pain_trigger"
          }
        ]
      },
      "bad_timing_locked": {
        "label": "CALLBACK LOCKED",
        "say": "Perfect — I'll try you then. Appreciate it, Tim.",
        "note": "Write down the exact day and time immediately. Set a calendar reminder. This is now a warm callback.",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION ASK",
        "say": "Yeah totally — I mean it is a cold call, I'll own that. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not a fit?",
        "note": "Honesty disarms. Most people will give 30 seconds. If they do, go straight to pain trigger.",
        "branches": [
          {
            "label": "OK / 'go ahead'",
            "to": "pain_trigger"
          },
          {
            "label": "No / not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED — LAST SHOT",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and this just isn't interesting?",
        "note": "This splits the objection. If it's timing, you get a callback. If it's disinterest, you can try one more hook or exit gracefully.",
        "branches": [
          {
            "label": "Bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / don't call again",
            "to": "end_graceful"
          },
          {
            "label": "What do you do? (curious)",
            "to": "pain_trigger"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "So I've been working with another resort property manager — pretty similar setup to you guys, couple hundred vacation rental units in a ski market. The thing they kept running into was... their cleaners were taking hundreds of turnover photos every week, uploading them into whatever system they had, and nobody actually had the time to review them all. They were basically collecting photos as a CYA, but stuff was still slipping through — a broken towel rack here, a stain on a couch there, staging that was just off. And the first person to notice was always the guest. By then it's already a bad review, maybe a dispute with the owner, and the ops team's playing defense. I imagine with 380-plus units turning over during peak season at Beaver Creek, there's a lot of surface area for things to fall through the cracks.",
        "note": "PAUSE here. Do not rush to the solution. Let Tim react. You want him to say 'yeah' or 'that sounds familiar' before you pitch anything. The silence after 'fall through the cracks' is where the magic happens.",
        "branches": [
          {
            "label": "Agrees / 'yeah that's real' / relates to the pain",
            "to": "pain_positive"
          },
          {
            "label": "Lukewarm / 'we have processes for that'",
            "to": "pain_neutral"
          },
          {
            "label": "That's not really my area / wrong person",
            "to": "not_my_area"
          },
          {
            "label": "Pushes back / not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "pain_positive": {
        "label": "THEY FEEL THE PAIN",
        "say": "Yeah — and at the level you guys operate at, the bar's even higher. A missed issue in a luxury condo at Beaver Creek hits different than some basic rental. So we built an AI that plugs into whatever system your team's already using for turnovers — it reviews every photo automatically, flags damage, missing items, staging issues, and generates a report before the guest ever walks in. No workflow change for your cleaners at all.",
        "note": "One sentence on the solution. Don't go deeper — he's warm. Pivot to discovery or CTA depending on how engaged he sounds.",
        "branches": [
          {
            "label": "Interested / 'tell me more'",
            "to": "warm_discovery"
          },
          {
            "label": "Sounds interesting but hesitant",
            "to": "solution_cta"
          },
          {
            "label": "We already have something for that",
            "to": "objection_have_process"
          }
        ]
      },
      "pain_neutral": {
        "label": "LUKEWARM — PUSH DEEPER",
        "say": "That makes sense — I'd expect you guys to have something in place with that many units. Out of curiosity though, is that process mostly manual? Like someone on your team actually eyeballing photos one by one? Or is it more of a spot-check situation?",
        "note": "You're trying to surface the gap between their process and reality. Most teams do spot-checks at best. If he confirms manual or spot-check, that's your opening.",
        "branches": [
          {
            "label": "Admits it's manual / spot-check / not perfect",
            "to": "pain_positive"
          },
          {
            "label": "Says they're fully covered",
            "to": "objection_have_process"
          },
          {
            "label": "Not sure / 'I'd have to check with my team'",
            "to": "not_my_area"
          }
        ]
      },
      "not_my_area": {
        "label": "NOT THEIR AREA — REFERRAL PIVOT",
        "say": "Totally fair — I figured as Executive Director you'd have a view of who owns that piece. Who on your team would be the right person to talk to about the turnover and inspection workflow? Is that someone on the VBCRP property management side?",
        "note": "He likely knows the ops leader at VBCRP or whoever runs housekeeping and property management. If he mentions the vacation rentals team, push for a specific name — not just the department.",
        "branches": [
          {
            "label": "Gives a name",
            "to": "referral_get_name"
          },
          {
            "label": "Points to VBCRP generally / 'try the property management team'",
            "to": "referral_ask"
          },
          {
            "label": "Doesn't know / can't help",
            "to": "referral_ask"
          },
          {
            "label": "Actually, let me hear more first",
            "to": "pain_trigger"
          }
        ]
      },
      "referral_ask": {
        "label": "DIG FOR A NAME",
        "say": "That's super helpful. Do you happen to know the name of whoever runs property management or operations for the vacation rental side? If I can get a specific name I'll put something tailored together so it actually lands — way better than cold emailing a shared inbox.",
        "note": "Push for a real name. The shared VBCRP inbox is a dead end for cold outreach. You need a person. If he offers to connect you, that's even better.",
        "branches": [
          {
            "label": "Gives a name",
            "to": "referral_get_name"
          },
          {
            "label": "Doesn't know a name / suggests email",
            "to": "referral_email_fallback"
          },
          {
            "label": "Offers to connect you internally",
            "to": "referral_warm_intro"
          }
        ]
      },
      "referral_get_name": {
        "label": "GOT A NAME",
        "say": "That's perfect — [repeat name]. And do you know if they've got a direct line, or should I try through the main office? Also — would it be weird if I mentioned you pointed me their way?",
        "note": "Get the name, number if possible, and permission to name-drop Tim. This turns your next call from cold to warm. Write the name down immediately.",
        "branches": [
          {
            "label": "Gives number + OK to name-drop",
            "to": "referral_close"
          },
          {
            "label": "Says try main office / no number",
            "to": "referral_close"
          },
          {
            "label": "Prefers you don't use their name",
            "to": "referral_close"
          }
        ]
      },
      "referral_warm_intro": {
        "label": "WARM INTRO OFFERED",
        "say": "That would be incredible honestly. Would it be easier for you to shoot them a quick note, or should I send you something you can just forward over?",
        "note": "A warm intro from Tim Baker is gold. Make it dead simple for him. Offer to write the email he can forward — remove all friction.",
        "branches": [
          {
            "label": "He'll send a note himself",
            "to": "referral_close"
          },
          {
            "label": "Asks you to send something to forward",
            "to": "referral_close"
          }
        ]
      },
      "referral_email_fallback": {
        "label": "NO NAME — TRY ANOTHER ANGLE",
        "say": "No worries at all. What about on the Beaver Creek Resort Company side — is there anyone on your team who deals with property quality or guest experience that might overlap with this?",
        "note": "Try one more angle before giving up. BCRC may have someone in guest services or quality who could bridge you to VBCRP.",
        "branches": [
          {
            "label": "Gives a name or suggestion",
            "to": "referral_get_name"
          },
          {
            "label": "Can't help further",
            "to": "referral_close"
          }
        ]
      },
      "referral_close": {
        "label": "CLOSE THE REFERRAL",
        "say": "Really appreciate that, Tim. I'll reach out to them this week. And hey — if you ever wanna see what we're building, I'm an easy guy to find. Thanks for your time.",
        "note": "You got what you needed. Be genuinely grateful. Don't linger. Write down everything — name, number, permission to name-drop — immediately after hanging up.",
        "branches": []
      },
      "solution_cta": {
        "label": "SOLUTION + CTA",
        "say": "That's basically what we built — an AI that reviews every turnover photo your team's already taking and catches the stuff that humans miss at scale. Would you be open to taking a look at some point when I'm not cold calling you out of the blue?",
        "note": "Low-friction ask. You're not asking him to buy, demo, or commit — just 'take a look.' If he hesitates, pivot to offer of value or sell the test drive.",
        "branches": [
          {
            "label": "Sure / open to it",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "No budget right now",
            "to": "objection_no_budget"
          },
          {
            "label": "Not my area to decide",
            "to": "not_my_area"
          }
        ]
      },
      "warm_discovery": {
        "label": "THEY'RE WARM — ASK QUESTIONS",
        "say": "That's great to hear. So I don't waste your time — what does the inspection workflow actually look like right now at Beaver Creek? Are your cleaners taking photos every turnover, or is it more of a checklist thing?",
        "note": "STOP PITCHING. You're in discovery. Let him talk. Listen for: what tool they use, who owns the process, pain points, and whether he's the decision-maker or an influencer. Take notes.",
        "branches": [
          {
            "label": "Describes their process",
            "to": "discovery_process"
          },
          {
            "label": "Not sure of the details / 'that's more the ops team'",
            "to": "not_my_area"
          },
          {
            "label": "We use a specific tool",
            "to": "discovery_tool"
          }
        ]
      },
      "discovery_process": {
        "label": "LEARNING THEIR PROCESS",
        "say": "Got it. And who on the team actually reviews those — is there someone at the property management level doing QA on the photos, or does it basically fall on the housekeeping leads to self-check?",
        "note": "You're mapping the org. Who takes photos → who reviews them → who catches issues → who gets blamed when something's missed. This tells you who the real buyer is.",
        "branches": [
          {
            "label": "Names a person or role",
            "to": "discovery_scale"
          },
          {
            "label": "It's ad hoc / nobody really owns it",
            "to": "discovery_scale"
          },
          {
            "label": "Redirects to someone else",
            "to": "not_my_area"
          }
        ]
      },
      "discovery_tool": {
        "label": "THEY NAMED A TOOL",
        "say": "Oh nice — that's actually one of the platforms we plug right into. So the cool thing is, your team wouldn't change anything they're already doing. We'd just layer on top and start flagging issues automatically from the photos they're already uploading. How's it been working for you guys so far?",
        "note": "If they name Breezeway, Track, Guesty, or any PMS — great, we integrate. If you don't recognize it, don't fake it — say 'we've been integrating with a bunch of different platforms.' The real question is: how's it working?",
        "branches": [
          {
            "label": "It's fine but has gaps",
            "to": "discovery_scale"
          },
          {
            "label": "We love it / it's great",
            "to": "objection_have_process"
          },
          {
            "label": "Wants to know more about how we integrate",
            "to": "discovery_scale"
          }
        ]
      },
      "discovery_scale": {
        "label": "SCALE + SEASON PRESSURE",
        "say": "Makes sense. And heading into next ski season — are you guys looking to add units to the program, or is it more about tightening up operations with the current portfolio? I ask because most of the managers I talk to say peak season is when everything breaks.",
        "note": "Tie it to their seasonal reality. Beaver Creek peak season means massive turnover volume. This is when inspection gaps hurt most. If he talks about growth or seasonal chaos, that's your bridge to booking the meeting.",
        "branches": [
          {
            "label": "Talks about growth or adding units",
            "to": "book_bridge"
          },
          {
            "label": "Talks about operational challenges / peak pressure",
            "to": "book_bridge"
          },
          {
            "label": "We're in good shape / not a priority",
            "to": "sell_test_drive"
          }
        ]
      },
      "book_bridge": {
        "label": "BRIDGE TO MEETING",
        "say": "Yeah that's exactly what I was hoping to dig into. Would it make sense to set up 20 minutes where I can show you what we've been doing with a couple other ski resort property managers? Seeing it is way more useful than me trying to explain over the phone. I've got next week pulled up — what day works best?",
        "note": "Be specific. Suggest a day. If he hedges, give two options. Goal is to get on the calendar right now, not 'sometime.'",
        "branches": [
          {
            "label": "Gives a day/time",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "send_email"
          },
          {
            "label": "Budget's tight / need approval",
            "to": "objection_no_budget"
          },
          {
            "label": "Not right now",
            "to": "sell_test_drive"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK IT NOW",
        "say": "Perfect — let me grab that. How does [time] on [day] look? And what's the best email to send the invite to? I'll drop it over right now while we're on the phone.",
        "note": "Lock it in. Send the invite WHILE ON THE PHONE. Try tbaker@vailresorts.com based on the company email pattern if he doesn't offer one. Once booked, stop selling immediately.",
        "branches": [
          {
            "label": "Gives email / confirms time",
            "to": "meeting_booked"
          },
          {
            "label": "Hesitates on time / 'just send it'",
            "to": "meeting_booked"
          }
        ]
      },
      "book_meeting_soft": {
        "label": "TENTATIVE — LOCK SOMETHING IN",
        "say": "Totally get it. How about I pencil in something tentative for next week — say Wednesday afternoon — and if you need to loop someone in or push it, no worries at all? That way it's on the calendar and we don't have to play phone tag.",
        "note": "A tentative meeting is better than no meeting. Get something on the calendar even if it might move.",
        "branches": [
          {
            "label": "Agrees to tentative",
            "to": "book_meeting"
          },
          {
            "label": "Prefers email first",
            "to": "send_email"
          },
          {
            "label": "Passes / not now",
            "to": "sell_test_drive"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING CONFIRMED",
        "say": "Done — you'll see it in your inbox in about 30 seconds. Really appreciate you taking my call, Tim. Looking forward to it.",
        "note": "STOP SELLING. You got the meeting. Be warm, be brief, get off the phone. Send the calendar invite immediately after hanging up.",
        "branches": []
      },
      "objection_no_budget": {
        "label": "NO BUDGET",
        "say": "Totally get it. Especially with how Vail Resorts runs things — I'm sure any new tooling has to go through a pretty long approval chain. That's honestly most of the people I talk to right now.",
        "note": "Agree first. Reference the corporate structure — Vail Resorts is publicly traded, budgets are centralized and slow. Then split the objection.",
        "branches": [
          {
            "label": "Elaborates on budget constraints",
            "to": "split_budget"
          },
          {
            "label": "Softens / 'yeah it's tough'",
            "to": "split_budget"
          }
        ]
      },
      "split_budget": {
        "label": "SPLIT THE BUDGET OBJECTION",
        "say": "Just so nobody from my team cold calls you again — is it that budget for this cycle is completely locked, or is it more that anything new has to go through corporate and it's just a headache to even start that conversation?",
        "note": "If budget is locked, sell the test drive for future planning. If corporate approval is the pain, offer to help build an internal case.",
        "branches": [
          {
            "label": "Budget is locked",
            "to": "sell_test_drive"
          },
          {
            "label": "Corporate approval is the headache",
            "to": "sell_test_drive"
          },
          {
            "label": "Actually it's more that I'm not sure we need it",
            "to": "objection_not_interested"
          }
        ]
      },
      "objection_not_interested": {
        "label": "NOT INTERESTED",
        "say": "I totally get it. I should've assumed you'd be all set — otherwise you probably would've reached out to someone like us already.",
        "note": "Agree. Don't push back. Let the silence sit for a beat, then split.",
        "branches": [
          {
            "label": "Softens a bit",
            "to": "split_interest"
          },
          {
            "label": "Stays firm",
            "to": "split_interest"
          }
        ]
      },
      "split_interest": {
        "label": "SPLIT THE INTEREST OBJECTION",
        "say": "Just so I know — is it that turnover inspections really aren't a pain point for you guys, or is it more that you just hate cold calls and I caught you at a bad time?",
        "note": "Most people will admit it's the cold call, not the problem. If they say the problem isn't real, go to offer of value. If it's the cold call, you get another shot.",
        "branches": [
          {
            "label": "It's the cold call / bad timing",
            "to": "bad_timing"
          },
          {
            "label": "It genuinely isn't a problem",
            "to": "offer_value"
          },
          {
            "label": "Opens up about the real issue",
            "to": "pain_positive"
          }
        ]
      },
      "objection_have_process": {
        "label": "ALREADY HAVE SOMETHING",
        "say": "That makes total sense — with 380-plus units you'd have to have something in place. It'd be weird if you didn't.",
        "note": "Validate their process. Don't compete with it. Then split to understand if they're truly happy or just resistant to change.",
        "branches": [
          {
            "label": "Describes what they have",
            "to": "split_process"
          },
          {
            "label": "Just says 'yeah we're good'",
            "to": "split_process"
          }
        ]
      },
      "split_process": {
        "label": "SPLIT THE VENDOR/PROCESS OBJECTION",
        "say": "Totally. Is it that you're fully covered and genuinely happy with how it's working, or is it more that switching or adding anything right now would just be a headache with everything else going on?",
        "note": "If they're happy, respect it and go to the value offer. If switching is the pain, lean into 'no workflow change' — we layer on top of whatever they already have.",
        "branches": [
          {
            "label": "We're happy with it",
            "to": "offer_value"
          },
          {
            "label": "Switching would be a headache",
            "to": "sell_test_drive_no_change"
          },
          {
            "label": "Actually there are some gaps...",
            "to": "pain_positive"
          }
        ]
      },
      "sell_test_drive_no_change": {
        "label": "NO WORKFLOW CHANGE ANGLE",
        "say": "That's the thing though — we're not replacing anything. We literally plug into whatever your team's already using and layer on top. Your cleaners don't change a single thing they do. It's like getting a second set of eyes on every photo that's already being taken. Would it be worth 20 minutes to see how that works? Even just to know it exists.",
        "note": "This is the strongest angle when the objection is switching fatigue. Hammer 'no change' and make the meeting feel effortless. If this doesn't land, go to offer of value.",
        "branches": [
          {
            "label": "OK let's look at it",
            "to": "book_meeting"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          },
          {
            "label": "Still no",
            "to": "offer_value"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Look, you're probably not buying anything from a 20-year-old who cold called you on a Tuesday — and I totally respect that. But when budget does free up or the timing's better, the people who move fastest are the ones who already know what's out there. Would you be open to a quick look — not to buy anything, just so it's on your radar for when it makes sense?",
        "note": "Low pressure. Self-aware. The age comment is disarming and honest. If this doesn't work, pivot to offer of value.",
        "branches": [
          {
            "label": "Sure / why not",
            "to": "book_meeting"
          },
          {
            "label": "Send me something",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "offer_value"
          }
        ]
      },
      "offer_value": {
        "label": "OFFER OF VALUE — LAST PLAY",
        "say": "Totally fair. If nothing else — I could send you a quick breakdown of what other property managers in ski resort markets are doing with their turnover photos right now. Worst case you steal some ideas and we part as friends. Would that be useful at all?",
        "note": "This is the last play before a graceful exit. If he says yes, get his email and send something genuinely valuable. If no, exit warmly. Don't beg.",
        "branches": [
          {
            "label": "Sure, send it over",
            "to": "send_email"
          },
          {
            "label": "No thanks",
            "to": "end_graceful"
          }
        ]
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Absolutely — happy to. One quick question so I don't just send a generic pitch: what would be most useful to see? Is it more about the photo analysis side, or how we've worked with other resort property managers on the operations piece?",
        "note": "Always ask one tailoring question. This gets him invested and tells you what to include. Get his direct email — try to confirm tbaker@vailresorts.com or whatever he gives.",
        "branches": [
          {
            "label": "Tells you what they want to see",
            "to": "email_close"
          },
          {
            "label": "Just send whatever / 'I'll take a look'",
            "to": "email_close"
          }
        ]
      },
      "email_close": {
        "label": "LOCK IN THE EMAIL",
        "say": "Perfect — what's the best email for you? I'll include a couple of times to connect next week in case anything jumps out. Really appreciate your time, Tim.",
        "note": "Include a specific time suggestion in the follow-up email. Follow up in 2-3 business days if no response. Keep the email short — one clear CTA, not a novel.",
        "branches": []
      },
      "end_graceful": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes down the road, I'm easy to find. Appreciate your time, Tim — enjoy the rest of ski season.",
        "note": "Don't burn the bridge. The ski season line keeps it personal and ties back to the opener. Log the call, note the objection, set a reminder to try again in 3-6 months.",
        "branches": []
      },
      "gatekeeper_initial": {
        "label": "GATEKEEPER — SLIDE BY",
        "say": "Hey — could you get me over to Tim? It's Sam.",
        "note": "Short. Confident. First names only. Don't explain why. Don't pitch. Act like Tim's expecting you.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Asks what it's about",
            "to": "gatekeeper_context"
          },
          {
            "label": "Tim's not available",
            "to": "gatekeeper_unavailable"
          }
        ]
      },
      "gatekeeper_context": {
        "label": "GATEKEEPER — GIVE CONTEXT",
        "say": "Yeah — I work with a few other property managers in the ski resort space. Would you mind letting Tim know it's Sam Parks? I sent a note over and just wanted to follow up.",
        "note": "Drip info slowly. Don't pitch the gatekeeper. 'I sent a note over' creates implied familiarity. End with a redirect so you stay in control.",
        "branches": [
          {
            "label": "Puts you through",
            "to": "opener"
          },
          {
            "label": "Takes a message / asks for email",
            "to": "gatekeeper_message"
          },
          {
            "label": "Pushes back further",
            "to": "gatekeeper_social_proof"
          }
        ]
      },
      "gatekeeper_social_proof": {
        "label": "GATEKEEPER — SOCIAL PROOF",
        "say": "Totally understand. We help a couple other resort property management companies with their turnover inspection workflows — similar setup to Beaver Creek. Would you mind giving Tim a heads up that I called? It's Sam Parks with RapidEye.",
        "note": "Third and final attempt. Leave a clean, memorable message. Be gracious. If they won't help, get the gatekeeper's name so you can build familiarity on the next call.",
        "branches": [
          {
            "label": "Agrees to pass the message",
            "to": "gatekeeper_message"
          },
          {
            "label": "Won't help",
            "to": "gatekeeper_message"
          }
        ]
      },
      "gatekeeper_unavailable": {
        "label": "TIM'S NOT AVAILABLE",
        "say": "No worries — when's he usually around? I'll try back then.",
        "note": "Simple ask. Some gatekeepers will give you his schedule if you ask casually enough. Get a time window.",
        "branches": [
          {
            "label": "Gives a time / 'try mornings'",
            "to": "gatekeeper_message"
          },
          {
            "label": "Won't say / 'I don't know'",
            "to": "gatekeeper_message"
          }
        ]
      },
      "gatekeeper_message": {
        "label": "LEAVE A MESSAGE",
        "say": "Could you just let him know Sam Parks called? I'll try back tomorrow. Thanks so much — what was your name, by the way?",
        "note": "Get the gatekeeper's name. Next time you call: 'Hi [name], it's Sam again — is Tim around?' builds familiarity. Log the name, the time you called, and when they said to try back.",
        "branches": []
      }
    }
  }
}