{
  "name": "Tom Stewart",
  "title": "Chief Operating Officer (COO) and Broker in Charge",
  "company": "Resort Realty",
  "location": "Outer Banks, NC",
  "phone": "+1-252-255-3502",
  "company_phone": "+1-800-458-3830",
  "alt_phones": [],
  "flow": {
    "context": "Tom Stewart is the COO and Broker in Charge at Resort Realty — 600+ vacation rental homes across the Outer Banks, five offices. Navy veteran, construction and hospitality background, very operations-minded and data-driven. He appeared on the How We Grow podcast in April 2024 talking about the 80-20 rule and using Streamline data to convince owners to renovate. They recently acquired Colony Realty's portfolio and are actively hiring inexperienced inspectors — both massive operational stress points. Sam's hook: reference the podcast, mention Streamline by name, and position RapidEye as the automated QC layer his growing team needs.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Tom, I caught your episode on How We Grow with Lynell Gordon — your point about using data to convince owners to renovate really stuck with me. It's Sam Parks with RapidEye. Have you heard my name tossed around at all?",
        "note": "Feet on desk energy. Casual. You actually listened to his podcast — that's real and he'll feel it. Let the silence sit after the question.",
        "branches": [
          {
            "label": "No / Who? / Don't think so",
            "to": "not_heard"
          },
          {
            "label": "Yes / Maybe / Sounds familiar",
            "to": "heard_yes"
          },
          {
            "label": "Bad timing / I'm busy",
            "to": "bad_timing"
          },
          {
            "label": "How'd you get this number? / What is this?",
            "to": "permission_fallback"
          }
        ]
      },
      "not_heard": {
        "label": "NOT HEARD — TRANSITION TO PAIN",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call, Tom — I work with a few other vacation rental operators managing portfolios similar to yours. One of them was in almost the exact same spot — growing fast, just absorbed another company's inventory, brought on a bunch of new inspectors. And the issue wasn't that inspections weren't happening. It's that stuff was still getting missed. Their team was taking hundreds of photos every turnover Saturday, but nobody had time to actually review them all. Damages would slip through, owners would find out before the PM did, and it turned into deposit disputes and trust issues. We built a tool that plugs into Streamline and automatically reviews every photo your team's already taking — flags damage, missing items, staging problems — before anyone checks in. Would you be open to seeing what that looks like? I promise I won't keep you.",
        "note": "This is the full pain trigger plus solution plus CTA. PAUSE after 'trust issues' — let him react. If he jumps in, let him talk. Only deliver the solution sentence if he's still listening. The Streamline name-drop shows homework.",
        "branches": [
          {
            "label": "Yeah sure / That's interesting / Tell me more",
            "to": "pain_warm"
          },
          {
            "label": "How does that work exactly?",
            "to": "solution_detail"
          },
          {
            "label": "We already have a process for that",
            "to": "objection_have_process"
          },
          {
            "label": "Not interested / Not right now",
            "to": "objection_not_interested"
          },
          {
            "label": "Send me an email",
            "to": "objection_send_email"
          },
          {
            "label": "No budget for that",
            "to": "objection_no_budget"
          }
        ]
      },
      "heard_yes": {
        "label": "HEARD OF US — EXPLORE",
        "say": "Oh nice — well normally we'd be working with someone like you. What did you hear?",
        "note": "Let him talk. Whatever he says, agree and bridge to discovery. If he already knows what RapidEye does, skip the pitch entirely.",
        "branches": [
          {
            "label": "Mentions the product / knows what we do",
            "to": "pain_warm"
          },
          {
            "label": "Vague / not sure exactly",
            "to": "not_heard"
          },
          {
            "label": "Heard from someone specific",
            "to": "pain_warm"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you, Tom. Would it be a terrible idea if I tried you again tomorrow — or would later this week work better?",
        "note": "Don't apologize. Offer two options. You're not asking IF to call back, you're asking WHEN.",
        "branches": [
          {
            "label": "Gives a time or day",
            "to": "reschedule_locked"
          },
          {
            "label": "Just send me an email",
            "to": "objection_send_email"
          },
          {
            "label": "No don't call back",
            "to": "graceful_exit"
          }
        ]
      },
      "reschedule_locked": {
        "label": "CALLBACK LOCKED",
        "say": "Perfect — I've got that down. I'll try you then. Really appreciate it, Tom.",
        "note": "Write the time down immediately. Set a reminder. This is a warm callback — treat it like gold.",
        "branches": []
      },
      "permission_fallback": {
        "label": "PERMISSION — 30 SECONDS",
        "say": "Yeah totally — I mean it is a cold call. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not a fit?",
        "note": "Disarming honesty. Most people respect the transparency and give you the 30 seconds. Smile through it.",
        "branches": [
          {
            "label": "Fine / Go ahead / 30 seconds",
            "to": "pain_trigger_short"
          },
          {
            "label": "No / Not interested / Take me off your list",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED — SPLIT",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it more that you already know what we do and this just isn't interesting?",
        "note": "Not pushing. Splitting the objection. Either answer gives you a path forward.",
        "branches": [
          {
            "label": "Bad time / Just busy right now",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / Don't need it",
            "to": "graceful_exit"
          },
          {
            "label": "What do you do exactly?",
            "to": "pain_trigger_short"
          }
        ]
      },
      "pain_trigger_short": {
        "label": "PAIN TRIGGER — COMPRESSED",
        "say": "So I work with vacation rental operators managing big portfolios — think five, six hundred homes. The problem I keep hearing is their teams take hundreds of photos every turnover, but nobody has time to actually review them all. Stuff slips through — a broken chair, a stain on the couch — and the owner finds out before the PM does. We built an AI that plugs into Streamline and reviews every photo automatically. Flags damage before the guest checks in. Would you be open to taking a look when I'm not cold calling you out of the blue?",
        "note": "This is the 30-second version. Tight. Specific. Mentioning Streamline by name is the credibility punch. End with the low-pressure CTA.",
        "branches": [
          {
            "label": "Yeah / That's interesting / Tell me more",
            "to": "pain_warm"
          },
          {
            "label": "We have a process for that",
            "to": "objection_have_process"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          },
          {
            "label": "Send me something",
            "to": "objection_send_email"
          },
          {
            "label": "No budget",
            "to": "objection_no_budget"
          }
        ]
      },
      "pain_warm": {
        "label": "THEY'RE WARM — STOP PITCHING",
        "say": "Awesome. So I don't waste your time — can I ask you a couple quick questions so I know what's actually relevant to show you?",
        "note": "STOP SELLING. He's interested. Transition to discovery. He said yes — don't blow it by pitching more.",
        "branches": [
          {
            "label": "Sure / Go ahead",
            "to": "discovery_process"
          },
          {
            "label": "Just tell me what it costs or how it works",
            "to": "solution_detail"
          },
          {
            "label": "I only have a minute",
            "to": "discovery_quick"
          }
        ]
      },
      "discovery_process": {
        "label": "DISCOVERY — CURRENT PROCESS",
        "say": "What does your inspection workflow actually look like right now across those six hundred-plus homes? Are your inspectors taking photos on every turnover, or is it more spot-check?",
        "note": "You know they're hiring inexperienced inspectors. Let him tell you the pain himself. Listen for: how many photos, who reviews them, what falls through the cracks.",
        "branches": [
          {
            "label": "Describes their process / photos every turn",
            "to": "discovery_colony"
          },
          {
            "label": "We use Streamline for that",
            "to": "discovery_streamline"
          },
          {
            "label": "It's kind of a mess / working on it",
            "to": "discovery_staffing"
          },
          {
            "label": "We don't really do photo inspections",
            "to": "discovery_no_photos"
          }
        ]
      },
      "discovery_colony": {
        "label": "DISCOVERY — COLONY ACQUISITION",
        "say": "Got it. And with the Colony Realty properties coming into the portfolio — how's that integration going? Are those homes up to your standards yet, or is that still in progress?",
        "note": "This shows deep research. The Colony acquisition is a known pain point — more properties, same team, inconsistent standards. Let him vent.",
        "branches": [
          {
            "label": "It's been a lot / still integrating",
            "to": "discovery_staffing"
          },
          {
            "label": "Going well / mostly done",
            "to": "discovery_peak_season"
          },
          {
            "label": "How do you know about that?",
            "to": "research_explain"
          }
        ]
      },
      "discovery_streamline": {
        "label": "DISCOVERY — STREAMLINE DEEP DIVE",
        "say": "Yeah — I heard you mention Streamline on the podcast actually. Are you using their PropertyCare module for inspections, or are the photos living somewhere else?",
        "note": "Technical qualifying question. You need to know where the photos live. If Streamline PropertyCare, RapidEye plugs right in. If photos are on phones or in a folder, different conversation.",
        "branches": [
          {
            "label": "Using PropertyCare or Streamline ops tools",
            "to": "discovery_peak_season"
          },
          {
            "label": "Photos are separate / on phones / Google Drive",
            "to": "discovery_peak_season"
          },
          {
            "label": "We use Breezeway for ops",
            "to": "discovery_peak_season"
          }
        ]
      },
      "discovery_staffing": {
        "label": "DISCOVERY — STAFFING CHALLENGE",
        "say": "That makes sense. I saw you guys were bringing on new inspectors recently — how's the ramp-up been? Are they catching what needs to be caught, or is that still a work in progress?",
        "note": "You know from the job posting they're hiring inspectors with 'no experience needed.' This is a huge QC gap. Let him tell you about it.",
        "branches": [
          {
            "label": "It's been tough / training takes time",
            "to": "solution_bridge"
          },
          {
            "label": "They're doing okay / getting there",
            "to": "discovery_peak_season"
          },
          {
            "label": "How do you know we're hiring?",
            "to": "research_explain"
          }
        ]
      },
      "discovery_no_photos": {
        "label": "DISCOVERY — NO PHOTO PROCESS",
        "say": "Interesting. So how are you documenting property condition between guests right now? Is it mostly visual walkthroughs, or checklists?",
        "note": "If they don't do photo inspections, the video walkthrough product is the play. Listen for how they currently track damage.",
        "branches": [
          {
            "label": "Checklists / walkthroughs / manual",
            "to": "solution_bridge_video"
          },
          {
            "label": "We have a system that works",
            "to": "objection_have_process"
          }
        ]
      },
      "discovery_peak_season": {
        "label": "DISCOVERY — PEAK SEASON PRESSURE",
        "say": "How many turnovers are you doing on a peak Saturday in summer? And who's actually reviewing all those inspection photos — is that falling on you, or do you have someone dedicated to it?",
        "note": "This is where the math gets painful. 600+ homes turning on a Saturday means hundreds of photo sets. Nobody reviews all of them manually. Let the number sink in.",
        "branches": [
          {
            "label": "Gives numbers / describes the chaos",
            "to": "solution_bridge"
          },
          {
            "label": "We have team leads handling it",
            "to": "solution_bridge"
          },
          {
            "label": "Honestly nobody reviews them all",
            "to": "solution_bridge"
          }
        ]
      },
      "discovery_quick": {
        "label": "DISCOVERY — SHORT VERSION",
        "say": "Quick one — on a peak turnover Saturday, how are your inspectors documenting condition? Photos in Streamline, or something else?",
        "note": "He's short on time. One question to qualify, then straight to the CTA.",
        "branches": [
          {
            "label": "Photos in Streamline or an app",
            "to": "solution_bridge"
          },
          {
            "label": "Checklists / manual",
            "to": "solution_bridge_video"
          },
          {
            "label": "I really don't have time",
            "to": "bad_timing"
          }
        ]
      },
      "research_explain": {
        "label": "EXPLAIN YOUR HOMEWORK",
        "say": "I did my homework before calling — I figure if I'm gonna take sixty seconds of your day I should at least know who I'm talking to. I listened to your podcast, looked at what's going on with Resort Realty. I'm not just dialing down a list.",
        "note": "Tom's military background means he respects preparation and directness. Don't be apologetic about researching him — frame it as respect for his time.",
        "branches": [
          {
            "label": "Appreciates it / laughs / fair enough",
            "to": "solution_bridge"
          },
          {
            "label": "Still skeptical",
            "to": "solution_bridge"
          }
        ]
      },
      "solution_bridge": {
        "label": "BRIDGE TO SOLUTION",
        "say": "So here's why I called you specifically. We built an AI that plugs into the photo workflow your team's already doing — connects to Streamline — and automatically reviews every photo for damage, missing items, staging issues. No workflow change for your inspectors. It just catches the stuff that slips through when you're turning six hundred homes and nobody can eyeball every single photo. Would it make sense to block twenty minutes so I can show you what it actually looks like on a real property?",
        "note": "One shot at the solution. Mention Streamline. Mention 600 homes. Emphasize NO WORKFLOW CHANGE — that's huge for an operations guy. Then CTA with a specific time ask.",
        "branches": [
          {
            "label": "Yeah let's do it / Sure",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "objection_send_email"
          },
          {
            "label": "What does it cost?",
            "to": "handle_pricing"
          },
          {
            "label": "We're not looking to add anything right now",
            "to": "objection_not_interested"
          },
          {
            "label": "No budget",
            "to": "objection_no_budget"
          },
          {
            "label": "I'd need to loop someone in",
            "to": "referral_internal"
          }
        ]
      },
      "solution_bridge_video": {
        "label": "BRIDGE TO SOLUTION — VIDEO",
        "say": "Got it. So we actually have two ways in — one works off photos, but the other works off video walkthroughs. Your inspector does a quick walkthrough with their phone, and our AI scans the whole thing for damage, change detection, missing items. It's like giving every inspector a photographic memory. Would it be worth twenty minutes to see what that looks like?",
        "note": "If they don't do structured photo inspections, the video walkthrough product is the better fit. Same CTA.",
        "branches": [
          {
            "label": "Yeah / That's interesting",
            "to": "book_meeting"
          },
          {
            "label": "Send me info",
            "to": "objection_send_email"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "solution_detail": {
        "label": "EXPLAIN HOW IT WORKS",
        "say": "So your inspectors are already taking photos during turnovers, right? We connect to your Streamline system, pull those photos automatically, and run them through our AI. It flags things like damage to furniture, stains, missing items, staging that's off — anything that looks different from how the property should look. Your team gets a report before the next guest checks in. No new app for your inspectors, no new process. It just works on top of what they're already doing.",
        "note": "Keep it simple. Tom has a construction background — he thinks in practical terms. Avoid AI buzzwords. Focus on inputs and outputs.",
        "branches": [
          {
            "label": "That's pretty cool / I like that",
            "to": "book_meeting"
          },
          {
            "label": "What does it cost?",
            "to": "handle_pricing"
          },
          {
            "label": "Who else is using this?",
            "to": "social_proof"
          },
          {
            "label": "We'd need to test it first",
            "to": "book_meeting"
          }
        ]
      },
      "handle_pricing": {
        "label": "PRICING QUESTION",
        "say": "Totally fair question. Honestly it depends on your volume and how you want to set it up — I don't want to throw out a number that doesn't match your situation. That's one of the things I'd walk through in the demo. But to give you a sense — for a portfolio your size, we're talking less than what you'd pay one full-time inspector. Would it make sense to block twenty minutes and I can put together something specific for six hundred-plus homes?",
        "note": "Don't give a hard number on a cold call. Anchor against a cost he already pays — an inspector salary. Redirect to the meeting.",
        "branches": [
          {
            "label": "Yeah let's set something up",
            "to": "book_meeting"
          },
          {
            "label": "Just ballpark me",
            "to": "handle_pricing_push"
          },
          {
            "label": "No budget right now",
            "to": "objection_no_budget"
          }
        ]
      },
      "handle_pricing_push": {
        "label": "PRICING — PUSHED FOR NUMBER",
        "say": "I hear you — I'm not trying to dodge it. For six hundred homes we're typically in the range of a few hundred bucks a month. The real ROI question is how many damage claims you're eating right now versus what you'd catch up front. Happy to dig into that math with you — does next Tuesday or Wednesday work better?",
        "note": "Give a loose range if pushed. Immediately redirect to booking. Don't let pricing become a ten-minute conversation on a cold call.",
        "branches": [
          {
            "label": "Let's do it",
            "to": "book_meeting"
          },
          {
            "label": "Let me think about it",
            "to": "sell_test_drive"
          },
          {
            "label": "That's too much / no budget",
            "to": "objection_no_budget"
          }
        ]
      },
      "social_proof": {
        "label": "SOCIAL PROOF",
        "say": "Right now we're working with a PM company on the East Coast managing about six hundred properties — pretty similar to your setup. Also have a group in New York doing two hundred luxury homes, and an operator in Dubai. The East Coast company is actually how I got connected to the Outer Banks market — they pointed me your direction.",
        "note": "Don't name-drop specific companies without permission. Keep it general but specific enough to be credible. The 'pointed me your way' line is a soft referral implication.",
        "branches": [
          {
            "label": "Interesting / makes sense",
            "to": "book_meeting"
          },
          {
            "label": "Who specifically?",
            "to": "social_proof_redirect"
          }
        ]
      },
      "social_proof_redirect": {
        "label": "SOCIAL PROOF — NAME REQUEST",
        "say": "I'd love to connect you directly — I just need to check with them before sharing names. If we set up a quick call I can make that introduction. How's your week looking?",
        "note": "Don't invent names. Promise an intro and use it as another reason to book the meeting.",
        "branches": [
          {
            "label": "Sure that'd be great",
            "to": "book_meeting"
          },
          {
            "label": "Not right now",
            "to": "sell_test_drive"
          }
        ]
      },
      "objection_not_interested": {
        "label": "OBJECTION — NOT INTERESTED",
        "say": "I totally get it. I should've assumed you'd be all set — otherwise you probably would've reached out. Just so nobody from my team cold calls you again — is it more that this isn't a problem you're focused on right now, or is it just that cold calls are the worst and I caught you at a bad moment?",
        "note": "Agree first. Then split. Most people pick the second option which opens the door back up.",
        "branches": [
          {
            "label": "Bad timing / cold calls suck",
            "to": "sell_test_drive"
          },
          {
            "label": "Not a problem we have / we're covered",
            "to": "objection_have_process"
          },
          {
            "label": "Just not interested period",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_no_budget": {
        "label": "OBJECTION — NO BUDGET",
        "say": "Totally get it. Especially with everything going on — growing the portfolio, the Colony integration — I'm sure every dollar's accounted for right now. Just so I'm not wasting your time or mine — is it that budget this cycle is completely locked, or is it more that anything new you try to buy puts you through the ringer?",
        "note": "Acknowledge the Colony acquisition to show empathy and research. The split determines timing issue versus process issue.",
        "branches": [
          {
            "label": "Budget is locked / not this year",
            "to": "sell_test_drive"
          },
          {
            "label": "Approval process is brutal",
            "to": "sell_test_drive"
          },
          {
            "label": "Both / just can't right now",
            "to": "sell_test_drive"
          }
        ]
      },
      "objection_have_process": {
        "label": "OBJECTION — HAVE A PROCESS",
        "say": "That makes total sense — managing six hundred homes you'd have to have something solid in place. Is it that you're fully covered and happy with how inspections are going, or is it more that switching anything right now in the middle of everything would be a headache?",
        "note": "You know they're hiring inexperienced inspectors. Their process has gaps. But don't argue — split the objection and let him reveal the real blocker.",
        "branches": [
          {
            "label": "We're happy with our process",
            "to": "objection_happy_reframe"
          },
          {
            "label": "Switching would be a headache",
            "to": "sell_test_drive"
          },
          {
            "label": "A bit of both",
            "to": "sell_test_drive"
          }
        ]
      },
      "objection_happy_reframe": {
        "label": "REFRAME — HAPPY WITH PROCESS",
        "say": "Respect that. Out of curiosity — when your team turns those six hundred homes on a Saturday, does someone actually review every set of photos? Or is it more like you're relying on inspectors to flag stuff themselves?",
        "note": "This is the reframe. Nobody reviews 600 sets of photos. If he admits that, you've reopened the conversation. If he insists they do, respect it and exit.",
        "branches": [
          {
            "label": "Admits not every photo gets reviewed",
            "to": "reframe_bridge"
          },
          {
            "label": "We review everything / we're thorough",
            "to": "graceful_exit_soft"
          },
          {
            "label": "Good question / hadn't thought of it that way",
            "to": "reframe_bridge"
          }
        ]
      },
      "reframe_bridge": {
        "label": "REFRAME — BRIDGE BACK",
        "say": "That's exactly the gap we fill. You don't need to change anything about how your team works — we just review what they're already capturing and make sure nothing gets through. It's like a second set of eyes on every property, every turn. Would it be worth a quick look — even just to see what other managers in the OBX market are doing?",
        "note": "Reframe RapidEye as additive not a replacement. 'Second set of eyes' resonates with military and ops minds. OBX market reference adds local social proof.",
        "branches": [
          {
            "label": "Yeah okay let's take a look",
            "to": "book_meeting"
          },
          {
            "label": "Send me something",
            "to": "objection_send_email"
          },
          {
            "label": "Still not interested",
            "to": "graceful_exit"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Look, you're probably not buying anything on a cold call — and I totally respect that. But when budget does free up, the people who move fastest are the ones who already know what's on their list. Would you be open to twenty minutes — not a sales pitch, just a look at what we're doing — so you know it's out there when the time's right? Worst case I walk you through what other PM companies in the Outer Banks are doing with their turnover photos and you steal some ideas.",
        "note": "Future state close. You're not asking him to buy — you're asking him to be informed. The 'steal some ideas' line lowers stakes to near zero.",
        "branches": [
          {
            "label": "Yeah that's fair / okay",
            "to": "book_meeting"
          },
          {
            "label": "Send me an email and I'll look",
            "to": "objection_send_email"
          },
          {
            "label": "Not right now",
            "to": "referral_ask"
          },
          {
            "label": "No thanks",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One question before I do — what would be most relevant to include so it's not just another pitch that gets buried? Are you more interested in the Streamline integration side, or the actual damage detection piece?",
        "note": "Accept the email request. The qualifying question keeps the conversation going AND tells you what to emphasize in the follow-up.",
        "branches": [
          {
            "label": "Integration / tech side",
            "to": "email_close"
          },
          {
            "label": "Damage detection / operations side",
            "to": "email_close"
          },
          {
            "label": "Just send whatever / both",
            "to": "email_close"
          },
          {
            "label": "Actually let's just do the call",
            "to": "book_meeting"
          }
        ]
      },
      "email_close": {
        "label": "EMAIL — GET ADDRESS",
        "say": "Got it — I'll keep it short and specific. What's the best email for you? And I'll throw a couple time slots in there too — if one works, great. If not, no pressure at all. Thanks for hearing me out, Tom.",
        "note": "Get the email. Include time slots in the email — plants the seed for a meeting. Send within 10 minutes of hanging up.",
        "branches": [
          {
            "label": "Gives email",
            "to": "email_sent"
          },
          {
            "label": "Just use the general one / find it online",
            "to": "email_sent"
          }
        ]
      },
      "email_sent": {
        "label": "EMAIL CAPTURED — END",
        "say": "Perfect — you'll have it in the next ten minutes. Appreciate your time, Tom.",
        "note": "Send the email IMMEDIATELY. Reference something specific from the call. Include a calendar link and two specific time options. Subject line should reference the podcast or Streamline.",
        "branches": []
      },
      "referral_ask": {
        "label": "REFERRAL — ASK",
        "say": "Totally understand. Before I let you go — is there someone on your team who handles the day-to-day inspection workflow? Like your housekeeping director or ops manager? If I can get a name I'll put something tailored together so it actually lands with the right person.",
        "note": "You know Debbie Ianetta is General Manager. If he mentions her that's gold. Any name is a win — you'll call them with Tom's name as the referral.",
        "branches": [
          {
            "label": "Gives a name",
            "to": "referral_received"
          },
          {
            "label": "That would be me / I handle it",
            "to": "sell_test_drive_final"
          },
          {
            "label": "I'd rather not / just email me",
            "to": "objection_send_email"
          },
          {
            "label": "No / declines",
            "to": "graceful_exit"
          }
        ]
      },
      "referral_received": {
        "label": "REFERRAL — GOT A NAME",
        "say": "Perfect — got it. And what's the best way to reach them — do they have a direct line or should I go through the main office? Really appreciate you pointing me in the right direction, Tom. If it goes well I'll keep you in the loop.",
        "note": "Get the name AND the contact method. Mention keeping Tom in the loop — he's still the executive buyer even if someone else evaluates.",
        "branches": [
          {
            "label": "Gives contact info",
            "to": "referral_close"
          },
          {
            "label": "Just call the main line",
            "to": "referral_close"
          }
        ]
      },
      "referral_close": {
        "label": "REFERRAL — CLOSE",
        "say": "Got it. Thanks for your time, Tom — I know cold calls aren't exactly how you want to spend your morning. I'll reach out to them and make sure it's relevant. Take care.",
        "note": "End on a high note. You got a referral from the COO — that's a warm intro. Use Tom's name when you call the referral. Log everything.",
        "branches": []
      },
      "referral_internal": {
        "label": "NEEDS TO LOOP SOMEONE IN",
        "say": "Makes total sense. Who would that be — your ops manager or someone on the housekeeping side? I'm happy to set something up with both of you on the line so nobody's playing telephone.",
        "note": "He's interested but can't decide alone. Get the name of who else needs to be there. A meeting with both is ideal.",
        "branches": [
          {
            "label": "Gives a name / suggests a joint call",
            "to": "book_meeting"
          },
          {
            "label": "Let me talk to them first",
            "to": "objection_send_email"
          }
        ]
      },
      "sell_test_drive_final": {
        "label": "HE'S THE GUY — LAST PUSH",
        "say": "Well then you're exactly who I should be talking to. I know you just said the timing's not great — and I get it. But what if I block just fifteen minutes? I'll show you what we're doing, you tell me if it's worth exploring. If not I'll leave you alone. Fair deal?",
        "note": "He confirmed he's the decision maker AND the day-to-day person. Give him the fair deal close — binary and low risk. Fifteen minutes is easier to say yes to than thirty.",
        "branches": [
          {
            "label": "Alright fine / okay",
            "to": "book_meeting"
          },
          {
            "label": "Send me an email first",
            "to": "objection_send_email"
          },
          {
            "label": "No",
            "to": "graceful_exit"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next Tuesday and Thursday open — does morning or afternoon work better for you?",
        "note": "Give two day options. Narrow to time. Lock it NOW. Don't say 'I'll send you a link' — pick the time on the phone.",
        "branches": [
          {
            "label": "Picks a day or time",
            "to": "meeting_booked"
          },
          {
            "label": "Let me check my calendar / not sure",
            "to": "meeting_push"
          },
          {
            "label": "End of next week works",
            "to": "meeting_booked"
          }
        ]
      },
      "meeting_push": {
        "label": "MEETING — NUDGE",
        "say": "No rush — how about I throw a calendar invite for Thursday at ten and you can move it if you need to? That way it's on the books and we're not going back and forth over email.",
        "note": "Pick a time FOR him. Easier to accept a specific time than to choose one. Send the invite while still on the phone if possible.",
        "branches": [
          {
            "label": "Yeah that works",
            "to": "meeting_booked"
          },
          {
            "label": "Email me the invite",
            "to": "meeting_booked"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING LOCKED — STOP SELLING",
        "say": "Perfect — I'll send that over right now. Really appreciate you taking my call, Tom. Looking forward to it.",
        "note": "STOP SELLING. Meeting is booked. Don't add features or benefits. Send the invite immediately. Add a personal note referencing the podcast or something from the call.",
        "branches": []
      },
      "graceful_exit_soft": {
        "label": "SOFT EXIT — DOOR OPEN",
        "say": "I respect that. If anything changes — especially heading into peak season with all those turnovers — I'm easy to find. I'll shoot you a quick email with my info just so you have it. Appreciate your time, Tom.",
        "note": "He wasn't rude, just not interested. Leave gracefully. The email keeps the door cracked. Reference peak season as a future trigger event.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes, I'm easy to find. Appreciate your time, Tom — take care.",
        "note": "Don't burn the bridge. Clean exit. Log the call and set a follow-up reminder for 60-90 days. He may come around after peak season chaos.",
        "branches": []
      }
    }
  }
}