{
  "name": "Tony Soto",
  "title": "Operations Manager",
  "company": "Seaside Vacations",
  "location": "Outer Banks, NC",
  "phone": "+1-252-261-7787",
  "company_phone": "+1-800-395-2525",
  "alt_phones": [],
  "flow": {
    "context": "Tony Soto is Operations Manager at Seaside Vacations — about 450 vacation rental homes on the Outer Banks, NC, Corolla to Hatteras. He owns cleaning, maintenance, and quality assurance. He appeared on camera detailing BNC15 sanitization protocols and personally hires pool techs and laundry staff, so he feels labor pain firsthand. Seaside runs on Track PMS and Breezeway (their owners called Breezeway 'as important as our PMS'), and they offer a Clean House Guarantee — $100 payout plus labor every time a guest finds a missed issue. They also went pet-friendly, which their COO Lori Smith publicly said increases damage risk and cleaning burden. Sam's angle: surfer and fisherman calling into the East Coast's best surf and fishing market, and RapidEye plugs directly into the Breezeway workflow Tony already runs every day.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Tony — I've been working with a couple vacation rental ops teams on the Outer Banks, and when I was looking into Seaside your name kept coming up as the one who owns the inspection and QA side. It's Sam Parks with RapidEye. Have you heard my name tossed around?",
        "note": "Relaxed, peer-to-peer energy. Don't rush the question at the end — let it breathe. If rapport opens up, mention you surf and fish. OBX is your kind of place and it humanizes you fast.",
        "branches": [
          {
            "label": "No / hasn't heard of you",
            "to": "says_no"
          },
          {
            "label": "Yes / sounds curious",
            "to": "says_yes"
          },
          {
            "label": "Busy / bad timing / can't talk",
            "to": "bad_timing"
          },
          {
            "label": "Guarded / confused / 'Who is this?'",
            "to": "permission_fallback"
          }
        ]
      },
      "says_no": {
        "label": "HASN'T HEARD OF YOU",
        "say": "Ha — guess I'm not as popular as I thought. Well the reason for my call — I work with a few ops managers running Breezeway across a few hundred homes, and they keep hitting the same wall with their turnover photos. Mind if I take thirty seconds on it?",
        "note": "The joke resets the energy. You're asking micro-permission to share the pain trigger. Any green light — go.",
        "branches": [
          {
            "label": "Sure / go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "Still guarded / hesitant",
            "to": "permission_fallback"
          }
        ]
      },
      "says_yes": {
        "label": "HAS HEARD OF YOU",
        "say": "Oh nice — normally we end up working with someone like you on the operations side. What'd you hear?",
        "note": "Let him talk. Whatever he says, bridge into discovery. If he's vague — 'Yeah I think someone mentioned it' — say 'That's the gist. Mind if I ask a couple quick questions about how you guys handle things on the inspection side?'",
        "branches": [
          {
            "label": "Shares something / engages",
            "to": "warm_discovery"
          },
          {
            "label": "Vague / 'Not sure'",
            "to": "pain_trigger"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — I know with four-fifty homes things don't slow down out there. Would it be a terrible idea if I tried you again Thursday morning?",
        "note": "Suggest a specific day and time. If he counters with a different day, take it immediately. The goal is a locked-in callback, not a maybe.",
        "branches": [
          {
            "label": "Suggests a time / agrees to callback",
            "to": "reschedule"
          },
          {
            "label": "Not interested at all",
            "to": "graceful_exit"
          }
        ]
      },
      "permission_fallback": {
        "label": "PERMISSION ASK",
        "say": "Yeah totally — I mean it is a cold call, I get it. Can I get thirty seconds to tell you why I reached out? You can totally hang up on me if it's not relevant.",
        "note": "Say it with a smile. The self-deprecation disarms. Most people will give you thirty seconds out of sheer curiosity.",
        "branches": [
          {
            "label": "Fine / go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "No / still pushing back",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION DENIED",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it more that you already know what we do and it's just not a fit?",
        "note": "You're splitting the rejection. 'Horrible time' gives you a reschedule. 'Not a fit' gives you intel or a clean exit. Either answer is useful.",
        "branches": [
          {
            "label": "'Bad time'",
            "to": "reschedule"
          },
          {
            "label": "'Not a fit' / hard no",
            "to": "graceful_exit"
          }
        ]
      },
      "pain_trigger": {
        "label": "THE PROBLEM",
        "say": "So I was talking to another ops manager on the Banks — similar setup to you guys, around four hundred homes, running everything through Breezeway. And he was telling me his team's taking a hundred-plus photos per turnover, but nobody actually has the bandwidth to sit there and review every single one before the next guest checks in. So stuff slips through — a stain on the sectional, a cracked screen door, a missing cushion on the deck — and they don't find out until the guest calls it in two hours later. I know you guys run that Clean House Guarantee, so every time something's missed that's a hundred bucks plus sending a crew back out. Across four-fifty homes in peak season... it adds up fast.",
        "note": "STOP TALKING. Pause. Let the silence do the work. You just described his life — if he jumps in agreeing or venting, ride that wave. Do NOT rush to the solution.",
        "branches": [
          {
            "label": "Engages / agrees / shares own pain",
            "to": "pain_resonates"
          },
          {
            "label": "Quiet but listening",
            "to": "solution_and_cta"
          },
          {
            "label": "'Breezeway handles that for us'",
            "to": "objection_have_process"
          },
          {
            "label": "Dismissive / 'Not really an issue'",
            "to": "objection_not_interested"
          }
        ]
      },
      "pain_resonates": {
        "label": "PAIN CONFIRMED",
        "say": "Yeah, that's exactly what I keep hearing. So how does it work for you guys right now — are your property coordinators the ones reviewing photos after every turn, or does that all land on you?",
        "note": "He's engaged — ask questions, don't pitch. You know Seaside uses a Property Coordinator model where staff are assigned to specific homes. Reference it naturally. Let him describe his pain in his own words.",
        "branches": [
          {
            "label": "Talks about Breezeway / photo workflow",
            "to": "discovery_breezeway"
          },
          {
            "label": "Mentions guest complaints or guarantee payouts",
            "to": "discovery_clean_guarantee"
          },
          {
            "label": "Talks about staffing or labor challenges",
            "to": "discovery_labor_pain"
          },
          {
            "label": "Short answer — ready for your point",
            "to": "solution_and_cta"
          }
        ]
      },
      "warm_discovery": {
        "label": "DISCOVERY",
        "say": "Really appreciate you walking me through that. So what does your inspection process look like right now — you guys running everything through Breezeway for the photo documentation side?",
        "note": "You already know they use Breezeway and Track. This is a leading question to get him talking. Listen for pain points — photo review bottleneck, staffing, guarantee payouts, pet damage. Anchor the solution to whatever he gives you.",
        "branches": [
          {
            "label": "Confirms Breezeway / talks about photo process",
            "to": "discovery_breezeway"
          },
          {
            "label": "Mentions quality issues or guest complaints",
            "to": "discovery_clean_guarantee"
          },
          {
            "label": "Talks about staffing challenges",
            "to": "discovery_labor_pain"
          },
          {
            "label": "Brief answer — waiting for your point",
            "to": "solution_and_cta"
          }
        ]
      },
      "discovery_breezeway": {
        "label": "BREEZEWAY DEEP DIVE",
        "say": "Got it — so your team's already collecting all the photos in Breezeway. Out of curiosity, how many of those actually get reviewed by a human before the next guest checks in? Is someone going through every photo on every property, or is it more of a spot-check thing?",
        "note": "This is the money question. You know the answer — nobody reviews all of them at scale. When he confirms the gap, you have the perfect setup for the solution. Be genuinely curious, not accusatory.",
        "branches": [
          {
            "label": "Admits not all get reviewed / spot checks only",
            "to": "solution_and_cta"
          },
          {
            "label": "Claims thorough review process",
            "to": "solution_and_cta"
          }
        ]
      },
      "discovery_clean_guarantee": {
        "label": "CLEAN HOUSE GUARANTEE",
        "say": "So when a guest does call something in and you're paying out on that guarantee — how often is it something that was actually sitting right there in the photos but just got missed in the review? Like is it a 'we didn't catch it' problem or a 'the cleaner didn't do it' problem?",
        "note": "You're anchoring the conversation to a real dollar cost Tony feels every week. Every $100 payout is money RapidEye saves. Let him quantify the pain if he's willing — 'how often' is the key question.",
        "branches": [
          {
            "label": "Shares specifics / admits it happens regularly",
            "to": "solution_and_cta"
          },
          {
            "label": "Downplays it / not sure",
            "to": "solution_and_cta"
          }
        ]
      },
      "discovery_labor_pain": {
        "label": "LABOR AND STAFFING",
        "say": "Yeah, I hear that from every ops team out there right now — finding and keeping good people is brutal. So when you're short-staffed, does the inspection side get compressed first? Like are your crews just snapping photos faster and moving on to the next house?",
        "note": "You know Tony is actively hiring pool techs and laundry staff. Labor shortage means corners get cut on inspections. If he confirms, the solution writes itself: AI reviews the photos your short-staffed team is already taking.",
        "branches": [
          {
            "label": "Confirms quality drops when short-staffed",
            "to": "solution_and_cta"
          },
          {
            "label": "Pivots to a different pain point",
            "to": "solution_and_cta"
          }
        ]
      },
      "solution_and_cta": {
        "label": "SOLUTION AND ASK",
        "say": "That makes a lot of sense. So here's why I called — we built something that plugs right into Breezeway and automatically reviews every photo your team's already taking. It flags damage, missing items, staging issues — before the next guest checks in. No workflow change for your crews at all. Would you be open to taking a look sometime this week when I'm not cold calling you out of the blue?",
        "note": "One breath. Solution is one sentence. CTA is low-friction — 'take a look' not 'buy.' Pause after the question and let him respond.",
        "branches": [
          {
            "label": "'Yeah sure' / interested",
            "to": "book_meeting"
          },
          {
            "label": "'We don't have budget for that'",
            "to": "objection_no_budget"
          },
          {
            "label": "'Not really interested'",
            "to": "objection_not_interested"
          },
          {
            "label": "'Can you send me an email?'",
            "to": "send_email"
          },
          {
            "label": "'I'm not the one who'd decide on that'",
            "to": "not_right_person"
          }
        ]
      },
      "objection_not_interested": {
        "label": "NOT INTERESTED",
        "say": "Totally get it — I should've assumed you'd be all set. Otherwise you probably would've reached out to us. Just so nobody from my team bugs you again — is it that this isn't really a problem you're focused on right now, or is it more that you just hate getting cold calls? Either one's fair.",
        "note": "Agree FIRST. Don't argue. The split keeps the conversation alive. 'Not focused on' means timing — you can future-proof it. 'Hate cold calls' means the medium, not the message.",
        "branches": [
          {
            "label": "'Not a priority right now'",
            "to": "sell_test_drive"
          },
          {
            "label": "'Hate cold calls' / both",
            "to": "sell_test_drive"
          },
          {
            "label": "Hard no / wants off the phone",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_no_budget": {
        "label": "NO BUDGET",
        "say": "Totally get it. Nowadays it's hard enough to keep the tools you've got, let alone bring in something new. Is it that budget for this cycle is completely locked, or is it more that anything new has to go through Gordon and the approval process is a pain?",
        "note": "Agree and normalize. Dropping Gordon Jones's name (President) shows you understand the org. The split separates 'no money' from 'approval friction' — different problems, different handles.",
        "branches": [
          {
            "label": "Budget is locked / approvals are painful",
            "to": "sell_test_drive"
          },
          {
            "label": "'Just not spending right now'",
            "to": "send_email"
          }
        ]
      },
      "objection_have_process": {
        "label": "ALREADY HAVE A PROCESS",
        "say": "That makes total sense — with four-fifty homes you'd have to have something dialed in. And honestly we're not trying to replace Breezeway at all — you guys love it and I get why. We actually plug into it. The thing we keep seeing is Breezeway's phenomenal at collecting the photos, but someone still has to review them all. That's the piece we automate. Would it be worth seeing what that looks like inside your actual Breezeway workflow?",
        "note": "Critical reframe: RapidEye doesn't replace Breezeway, it enhances it. Seaside's owners have called Breezeway 'as important as their PMS' — don't position against it. Position as the missing layer on top.",
        "branches": [
          {
            "label": "Curious / open to seeing it",
            "to": "book_meeting"
          },
          {
            "label": "Still skeptical",
            "to": "sell_test_drive"
          },
          {
            "label": "Hard no",
            "to": "graceful_exit"
          }
        ]
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Look — you're probably not buying anything off a cold call, and I totally respect that. But when budget does free up or you're evaluating tools heading into next season, the people who have an easy time are the ones who already know what's on their list. Would you be open to fifteen minutes sometime this week — not to buy anything, just so you know what's out there? Worst case you steal some ideas from what other OBX managers are doing with their turnover photos and we part as friends.",
        "note": "This is the 'future-proof' pitch. You're not asking him to buy. You're asking him to be informed. 'Steal some ideas' lowers the stakes to zero. If he still says no, exit gracefully — don't push a third time.",
        "branches": [
          {
            "label": "Agrees to a meeting",
            "to": "book_meeting"
          },
          {
            "label": "'Just send me something'",
            "to": "send_email"
          },
          {
            "label": "Still no",
            "to": "graceful_exit"
          }
        ]
      },
      "not_right_person": {
        "label": "NOT THE DECISION MAKER",
        "say": "Totally makes sense — I know as the ops guy your plate's already full. Who on your side would typically own a decision around new tooling like this? Would that be Lori, or someone else?",
        "note": "Drop Lori Smith's name (COO) casually to show homework. If he says Gordon Jones (President), that works too. The goal is a name and ideally a warm intro. Don't force it — just get the name.",
        "branches": [
          {
            "label": "Gives a name / confirms Lori or Gordon",
            "to": "referral"
          },
          {
            "label": "'Not sure' / won't share",
            "to": "graceful_exit"
          }
        ]
      },
      "referral": {
        "label": "GET THE REFERRAL",
        "say": "That's super helpful. Would you mind if I mentioned you pointed me their way? Or even better — would you be open to shooting them a quick note so my call doesn't come totally out of left field?",
        "note": "A warm intro from Tony is gold. Even just permission to use his name warms the next call significantly. If he offers to intro, let him drive it. If he just gives you the name, that's still a win.",
        "branches": [
          {
            "label": "Agrees to intro or lets you use his name",
            "to": "referral_success"
          },
          {
            "label": "Won't intro / just gives the name",
            "to": "referral_success"
          },
          {
            "label": "Won't share / shuts it down",
            "to": "graceful_exit"
          }
        ]
      },
      "referral_success": {
        "label": "REFERRAL LOCKED",
        "say": "Really appreciate that, Tony. I'll put something specific together for them so it's actually worth their time. And honestly — if you ever want to see what it looks like from the ops side, I'm easy to find. Thanks for taking my call.",
        "note": "Terminal. Send a tailored email to the referral within the hour. Mention Tony by name. Also send Tony a brief thank-you note — he might become a champion later.",
        "branches": []
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next week pulled up — how does Tuesday or Wednesday afternoon look for you? Should only take about fifteen minutes.",
        "note": "Give two specific options. Lock in the day and time NOW. Send the calendar invite while you're still on the phone if possible. Once it's booked, STOP SELLING.",
        "branches": [
          {
            "label": "Picks a time",
            "to": "meeting_booked"
          },
          {
            "label": "Wants to check calendar / pushes out",
            "to": "meeting_booked"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING CONFIRMED",
        "say": "Perfect — I'll shoot you a calendar invite right now so it's locked in. Really appreciate you taking my cold call, Tony. Talk to you then.",
        "note": "Terminal. Send the invite immediately. Keep it short — don't re-pitch or add caveats. You won. Stop talking.",
        "branches": []
      },
      "send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair. One quick question before I do — what would be most useful to include so it's not just another generic vendor email? Like would you rather see how it works inside Breezeway specifically, or more of the ROI side with the inspection costs?",
        "note": "Terminal. Accept the email request gracefully but ask ONE question to tailor it. Whatever he says, send the email within the hour. Include a specific meeting time suggestion in the email — 'I've got Tuesday at 2 if you want to see it live.' Also include the Clean House Guarantee angle.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand, Tony. If anything changes on your end I'm easy to find. Appreciate your time.",
        "note": "Terminal. Don't burn the bridge. No guilt trips, no last-ditch pitches. Log the outcome and the reason. He may come back around — especially heading into peak season when the pain gets real.",
        "branches": []
      },
      "reschedule": {
        "label": "RESCHEDULE",
        "say": "Perfect — I'll give you a ring then. Appreciate it, Tony.",
        "note": "Terminal. Set a hard reminder for the exact day and time. When you call back, open with 'Hey Tony, it's Sam Parks — we talked briefly last [day] and you said to try you back.' That callback is warm, not cold.",
        "branches": []
      }
    }
  }
}