{
  "name": "Whitney Hawkins",
  "title": "General Manager",
  "company": "Brindley Beach Vacations & Sales",
  "location": "Outer Banks, NC",
  "phone": "+1-252-202-4949",
  "company_phone": "+1-877-642-3224",
  "alt_phones": [],
  "flow": {
    "context": "Whitney Hawkins is the General Manager at Brindley Beach Vacations & Sales, a 500+ home vacation rental operation across the Outer Banks, NC — she's based in the Corolla office and likely owns cross-functional ops: guest readiness, cleaner standards, vendor performance. She grew up in a real estate family and ran her own boutique RE company for 20 years, so she's operationally sharp and comfortable evaluating new tools. Doug Brindley (Owner/President, former CPA, in seat since 1984) is the final decision-maker above her. They appear to use Streamline/Happy Stays for guest and owner portals. Sam's surfing and fishing background connects naturally to OBX — use it to warm the call.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Whitney — I work with a few vacation rental companies on the East Coast, and honestly as a surfer I've always had a soft spot for the Outer Banks. It's Sam Parks with RapidEye — have you heard my name tossed around?",
        "note": "Feet-up-on-the-desk energy. Don't rush. The surfing mention is real — Sam founded a surf club and has traveled internationally to surf. Let the OBX connection land naturally before moving on.",
        "branches": [
          {
            "label": "Yes / I think so",
            "to": "heard_yes"
          },
          {
            "label": "No, I haven't",
            "to": "heard_no"
          },
          {
            "label": "Now's not a good time",
            "to": "bad_timing"
          },
          {
            "label": "Who? / What is this about?",
            "to": "suspicious"
          }
        ]
      },
      "heard_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh no kidding — well normally we'd be working with someone exactly in your shoes. What did you hear?",
        "note": "Rare but great. Let her talk. Whatever she says, bridge to discovery. Don't correct or over-explain anything she gets wrong.",
        "branches": [
          {
            "label": "Mentions AI / photos / inspections",
            "to": "warm_discovery"
          },
          {
            "label": "Vague / not sure where they heard it",
            "to": "pain_trigger"
          }
        ]
      },
      "heard_no": {
        "label": "HAVEN'T HEARD — TRANSITION",
        "say": "Ha — I guess I'm not as popular as I thought. Well the reason I'm calling is actually pretty specific to you guys…",
        "note": "Most common response. Keep it light, self-deprecating, then flow right into the pain trigger with no pause.",
        "branches": [
          {
            "label": "Continue to pain trigger",
            "to": "pain_trigger"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — would it be a terrible idea if I tried you again tomorrow, or would later this week work better?",
        "note": "Don't push. Respect it. If she gives a time, lock it in immediately. If she says send an email, go to that path.",
        "branches": [
          {
            "label": "Gives a specific day/time",
            "to": "reschedule"
          },
          {
            "label": "Just send me an email",
            "to": "objection_send_email"
          },
          {
            "label": "Don't call back / not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "reschedule": {
        "label": "RESCHEDULE LOCKED",
        "say": "Perfect — I'll try you then. Really appreciate it, Whitney. Talk soon.",
        "note": "Write down the exact time she gave. Set a reminder. Call back exactly when you said you would — reliability builds trust before you've even pitched.",
        "branches": []
      },
      "suspicious": {
        "label": "WHO IS THIS / WHAT'S THIS ABOUT",
        "say": "Yeah totally fair — it is a cold call, I'll be honest. Can I get 30 seconds to tell you why I reached out? And you can totally hang up on me if it's not a fit.",
        "note": "She's guarded, not hostile. Radical honesty disarms. If she gives you the 30 seconds, go straight to pain — don't waste any of it on pleasantries.",
        "branches": [
          {
            "label": "OK, go ahead / 30 seconds",
            "to": "pain_trigger"
          },
          {
            "label": "No thanks / not interested",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION DENIED",
        "say": "Shoot — totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you already know what we do and it's just not interesting?",
        "note": "You're splitting the rejection to diagnose what's real. Most people soften here because you offered to stop calling. Listen to which bucket she puts herself in.",
        "branches": [
          {
            "label": "Just bad timing",
            "to": "bad_timing"
          },
          {
            "label": "Not interested / don't care",
            "to": "last_resort_value"
          },
          {
            "label": "What do you actually do? (curiosity)",
            "to": "pain_trigger"
          }
        ]
      },
      "last_resort_value": {
        "label": "LAST SHOT — OFFER VALUE",
        "say": "Totally respect that. If nothing else — we've been working with a few PM companies your size on the East Coast and I put together some data on what's actually working for turnover quality heading into peak season. Happy to shoot that over, no strings attached. Would that be useful or should I just leave you alone?",
        "note": "This is your last swing. If she says no, exit gracefully. If she bites, you have an email follow-up path that can convert later.",
        "branches": [
          {
            "label": "Sure, send it over",
            "to": "email_tailoring"
          },
          {
            "label": "No thanks",
            "to": "end_graceful"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER — THE PROBLEM",
        "say": "So I was talking to another GM running about five hundred vacation homes — pretty similar setup to Brindley Beach — and she was telling me about this cycle that drives her crazy. Her housekeeping teams are snapping photos every single turnover, hundreds a day during peak season. But nobody on the ops side actually has time to look through all of them. So stuff slips — a stain on a sofa, a cracked deck railing, a missing set of towels — and the first person who catches it is the guest checking in that afternoon. Then her phone's ringing, owner's upset, and she's scrambling to fix something that was literally sitting in a photo someone took six hours earlier. Does any of that sound familiar, or is your world totally different?",
        "note": "PAUSE after 'sound familiar.' This is the most important silence in the call. Do NOT fill the gap. The specifics — 500 homes, photos during turnover, guest catching it first — are designed to mirror her exact world at Brindley Beach. Let her react.",
        "branches": [
          {
            "label": "Yes / that resonates / we deal with that",
            "to": "pain_resonates"
          },
          {
            "label": "We have a process for that already",
            "to": "objection_have_process"
          },
          {
            "label": "Sort of / lukewarm / listening",
            "to": "solution_and_cta"
          },
          {
            "label": "Not really our problem / not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "pain_resonates": {
        "label": "PAIN LANDS — DIG DEEPER",
        "say": "Yeah — that's exactly what I keep hearing. Out of curiosity, with five hundred–plus homes across multiple offices, how are your housekeeping teams documenting turnovers right now? Is it through an app, through Streamline, or more of a manual photo process?",
        "note": "She's engaged — shift to questions. You're trying to understand their current workflow before you pitch. Mentioning Streamline signals you did your homework. If she names any tool, note it and reference it later.",
        "branches": [
          {
            "label": "Describes their process / mentions tools",
            "to": "solution_and_cta"
          },
          {
            "label": "It's pretty manual / no real system",
            "to": "solution_and_cta"
          },
          {
            "label": "Why do you ask? / gets guarded",
            "to": "solution_and_cta"
          }
        ]
      },
      "solution_and_cta": {
        "label": "ONE-SENTENCE SOLUTION + CTA",
        "say": "Got it — so here's why I called you specifically. We built something that plugs into the photos your teams are already taking during turnovers and automatically flags damage, missing items, staging issues — before anyone checks in. No workflow change on your team's end. Would you be open to taking a look sometime when I'm not cold calling you out of the blue?",
        "note": "One sentence on what it does. One sentence on the ask. Then STOP. If she mentioned Streamline or Breezeway, say 'plugs right into [that tool].' Don't list features, don't oversell.",
        "branches": [
          {
            "label": "Yeah I'd take a look / that's interesting",
            "to": "warm_discovery"
          },
          {
            "label": "We don't have budget for that right now",
            "to": "objection_no_budget"
          },
          {
            "label": "Send me something / email me",
            "to": "objection_send_email"
          },
          {
            "label": "I'd need to talk to Doug about something like that",
            "to": "objection_need_approval"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "warm_discovery": {
        "label": "SHE'S WARM — ASK QUESTIONS",
        "say": "Awesome — before I show you anything, I wanna make sure I'm not wasting your time. What does your inspection process actually look like right now? Like after a cleaner finishes a home — what happens before the next guest checks in?",
        "note": "STOP PITCHING. She's warm. Your only job is to understand her world. Listen for: who reviews photos, how many turnovers per day, what falls through, what tools they use, pain with owners or guests. Take notes — you'll use this to tailor the demo.",
        "branches": [
          {
            "label": "Describes process in detail",
            "to": "discovery_deeper"
          },
          {
            "label": "Keeps it brief / high-level",
            "to": "discovery_deeper"
          },
          {
            "label": "Can we just schedule something?",
            "to": "book_meeting"
          }
        ]
      },
      "discovery_deeper": {
        "label": "DIG INTO PAIN POINTS",
        "say": "That's really helpful. And when something does get missed — like damage that wasn't caught before check-in — what does that typically look like for you? Is it mostly guest complaints, or more the owner side that creates headaches?",
        "note": "You're mapping her pain to either guest experience or owner retention — both are RapidEye value props. Also listen for: security deposit disputes, insurance, seasonal staffing issues, cleaner accountability. Whatever she emphasizes, mirror it back when you bridge to the meeting.",
        "branches": [
          {
            "label": "Guest complaints / bad reviews",
            "to": "discovery_connect_to_meeting"
          },
          {
            "label": "Owner frustration / trust issues",
            "to": "discovery_connect_to_meeting"
          },
          {
            "label": "Both / it's a mess during peak season",
            "to": "discovery_connect_to_meeting"
          },
          {
            "label": "We handle it fine / downplays",
            "to": "discovery_connect_to_meeting"
          }
        ]
      },
      "discovery_connect_to_meeting": {
        "label": "BRIDGE TO MEETING",
        "say": "Yeah that makes a lot of sense. Here's what I think would actually be worth your time — I can show you exactly what we're doing with a couple other companies your size, how the AI catches stuff in the photos, and you can tell me if it would actually fit into how your team works. It's like fifteen, twenty minutes. Would you be open to that?",
        "note": "You've earned the right to ask. Be specific on time commitment — 15-20 min feels low-stakes. If she hedges, offer to include whoever else needs to see it. If she mentions Doug needing to be involved, go to the approval path.",
        "branches": [
          {
            "label": "Yeah let's do it",
            "to": "book_meeting"
          },
          {
            "label": "I'd need to loop in Doug / someone else",
            "to": "objection_need_approval"
          },
          {
            "label": "Send me something first",
            "to": "objection_send_email"
          },
          {
            "label": "Let me think about it",
            "to": "sell_test_drive"
          }
        ]
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Perfect — I've got next week pulled up. Would Tuesday or Thursday work better for you? I'm flexible on time.",
        "note": "Give two options, not open-ended. Once she picks a day, suggest a specific time. Send the calendar invite WHILE still on the phone if possible.",
        "branches": [
          {
            "label": "Picks a day/time",
            "to": "meeting_booked"
          },
          {
            "label": "Let me check my calendar and get back to you",
            "to": "meeting_pin_down"
          }
        ]
      },
      "meeting_pin_down": {
        "label": "PIN DOWN THE TIME",
        "say": "Totally — I'll shoot you a quick invite so it's on your radar. Would mornings or afternoons generally work better? I'll send it to whitney at brindleybeach dot com — that the best one?",
        "note": "Don't leave without sending something. Confirm the email. If she won't commit, send the invite for a reasonable slot and say 'just let me know if that doesn't work.'",
        "branches": [
          {
            "label": "Confirms a time or email",
            "to": "meeting_booked"
          },
          {
            "label": "Just email me and we'll figure it out",
            "to": "email_tailoring"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING CONFIRMED",
        "say": "Awesome — just sent that over. Really appreciate you taking my call, Whitney. Looking forward to showing you what we've got. Talk soon.",
        "note": "STOP SELLING. The meeting is booked. Be warm, be brief, get off the phone. Do not add 'one more thing.' Send the invite immediately after hanging up if you haven't already.",
        "branches": []
      },
      "objection_no_budget": {
        "label": "NO BUDGET OBJECTION",
        "say": "Totally get it. Nowadays it's harder to keep a tool on the books, let alone buy something new — especially heading into peak season when every dollar's going to ops.",
        "note": "Agree first. Don't argue. You're disarming the reflex. Pause briefly, then move to the split.",
        "branches": [
          {
            "label": "Continue to split",
            "to": "budget_split"
          }
        ]
      },
      "budget_split": {
        "label": "SPLIT THE BUDGET OBJECTION",
        "say": "Just so nobody from my team cold calls you again — is it that budget for this year is completely locked up, or is it more that anything you try to buy has to go through Doug and a whole approval process?",
        "note": "You're splitting to diagnose. If it's an approval chain through Doug, pivot to the approval path. If budget is truly locked, sell the test drive for future planning. Mentioning Doug by name shows you did your homework.",
        "branches": [
          {
            "label": "Budget is locked / can't spend right now",
            "to": "sell_test_drive"
          },
          {
            "label": "Everything goes through Doug / the owner",
            "to": "objection_need_approval"
          },
          {
            "label": "How much does it cost? (curiosity)",
            "to": "warm_discovery"
          }
        ]
      },
      "objection_not_interested": {
        "label": "NOT INTERESTED OBJECTION",
        "say": "Totally get it. I should've assumed you'd be all set — otherwise you probably would've reached out to us.",
        "note": "Agree and lower the temperature. This is almost always a reaction to the cold call, not a real rejection of the product. Pause briefly, then split.",
        "branches": [
          {
            "label": "Continue to split",
            "to": "interest_split"
          }
        ]
      },
      "interest_split": {
        "label": "SPLIT THE INTEREST OBJECTION",
        "say": "Just so I'm not bugging you again — is it that turnover quality just isn't a pain point for you right now, or is it more that you just hate getting cold calls? Totally fair either way.",
        "note": "If 'not a pain point,' she might be the wrong person or they genuinely have it nailed — explore or pivot to referral. If 'hate cold calls,' she may be open if approached differently — offer value or email path.",
        "branches": [
          {
            "label": "Not a priority / we're good on that",
            "to": "sell_test_drive"
          },
          {
            "label": "I just hate cold calls / bad timing",
            "to": "sell_test_drive"
          },
          {
            "label": "I'm not the right person for this",
            "to": "referral_ask"
          },
          {
            "label": "Hard no / please stop",
            "to": "end_graceful"
          }
        ]
      },
      "objection_have_process": {
        "label": "ALREADY HAVE A PROCESS",
        "say": "That makes total sense — with five hundred–plus homes you'd have to have something dialed in, otherwise it'd be chaos.",
        "note": "Validate first. She might mean a manual checklist, Breezeway, Properly, or a homegrown system. The split will reveal which. Don't assume.",
        "branches": [
          {
            "label": "Continue to split",
            "to": "process_split"
          }
        ]
      },
      "process_split": {
        "label": "SPLIT THE PROCESS OBJECTION",
        "say": "Is it that you're fully covered and happy with how it's working, or is it more that switching anything right now — especially heading into summer — would just be a headache?",
        "note": "If happy, sell the test drive as a benchmark comparison. If switching is the barrier, emphasize that RapidEye layers on top of existing tools — no rip and replace, no workflow change for cleaners.",
        "branches": [
          {
            "label": "We're happy with what we have",
            "to": "sell_test_drive"
          },
          {
            "label": "Switching would be a pain / too busy right now",
            "to": "no_workflow_change"
          },
          {
            "label": "It works but it's not perfect",
            "to": "warm_discovery"
          }
        ]
      },
      "no_workflow_change": {
        "label": "NO WORKFLOW CHANGE ANGLE",
        "say": "Yeah — that's actually the whole point of how we built this. It plugs into whatever your team's already doing. Same photos, same process, nothing changes for your cleaners. The AI just runs in the background and flags stuff they missed. Would it be worth fifteen minutes to see how it works, even if the timing's not perfect right now?",
        "note": "This is your best rebuttal for 'switching is hard.' RapidEye doesn't replace their stack — it layers on top. If she mentioned Streamline earlier, say 'it plugs right into Streamline.' If unknown, keep it generic.",
        "branches": [
          {
            "label": "OK, I'd look at that",
            "to": "book_meeting"
          },
          {
            "label": "Still not the right time",
            "to": "sell_test_drive"
          },
          {
            "label": "Send me some info",
            "to": "objection_send_email"
          }
        ]
      },
      "objection_send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair — I'll send something over. One quick question so it's not just another generic pitch sitting in your inbox: what would be most useful to see? Is it more about the cost side, or more about how it actually works with your current setup?",
        "note": "Accept the request, then ask ONE tailoring question. This keeps the conversation alive for another 30 seconds, which sometimes re-engages her into a real discussion.",
        "branches": [
          {
            "label": "Tells you what to include / cost vs. workflow",
            "to": "email_tailoring"
          },
          {
            "label": "Just send whatever you've got",
            "to": "email_tailoring"
          },
          {
            "label": "Actually starts asking questions (re-engages)",
            "to": "warm_discovery"
          }
        ]
      },
      "email_tailoring": {
        "label": "CONFIRM EMAIL + SUGGEST TIME",
        "say": "Perfect — I'll put something together and shoot it to whitney at brindleybeach dot com. I'll throw a couple times in there in case you wanna hop on a quick call after you've looked it over. Really appreciate your time, Whitney.",
        "note": "In the email: include a one-pager tailored to what she asked for, a specific time suggestion (e.g., 'Would Thursday at 2pm work for a quick 15-min call?'), and a short note referencing the OBX/surfing connection to remind her who you are. Follow up in 2 days if no response.",
        "branches": []
      },
      "objection_need_approval": {
        "label": "NEEDS DOUG'S APPROVAL",
        "say": "Completely makes sense — Doug would need to sign off on something like this. Would it make more sense for me to show you first so you can see if it's even worth bringing to him, or would you rather I just loop him in from the start?",
        "note": "Whitney likely needs Doug Brindley's approval. Either path is a win. If she wants to see it first, you're building an internal champion. If she wants Doug included, you get the decision-maker on the call. Doug is a former CPA — he'll respond to quantified ROI (cost of missed damage, reduced re-inspection labor).",
        "branches": [
          {
            "label": "Show me first, then I'll bring it to Doug",
            "to": "book_meeting"
          },
          {
            "label": "Include Doug from the start",
            "to": "book_with_doug"
          },
          {
            "label": "Let me talk to him and get back to you",
            "to": "anchor_followup"
          }
        ]
      },
      "book_with_doug": {
        "label": "BOOK WITH DOUG INCLUDED",
        "say": "Perfect — is there a day next week that works for both of you? I know you're both up in the Corolla office, so even if it's just fifteen minutes between meetings, I can make it work whenever's easiest.",
        "note": "You know Doug and Whitney are both in the Corolla office — showing that makes you sound informed, not stalky. If she can't coordinate schedules, offer to send an invite to both and let them pick.",
        "branches": [
          {
            "label": "Gives a day/time",
            "to": "meeting_booked"
          },
          {
            "label": "Let me check with him first",
            "to": "anchor_followup"
          }
        ]
      },
      "anchor_followup": {
        "label": "ANCHOR THE FOLLOW-UP",
        "say": "Totally — how about I follow up with you Thursday? That way you've got a couple days to chat with him and I'm not just leaving this hanging. Does that work?",
        "note": "Do NOT let this go to 'I'll get back to you' limbo. Pin a specific follow-up day. Send a brief email recap today so she has something to forward to Doug if she wants.",
        "branches": [
          {
            "label": "Yeah, Thursday works",
            "to": "followup_confirmed"
          },
          {
            "label": "Just email me",
            "to": "email_tailoring"
          }
        ]
      },
      "followup_confirmed": {
        "label": "FOLLOW-UP SET",
        "say": "Great — I'll touch base Thursday. Thanks for hearing me out, Whitney. Talk soon.",
        "note": "Set the reminder immediately. Follow up exactly when you said. Send a brief email recap right after this call so she has your info and can forward to Doug. Include one compelling stat or screenshot — make it easy for her to champion internally.",
        "branches": []
      },
      "sell_test_drive": {
        "label": "SELL THE TEST DRIVE",
        "say": "Look — you're probably not buying anything off a cold call, and I totally respect that. But the people who end up getting the most out of this are the ones who already know what's out there when the timing is right. If nothing else, I could walk you through what a couple other PM companies in the Outer Banks market are doing with their turnover photos right now. Worst case you steal some ideas and we part as friends. Would that be worth fifteen minutes?",
        "note": "This is your 'nothing to lose' pitch. You're not asking her to buy — you're offering market intelligence specific to OBX. The peer comparison angle is strong for a GM who's been in property management for 20+ years. If she still says no, pivot to referral.",
        "branches": [
          {
            "label": "OK sure / that could be useful",
            "to": "book_meeting"
          },
          {
            "label": "Not right now / still no",
            "to": "referral_ask"
          },
          {
            "label": "Hard no",
            "to": "end_graceful"
          }
        ]
      },
      "referral_ask": {
        "label": "ASK FOR REFERRAL",
        "say": "Totally fair. One last question — if this was gonna land somewhere at Brindley Beach, who on your team would typically own the inspection or turnover quality side of things? I know you guys have housekeeping and maintenance split across offices — would it be more of a maintenance manager thing, or is there someone else who lives in that world day to day?",
        "note": "You're aiming for Ben Albert (Maintenance Manager, Corolla, since 2010) or Taniyia Skinner / Jennifer Scarborough (Housekeeping Managers North/South). If she names someone, ask permission to use her name. If she says 'that's actually me,' circle back to the test drive.",
        "branches": [
          {
            "label": "Gives a name / points to someone",
            "to": "referral_get_name"
          },
          {
            "label": "That's me actually / I handle it",
            "to": "sell_test_drive"
          },
          {
            "label": "Not sure / doesn't want to say",
            "to": "end_graceful"
          }
        ]
      },
      "referral_get_name": {
        "label": "LOCK THE REFERRAL",
        "say": "That's super helpful. Would you mind if I reached out to them and mentioned we chatted? I'll put something specific together so it actually makes sense for their world — not just a generic cold pitch.",
        "note": "If she gives Ben Albert or a housekeeping manager, you already have their direct numbers and emails from the research. Getting Whitney's permission to name-drop turns a cold call into a warm intro. Even 'just reach out, don't use my name' is a win — you have the right target.",
        "branches": [
          {
            "label": "Sure, go ahead / use my name",
            "to": "end_with_referral"
          },
          {
            "label": "You can reach out but don't use my name",
            "to": "end_with_referral"
          },
          {
            "label": "No, don't contact them",
            "to": "end_graceful"
          }
        ]
      },
      "end_with_referral": {
        "label": "EXIT WITH REFERRAL",
        "say": "Really appreciate that, Whitney. I'll reach out to them and keep it relevant. And if anything ever comes up on your end, I'm easy to find — Sam Parks, RapidEye. Thanks for your time.",
        "note": "Great outcome. Call the referred person within 24 hours while the conversation is fresh. If she gave permission, open the next call with 'Whitney Hawkins suggested I give you a call.' If not, still reference Brindley Beach generally. Log the referral in CRM.",
        "branches": []
      },
      "end_graceful": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes on your end, I'm easy to find — Sam Parks with RapidEye. Appreciate your time, Whitney.",
        "note": "Don't burn the bridge. Send a brief, non-pushy follow-up email within the hour referencing the call. You can still reach out to Ben Albert or Doug Brindley separately — this door isn't closed forever.",
        "branches": []
      }
    }
  }
}