{
  "name": "Zane Strickland",
  "title": "Director of Operations (West Aspen)",
  "company": "Frias Properties of Aspen Snowmass",
  "location": "Aspen, CO",
  "phone": "+1-970-429-2347",
  "company_phone": "+1-970-920-2000",
  "alt_phones": [],
  "flow": {
    "context": "Zane Strickland is Director of Operations for West Aspen at Frias Properties — promoted from Property Manager in 2024, at the company since 2020. He owns turnover quality, guest readiness, and damage tracking across a big chunk of their 130+ luxury vacation rentals in Aspen and Snowmass. Frias runs on Streamline for PMS and work orders, expanded into Snowmass in 2023, and markets hospitality-level full-service care with dedicated housekeeping leadership (Manuel Nava, Isidra Santos). Ben Wolff (Managing Partner & GM) sits above him; Chris Longden (Director of Ops, East Aspen) is his peer. Strongest hook: Sam was just skiing in Jackson Hole last week — Zane lives and works in Aspen ski country and we're calling mid-peak season.",
    "start": "opener",
    "nodes": {
      "opener": {
        "label": "OPENER",
        "say": "Hey Zane — I was just out in Jackson Hole last week, ended up talking to a few property managers out there about their turnover workflows. It's Sam Parks with RapidEye. Have you heard my name tossed around?",
        "note": "Feet-up-on-the-desk energy. You're a fellow ski guy calling mid-season — let the Jackson Hole line land before you give your name. Don't rush.",
        "branches": [
          {
            "label": "Yes / I think so / Maybe",
            "to": "heard_yes"
          },
          {
            "label": "No / Who? / Doesn't ring a bell",
            "to": "heard_no"
          },
          {
            "label": "Now's not a good time / I'm busy",
            "to": "bad_timing"
          },
          {
            "label": "What is this about? / Who are you with?",
            "to": "who_is_this"
          }
        ]
      },
      "heard_yes": {
        "label": "THEY'VE HEARD OF YOU",
        "say": "Oh nice — well normally we'd be working with someone like you. What did you hear?",
        "note": "Let them talk. Whatever they say, use it as a bridge into discovery. Don't correct or re-pitch — follow their thread.",
        "branches": [
          {
            "label": "They describe something positive or neutral",
            "to": "discovery_current_process"
          },
          {
            "label": "They're vague / 'not much'",
            "to": "pain_trigger"
          },
          {
            "label": "They heard something skeptical",
            "to": "acknowledge_and_pivot"
          }
        ]
      },
      "heard_no": {
        "label": "HAVEN'T HEARD OF YOU",
        "say": "Oh, I guess I'm not as popular as I thought. Well — the reason for my call...",
        "note": "Smile when you say this. Self-deprecating, then immediately pivot to the pain trigger. No pause between this line and the next node.",
        "branches": [
          {
            "label": "Continue →",
            "to": "pain_trigger"
          }
        ]
      },
      "bad_timing": {
        "label": "BAD TIMING",
        "say": "Totally hear you — I know peak season in Aspen is insane right now. Would it be a terrible idea if I tried you again later this week? Maybe Thursday or Friday when things calm down a bit?",
        "note": "Acknowledge the season — he's flipping luxury units back to back right now. Be specific with callback days. If he gives you a time, lock it in and get off the phone.",
        "branches": [
          {
            "label": "Sure, try me Thursday / Friday / gives a time",
            "to": "reschedule"
          },
          {
            "label": "Just tell me real quick what it's about",
            "to": "pain_trigger"
          },
          {
            "label": "No / Don't call back",
            "to": "graceful_exit"
          }
        ]
      },
      "reschedule": {
        "label": "CALLBACK LOCKED",
        "say": "Perfect — I'll try you Thursday. Appreciate it, Zane. Talk soon.",
        "note": "Write down the exact day and time immediately. Don't pitch anything else. Get off the phone.",
        "branches": []
      },
      "who_is_this": {
        "label": "WHO IS THIS / WHAT'S THIS ABOUT",
        "say": "Yeah totally — I mean it is a cold call, I'll be honest. Can I get 30 seconds to tell you why I reached out, and you can totally hang up on me if it's not a fit?",
        "note": "Honesty disarms. The '30 seconds + permission to hang up' line lowers their guard. If he says yes, go straight to pain trigger.",
        "branches": [
          {
            "label": "Sure / Go ahead / 30 seconds",
            "to": "pain_trigger"
          },
          {
            "label": "No / Not interested / I'm good",
            "to": "permission_rejected"
          }
        ]
      },
      "permission_rejected": {
        "label": "PERMISSION REJECTED",
        "say": "Shoot, totally my bad. Just so nobody from my team bugs you again — is it that I caught you at a horrible time, or is it that you're already all set with how you're handling your turnover inspections?",
        "note": "This isn't pushback — it's a genuine question. The split gives him two easy outs, and either one gives you information to work with.",
        "branches": [
          {
            "label": "Bad timing / Caught me at a bad time",
            "to": "bad_timing"
          },
          {
            "label": "We're all set / Already have a process",
            "to": "objection_have_process"
          },
          {
            "label": "Just not interested / Take me off the list",
            "to": "graceful_exit"
          }
        ]
      },
      "pain_trigger": {
        "label": "PAIN TRIGGER",
        "say": "So I work with a few other operations directors at vacation rental companies in ski markets, and the thing I keep hearing — especially right now during peak season — is this: cleaners are flipping units back to back, snapping photos between every turn, but nobody actually has time to look through all of them. So what ends up happening is a guest checks into a place that's going for two or three grand a night, and there's a stain on the sofa or a crack in the countertop from the last guest — but nobody caught it in the photos. Now you're trying to figure out which guest caused it, the owner's calling you, and you're eating the cost. Does any of that sound familiar?",
        "note": "PAUSE after 'does any of that sound familiar.' This is the most important silence in the call. Let Zane react. His response tells you exactly where to go next. Do not fill the silence.",
        "branches": [
          {
            "label": "Yeah / That's exactly what happens / We deal with that",
            "to": "warm_reaction"
          },
          {
            "label": "Sort of / We have a process but it's not perfect",
            "to": "neutral_reaction"
          },
          {
            "label": "Not really / We've got that handled",
            "to": "objection_have_process"
          },
          {
            "label": "I don't have time for this / What are you selling?",
            "to": "objection_not_interested"
          }
        ]
      },
      "warm_reaction": {
        "label": "THEY FEEL THE PAIN",
        "say": "Yeah — I figured with 130-plus units in a market like Aspen, that's gotta be a constant thing. So real quick — we built a tool that plugs into the photos your cleaners are already taking and uses AI to flag damage, missing items, staging issues automatically — before the next guest checks in. Instead of someone manually reviewing every set, the system catches it. Would you be open to taking a look sometime when I'm not cold calling you out of the blue?",
        "note": "One sentence on the solution, then straight to the CTA. Don't over-explain how the AI works. If he says yes, book it NOW. If he starts asking questions, you're in discovery — stop pitching and start listening.",
        "branches": [
          {
            "label": "Yeah sure / I'd take a look",
            "to": "book_meeting"
          },
          {
            "label": "How does it work? / Tell me more",
            "to": "discovery_current_process"
          },
          {
            "label": "Send me an email",
            "to": "objection_send_email"
          },
          {
            "label": "I'm not the right person for this",
            "to": "not_right_person"
          }
        ]
      },
      "neutral_reaction": {
        "label": "LUKEWARM — THEY HAVE SOMETHING",
        "say": "Yeah, that makes sense — I'd honestly be surprised if you didn't have something in place with a portfolio your size. Out of curiosity, what does that look like right now? Are your cleaners documenting stuff through Streamline, or is it a separate workflow?",
        "note": "You KNOW they use Streamline for work orders — drop it casually to show you've done homework. This transitions into discovery. Listen for gaps in their process — that's your opening.",
        "branches": [
          {
            "label": "They describe their process (photos in Streamline / manual review)",
            "to": "discovery_pain_points"
          },
          {
            "label": "We use Breezeway / another dedicated tool",
            "to": "discovery_existing_tool"
          },
          {
            "label": "I don't want to get into it / Not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "acknowledge_and_pivot": {
        "label": "HEARD SOMETHING SKEPTICAL",
        "say": "Ah, fair enough — I'm curious what you heard. But honestly, the reason I'm reaching out is pretty straightforward. I've been talking to a few ops directors at companies similar to Frias, and there's one problem that keeps coming up around turnover photos and damage tracking. Can I give you the 30-second version?",
        "note": "Don't get defensive about whatever they heard. Acknowledge, redirect, and earn the 30 seconds.",
        "branches": [
          {
            "label": "Sure / Go ahead",
            "to": "pain_trigger"
          },
          {
            "label": "Not interested",
            "to": "objection_not_interested"
          }
        ]
      },
      "discovery_current_process": {
        "label": "DISCOVERY — CURRENT PROCESS",
        "say": "That's actually super helpful. So right now, when your team flips a unit on the West Aspen side — what does the photo and inspection piece look like? Are your cleaners documenting everything themselves, or do you have inspectors going behind them?",
        "note": "STOP PITCHING. You're in discovery now. Ask questions, take notes. Listen for: who takes photos, who reviews them, what tool they use, how many turnovers per week, what falls through the cracks.",
        "branches": [
          {
            "label": "They describe the process in detail",
            "to": "discovery_pain_points"
          },
          {
            "label": "We run it through Streamline / work orders",
            "to": "discovery_streamline"
          },
          {
            "label": "We don't really have a formal process / It's loose",
            "to": "discovery_no_process"
          }
        ]
      },
      "discovery_streamline": {
        "label": "DISCOVERY — STREAMLINE WORKFLOW",
        "say": "Oh nice — so you're running everything through Streamline. That's pretty common with operators I talk to. So when the photos come in, who's actually reviewing them? Is that you, or do Manuel and the housekeeping team handle that?",
        "note": "They use Streamline for PMS and work orders — confirmed. Manuel Nava and Isidra Santos are Housekeeping Managers. Dropping Manuel's name shows deep research. Dig into who actually reviews photos and where the bottleneck lives.",
        "branches": [
          {
            "label": "I review them / My team reviews them",
            "to": "discovery_pain_points"
          },
          {
            "label": "Housekeeping handles it / Manuel and Isidra",
            "to": "discovery_pain_points"
          },
          {
            "label": "Honestly nobody reviews them closely",
            "to": "discovery_no_process"
          }
        ]
      },
      "discovery_pain_points": {
        "label": "DISCOVERY — DIG INTO PAIN",
        "say": "Got it. And in peak season like right now — how many turnovers are you running per week across your West Aspen units? And when something does slip through — a damage that doesn't get caught — what does that look like for you? Who ends up getting the call from the owner?",
        "note": "You want two things: (1) turnover volume so you can quantify the problem, (2) the emotional pain of what happens when things slip. If Zane says he personally gets owner calls, that's gold — he'll want this fixed.",
        "branches": [
          {
            "label": "High volume / Things do slip through / I get the calls",
            "to": "solution_and_cta"
          },
          {
            "label": "We're pretty tight / Not many misses",
            "to": "solution_and_cta_soft"
          },
          {
            "label": "That's really more of a housekeeping issue",
            "to": "not_right_person"
          }
        ]
      },
      "discovery_no_process": {
        "label": "DISCOVERY — NO FORMAL PROCESS",
        "say": "Yeah — that's actually really common. Most operators I talk to, the photos exist but nobody's systematically reviewing them until there's a problem and you're going back trying to figure out what happened after the fact. That's actually the exact gap we fill. We plug into the photos that are already being taken and automatically flag anything that looks off — damage, missing items, staging issues — before the next guest walks in. Would you be open to seeing what that looks like? Fifteen minutes, I can show you on some sample photos.",
        "note": "This is a green light. They have the problem and no solution. Pitch the meeting, not the product. Keep it short.",
        "branches": [
          {
            "label": "Sure / Yeah let's look at it",
            "to": "book_meeting"
          },
          {
            "label": "Send me something first",
            "to": "objection_send_email"
          },
          {
            "label": "I'd need to loop in someone else",
            "to": "not_right_person"
          }
        ]
      },
      "discovery_existing_tool": {
        "label": "DISCOVERY — THEY HAVE A TOOL",
        "say": "Oh nice — how's that been working for you? Are you finding it actually catches stuff proactively, or is it more of a documentation tool where you still need someone reviewing everything manually?",
        "note": "If they name a competitor (Breezeway, Properly, etc.), don't bash it. Ask how it's working. Most tools are documentation-first, not detection-first — that's RapidEye's differentiation.",
        "branches": [
          {
            "label": "It's fine / Works well enough",
            "to": "objection_have_process"
          },
          {
            "label": "It's mostly documentation / We still review manually",
            "to": "solution_and_cta"
          },
          {
            "label": "It's a pain / Not great",
            "to": "solution_and_cta"
          }
        ]
      },
      "solution_and_cta": {
        "label": "SOLUTION + MEETING ASK",
        "say": "That's exactly what I keep hearing. So what we built is basically an AI layer that sits on top of your existing photo workflow — your cleaners don't change anything they're doing — and it automatically reviews every photo, flags damage, missing items, anything out of place. You get a report before the next guest checks in instead of finding out after. Would you be open to taking a look? I can walk you through it in fifteen minutes — worst case you steal some ideas from what other ski-market PMs are doing with their turnover photos and we part as friends.",
        "note": "The 'worst case you steal some ideas' line is your safety net — makes the meeting feel low-risk. If he says yes, immediately propose a specific day and time.",
        "branches": [
          {
            "label": "Sure / Yeah I'd be interested",
            "to": "book_meeting"
          },
          {
            "label": "Not right now / Maybe later",
            "to": "test_drive_pitch"
          },
          {
            "label": "Send me an email",
            "to": "objection_send_email"
          },
          {
            "label": "I'd need to loop someone else in",
            "to": "not_right_person"
          }
        ]
      },
      "solution_and_cta_soft": {
        "label": "SOFT CTA — THEY FEEL COVERED",
        "say": "That's solid — sounds like you run a tight ship. I'll say this: what I keep hearing from ops directors who think they've got it locked down is they're surprised what the AI catches that their team didn't. Not because the team is bad — just because when you're flipping twenty units in a day, the human eye misses stuff. Would you be open to seeing it? Even just to benchmark against what you're already doing?",
        "note": "Don't argue with 'we're pretty tight.' Reframe the meeting as a benchmark or sanity check, not a fix for a broken process.",
        "branches": [
          {
            "label": "Sure / Can't hurt to look",
            "to": "book_meeting"
          },
          {
            "label": "Not right now / We're good",
            "to": "test_drive_pitch"
          },
          {
            "label": "Send me something",
            "to": "objection_send_email"
          }
        ]
      },
      "objection_not_interested": {
        "label": "NOT INTERESTED",
        "say": "I totally get it. I should've assumed you'd be all set — otherwise you probably would've reached out yourself. Just so no one from my team cold calls you again — is it that turnover quality isn't really a problem you're focused on right now, or is it more that you just hate cold calls?",
        "note": "Agree first — surprise him by not pushing back. The split question gives him an easy out while keeping the door open. If it's 'hate cold calls,' pivot to email. If it's 'not focused on it,' you can ask who is.",
        "branches": [
          {
            "label": "I just hate cold calls / Bad medium",
            "to": "objection_send_email_warm"
          },
          {
            "label": "Not a priority right now / We're covered",
            "to": "test_drive_pitch"
          },
          {
            "label": "Not interested at all / Firm no",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_have_process": {
        "label": "WE ALREADY HAVE SOMETHING IN PLACE",
        "say": "That makes total sense — with 130-plus units you'd have to have something dialed in. I'd honestly be surprised if you didn't. Is it that you're fully covered and love what you've got, or is it more that switching anything mid-peak-season would just be a headache?",
        "note": "This split is critical. 'Love what we've got' is rare — most people tolerate their process. 'Switching mid-season is a headache' means they're open but timing is wrong. That's a meeting you can book for after season.",
        "branches": [
          {
            "label": "We're happy with what we have",
            "to": "test_drive_pitch"
          },
          {
            "label": "It's more about timing / Can't switch mid-season",
            "to": "timing_pitch"
          },
          {
            "label": "Honestly it works but it's not perfect",
            "to": "solution_and_cta"
          }
        ]
      },
      "objection_no_budget": {
        "label": "NO BUDGET",
        "say": "Totally get it. Nowadays it's harder to keep a tool, let alone buy something new. Just so I'm not wasting your time — is it that budget for this cycle is completely locked, or is it more that anything you try to buy has to go through a whole approval chain?",
        "note": "If budget is locked, pitch the test drive for future planning. If it's an approval chain, ask who approves — that's your path to Ben Wolff.",
        "branches": [
          {
            "label": "Budget is locked / Nothing this year",
            "to": "test_drive_pitch"
          },
          {
            "label": "Everything goes through Ben / through approval",
            "to": "referral_to_ben"
          },
          {
            "label": "It's just not a priority spend right now",
            "to": "test_drive_pitch"
          }
        ]
      },
      "timing_pitch": {
        "label": "TIMING — POST-SEASON MEETING",
        "say": "A hundred percent — mid-season is not the time to rip anything out. What if we did this: I shoot you a quick note now, and we block fifteen minutes for after mud season — maybe late April, early May — when you actually have headspace to think about next year's ops? That way you go into next season knowing what's out there.",
        "note": "Aspen's off-season ('mud season') is typically late April through May. That's when ops leaders plan for the following year. Book it far out if you have to — a meeting on the calendar is a meeting on the calendar.",
        "branches": [
          {
            "label": "Yeah that makes more sense / Sure",
            "to": "book_meeting_future"
          },
          {
            "label": "Just send me an email for now",
            "to": "objection_send_email"
          },
          {
            "label": "Not interested even then",
            "to": "graceful_exit"
          }
        ]
      },
      "test_drive_pitch": {
        "label": "TEST DRIVE — SELL THE FUTURE LOOK",
        "say": "Totally respect that. Here's my thought though — you're probably not buying anything right now, and that's fine. But when budget or timing does free up, the folks who end up moving fast are the ones who already know what's on their shortlist. Would you be open to a quick look — not to buy, just so you know what's out there? If nothing else I can show you what other operators in ski markets are doing with their turnover photos. Fifteen minutes.",
        "note": "This is your last clean shot at a meeting. The 'not to buy, just to know' framing removes all pressure. If he still says no, go to email or graceful exit.",
        "branches": [
          {
            "label": "Sure / Fine, fifteen minutes",
            "to": "book_meeting"
          },
          {
            "label": "Send me an email instead",
            "to": "objection_send_email"
          },
          {
            "label": "No thanks / Not for me",
            "to": "graceful_exit"
          }
        ]
      },
      "objection_send_email": {
        "label": "SEND ME AN EMAIL",
        "say": "Totally fair — I'll shoot something over today. One question before I do so it's not just another generic pitch sitting in your inbox — what would actually be most relevant for you? Is it more the damage detection side of things, or is it more about tracking cleaner and inspector consistency across your units?",
        "note": "This question does two things: (1) gives you intel to tailor the email, (2) keeps him talking and shows you're thoughtful. Whatever he answers, use it in the follow-up.",
        "branches": [
          {
            "label": "Damage detection / Catching issues",
            "to": "email_confirm"
          },
          {
            "label": "Cleaner performance / Consistency tracking",
            "to": "email_confirm"
          },
          {
            "label": "Just send whatever / I don't care",
            "to": "email_confirm"
          }
        ]
      },
      "objection_send_email_warm": {
        "label": "THEY HATE COLD CALLS — PIVOT TO EMAIL",
        "say": "Ha — totally fair, I hate getting them too. Tell you what, I'll send you a quick note with some context, and if it looks interesting you can grab time on my calendar whenever works for you. No more cold calls from me. What's the best email — is it Zane at Frias Properties dot com?",
        "note": "You already know his email is Zane@FriasProperties.com but confirming it builds a small moment of rapport and verifies it's still current. Keep it light and friendly.",
        "branches": [
          {
            "label": "Yeah that's right / Confirms email",
            "to": "email_confirm"
          },
          {
            "label": "Gives a different email",
            "to": "email_confirm"
          }
        ]
      },
      "email_confirm": {
        "label": "CONFIRM EMAIL + SUGGEST TIME",
        "say": "Got it — I'll send that over today. And just so it doesn't die in your inbox, I'm gonna throw a time suggestion in there for next week. If it doesn't work, no worries — but at least you've got it. Appreciate you taking my call, Zane.",
        "note": "Always include a specific day and time in the email — 'next Tuesday at 2pm MT' beats 'whenever works.' Send the email within 10 minutes of hanging up. Subject line should reference the skiing or Aspen specifically.",
        "branches": []
      },
      "not_right_person": {
        "label": "NOT THE RIGHT PERSON",
        "say": "Totally get it — who on your team would typically own a decision around inspection tooling or turnover workflows? Is that more of a Ben Wolff conversation, or is there someone else I should be talking to?",
        "note": "Dropping Ben Wolff's name by name shows you've done research and makes the referral concrete. If Zane mentions Chris Longden or the housekeeping managers (Manuel Nava, Isidra Santos), note those names.",
        "branches": [
          {
            "label": "Yeah, talk to Ben / That's a Ben decision",
            "to": "referral_to_ben"
          },
          {
            "label": "Talk to Chris Longden / My counterpart on the East side",
            "to": "referral_to_chris"
          },
          {
            "label": "Talk to housekeeping / Manuel / Isidra",
            "to": "referral_to_housekeeping"
          },
          {
            "label": "I'm not sure / Won't give a name",
            "to": "graceful_exit"
          }
        ]
      },
      "referral_to_ben": {
        "label": "REFERRAL — BEN WOLFF",
        "say": "Perfect — would you mind if I mentioned your name when I reach out to Ben? And is email or his direct line the better way to catch him?",
        "note": "You already have Ben's direct line (970-429-2435) and email (Ben@FriasProperties.com). Getting Zane's permission to name-drop is the real win — it turns the next call warm.",
        "branches": [
          {
            "label": "Sure, mention my name / Here's how to reach him",
            "to": "referral_confirm"
          },
          {
            "label": "Don't mention me / Just reach out on your own",
            "to": "referral_confirm"
          }
        ]
      },
      "referral_to_chris": {
        "label": "REFERRAL — CHRIS LONGDEN",
        "say": "Chris Longden, right — the East Aspen operations director? Would you mind if I mentioned your name when I reach out?",
        "note": "Confirming Chris's name and title shows credibility. His direct line is 970-429-2436, email is CLongden@FriasProperties.com. Getting permission to name-drop is the goal.",
        "branches": [
          {
            "label": "Yeah sure / Go ahead",
            "to": "referral_confirm"
          },
          {
            "label": "Don't mention me / Just reach out",
            "to": "referral_confirm"
          }
        ]
      },
      "referral_to_housekeeping": {
        "label": "REFERRAL — HOUSEKEEPING MANAGERS",
        "say": "Got it — would that be Manuel Nava or Isidra? And would you mind if I mentioned you sent me their way?",
        "note": "Manuel Nava (970-618-8433) and Isidra Santos (970-429-2425) are both Housekeeping Managers. They feel turnover photo pain most directly. A warm referral from Zane makes these calls much easier.",
        "branches": [
          {
            "label": "Manuel / Isidra / Both — and confirms referral",
            "to": "referral_confirm"
          },
          {
            "label": "Just reach out on your own",
            "to": "referral_confirm"
          }
        ]
      },
      "referral_confirm": {
        "label": "CONFIRM REFERRAL + CLOSE",
        "say": "Awesome — really appreciate that, Zane. I'll put something tailored together for them so it actually lands. Thanks for taking my call — and enjoy the rest of ski season out there.",
        "note": "End on the skiing note — ties back to the opener. Send the referral outreach the same day while Zane's name is fresh. If he gave permission to name-drop, lead with that in the next call's opener.",
        "branches": []
      },
      "book_meeting": {
        "label": "BOOK THE MEETING",
        "say": "Awesome. I've got next week pulled up — how does Tuesday or Wednesday look? I'm thinking early afternoon your time, like one or two PM Mountain?",
        "note": "Be specific — two days, a time range. Don't say 'whenever works for you.' Mid-week early afternoon avoids the morning turnover crunch an ops director deals with during ski season.",
        "branches": [
          {
            "label": "Tuesday works / Wednesday works / Gives a time",
            "to": "meeting_booked"
          },
          {
            "label": "Later in the week / Different time",
            "to": "meeting_booked"
          },
          {
            "label": "Actually let me think about it first",
            "to": "objection_send_email"
          }
        ]
      },
      "book_meeting_future": {
        "label": "BOOK POST-SEASON MEETING",
        "say": "Perfect. How about the last week of April — say Wednesday April 29th, early afternoon? I'll send over a calendar invite right now so it's locked in, and I'll shoot you a reminder closer to the date.",
        "note": "Post-mud-season timing. Send the calendar invite immediately while still on the phone. Don't let it become 'I'll reach back out sometime' — get it on the calendar now.",
        "branches": [
          {
            "label": "Sure / That works",
            "to": "meeting_booked"
          },
          {
            "label": "Just email me then / I'll find time later",
            "to": "email_confirm"
          }
        ]
      },
      "meeting_booked": {
        "label": "MEETING CONFIRMED",
        "say": "Locked in. I'll send the invite right now so you've got it. Really appreciate you taking my call, Zane — enjoy the rest of the season. Talk soon.",
        "note": "STOP SELLING. The meeting is booked. Send the calendar invite within 60 seconds of hanging up. Include a one-line agenda and your Zoom link. Don't add pitch materials — you already won.",
        "branches": []
      },
      "graceful_exit": {
        "label": "GRACEFUL EXIT",
        "say": "Totally understand. If anything changes, I'm easy to find — Sam Parks, RapidEye. Appreciate your time, Zane. Enjoy the snow out there.",
        "note": "Don't burn the bridge. Log the call, note the objection and any intel he shared, and set a follow-up reminder for 60-90 days. Zane may be much more receptive after ski season winds down in April.",
        "branches": []
      }
    }
  }
}